[{"ratings": {"rAmountLearned": "2.30", "rDifficulty": "2.44", "rStimulateInterest": "1.70", "rRecommendMajor": "2.46", "rCourseQuality": "2.07", "rWorkRequired": "2.11", "rInstructorAccess": "2.53", "rReadingsValue": "2.49", "rRecommendNonMajor": "1.43", "rCommAbility": "1.76", "rInstructorQuality": "1.95"}, "section": {"name": "BIO III - BIOMATERIALS", "sectionnum": "001", "primary_alias": "BE-512-001", "path": "/courses/24038/sections/001", "id": "24038-001", "aliases": ["BE-512-001"]}, "comments": "This course provides a comprehensive background in biomaterials. It covers\r\nsurface properties, mechanical behavior, and tissue response of ceramics, polymers, and\r\nmetals used in the body. It also builds on this knowledge to address aspects of tissue\r\nengineering, particularly the substrate component of engineered tissue and organs.\r\nMany students found the course material very interesting – the contents were\r\n“useful and relevant to the world of bioengineering.” However, the majority of students\r\ncomplained about the “poorly written and confusing exam questions,” which solely\r\nincluded multiple choices that did “not reflect students’ knowledge of content” and were\r\nbased on “how well you memorized the slides.” Some students were unsatisfied with the\r\nreadings that were “difficult to decipher” and “became optional” due to too many details.\r\nStudents understood the adjustments made by Professor Ducheyne in grading and\r\nin the content of assignments due to the higher enrollment of the course this semester.\r\nHowever, many of them commented that “it was never made very clear how the\r\nindividual exams/assignments were graded” and that they “never got a single assignment\r\nback.” Some students thought that Professor Ducheyne had put a lot of effort into the\r\ncourse, but some found that the professor “didn’t seem very interested in being a\r\nlecturer.”\r\nStudents felt that “the course was not very interactive” because of the large class\r\nsize. One student commented “the workload has been very light,” and another student\r\ncomplained that the course “just increased the general knowledge of the subject.” This\r\ncourse is recommended for majors and the prerequisites are General Chemistry and Basic\r\nBiomechanics.", "num_students": 59, "path": "/courses/24038/sections/001/reviews/1798-PAUL-L-R--DUCHEYNE", "instructor": {"path": "/instructors/1798-PAUL-L-R--DUCHEYNE", "first_name": "PAUL L.R.", "last_name": "DUCHEYNE", "id": "1798-PAUL-L-R--DUCHEYNE", "name": "PAUL L.R. DUCHEYNE"}, "num_reviewers": 59, "id": "24038-001-1798-PAUL-L-R--DUCHEYNE"}]