[{"ratings": {"rAmountLearned": "2.88", "rDifficulty": "3.04", "rStimulateInterest": "2.92", "rRecommendMajor": "3.24", "rCourseQuality": "2.69", "rWorkRequired": "2.44", "rInstructorAccess": "3.16", "rReadingsValue": "2.68", "rRecommendNonMajor": "2.44", "rCommAbility": "3.16", "rInstructorQuality": "3.03"}, "section": {"name": "INTRO TO HUMAN EVOLUTION", "sectionnum": "601", "primary_alias": "ANTH-003-601", "path": "/courses/26939/sections/601", "id": "26939-601", "aliases": ["ANTH-003-601"]}, "comments": "This class seeks to answer the questions of how did humans evolve? When did humans start to walk on two legs? How are humans related to non-human primates? This course focuses on the scientific study of human evolution describing the emergence, development, and diversification of our species, Homo sapiens. Students will have the opportunity, during recitations, to conduct hands-on exercises collecting and analyzing behavioral, morphological, and genetic data on both humans and nonhuman primates and working with the Department of Anthropology's extensive collection of fossil casts.\r\n\tStudents were interested in the material presented in class, but often felt overwhelmed by the amount of material: “100 slides for a 3 hour class … is almost unbearable.” Other students were dismayed by the difficultly of the exams—students reported them being “totally intimidating” and feeling that it was “hard to make even an A-.” The assignments were described as harshly graded.  Students were interested in the material, but seemed to be put off by the large amount expected to be memorized. \r\n\tProfessor Selinsky was praised as “great at holding interest” as well as a “wonderful person.” Students enjoyed her personally, and described her as “well organized” and “really enthusiastic about the information.” \r\nThis class was described as somewhat intense, with “a lot of reading” and difficult exams, which required “intensive studying.” Students did note that this class was a good way to satisfy the Living World sector requirement, and some were effusive in their love for the Professor Selinsky, who went so far as to “even bake cookies” for the class. ", "num_students": 31, "path": "/courses/26939/sections/601/reviews/5282-PAGE-SELINSKY", "instructor": {"path": "/instructors/5282-PAGE-SELINSKY", "first_name": "PAGE", "last_name": "SELINSKY", "id": "5282-PAGE-SELINSKY", "name": "PAGE SELINSKY"}, "num_reviewers": 29, "id": "26939-601-5282-PAGE-SELINSKY"}]