{"coursehistories": {"path": "/coursehistories/1468"}, "description": "The study of the neural systems that underlie human perception, memory and language; and of the pathological syndromes that result from damage to these systems. \n\n", "semester": "2010C", "name": "COGNITIVE NEUROSCIENCE", "reviews": {"path": "/courses/23700/reviews", "values": [{"ratings": {"rAmountLearned": "2.89", "rDifficulty": "3.02", "rStimulateInterest": "2.71", "rRecommendMajor": "3.38", "rCourseQuality": "2.75", "rWorkRequired": "2.48", "rInstructorAccess": "2.83", "rReadingsValue": "1.77", "rRecommendNonMajor": "1.75", "rCommAbility": "3.01", "rInstructorQuality": "2.95"}, "section": {"name": "COGNITIVE NEUROSCIENCE", "sectionnum": "401", "primary_alias": "PSYC-149-401", "path": "/courses/23700/sections/401", "id": "23700-401", "aliases": ["PSYC-149-401", "BIBB-249-401"]}, "comments": "PSYC 149 integrates psychology and neuroscience. The course will explore the neural systems that underlie human perception, memory, and language, and the pathological syndromes that result from damage to these systems.\r\n\r\nThis course places emphasis on experiments in the field of neuroscience and in the interpretation of data. Students found this course interesting and many students reported learning a lot. However, one student reported that there is a great deal of overlap between this course and PSYC 111 and BBB 109.\r\n\r\nStudents reported that Professor Epstein is a very enthusiastic and clear lecturer. His slides are well-organized and useful in preparing for exams. Additionally, Professor Epstein attempts to inject humor into his lectures. However, some students complained that Professor Epstein was disorganized in terms of returning papers and exams and in providing students with a grading rubric.\r\n\r\nStudents reported that exams for this course were fair, and emphasized that students should attend lectures to be successful. Additionally, Professor Epstein provided review sheets before each exam, which were invaluable in preparing for the tests. One student wrote that exams focused on the students’ ability to understand the material beyond a simply factual level. Additionally, one student commented that psychology majors were at a disadvantage compared to BBB majors in terms of previously-learned material.\r\n", "num_students": 104, "path": "/courses/23700/sections/401/reviews/2317-RUSSELL-ALAN-EPSTEIN", "instructor": {"path": "/instructors/2317-RUSSELL-ALAN-EPSTEIN", "first_name": "RUSSELL ALAN", "last_name": "EPSTEIN", "id": "2317-RUSSELL-ALAN-EPSTEIN", "name": "RUSSELL ALAN EPSTEIN"}, "num_reviewers": 95, "id": "23700-401-2317-RUSSELL-ALAN-EPSTEIN"}]}, "credits": null, "primary_alias": "PSYC-149", "path": "/courses/23700", "sections": {"path": "/courses/23700/sections", "values": [{"name": "COGNITIVE NEUROSCIENCE", "sectionnum": "401", "primary_alias": "PSYC-149-401", "path": "/courses/23700/sections/401", "id": "23700-401", "aliases": ["PSYC-149-401", "BIBB-249-401"]}]}, "id": 23700, "aliases": ["PSYC-149", "BIBB-249"]}