{"coursehistories": {"path": "/coursehistories/5424"}, "description": "Are sexual and gender diversities best understood based on cultural, political, pathological, or scientific models? And what's the difference? While sexual and gender diversity have been consistent features in most cultures throughout history, how such gender-and sexual-based discussions have been articulated, understood, condoned, or condemned has varied in the past century of the biosciences. If medical historieans and queer theorists have paid almost obsessive attention to these subjects, contemporary scientific theorists and bioethicists have intervened t0 a lesser degree and on only a handful of relevant subjects. Bearing in mind the social and medical legacies related to sexual and gender identities, this course will consider a range of historical and contemporary topics which speak to the intersection of bioethical dilemmas on medicine, sexuality and gender identity, including: the gay adolescent, the intersex person, gay conversion therapies, the prospect of gay gene studies, sex addiction, queer blood/organ donation policies, transgender politics, and the wake of the global HIV/AIDS pandemic. \n\nSpecifically, in this course, we will focus on literary sources (memoirs, diaries, and films) as well as non-literary accounts (medical texts, bioethical scholarship, and historical records) that explore the emotional and somatic aspects of matters related to sexuality, gender, gender identity, and the biosciences. \n\n", "semester": "2013A", "name": "SCI OF SEX & SEXUALITY", "reviews": {"path": "/courses/30407/reviews", "values": [{"ratings": {"rDifficulty": "2.62", "rStimulateInterest": "3.77", "rCourseQuality": "3.43", "rWorkRequired": "3.00", "rInstructorQuality": "3.93", "rCommAbility": "3.77", "rInstructorAccess": "3.69"}, "section": {"name": "SCI OF SEX & SEXUALITY", "sectionnum": "401", "primary_alias": "GSWS-242-401", "path": "/courses/30407/sections/401", "id": "30407-401", "aliases": ["GSWS-242-401", "STSC-242-401", "HSOC-242-401"]}, "comments": "", "num_students": 16, "path": "/courses/30407/sections/401/reviews/3206-SHANNON-B--LUNDEEN", "instructor": {"path": "/instructors/3206-SHANNON-B--LUNDEEN", "first_name": "SHANNON B.", "last_name": "LUNDEEN", "id": "3206-SHANNON-B--LUNDEEN", "name": "SHANNON B. LUNDEEN"}, "num_reviewers": 16, "id": "30407-401-3206-SHANNON-B--LUNDEEN"}]}, "credits": null, "primary_alias": "GSWS-242", "path": "/courses/30407", "sections": {"path": "/courses/30407/sections", "values": [{"name": "SCI OF SEX & SEXUALITY", "sectionnum": "401", "primary_alias": "GSWS-242-401", "path": "/courses/30407/sections/401", "id": "30407-401", "aliases": ["GSWS-242-401", "STSC-242-401", "HSOC-242-401"]}]}, "id": 30407, "aliases": ["GSWS-242", "STSC-242", "HSOC-242"]}