{"coursehistories": {"path": "/coursehistories/4700"}, "description": "In some parts of the world, spending on pharmaceuticals is astronomical. In others, people do not have access to basic or life-saving drugs. Individuals struggle to afford medications; whole populations are neglected, considered too poor to constitute profitable markets for the development and distribution of necessary drugs. This seminar analyzes the dynamics of the burgeoning international pharmaceutical trade and the global inequalities that emerge from and are reinforced by market-driven medicine. Questions about who will be treated and who will not filter through every phase of pharmaceutical production --from preclinical research to human testing, marketing, distribution, prescription, and consumption. \n\nWhether considering how the pharmaceutical industry shapes popular understandings of mental illness in North America and Great Britain, how Brazil has created a model of HIV/AIDS prevention and treatment program, or how the urban pooer in Delhi understand and access healthcare, the seminar draws on anthropological case studies to illuminate the roles of corporations, governments, non-governmental organizations, and individuals in relation to global pharmaceuticals. As we analyze each case and gain famliarity with tehnographic methods, we will ask how individual and group health is shaped by new medical technologies and their evolving regulatory regimes and markets. The course familiarizes students with critical debates on globalization and with local responses to globalizing processes; and it contributes to ethical and political debates on the development and access to new medical technologies. \n\n", "semester": "2008C", "name": "PHARMA & GLOBAL HEALTH: Pharmaceuticals and Global Health", "reviews": {"path": "/courses/18266/reviews", "values": [{"ratings": {"rAmountLearned": "3.17", "rDifficulty": "3.00", "rStimulateInterest": "3.28", "rRecommendMajor": "3.59", "rCourseQuality": "3.50", "rWorkRequired": "3.61", "rInstructorAccess": "3.33", "rReadingsValue": "3.06", "rRecommendNonMajor": "2.83", "rCommAbility": "3.53", "rInstructorQuality": "3.56"}, "section": {"name": "PHARMA & GLOBAL HEALTH: Pharmaceuticals and Global Health", "sectionnum": "301", "primary_alias": "ANTH-234-301", "path": "/courses/18266/sections/301", "id": "18266-301", "aliases": ["ANTH-234-301", "HSOC-234-301"]}, "comments": "", "num_students": 19, "path": "/courses/18266/sections/301/reviews/4142-ADRIANA-PETRYNA", "instructor": {"path": "/instructors/4142-ADRIANA-PETRYNA", "first_name": "ADRIANA", "last_name": "PETRYNA", "id": "4142-ADRIANA-PETRYNA", "name": "ADRIANA PETRYNA"}, "num_reviewers": 18, "id": "18266-301-4142-ADRIANA-PETRYNA"}]}, "credits": null, "primary_alias": "ANTH-234", "path": "/courses/18266", "sections": {"path": "/courses/18266/sections", "values": [{"name": "PHARMA & GLOBAL HEALTH: Pharmaceuticals and Global Health", "sectionnum": "301", "primary_alias": "ANTH-234-301", "path": "/courses/18266/sections/301", "id": "18266-301", "aliases": ["ANTH-234-301", "HSOC-234-301"]}]}, "id": 18266, "aliases": ["ANTH-234", "HSOC-234"]}