{"coursehistories": {"path": "/coursehistories/1045"}, "description": "Gender is an organizing principle of society, shaping social structures, cultural understandings, processes of interaction, and identities in ways that have profound consequences. It affects every aspect of people's lives, from their intimate relationships to their participation in work, family, government, and other social institutions and their place in the stratification system, Yet gender is such a taken for granted basis for differences among people that it can be hard to see the underlying social structures and cultural forces that reinforce or weaken the social boundaries that define gender. Differences in behavior, power,and experience are often seen as the result of biological imperatives or of individual choice. A sociological view of gender, in contrast, emphasizes how gender is socially constructed and how structural constraints limit choice. This course examines how differences based on gender are created and sustained, with particular attention to how other important bases of personal identity and social inequality--race and class-interact with patterns of gender relations. We will also seek to understand how social change happens and how gender inequality might be reduced. \n\n", "semester": "2010C", "name": "SOCIOLOGY OF GENDER", "reviews": {"path": "/courses/23790/reviews", "values": [{"ratings": {"rAmountLearned": "2.32", "rDifficulty": "2.45", "rStimulateInterest": "1.39", "rRecommendMajor": "2.35", "rCourseQuality": "2.00", "rWorkRequired": "2.84", "rInstructorAccess": "2.35", "rReadingsValue": "2.71", "rRecommendNonMajor": "1.81", "rCommAbility": "1.65", "rInstructorQuality": "2.03"}, "section": {"name": "SOCIOLOGY OF GENDER", "sectionnum": "401", "primary_alias": "SOCI-122-401", "path": "/courses/23790/sections/401", "id": "23790-401", "aliases": ["SOCI-122-401", "GSOC-122-401"]}, "comments": "\r\nThis course examines how gender affects every aspect of people's lives, from their intimate relationships to their participation in work, family, government, and other social institutions and their place in the stratification system. The fact that gender is a taken for granted basis for differences among people is also explored, and the underlying social structures and cultural forces that reinforce or weaken the social boundaries that define gender are exposed. The sociological view of gender emphasizes how gender is socially constructed and how structural constraints limit choice and examines how differences based on gender are created and sustained, with particular attention to how other important bases of personal identity and social inequality interact with patterns of gender relations. Finally, the course also aims to understand how social change happens and how gender inequality might be reduced.\r\n\r\nReviews for this course were quite divided. Many students thought that the course material was very interesting, yet they did not actually enjoy taking the class, finding the readings more worthwhile than the lectures. The content itself was seen as “eye-opening” and applicable to everyone. \r\n\r\nProfessor Leidner was not generally well liked by students. Many reported that she spoke in a whisper and was incapable of engaging students even though the material itself was interesting. She relied heavily on readings, discussion and movie clips to support the material covered in lecture yet the lectures were disorganized, “hard to follow”, and uninteresting. Though she was described as “nice,” many students complained about her teaching ability and her tendency to “ramble on” about things that that were not particularly relevant.  \r\n\r\nThe workload for this course is significant. Students were required to do a lot of essential reading. Exams were considered unfair, with too many vague answers; students did so poorly on exams that Professor Leidner had to add extra assignments to counter the grades. However, a few students felt that the class wasn’t too challenging as long as all the reading was done. The class was recommended only by one student, though many would agree that if another professor were to teach the course it would be much improved as the material itself is interesting.\r\n", "num_students": 35, "path": "/courses/23790/sections/401/reviews/1094-ROBIN-LISA-LEIDNER", "instructor": {"path": "/instructors/1094-ROBIN-LISA-LEIDNER", "first_name": "ROBIN LISA", "last_name": "LEIDNER", "id": "1094-ROBIN-LISA-LEIDNER", "name": "ROBIN LISA LEIDNER"}, "num_reviewers": 34, "id": "23790-401-1094-ROBIN-LISA-LEIDNER"}]}, "credits": null, "primary_alias": "SOCI-122", "path": "/courses/23790", "sections": {"path": "/courses/23790/sections", "values": [{"name": "SOCIOLOGY OF GENDER", "sectionnum": "401", "primary_alias": "SOCI-122-401", "path": "/courses/23790/sections/401", "id": "23790-401", "aliases": ["SOCI-122-401", "GSOC-122-401"]}]}, "id": 23790, "aliases": ["SOCI-122", "GSOC-122"]}