{"coursehistories": {"path": "/coursehistories/2804"}, "description": "This course focuses on the mathematics behind Fourier theory and a wide variety of its applicationsin diverse problems in mathematics, engineering, and the sciences. The course is very mathematical in content and students signing up for it should have junior or senior standing. The topics covered are chosen from: functions and signals; systems of differential equations; superposition,memory, and non-linearity; resonance,eigenfunctions; the Fourier series and transform, spectra; convergence theorems; inner product spaces; mean-square approximation; interpolation and prediction, sampling; random processes, stationarity; wavelets, Brownian motion; stability and control, Laplace transforms. \n\nThe applications of the mathematical theory that will be presented vary from year to year but a representative sample include: polynomial approximation, Weierstrass's theorem; efficient computation via Monte Carlo; linear and non-linear oscillators;the isoperimetric problem; the heat equation, underwate communication; the wave equation, tides; testing for randomness, fraud; nowhere differentiable continuous functions; does Brownian motion exist?; error-correction; phase conjugate optics and four-wave mixing; cryptography and secure communications; how fast can we compute?; X-ray crystallography; cosmology; and what the diffusion equation has to say about mathematical finance and arbitrage opportunities. \n\n", "semester": "2009A", "name": "SIGNALS & SYSTEMS", "reviews": {"path": "/courses/15705/reviews", "values": [{"ratings": {"rAmountLearned": "3.26", "rDifficulty": "3.96", "rStimulateInterest": "3.37", "rRecommendMajor": "3.04", "rCourseQuality": "3.11", "rWorkRequired": "3.93", "rInstructorAccess": "3.56", "rReadingsValue": "3.00", "rRecommendNonMajor": "1.67", "rCommAbility": "3.52", "rInstructorQuality": "3.61"}, "section": {"name": "SIGNALS & SYSTEMS", "sectionnum": "001", "primary_alias": "ESE-325-001", "path": "/courses/15705/sections/001", "id": "15705-001", "aliases": ["ESE-325-001"]}, "comments": "This course focuses on the Fourier theory and its applications in mathematics, engineering, and the sciences. The mathematical topics covered vary with the semester, but can include functions and signals, systems of differential equations, superpositions, memory, non-linearity, resonance, eigenfunctions, the Fourier series and transform, convergence theorems, inner product spaces, mean-square approximation, interpolation and prediction, sampling, stationarity, and Laplace transforms. Applications discussed also vary with the semester, but has included topics such as polynomial approximation, underwater communication, cryptography and secure communications, Brownian motion, and x-ray crystallography.\r\n\r\nMany students praised this class as “amazing” and among the best at Penn. Some felt the course leaned too heavily towards theoretical mathematics, but most judged the class to be a good balance of theoretical background and engineering approach.\r\n\r\nProfessor Venkatesh was lauded as “passionate,” talented, engaging, and “one of the finest professors at the university.”\r\nStudents highly respected his teaching ability regardless of their opinion of the coursework, and found his lectures to be interesting and applicable.\r\n\r\nStudents judged this course to be difficult and “a lot of work” – most felt the class was worth the effort, but some considered it too time-consuming. Some students would have preferred more problem-solving examples and more thorough explanations of mathematical material.", "num_students": 31, "path": "/courses/15705/sections/001/reviews/1177-SANTOSH-S-VENKATESH", "instructor": {"path": "/instructors/1177-SANTOSH-S-VENKATESH", "first_name": "SANTOSH S", "last_name": "VENKATESH", "id": "1177-SANTOSH-S-VENKATESH", "name": "SANTOSH S VENKATESH"}, "num_reviewers": 29, "id": "15705-001-1177-SANTOSH-S-VENKATESH"}]}, "credits": null, "primary_alias": "ESE-325", "path": "/courses/15705", "sections": {"path": "/courses/15705/sections", "values": [{"name": "SIGNALS & SYSTEMS", "sectionnum": "001", "primary_alias": "ESE-325-001", "path": "/courses/15705/sections/001", "id": "15705-001", "aliases": ["ESE-325-001"]}]}, "id": 15705, "aliases": ["ESE-325"]}