{"coursehistories": {"path": "/coursehistories/2930"}, "description": "An introduction to Stochastic Processes. The primary focus is on Markov Chains, Martingales and Gaussian Processes. We will discuss many interesting applications from physics to economics. Topics may include: simulations of path functions, game theory and linear programming, stochastic optimization, Brownian Motion and Black-Scholes. \n\n", "semester": "2010C", "name": "STOCHASTIC PROCESSES", "reviews": {"path": "/courses/23836/reviews", "values": [{"ratings": {"rAmountLearned": "1.73", "rDifficulty": "3.93", "rStimulateInterest": "1.40", "rRecommendMajor": "2.27", "rCourseQuality": "1.13", "rWorkRequired": "3.47", "rInstructorAccess": "2.73", "rReadingsValue": "1.00", "rRecommendNonMajor": "0.67", "rCommAbility": "0.87", "rInstructorQuality": "1.06"}, "section": {"name": "STOCHASTIC PROCESSES", "sectionnum": "001", "primary_alias": "STAT-433-001", "path": "/courses/23836/sections/001", "id": "23836-001", "aliases": ["STAT-433-001"]}, "comments": "The primary focus is on Markov Chains, Martingales and Gaussian Processes. This course discusses many interesting applications from physics to economics. Topics may include: simulations of path functions, game theory and linear programming, stochastic optimization, Brownian Motion and Black-Scholes.\r\n\r\nStudents found this class “extremely difficult” and “not for the faint of heart.” This class was deemed “very important,” but would act as a “proving point” for a future in mathematics. Students enjoyed the lectures once the basic processes were finished, but urged that this class required, “a tremendous amount of work and thinking to master.”\r\n\r\nStudents agreed that Professor Shepp was “incredibly brilliant” and “very elegant,” but also were concerned that he “cannot clearly convey the material.” They suspect this is because he is used to teaching graduate students, and also wish that Professor Shepp would have “stuck more to the textbook” than his own notes. However, students did find Professor Shepp “motivating” and “very willing to spend hours outside of class helping students.” He also did well in relating the material to real world examples.\r\n\r\nThis class is definitely not for students looking for an “easy A.” This class was “somewhat unstructured” and didn’t follow the syllabus much. In addition, students said that the prerequisite, STAT 430, was not sufficient to do well in this class.\r\n", "num_students": 17, "path": "/courses/23836/sections/001/reviews/5544-LAWRENCE-A--SHEPP", "instructor": {"path": "/instructors/5544-LAWRENCE-A--SHEPP", "first_name": "LAWRENCE A.", "last_name": "SHEPP", "id": "5544-LAWRENCE-A--SHEPP", "name": "LAWRENCE A. SHEPP"}, "num_reviewers": 16, "id": "23836-001-5544-LAWRENCE-A--SHEPP"}]}, "credits": null, "primary_alias": "STAT-433", "path": "/courses/23836", "sections": {"path": "/courses/23836/sections", "values": [{"name": "STOCHASTIC PROCESSES", "sectionnum": "001", "primary_alias": "STAT-433-001", "path": "/courses/23836/sections/001", "id": "23836-001", "aliases": ["STAT-433-001"]}]}, "id": 23836, "aliases": ["STAT-433"]}