[{"ratings": {"rAmountLearned": "3.20", "rDifficulty": "2.16", "rStimulateInterest": "3.52", "rRecommendMajor": "3.80", "rCourseQuality": "3.31", "rWorkRequired": "2.20", "rInstructorAccess": "3.67", "rReadingsValue": "2.52", "rRecommendNonMajor": "3.20", "rCommAbility": "3.72", "rInstructorQuality": "3.68"}, "section": {"name": "INTRO TO MIDDLE EAST", "sectionnum": "001", "primary_alias": "NELC-102-001", "path": "/courses/22134/sections/001", "id": "22134-001", "aliases": ["NELC-102-001"]}, "comments": "This course surveys the history of the Middle East from the rise of Islam (c. 600) to the modern era, concentrating on political, social, and cultural trends. Although the emphasis is on Middle Eastern societies, this course occasionally considers developments in other parts of the world, such as sub-Saharan Africa, Central Asia, and Spain, where Middle Eastern cultures are or have been influential. The goal of this course is to understand the shared features that have distinguished Middle Eastern societies under the aegis of Islamic civilization, as well as the varieties of experience that have endowed the region with so much cultural diversity. The course leads up to the present in order to understand the political and social strains that are affecting the Middle East today. &#8232;&#8232;Overall, students loved this course. They reported enjoying the interesting readings and engaging lectures. Students said that they found this class very rewarding because they learned a lot. A few students thought that the course material was too broad, but some felt that it was appropriate for an introductory course. &#8232;&#8232;Students generally raved about Professor Cobb, calling him one of the best professors. Students thought that Professor Cobb’s “dedication and passion” were apparent and that both qualities motivated his students and encouraged them to come to class. &#8232;&#8232;Students reported that Professor Cobb was very accessible. They stated that while his class covered a lot of material, it was not too difficult, and much of the grade depended on the take-home midterm and final.&#8232;&#8232;This review is based on the 5 student comments that were submitted.", "num_students": 28, "path": "/courses/22134/sections/001/reviews/4473-PAUL-MICHAEL-COBB", "instructor": {"path": "/instructors/4473-PAUL-MICHAEL-COBB", "first_name": "PAUL MICHAEL", "last_name": "COBB", "id": "4473-PAUL-MICHAEL-COBB", "name": "PAUL MICHAEL COBB"}, "num_reviewers": 26, "id": "22134-001-4473-PAUL-MICHAEL-COBB"}]