[{"ratings": {"rAmountLearned": "3.09", "rDifficulty": "2.48", "rStimulateInterest": "2.61", "rRecommendMajor": "2.70", "rCourseQuality": "3.11", "rWorkRequired": "2.61", "rInstructorAccess": "3.48", "rReadingsValue": "2.35", "rRecommendNonMajor": "2.43", "rCommAbility": "3.43", "rInstructorQuality": "3.36"}, "section": {"name": "COMPUT LINEAR ALGEBRA", "sectionnum": "401", "primary_alias": "MATH-313-401", "path": "/courses/27713/sections/401", "id": "27713-401", "aliases": ["MATH-313-401", "MATH-513-401"]}, "comments": "Many important problems in a wide range of disciplines within computer science and throughout science are solved using techniques from linear algebra in this course.  This course will introduce students to some of the most widely used algorithms and illustrate how they are actually used. Some specific topics include the solution of systems of linear equations by Gaussian elimination, dimension of a linear space, inner product, cross product, change of basis, affine and rigid motions, eigenvalues and eigenvectors, diagonalization of both symmetric and non-symmetric matrices, quadratic polynomials and least squares optimization. Applications will include the use of matrix computations to computer graphics, use of the discrete Fourier transform and related techniques in digital signal processing, the analysis of systems of linear differential equations, and singular value decompositions with application to a principal component analysis. The ideas and tools provided by this course will be useful to students who intend to tackle higher-level courses in digital signal processing, computer vision, robotics and computer graphics. \r\n\r\nStudent’s really enjoyed this course. Students strongly recommend this course to non-math majors interested in real life applications of linear algebra. Thus, one student said, “Most math majors would find the course lacking in theory.” The course moves very slowly at times, especially for someone who has taken MATH240/has any experience with linear algebra.\r\n\r\nProfessor Jauregui is a very good teacher. His lectures are impeccably organized and he explains concepts carefully and clearly.  Student’s thought Professor Januregui was engaging, and he was exceptional at communicating course material and making sure all his students understood the concepts emphasized in the “wonderful” course. A couple of students wrote that he was the one of the best professors they have had.\r\n\r\nThe prerequisites for this course include: Math 114 or 115, and some programming experience. Students who have already received credit for either Math 370, 371, 502 or 503 cannot receive further credit for Math 312 or Math 313/513.  Students can receive credit for at most one of Math 312 and Math 313/513. Students said that the exams are very reasonable and extend directly from classwork and homework problems. The problem sets were very reasonable and the MATLAB assignments were very cool, although they might be very frustrating if you don't have programming experience.", "num_students": 29, "path": "/courses/27713/sections/401/reviews/5404-JEFFREY-L--JAUREGUI", "instructor": {"path": "/instructors/5404-JEFFREY-L--JAUREGUI", "first_name": "JEFFREY L.", "last_name": "JAUREGUI", "id": "5404-JEFFREY-L--JAUREGUI", "name": "JEFFREY L. JAUREGUI"}, "num_reviewers": 29, "id": "27713-401-5404-JEFFREY-L--JAUREGUI"}]