{"coursehistories": {"path": "/coursehistories/4184"}, "description": "The course will explore how a screenplay is conceptualized and developed, the role of agency relationships in the film business, and - casting as wide a net as possible - the financing, production, direction, distribution, exhibition and marketing of both independent and studio films. A combination of lectures by instructors and practitioners, case studies, film screenings, and consulting projects with independent and Hollywood creators, packagers, financiers, exhibitors, distributors and publicists will illustrate the relationship between the art of film and the business of film. Guests will include screenwriters, agents, producers, directors, distributors, film festival curators and film critics. In short, we will try to cover all aspects of making a film, and explore that often-tricky intersection of art and commerce. \n\n", "semester": "2011A", "name": "ART AND BUSINESS OF FILM", "reviews": {"path": "/courses/21439/reviews", "values": [{"ratings": {"rAmountLearned": "2.95", "rDifficulty": "2.00", "rStimulateInterest": "3.32", "rRecommendMajor": "3.30", "rCourseQuality": "2.80", "rWorkRequired": "2.05", "rInstructorAccess": "3.40", "rReadingsValue": "2.85", "rRecommendNonMajor": "2.80", "rCommAbility": "2.90", "rInstructorQuality": "3.12"}, "section": {"name": "ART AND BUSINESS OF FILM", "sectionnum": "401", "primary_alias": "CINE-285-401", "path": "/courses/21439/sections/401", "id": "21439-401", "aliases": ["CINE-285-401", "MGMT-253-401"]}, "comments": "", "num_students": 33, "path": "/courses/21439/sections/401/reviews/3285-KATHLEEN-DEMARCO-VAN-CLEVE", "instructor": {"path": "/instructors/3285-KATHLEEN-DEMARCO-VAN-CLEVE", "first_name": "KATHLEEN DEMARCO", "last_name": "VAN CLEVE", "id": "3285-KATHLEEN-DEMARCO-VAN-CLEVE", "name": "KATHLEEN DEMARCO VAN CLEVE"}, "num_reviewers": 26, "id": "21439-401-3285-KATHLEEN-DEMARCO-VAN-CLEVE"}, {"ratings": {"rAmountLearned": "2.95", "rDifficulty": "2.00", "rStimulateInterest": "3.10", "rRecommendMajor": "3.30", "rCourseQuality": "2.80", "rWorkRequired": "2.05", "rInstructorAccess": "3.45", "rReadingsValue": "2.85", "rRecommendNonMajor": "2.80", "rCommAbility": "3.16", "rInstructorQuality": "3.24"}, "section": {"name": "ART AND BUSINESS OF FILM", "sectionnum": "401", "primary_alias": "CINE-285-401", "path": "/courses/21439/sections/401", "id": "21439-401", "aliases": ["CINE-285-401", "MGMT-253-401"]}, "comments": "In this course, students explore how a screenplay is conceptualized and developed, the role of agency relationships in the film business, and the financing, production, direction, distribution, exhibition and marketing of both independent and studio films. Relying on lectures by instructors and practitioners, case studies, film screenings, and consulting projects with independent and Hollywood creators, packagers, financiers, exhibitors, distributors and publicists, the material seeks to illustrate the relationship between the art of film and the business of film. Guests include screenwriters, agents, producers, directors, distributors, film festival curators and film critics. \r\n\r\nStudents had much praise for Cine 285. One student declared it “the most relevant class offered at Penn for anyone interested in pursuing film as a career.” Students felt that its innovative structure made for a high quality course, although they also noted that it suffered from some lack of organization – its one major drawback.\r\n\r\nMuch of the praise for the course stemmed from the strength of Professors Kathleen and Emory Van Cleve, who were commended for their “fun and engaging” style. One student considered the professionalism and experience of the professors to be the course’s “greatest asset.” The lectures were considered interesting and informative, and students enjoyed the speakers brought in by Professors Kathleen and Emory Van Cleve.\r\n\r\nStudents felt the workload was very manageable, although many expressed frustration with the readings. The reading assignments were described as pertinent, but frequently unnecessary, but movie assignments were relevant and students enjoyed the group work aspects of the course. Most students expressed an interest in seeing the course offered in subsequent years, though, again, with tweaks made to the structure in order to ensure a more efficient and coherent trajectory of the material.\r\n", "num_students": 33, "path": "/courses/21439/sections/401/reviews/3296-EMORY-B-VAN-CLEVE", "instructor": {"path": "/instructors/3296-EMORY-B-VAN-CLEVE", "first_name": "EMORY B", "last_name": "VAN CLEVE", "id": "3296-EMORY-B-VAN-CLEVE", "name": "EMORY B VAN CLEVE"}, "num_reviewers": 26, "id": "21439-401-3296-EMORY-B-VAN-CLEVE"}]}, "credits": null, "primary_alias": "CINE-285", "path": "/courses/21439", "sections": {"path": "/courses/21439/sections", "values": [{"name": "ART AND BUSINESS OF FILM", "sectionnum": "401", "primary_alias": "CINE-285-401", "path": "/courses/21439/sections/401", "id": "21439-401", "aliases": ["CINE-285-401", "MGMT-253-401"]}]}, "id": 21439, "aliases": ["CINE-285", "MGMT-253"]}