[{"ratings": {"rAmountLearned": "2.94", "rDifficulty": "3.29", "rStimulateInterest": "2.94", "rRecommendMajor": "3.55", "rCourseQuality": "2.60", "rWorkRequired": "3.48", "rInstructorAccess": "2.26", "rReadingsValue": "2.41", "rRecommendNonMajor": "1.23", "rCommAbility": "3.13", "rInstructorQuality": "2.86"}, "section": {"name": "COMPUTER OPER SYSTEM", "sectionnum": "001", "primary_alias": "CIS-380-001", "path": "/courses/22830/sections/001", "id": "22830-001", "aliases": ["CIS-380-001"]}, "comments": "This course surveys methods and algorithms used in operating systems. Concurrent distributed operation is emphasized. The main topics covered are as follows: process synchronization; interprocess communications; concurrent/distributed programming languages; resource allocation and deadlock; virtual memory; protection and security; distributed operation; distributed data; performance evaluation. \r\n\r\nMost students felt that the course was a bit “unstructured,” with the homework being “only relevant to the first few lectures of the course.” In addition, most students felt that the “course was excellent.” They described it as being “challenging” and the ideas expressed as being “very interesting.” \r\n\r\nAlmost all of the students praised Professor Blaze for his teaching style. He was described as being a “very interesting and dynamic lecturer.” Students generally liked his lecture format, but they would have preferred it if he had “more concrete office hours.” Many students criticized the professor for being unorganized during the second half of the course. \r\n\r\nOverall, students felt that the difficulty of the course did not match with its reputation of being extremely hard. There was a “lack in organization of grading,” but apart from, most students regarded it as being fair. According to most, the exams were difficult, and many found that “having more old exams” would have been more helpful. This course was recommended for majors only.\r\n", "num_students": 39, "path": "/courses/22830/sections/001/reviews/2435-MATTHEW-BLAZE", "instructor": {"path": "/instructors/2435-MATTHEW-BLAZE", "first_name": "MATTHEW", "last_name": "BLAZE", "id": "2435-MATTHEW-BLAZE", "name": "MATTHEW BLAZE"}, "num_reviewers": 35, "id": "22830-001-2435-MATTHEW-BLAZE"}]