[{"ratings": {"rAmountLearned": "2.94", "rDifficulty": "2.46", "rStimulateInterest": "2.67", "rRecommendMajor": "3.35", "rCourseQuality": "2.67", "rWorkRequired": "2.40", "rInstructorAccess": "3.20", "rReadingsValue": "2.32", "rRecommendNonMajor": "2.33", "rCommAbility": "2.42", "rInstructorQuality": "2.73"}, "section": {"name": "DRUGS, BRAIN AND MIND", "sectionnum": "401", "primary_alias": "BIBB-270-401", "path": "/courses/27032/sections/401", "id": "27032-401", "aliases": ["BIBB-270-401", "PSYC-225-401"]}, "comments": "\tThe course will begin with a review of basic concepts in pharmacology: routes of drug administration, drug metabolism, the dose response curve, tolerance, and sensitization. Following a brief overview of cellular foundations of neuropharmacology (cell biology, synaptic and receptor function), the course will focus on various classes of drugs used to treat neuropsychiatric disorders including, among others, depression, schizophrenia,and anxiety. Mechanisms mediating the mind-altering, addictive and neurotoxic effects of abused drugs will also be covered.\r\n\r\n\tStudents really enjoyed this “awesome” course, describing the material as very interesting. Students appreciated the balance of drug use and drug action topics discussed in the class. Some mentioned that the class was disorganized, however, and another wrote that the content seemed to be repeated a lot and was redundant.\r\n\r\nOne student wrote that the professor “has great ability in stimulating interest in her students.” Another mentioned that sometimes the “language barrier” was an issue, but overall students seemed to enjoy having Dr. Zach as their professor.\r\n\r\n\tExams were described as easy, though there were multiple typos, and multiple answers to multiple choice questions. A student commented that many answers on exams differed from lectures/notes and class readings.", "num_students": 105, "path": "/courses/27032/sections/401/reviews/5292-NETA-ZACH", "instructor": {"path": "/instructors/5292-NETA-ZACH", "first_name": "NETA", "last_name": "ZACH", "id": "5292-NETA-ZACH", "name": "NETA ZACH"}, "num_reviewers": 101, "id": "27032-401-5292-NETA-ZACH"}]