{"coursehistories": {"path": "/coursehistories/2385"}, "description": "Whether America begins with the Puritans and the Mayflower Compact, or with the Declaration of Independence and the Revolution, it is founded in resistance to empire. In the generations between, Americans have desired, dreaded and debated empire. This course will focus on empire and imperialism in American political thought. We will read primary texts addressing empire: from the departure and dissent of the Puritans, and Burke's Speech on Conciliation with the Colonies, to twentieth and twenty-first century debates over America's role in the world. These texts will include political pamphlets and speeches, poetry, novels, policy papers and film. \n\n", "semester": "2012A", "name": "AMERICAN POLIT THOUGHT", "reviews": {"path": "/courses/28044/reviews", "values": [{"ratings": {"rAmountLearned": "2.01", "rDifficulty": "2.51", "rStimulateInterest": "1.60", "rRecommendMajor": "2.44", "rCourseQuality": "1.78", "rWorkRequired": "2.51", "rInstructorAccess": "2.42", "rReadingsValue": "2.36", "rRecommendNonMajor": "1.66", "rCommAbility": "2.33", "rInstructorQuality": "2.02"}, "section": {"name": "AMERICAN POLIT THOUGHT", "sectionnum": "001", "primary_alias": "PSCI-183-001", "path": "/courses/28044/sections/001", "id": "28044-001", "aliases": ["PSCI-183-001"]}, "comments": "This course discusses an America founded in resistance to empire. In the generations between, Americans have desired, dreaded and debated empire. This course will focus on empire and imperialism in American political thought. Students will read primary texts addressing empire: from the departure and dissent of the Puritans, and Burke's Speech on Conciliation with the Colonies, to twentieth and twenty-first century debates over America's role in the world. These texts will include political pamphlets and speeches, poetry, novels, policy papers and film.\r\n\tMany students felt that the material covered in the course did not match the above description. The course was described as “boring” and one student reported that “it was hard to get myself to go to class.” Students felt that the grading was often unfair, as they were not graded by their own TA, and was therefore “wildly inconsistent.”\r\n\tProfessor Hirschmann was faulted for her “obvious political views” and for turning the course into a “liberal studies / gender studies course.” Students described her as frequently “unprepared” as well as disorganized. Hirschmann was also faulted for leaving her students “high and dry” before the final, not offering any review sessions or such.\r\n\tStudents were rather disappointed with this class. One student expressed disbelief that he needed to take this course for his major. The papers were described as being graded unfairly, and the students did not enjoy Professor Hirschmann’s lecture style or coverage of the material.", "num_students": 111, "path": "/courses/28044/sections/001/reviews/1678-NANCY-J--HIRSCHMANN", "instructor": {"path": "/instructors/1678-NANCY-J--HIRSCHMANN", "first_name": "NANCY J.", "last_name": "HIRSCHMANN", "id": "1678-NANCY-J--HIRSCHMANN", "name": "NANCY J. HIRSCHMANN"}, "num_reviewers": 95, "id": "28044-001-1678-NANCY-J--HIRSCHMANN"}]}, "credits": null, "primary_alias": "PSCI-183", "path": "/courses/28044", "sections": {"path": "/courses/28044/sections", "values": [{"name": "AMERICAN POLIT THOUGHT", "sectionnum": "001", "primary_alias": "PSCI-183-001", "path": "/courses/28044/sections/001", "id": "28044-001", "aliases": ["PSCI-183-001"]}]}, "id": 28044, "aliases": ["PSCI-183"]}