{"coursehistories": {"path": "/coursehistories/4652"}, "description": "This course integrates economic, ethical and political perspectives. It examines competing theories, models, and analytical frameworks for understanding policymaking. The course will focus on: 1. How public problems are framed and described; 2. What crieteria are useful in developing and assessing policy choices; and 3. How policy choices and outcomes are mediated and influenced by individuals, organizations and political institutions. \n\n", "semester": "2011A", "name": "THE PUBLIC POL. PROCESS: The Public Policy Process", "reviews": {"path": "/courses/22308/reviews", "values": [{"ratings": {"rAmountLearned": "2.14", "rDifficulty": "2.70", "rStimulateInterest": "1.16", "rRecommendMajor": "2.43", "rCourseQuality": "1.61", "rWorkRequired": "2.99", "rInstructorAccess": "2.66", "rReadingsValue": "2.25", "rRecommendNonMajor": "0.94", "rCommAbility": "1.51", "rInstructorQuality": "1.63"}, "section": {"name": "THE PUBLIC POL. PROCESS: The Public Policy Process", "sectionnum": "401", "primary_alias": "PPE-202-401", "path": "/courses/22308/sections/401", "id": "22308-401", "aliases": ["PPE-202-401", "PSCI-236-401"]}, "comments": "This course integrates economic, ethical and political perspectives. It examines competing theories, models, and analytical frameworks for understanding policymaking. The course will focus on how public problems are framed and described, the criteria are useful in developing and assessing policy choices, and how policy choices and outcomes are mediated and influenced by individuals, organizations and political institutions.&#8232;&#8232;Students had mixed feelings about the material taught. Many felt that one needed a \"basic understanding for American politics\" to follow the lectures. Some found the material \"interesting.\"&#8232;&#8232;Some students claimed that Professor Lapinski’s lectures, \"were rushed\" and \"Professor Lapinski is obviously very knowledgeable about public policy, but he has some trouble organizing his thoughts during lecture.\"&#8232;&#8232;The prerequisite for this course is ECON001. Work for the course includes about 100-200 pages of reading every week along with a weekly one page response. There is also a 20 page research paper due during the semester. This is class is recommended for majors only and is a requirement of the PPE major.", "num_students": 127, "path": "/courses/22308/sections/401/reviews/4082-JOHN-S--LAPINSKI", "instructor": {"path": "/instructors/4082-JOHN-S--LAPINSKI", "first_name": "JOHN S.", "last_name": "LAPINSKI", "id": "4082-JOHN-S--LAPINSKI", "name": "JOHN S. LAPINSKI"}, "num_reviewers": 110, "id": "22308-401-4082-JOHN-S--LAPINSKI"}]}, "credits": null, "primary_alias": "PPE-202", "path": "/courses/22308", "sections": {"path": "/courses/22308/sections", "values": [{"name": "THE PUBLIC POL. PROCESS: The Public Policy Process", "sectionnum": "401", "primary_alias": "PPE-202-401", "path": "/courses/22308/sections/401", "id": "22308-401", "aliases": ["PPE-202-401", "PSCI-236-401"]}]}, "id": 22308, "aliases": ["PPE-202", "PSCI-236"]}