{"coursehistories": {"path": "/coursehistories/2022"}, "description": "This course examines the major aspects of home-based care across patients' life spans from acute to long term care. New trends, advances, and issues in home management of complex conditions, innovative delivery systems and legal, ethical and policy consideration will be explored. \n\n", "semester": "2010C", "name": "CASE STUDY:  HOME HEALTH CARE", "reviews": {"path": "/courses/23537/reviews", "values": [{"ratings": {"rAmountLearned": "3.07", "rDifficulty": "2.07", "rStimulateInterest": "3.13", "rRecommendMajor": "3.40", "rCourseQuality": "3.13", "rWorkRequired": "1.93", "rInstructorAccess": "3.53", "rReadingsValue": "2.60", "rRecommendNonMajor": "2.53", "rCommAbility": "3.13", "rInstructorQuality": "3.19"}, "section": {"name": "CASE STUDY:  HOME HEALTH CARE", "sectionnum": "401", "primary_alias": "NURS-368-401", "path": "/courses/23537/sections/401", "id": "23537-401", "aliases": ["NURS-368-401", "NURS-550-401"]}, "comments": "Nursing 368 examines the major aspects of home-based care across patients' life spans from acute to long term care. New trends, advances, and issues in home management of complex conditions, innovative delivery systems and legal, ethical and policy consideration will be explored.\r\n\r\nOverall, students found this class to be “wonderful,” and many reported that they “learned far more about home healthcare” and “healthcare policy and reimbursements” than they had expected to learn. One student felt “grateful” for having taken the course, and others felt “far more expert” in the area than they had before. Several students found the structure of having a new guest lecturer each week to be helpful.\r\n\r\nMany students appreciated Professor Doyle. They felt that she brought “wisdom and knowledge” to the course material. Students reported benefitting in large part from the structure of the class, with the possible exception of in-class discussions, which sometimes felt “like a big waste of time” and “redundant.”\r\n\r\nOne student reported, “This course embodies the unique opportunity afforded by a Penn education.” Another felt that “all nurses need a course on policy and home care.” Prerequisites include NURS 104 and 106.\r\n", "num_students": 18, "path": "/courses/23537/sections/401/reviews/2612-JOAN-M-DOYLE", "instructor": {"path": "/instructors/2612-JOAN-M-DOYLE", "first_name": "JOAN M", "last_name": "DOYLE", "id": "2612-JOAN-M-DOYLE", "name": "JOAN M DOYLE"}, "num_reviewers": 17, "id": "23537-401-2612-JOAN-M-DOYLE"}]}, "credits": null, "primary_alias": "NURS-368", "path": "/courses/23537", "sections": {"path": "/courses/23537/sections", "values": [{"name": "CASE STUDY:  HOME HEALTH CARE", "sectionnum": "401", "primary_alias": "NURS-368-401", "path": "/courses/23537/sections/401", "id": "23537-401", "aliases": ["NURS-368-401", "NURS-550-401"]}]}, "id": 23537, "aliases": ["NURS-368", "NURS-550"]}