[{"ratings": {"rAmountLearned": "3.42", "rDifficulty": "2.74", "rStimulateInterest": "3.58", "rRecommendMajor": "3.79", "rCourseQuality": "3.40", "rWorkRequired": "2.68", "rInstructorAccess": "3.63", "rReadingsValue": "3.44", "rRecommendNonMajor": "2.74", "rCommAbility": "3.79", "rInstructorQuality": "3.70"}, "section": {"name": "FREEDOM OF THE WILL", "sectionnum": "301", "primary_alias": "PHIL-242-301", "path": "/courses/16301/sections/301", "id": "16301-301", "aliases": ["PHIL-242-301"]}, "comments": "&#8232;This course discusses challenges to our self-understanding that arise from thinking about persons and their actions as part of the order of nature. Questions considered include: what it means to be a free agent and what it means to have a free will, the degree to which our beliefs about physical causality undermine our beliefs about agency, the nature and importance of moral responsibility, and the relationship between freedom and responsibility. Readings are drawn from both historical and contemporary sources.&#8232;&#8232;\r\nThis course is “amazing,” “fascinating,” and “one of the best academic experiences” at Penn. The topic is “applicable,” “thought-provoking,” “fun,” and “mind-twisting, in a great way.” Assigned readings were “tailored directly” to course objectives and were well ordered. The summaries and critical reading project were helpful to students to get a thorough understanding of the material. The course ends with a final paper and take-home exam. &#8232;&#8232;\r\nProfessor Martin is an “excellent teacher and really made learning such a pleasure.” All students expressed this sentiment; she was “extremely knowledgeable” yet able to communicate the subject matter in a way that was “accessible to everyone.” Professor Martin’s lectures were “clear and concise,” articulating the material well and promoting “intelligent-thought provoking discussions.” Students thanked her for a “fantastic semester” and “would take any other course with the same instructor.”&#8232;&#8232;\r\nThis course is for anyone interested in philosophy or up for a new stimulating challenge. One student reported, “The way I thought about problems (of free will, responsibility, action, agency…anything!) definitely seeped into all my other classes.” Students thought the professor was “a fair grader” and did not assign too much work at any one time. Still, it was occasionally difficult to keep up with the reading, because there were new readings for “almost every class,” and students complained that the inclusion of both a “fairly dense” final paper and a “time-consuming” final take-home exam was too much work.", "num_students": 23, "path": "/courses/16301/sections/301/reviews/3458-ADRIENNE-M--MARTIN", "instructor": {"path": "/instructors/3458-ADRIENNE-M--MARTIN", "first_name": "ADRIENNE M.", "last_name": "MARTIN", "id": "3458-ADRIENNE-M--MARTIN", "name": "ADRIENNE M. MARTIN"}, "num_reviewers": 20, "id": "16301-301-3458-ADRIENNE-M--MARTIN"}]