{"coursehistories": {"path": "/coursehistories/949"}, "description": "This course describes current theorizing on how the human mind achieves high-level cognitive processes such as using language, thinking, and reasoning. The course discusses issues such as whether the language ability is unique to humans, whether there is a critical period to the acquisition of a language, the nature of conceptual knowledge, how people perform deductive reasoning and induction, and how linguistic and conceptual knowledge interact. \n\n", "semester": "2012A", "name": "LANGUAGE AND THOUGHT", "reviews": {"path": "/courses/28069/reviews", "values": [{"ratings": {"rAmountLearned": "1.94", "rDifficulty": "2.27", "rStimulateInterest": "1.56", "rRecommendMajor": "2.36", "rCourseQuality": "1.80", "rWorkRequired": "1.59", "rInstructorAccess": "2.85", "rReadingsValue": "1.50", "rRecommendNonMajor": "1.18", "rCommAbility": "1.58", "rInstructorQuality": "1.95"}, "section": {"name": "LANGUAGE AND THOUGHT", "sectionnum": "001", "primary_alias": "PSYC-151-001", "path": "/courses/28069/sections/001", "id": "28069-001", "aliases": ["PSYC-151-001"]}, "comments": "This course describes current theorizing on how the human mind achieves high-level cognitive processes such as using language, thinking, and reasoning. The course discusses issues such as whether the language ability is unique to humans, whether there is a critical period to the acquisition of a language,the nature of conceptual knowledge, how people perform deductive reasoning and induction, and how linguistic and conceptual knowledge interact.\r\n\tMany students complained that the reading materials were not closely related to what was being covered in class.  Many students pointed to the course's lack of structure.\r\n\tProfessor Dahan does not use PowerPoint for her lectures.  Many students thus found her lectures \"disorganized\" and \"difficult to follow.\" Students found Professor to be “very intelligent” though most found it hard for Professor Dahan to explain difficult course concepts. \r\n\tMany students reported that test averages for this course were very high.  This course is required for psychology majors. PSYC 001 is a pre-requisite for this class. ", "num_students": 136, "path": "/courses/28069/sections/001/reviews/2670-DELPHINE-DAHAN", "instructor": {"path": "/instructors/2670-DELPHINE-DAHAN", "first_name": "DELPHINE", "last_name": "DAHAN", "id": "2670-DELPHINE-DAHAN", "name": "DELPHINE DAHAN"}, "num_reviewers": 128, "id": "28069-001-2670-DELPHINE-DAHAN"}]}, "credits": null, "primary_alias": "PSYC-151", "path": "/courses/28069", "sections": {"path": "/courses/28069/sections", "values": [{"name": "LANGUAGE AND THOUGHT", "sectionnum": "001", "primary_alias": "PSYC-151-001", "path": "/courses/28069/sections/001", "id": "28069-001", "aliases": ["PSYC-151-001"]}]}, "id": 28069, "aliases": ["PSYC-151"]}