{"coursehistories": {"path": "/coursehistories/720"}, "description": "Mathematics 480 will open with a review of the basics of real analysis (brief or extended background requires). The review will include: introduction of the real numbers through Dedekind cuts, continuity of real-valued functions on the real line; Cantor nested-interval principle, basic results for continuous functions, Maximum and Intermediate Value theorems, Heine-Borel Theorem, Uniform Continuity on closed intervals; metric spaces, convergence of sequences, Cauchy sequences, completeness, more general uniform continuity and intermediate value theorems; general topology, separation, compactness, product spaces, Tychonoff's Theorem. \n\nSpecial topics in analysis: Weierstrass Polynomial Approximation Theorem, Bernstein polynomials and simultaneous approxfunctions and derivatives, topics from divergent series, summation methods; r measure theory, the Lebesgue integral, Lp spaces, Holder, Minkowski, and and Cauchy-Schwarz inequalities; basics of Functional Analysis, normed spaces, Banach spaces and Hilbert space, with examples (Lp spaces, continuous-functions spaces), Banach spaces and spectral theory, groups and Fourier transforms, Tauberian theorems; approximation theory, again, through the prism of functional analysis; extension of the polynomial approximation theorem (Stone-Weierstrass theorem), Muntz approximation theorem (by polynomials with preassigned powers), compact operators, the Spectral theorem, Stone's theorem (resprsentations of the additive group of real numbers); Peter-Weyl theory (represenations of compact groups). A selection from these topics as time and class preparation allow. \n\n", "semester": "2004C", "name": "TOPICS IN MODERN MATH", "reviews": {"path": "/courses/5565/reviews", "values": [{"ratings": {"rAmountLearned": "4.00", "rDifficulty": "2.00", "rStimulateInterest": "4.00", "rRecommendMajor": "4.00", "rCourseQuality": "4.00", "rWorkRequired": "3.00", "rInstructorAccess": "4.00", "rReadingsValue": "4.00", "rRecommendNonMajor": "2.00", "rCommAbility": "4.00", "rInstructorQuality": "4.00"}, "section": {"name": "TOPICS IN MODERN MATH", "sectionnum": "001", "primary_alias": "MATH-480-001", "path": "/courses/5565/sections/001", "id": "5565-001", "aliases": ["MATH-480-001", "MATH-550-001"]}, "comments": "", "num_students": 4, "path": "/courses/5565/sections/001/reviews/763-ALEXANDRE-A-KIRILLOV", "instructor": {"path": "/instructors/763-ALEXANDRE-A-KIRILLOV", "first_name": "ALEXANDRE A", "last_name": "KIRILLOV", "id": "763-ALEXANDRE-A-KIRILLOV", "name": "ALEXANDRE A KIRILLOV"}, "num_reviewers": 1, "id": "5565-001-763-ALEXANDRE-A-KIRILLOV"}]}, "credits": null, "primary_alias": "MATH-480", "path": "/courses/5565", "sections": {"path": "/courses/5565/sections", "values": [{"name": "TOPICS IN MODERN MATH", "sectionnum": "001", "primary_alias": "MATH-480-001", "path": "/courses/5565/sections/001", "id": "5565-001", "aliases": ["MATH-480-001", "MATH-550-001"]}]}, "id": 5565, "aliases": ["MATH-480", "MATH-550"]}