{"coursehistories": {"path": "/coursehistories/4381"}, "description": "This course explores some crucial foundational issues of contemporary social science. It focuses on various types of explanation, the construction of social models, and their validation. Specific topics will include: 1. Rational choice models (including game-theoretic ones) and alternative models of bounded rationality; 2. Experimental models in economics and psychology and whether they present a radical departure from traditional economic models; 3. Evolutionary models of the emergence of institutions, and agent-based simulations of such dynamics. In particular, we will explore theoretical and empirical models of trust, reciprocity, cooperation and fairness, asking what motivates individuals to engage in pro-social behavior and how such behavior can emerge and persist. This course will cover some of the material presented in other Core courses, with particular attention to foundational and explanatory issues that are not usually discussed in a typical social science course. \n\n", "semester": "2009A", "name": "PHIL OF SOCIAL SCIENCE", "reviews": {"path": "/courses/16299/reviews", "values": [{"ratings": {"rAmountLearned": "1.89", "rDifficulty": "3.13", "rStimulateInterest": "2.47", "rRecommendMajor": "2.21", "rCourseQuality": "1.92", "rWorkRequired": "2.80", "rInstructorAccess": "3.11", "rReadingsValue": "1.77", "rRecommendNonMajor": "1.09", "rCommAbility": "2.94", "rInstructorQuality": "3.04"}, "section": {"name": "PHIL OF SOCIAL SCIENCE", "sectionnum": "401", "primary_alias": "PHIL-228-401", "path": "/courses/16299/sections/401", "id": "16299-401", "aliases": ["PHIL-228-401", "PPE-228-401"]}, "comments": "This course discusses the foundations of contemporary social science. It focuses on the nature of social systems, the similarities and differences between social and natural sciences, the construction, analysis, and confirmation of social theories, and the nature of social explanations. The course will examine questions about objectivity in the social sciences, and students will construct and analyze simple computational models of social phenomena.&#8232;\r\n&#8232;Students thought that the course “raises some interesting questions,” but overall found subject matter and material “dry,” “boring,” and “dull.” The course was described as “too vague” and “without a serious focus.” There are several required readings, a few “interesting” guest lecturers, and assignments including essays and take-home exams due at the end of the semester. Students unanimously cited “the application of evolutionary biology in the social sciences via agent-based modeling” as the most valuable and enjoyable part of the course.&#8232;&#8232;\r\nStudents described Professor Weisberg as an “eloquent speaker” and “very enthusiastic.” He is a “dynamic lecturer and really encouraged class discussions during lecture.” Through his lecture slides, which had “a good combination of information and relevant video clips,” he did a “great job expressing the ideas of a very complicated and intricate subject.” Students were impressed by his methods, one student even describing him as, “by far, the best professor that I have had.”&#8232;&#8232;\r\nThis course is required for all PPE majors and is, ultimately, a philosophy class, so “it might be difficult at times to wrap your mind around the concepts.” It is a “challenge” to stay on top of the “very dense” readings.” The complex material indicated to some that this course is only for those interested in the topic, but another student felt it was a “class that any social science student should take,” because it “raised my awareness of what it is I am actually doing in college, and it taught me to approach what I am learning in class with an educated skepticism.” It might be beneficial to take an intro to philosophy writing course first. Most students felt that they would not receive good grades because much of the course is graded based on philosophy essays, which students felt were “graded harshly.”", "num_students": 55, "path": "/courses/16299/sections/401/reviews/2302-MICHAEL-WEISBERG", "instructor": {"path": "/instructors/2302-MICHAEL-WEISBERG", "first_name": "MICHAEL", "last_name": "WEISBERG", "id": "2302-MICHAEL-WEISBERG", "name": "MICHAEL WEISBERG"}, "num_reviewers": 52, "id": "16299-401-2302-MICHAEL-WEISBERG"}]}, "credits": null, "primary_alias": "PHIL-228", "path": "/courses/16299", "sections": {"path": "/courses/16299/sections", "values": [{"name": "PHIL OF SOCIAL SCIENCE", "sectionnum": "401", "primary_alias": "PHIL-228-401", "path": "/courses/16299/sections/401", "id": "16299-401", "aliases": ["PHIL-228-401", "PPE-228-401"]}]}, "id": 16299, "aliases": ["PHIL-228", "PPE-228"]}