[{"ratings": {"rAmountLearned": "3.39", "rDifficulty": "2.49", "rStimulateInterest": "3.55", "rRecommendMajor": "3.67", "rCourseQuality": "3.53", "rWorkRequired": "2.61", "rInstructorAccess": "3.12", "rReadingsValue": "3.10", "rRecommendNonMajor": "3.25", "rCommAbility": "3.76", "rInstructorQuality": "3.76"}, "section": {"name": "AMERICAN FOREIGN POLICY", "sectionnum": "001", "primary_alias": "PSCI-131-001", "path": "/courses/20721/sections/001", "id": "20721-001", "aliases": ["PSCI-131-001"]}, "comments": "This course analyzes the formation and conduct of foreign policy in the United States. The course combines three elements: a study of the history of American foreign relations; an analysis of the causes of American foreign policy such as the international system, public opinion, and the media; and a discussion of the major policy issues in contemporary U.S. foreign policy, including terrorism, civil wars, and economic policy.\r\n\r\nStudents for the most part enjoyed the content of the course, with many saying it was “the best class” they had taken at Penn. Students emphasized that “they learned a lot” and many indicated that the course had “stimulated interest” in political science. Most students found the lectures “straightforward” and “easy to follow.”\r\n\r\nStudents heaped praise on Professor Tierney, nearly unanimously calling him an “excellent lecturer,” a “charismatic and engaging professor” and stating that “Professor Tierney has a true talent for teaching.” Students also stressed that Professor Tierney was available to help his students.\r\n\r\nStudents complained that there was too much reading but each was nicely explained in class.  The course is highly recommended for majors and non-majors alike.  ", "num_students": 150, "path": "/courses/20721/sections/001/reviews/4206-DOMINIC-R-TIERNEY", "instructor": {"path": "/instructors/4206-DOMINIC-R-TIERNEY", "first_name": "DOMINIC R", "last_name": "TIERNEY", "id": "4206-DOMINIC-R-TIERNEY", "name": "DOMINIC R TIERNEY"}, "num_reviewers": 76, "id": "20721-001-4206-DOMINIC-R-TIERNEY"}]