{"coursehistories": {"path": "/coursehistories/2212"}, "description": "This course will investigate and discuss the various techniques of analysis that biological anthropologists can apply to forensic cases. Topics include human osteology, the recovery of bodies, the analysis of life history, the reconstruction of causes of death, and various case studies where anthropologists have contributed significantly to solving forensic cases. Discussions will include the limitations of forensic anthropology and the application of DNA recovery to skeletal/mummified materials. \n\n", "semester": "2010C", "name": "FORENSIC ANTHROPOLOGY", "reviews": {"path": "/courses/22625/reviews", "values": [{"ratings": {"rAmountLearned": "2.93", "rDifficulty": "2.41", "rStimulateInterest": "3.67", "rRecommendMajor": "3.52", "rCourseQuality": "2.93", "rWorkRequired": "2.07", "rInstructorAccess": "3.33", "rReadingsValue": "2.52", "rRecommendNonMajor": "3.00", "rCommAbility": "3.33", "rInstructorQuality": "3.46"}, "section": {"name": "FORENSIC ANTHROPOLOGY", "sectionnum": "601", "primary_alias": "ANTH-230-601", "path": "/courses/22625/sections/601", "id": "22625-601", "aliases": ["ANTH-230-601", "ANTH-633-601"]}, "comments": "Forensic Anthropology will investigate and discuss the various techniques of analysis that biological anthropologists can apply to forensic cases. Topics include human osteology, the recovery of bodies, the analysis of life history, the reconstruction of causes of death, and various case studies where anthropologists have contributed significantly to solving forensic cases. Discussions include the limitations of forensic anthropology and the application of DNA recovery to skeletal/mummified materials. &#8232;\r\n\r\nAs an introduction to the forensic field of anthropology at Penn, this class was generally described as “fascinating” and “excellent.” It seemed to provide “a very clear introduction to the field of anthropology as it relates to forensics” while also “covering a lot of ground.”&#8232;\r\n\r\nStudents across the board enjoyed Professor Monge, labeling her as the “best professor I have ever had at Penn.” She is “extremely knowledgeable and dedicated,” “interesting to listen to,” and “has an amazing ability to invest students in the course content.” One student, however, did “not believe Professor Monge stayed true to the syllabus” for the duration of the semester, suggesting that her “anecdotes and other tidbits of information…really detract from the nature of the material.” Some students found that “some lectures were off topic” and “precious class time [was spent] watching an unrelated movie.” However, students agreed that the anecdotes contributed by Professor Monge were nonetheless “entertaining” and typically relevant. Another student mentioned the Professor was “impossible to contact.” While she was quite “personable,” it was difficult to maintain communication with her via email. Nonetheless, it was obvious to students that she “is clearly an expert in the field” and most mentioned they “would take anything she was teaching.” &#8232;\r\n\r\n&#8232;This class includes assigned projects, but some students felt they “did not seem to incorporate what we learned in class.” Further, the work was described as “scattered:” “assigned one day, then reassigned for other days quite frequently.” This class is appropriate for students pursuing a Liberal and Professional Studies degree but, as it is introductory, is open to other students as well.\r\n", "num_students": 36, "path": "/courses/22625/sections/601/reviews/97-JANET-M--MONGE", "instructor": {"path": "/instructors/97-JANET-M--MONGE", "first_name": "JANET M.", "last_name": "MONGE", "id": "97-JANET-M--MONGE", "name": "JANET M. MONGE"}, "num_reviewers": 28, "id": "22625-601-97-JANET-M--MONGE"}]}, "credits": null, "primary_alias": "ANTH-230", "path": "/courses/22625", "sections": {"path": "/courses/22625/sections", "values": [{"name": "FORENSIC ANTHROPOLOGY", "sectionnum": "601", "primary_alias": "ANTH-230-601", "path": "/courses/22625/sections/601", "id": "22625-601", "aliases": ["ANTH-230-601", "ANTH-633-601"]}]}, "id": 22625, "aliases": ["ANTH-230", "ANTH-633"]}