{"coursehistories": {"path": "/coursehistories/4127"}, "description": "This is an introduction to studying gender systems and women's situations across cultures and countries with a special emphasis on South-Asia. The class focuses on \"globalization,\" the flows of people and culture that are increasing around the world. The class begins with the historical background for understanding the current period of globalization. We will look at the specific case of colonization in South-Asia and emphasize on its role in the rise of factories in both the colonized and colonizing nations. We then consider the role of these factories in today's world as they employ women from the third world (sweatshops), and explore other issues related to gender and globalization and discuss scholarly responses to the changing world system. This class approach stresses that in order to understand women's lives in the non-western world, it is important to understand the on-going connections between the \"first world\" and between the United States and the rest of the world. The larger objectives of the course are: 1.To learn about the history and current conditions of South Asia, , particularly as they affect women and gender. 2.To be able to identify relations between the \"first world\" and the \"third wo rld through an understanding of elements of globalization \n\n(such as mass media and cultural productions). 3.To understand ways that colonialism, Westernization affects gender systems systems and the formation of women's social movements that respond to these forces in the South Asian context. 4.4.To offer through the lens of gender, a framework to understand the the connected effects of globalization on national politics, economics and social issues in contemporary South Asia. \n\n", "semester": "2007A", "name": "WOMEN SOCIAL MVMTS IN SA: Women and Social Movements in Afghanistan and Pakistan", "reviews": {"path": "/courses/15144/reviews", "values": [{"ratings": {"rAmountLearned": "3.67", "rDifficulty": "2.83", "rStimulateInterest": "3.33", "rRecommendMajor": "3.67", "rCourseQuality": "3.50", "rWorkRequired": "3.00", "rInstructorAccess": "3.40", "rReadingsValue": "3.33", "rRecommendNonMajor": "2.67", "rCommAbility": "3.67", "rInstructorQuality": "3.33"}, "section": {"name": "WOMEN SOCIAL MVMTS IN SA: Women and Social Movements in Afghanistan and Pakistan", "sectionnum": "401", "primary_alias": "SAST-295-401", "path": "/courses/15144/sections/401", "id": "15144-401", "aliases": ["SAST-295-401", "SAST-595-401", "GSOC-295-401", "GSOC-595-401"]}, "comments": "", "num_students": 6, "path": "/courses/15144/sections/401/reviews/4214-FARZANA-SHAIKH-CHABAL", "instructor": {"path": "/instructors/4214-FARZANA-SHAIKH-CHABAL", "first_name": "FARZANA", "last_name": "SHAIKH CHABAL", "id": "4214-FARZANA-SHAIKH-CHABAL", "name": "FARZANA SHAIKH CHABAL"}, "num_reviewers": 6, "id": "15144-401-4214-FARZANA-SHAIKH-CHABAL"}]}, "credits": null, "primary_alias": "SAST-295", "path": "/courses/15144", "sections": {"path": "/courses/15144/sections", "values": [{"name": "WOMEN SOCIAL MVMTS IN SA: Women and Social Movements in Afghanistan and Pakistan", "sectionnum": "401", "primary_alias": "SAST-295-401", "path": "/courses/15144/sections/401", "id": "15144-401", "aliases": ["SAST-295-401", "SAST-595-401", "GSOC-295-401", "GSOC-595-401"]}]}, "id": 15144, "aliases": ["SAST-295", "SAST-595", "GSOC-295", "GSOC-595"]}