{"coursehistories": {"path": "/coursehistories/566"}, "description": "This course examines American history from the first contacts of the indigenous peoples of North America with European settlers to our own times by focusing on a few telling moments in this history. The course treats twelve of these moments. Each unit begins with a specific primary document, historical figure, image, location, year, or cultural artifact to commence the delving into the American past. Some of these icons are familiar, but the ensuing deciphering will render them as more complicated; some are unfamiliar, but they will emerge as absolutely telling. The course meets each week for two 50-minute team-taught lectures and once recitation session. Course requirements include: in-class midterm and final exams; three short paper assignments; and punctual attendance and participation in recitations. \n\n", "semester": "2011A", "name": "THE WORLD:HIST & MODRNTY", "reviews": {"path": "/courses/21840/reviews", "values": [{"ratings": {"rAmountLearned": "3.34", "rDifficulty": "1.76", "rStimulateInterest": "3.59", "rRecommendMajor": "3.76", "rCourseQuality": "3.56", "rWorkRequired": "2.07", "rInstructorAccess": "3.83", "rReadingsValue": "3.17", "rRecommendNonMajor": "3.46", "rCommAbility": "3.69", "rInstructorQuality": "3.67"}, "section": {"name": "THE WORLD:HIST & MODRNTY", "sectionnum": "001", "primary_alias": "HIST-011-001", "path": "/courses/21840/sections/001", "id": "21840-001", "aliases": ["HIST-011-001"]}, "comments": "This course explores the major themes, milestones, and debates in the history of the global community since 1750. Using examples from around the world, the course examines such issues as the causes of war and revolution; the impact of religion, science and technology on human communities; the development of global systems of slavery, colonialism, and labor migration; the growth of empires; the rise of nationalisms; and perceived differences between \"East\" and \"West.”\r\n\r\nOverall students enjoyed the “small class environment” and gained a “new perspective” towards history. The readings were “interesting” and the class “engaging.”\r\n\r\nPraise for Professor Joeden- Forgey was sweeping. Students found her “enthusiastic” about the material and “friendly” and “approachable” in that she “genuinely cared” about the students’ well being. Students remarked that Professor Joeden- Forgey was “fair” and generous with extra-credit. Her knowledge was “extensive” and her insight, “refreshing.”\r\n\r\nStudents “highly” recommended both this course and its professor to both majors and non-majors alike. Based on fewer than 8 comments. \r\n", "num_students": 44, "path": "/courses/21840/sections/001/reviews/609-ELISA-VON-JOEDEN-FORGEY", "instructor": {"path": "/instructors/609-ELISA-VON-JOEDEN-FORGEY", "first_name": "ELISA", "last_name": "VON JOEDEN-FORGEY", "id": "609-ELISA-VON-JOEDEN-FORGEY", "name": "ELISA VON JOEDEN-FORGEY"}, "num_reviewers": 35, "id": "21840-001-609-ELISA-VON-JOEDEN-FORGEY"}]}, "credits": null, "primary_alias": "HIST-011", "path": "/courses/21840", "sections": {"path": "/courses/21840/sections", "values": [{"name": "THE WORLD:HIST & MODRNTY", "sectionnum": "001", "primary_alias": "HIST-011-001", "path": "/courses/21840/sections/001", "id": "21840-001", "aliases": ["HIST-011-001"]}]}, "id": 21840, "aliases": ["HIST-011"]}