{"coursehistories": {"path": "/coursehistories/2227"}, "description": "Survey of the visual arts in Italy in the fourteenth, fifteenth,and sixteenth centuries, with emphasis on painting, sculpture and architecture in the major cultural centers. Topics may include the origins of modern urbanism, the rise of art theory, the art of the courts, and the role of art in the religious conflicts that ended the period. The course will devote attention to Donatello, Leonardo, Michelangelo, and Titian, among other artists. \n\n", "semester": "2009A", "name": "ITALIAN RENAISSANCE ART", "reviews": {"path": "/courses/15353/reviews", "values": [{"ratings": {"rAmountLearned": "3.04", "rDifficulty": "2.57", "rStimulateInterest": "3.00", "rRecommendMajor": "3.36", "rCourseQuality": "2.97", "rWorkRequired": "2.29", "rInstructorAccess": "3.18", "rReadingsValue": "2.54", "rRecommendNonMajor": "2.82", "rCommAbility": "3.54", "rInstructorQuality": "3.13"}, "section": {"name": "ITALIAN RENAISSANCE ART", "sectionnum": "601", "primary_alias": "ARTH-255-601", "path": "/courses/15353/sections/601", "id": "15353-601", "aliases": ["ARTH-255-601"]}, "comments": "This course is a survey of the visual arts in Italy in the fourteenth, fifteenth, and sixteenth centuries, with emphasis on painting, sculpture and architecture in the major cultural centers. Topics may include the origins of modern urbanism, the rise of art theory, the art of the courts, and the role of art in the religious conflicts that ended the period. The course will devote attention to Donatello, Leonardo, Michelangelo, and Titian, among other artists.\r\n\r\nThe material was described as a “concise overview of Italian Renaissance art.” Almost all reviews were positive calling the course “enjoyable” and even \"the most informative class I have taken at Penn.”\r\n\r\nStudents raved about Professor Boehman with almost every review praising her “great depth of knowledge” and “ability to make class fun.” Reviews described her as \"excellent,” \"enthusiastic\" and \"great at stimulating student interest.”\r\n\r\nThe PowerPoint presentation materials used in the class were prepared thoroughly, but some students would have \"appreciated a bit more discussion of the readings.”", "num_students": 33, "path": "/courses/15353/sections/601/reviews/3693-JESSICA-M-BOEHMAN", "instructor": {"path": "/instructors/3693-JESSICA-M-BOEHMAN", "first_name": "JESSICA M", "last_name": "BOEHMAN", "id": "3693-JESSICA-M-BOEHMAN", "name": "JESSICA M BOEHMAN"}, "num_reviewers": 30, "id": "15353-601-3693-JESSICA-M-BOEHMAN"}]}, "credits": null, "primary_alias": "ARTH-255", "path": "/courses/15353", "sections": {"path": "/courses/15353/sections", "values": [{"name": "ITALIAN RENAISSANCE ART", "sectionnum": "601", "primary_alias": "ARTH-255-601", "path": "/courses/15353/sections/601", "id": "15353-601", "aliases": ["ARTH-255-601"]}]}, "id": 15353, "aliases": ["ARTH-255"]}