{"coursehistories": {"path": "/coursehistories/5163"}, "description": "Histories of trade, political economy, mobility, and religious culture have been deeply interwined across the entire Indian Ocean rim: from cross-generational networks of merchant-saints of Hadhramaut (Yemen) in the heart of Malaysia's dynamic economy, to African slaves ruling states in India, to pirates at the nexus of global and local economies and Islamism, to present-day migrant laborers in Dubai who send money home to Pakistan to construct mosques and madrasas. How have cross-regional movement and local culture interacted over time under the broad umbrella of \"Islam\", as various powers extended supremacy over different aspects of this arena since the early modern era? Through the study of this region, with an emphasis on different thematic linkages between the Middle East, East Africa, South Asia, and Southeast Asia, we will think critically about the place of individuals and localities in cross-regional social and cultural change broadly viewed through the lens of \"Islam\". At the same time we will think about the extent to which a focus on \"Islam\" is fruitful for analysis, and how it might obscure other intersting questions of either political economy or identity. \n\nBy the end of the course, students will also have a good understanding of the historical geography of the Indian Ocean region; the shifting nature of cross-regional interactions over time in that region; and the way this region contributes to continuing change in global political economy. \n\n", "semester": "2011C", "name": "TRANSNATIONAL ISLAM: Transnational Islam and the Indian Ocean", "reviews": {"path": "/courses/25097/reviews", "values": [{"ratings": {"rAmountLearned": "2.75", "rDifficulty": "2.00", "rStimulateInterest": "2.50", "rRecommendMajor": "3.25", "rCourseQuality": "2.25", "rWorkRequired": "2.50", "rInstructorAccess": "3.75", "rReadingsValue": "3.25", "rRecommendNonMajor": "2.75", "rCommAbility": "2.50", "rInstructorQuality": "3.00"}, "section": {"name": "TRANSNATIONAL ISLAM: Transnational Islam and the Indian Ocean", "sectionnum": "401", "primary_alias": "SAST-169-401", "path": "/courses/25097/sections/401", "id": "25097-401", "aliases": ["SAST-169-401", "NELC-189-401", "ANTH-169-401"]}, "comments": "", "num_students": 4, "path": "/courses/25097/sections/401/reviews/4974-JAMES-CARON", "instructor": {"path": "/instructors/4974-JAMES-CARON", "first_name": "JAMES", "last_name": "CARON", "id": "4974-JAMES-CARON", "name": "JAMES CARON"}, "num_reviewers": 4, "id": "25097-401-4974-JAMES-CARON"}]}, "credits": null, "primary_alias": "SAST-169", "path": "/courses/25097", "sections": {"path": "/courses/25097/sections", "values": [{"name": "TRANSNATIONAL ISLAM: Transnational Islam and the Indian Ocean", "sectionnum": "401", "primary_alias": "SAST-169-401", "path": "/courses/25097/sections/401", "id": "25097-401", "aliases": ["SAST-169-401", "NELC-189-401", "ANTH-169-401"]}]}, "id": 25097, "aliases": ["SAST-169", "NELC-189", "ANTH-169"]}