{"coursehistories": {"path": "/coursehistories/588"}, "description": "A study of the major events, issues, and personalities in Afro-American history from Reconstruction to the present. It will also examine the different slave experiences and the methods of black resistance and rebellion in the various slave systems. \n\n", "semester": "2011A", "name": "AFRO AMER HIST 1876-PRES", "reviews": {"path": "/courses/21858/reviews", "values": [{"ratings": {"rAmountLearned": "3.21", "rDifficulty": "1.88", "rStimulateInterest": "3.32", "rRecommendMajor": "3.45", "rCourseQuality": "3.13", "rWorkRequired": "2.15", "rInstructorAccess": "3.47", "rReadingsValue": "3.56", "rRecommendNonMajor": "3.56", "rCommAbility": "3.41", "rInstructorQuality": "3.41"}, "section": {"name": "AFRO AMER HIST 1876-PRES", "sectionnum": "401", "primary_alias": "HIST-177-401", "path": "/courses/21858/sections/401", "id": "21858-401", "aliases": ["HIST-177-401", "AFRC-177-401"]}, "comments": "&#8232;&#8232;This course examines the major events, issues, and personalities in African American history from the Reconstruction period until the present day. The course also surveys the different slave experiences and the methods of Black resistance and rebellion in various slave systems. &#8232;&#8232;Students praised the course content as both interesting and relevant. Students appreciated that, “the reading load is light but every reading has a major impact.” Readings were often supplemented with multimedia such as music, videos, and photographs.&#8232;&#8232;Students rated Professor Akins highly for being both, “thought provoking and stimulating.” Many students praised Professor Akins’ discussion-based style of teaching, noting that “Professor Akins encourages debate and discussion among the students,” while acting as moderator guiding the discussion. Some students expressed concern, however, that the class relied too much on discussion and suggested more lecturing would supplement class discussion with firmer grounding in the course materials.&#8232;&#8232;Students seemed confident that their grades were based on a fair system of midterms and papers. Students considering the workload appropriate. Many students recommended this course, both to non-majors and to History majors. The course is open to both college freshmen and upperclassmen.", "num_students": 42, "path": "/courses/21858/sections/401/reviews/5381-JACQUELINE-A-AKINS", "instructor": {"path": "/instructors/5381-JACQUELINE-A-AKINS", "first_name": "JACQUELINE A", "last_name": "AKINS", "id": "5381-JACQUELINE-A-AKINS", "name": "JACQUELINE A AKINS"}, "num_reviewers": 41, "id": "21858-401-5381-JACQUELINE-A-AKINS"}]}, "credits": null, "primary_alias": "HIST-177", "path": "/courses/21858", "sections": {"path": "/courses/21858/sections", "values": [{"name": "AFRO AMER HIST 1876-PRES", "sectionnum": "401", "primary_alias": "HIST-177-401", "path": "/courses/21858/sections/401", "id": "21858-401", "aliases": ["HIST-177-401", "AFRC-177-401"]}]}, "id": 21858, "aliases": ["HIST-177", "AFRC-177"]}