{"coursehistories": {"path": "/coursehistories/754"}, "description": "This course explores the role of mergers and acquisitions and alternative methods of corporate development in advancing the strategies of operating business. Emphasis is on the way companies use acquisitions to alter business mixes; seize opportunities in new products, technologies and markets; enhance competitive positioning; adjust to changing economics, and promote value-creating growth. Although the course will emphasize strategic acquisitions, it also will explore leveraged buy-outs and hostile financial acquisitions as well as their influence on corporate buyers. \n\n", "semester": "2011C", "name": "MERGERS & ACQUISITIONS", "reviews": {"path": "/courses/24743/reviews", "values": [{"ratings": {"rAmountLearned": "3.33", "rDifficulty": "2.13", "rStimulateInterest": "3.29", "rRecommendMajor": "3.71", "rCourseQuality": "3.31", "rWorkRequired": "2.65", "rInstructorAccess": "3.50", "rReadingsValue": "3.17", "rRecommendNonMajor": "2.83", "rCommAbility": "3.25", "rInstructorQuality": "3.15"}, "section": {"name": "MERGERS & ACQUISITIONS", "sectionnum": "001", "primary_alias": "MGMT-249-001", "path": "/courses/24743/sections/001", "id": "24743-001", "aliases": ["MGMT-249-001"]}, "comments": "Management 249 explores the role of mergers and acquisitions and alternative methods of corporate development in advancing the strategies of operating business. Emphasis is on the way companies use acquisitions to alter business mixes; seize opportunities in new products, technologies and markets; enhance competitive positioning; adjust to changing economics, and promote value-creating growth. Although the course emphasizes strategic acquisitions, it also explores leveraged buy-outs and hostile financial acquisitions as well as their influence on corporate buyers.\r\n\r\nAll of the students who reviewed this course described it positively.  Students found the material to be “interesting” and “really enjoyed the discussion nature of the course.”  A few students commented that they “learned a ton.”\r\n\r\nStudents described Professor Feldman as “amazing” and “engaging.”  Many praised her for “adroitly guiding the conversation through the different challenges and solutions of the case studies” and “getting the appropriate take-aways from student’s comments.”\r\n\r\nThis class is a case-based course. Students are graded based on a large group project and participation in class discussions. A few students mentioned that significant work was required to prepare for the class discussions. MGMT 100 and MGMT 101 are prerequisites.\r\n", "num_students": 27, "path": "/courses/24743/sections/001/reviews/5639-EMILIE-R--FELDMAN", "instructor": {"path": "/instructors/5639-EMILIE-R--FELDMAN", "first_name": "EMILIE R.", "last_name": "FELDMAN", "id": "5639-EMILIE-R--FELDMAN", "name": "EMILIE R. FELDMAN"}, "num_reviewers": 26, "id": "24743-001-5639-EMILIE-R--FELDMAN"}]}, "credits": null, "primary_alias": "MGMT-249", "path": "/courses/24743", "sections": {"path": "/courses/24743/sections", "values": [{"name": "MERGERS & ACQUISITIONS", "sectionnum": "001", "primary_alias": "MGMT-249-001", "path": "/courses/24743/sections/001", "id": "24743-001", "aliases": ["MGMT-249-001"]}]}, "id": 24743, "aliases": ["MGMT-249"]}