[{"ratings": {"rAmountLearned": "2.72", "rDifficulty": "2.65", "rStimulateInterest": "2.91", "rRecommendMajor": "3.50", "rCourseQuality": "2.71", "rWorkRequired": "2.19", "rInstructorAccess": "2.78", "rReadingsValue": "2.21", "rRecommendNonMajor": "2.74", "rCommAbility": "3.28", "rInstructorQuality": "3.04"}, "section": {"name": "SOCIAL PSYCHOLOGY", "sectionnum": "001", "primary_alias": "PSYC-170-001", "path": "/courses/28071/sections/001", "id": "28071-001", "aliases": ["PSYC-170-001"]}, "comments": "An overview of theories and research across the range of social behavior from intra-individual to the group level including the effects of culture, social environment, and groups on social interaction.\r\n\r\nOverall, the majority of the students found the class to be “relatively enlightening” and the material to “extremely interesting.” Students enjoyed the interactive nature of such a large lecture, but also stated that the grading was “very harsh” and oftentimes “arbitrary.” A majority of students stated, “it’s not impossible to do well if you keep up with the readings.”\r\n\r\nDr. Goodwin was described as “mostly entertaining” with an ability to “explain concepts clearly using real world, experimental, and media examples.” A lot of students described him as “dry” at times, though, and sometimes “a little nervous.” Overall, students seemed to really enjoy Professor Goodwin.\r\n\r\nStudents seemed to mainly have an issue with the grading in this class. Otherwise, they would “recommend it to anyone interested in psychology.” A majority of students stated, “it’s not impossible to do well if you keep up with the readings.”", "num_students": 270, "path": "/courses/28071/sections/001/reviews/4544-GEOFFREY-P--GOODWIN", "instructor": {"path": "/instructors/4544-GEOFFREY-P--GOODWIN", "first_name": "GEOFFREY P.", "last_name": "GOODWIN", "id": "4544-GEOFFREY-P--GOODWIN", "name": "GEOFFREY P. GOODWIN"}, "num_reviewers": 246, "id": "28071-001-4544-GEOFFREY-P--GOODWIN"}]