[{"ratings": {"rAmountLearned": "3.20", "rDifficulty": "2.67", "rStimulateInterest": "3.39", "rRecommendMajor": "3.66", "rCourseQuality": "2.93", "rWorkRequired": "3.03", "rInstructorAccess": "3.08", "rReadingsValue": "3.03", "rRecommendNonMajor": "2.73", "rCommAbility": "3.33", "rInstructorQuality": "3.33"}, "section": {"name": "MEDICINE IN HISTORY", "sectionnum": "401", "primary_alias": "HSOC-002-401", "path": "/courses/23244/sections/401", "id": "23244-401", "aliases": ["HSOC-002-401", "HIST-036-401", "STSC-002-401"]}, "comments": "&#8232;This course surveys the history of medical knowledge and practice from antiquity to the present. The course takes a broadly chronological approach, blending the perspectives of the patient, the physician, and society as a whole--recognizing that medicine has always aspired to \"treat\" healthy people as well as the sick. Rather than history \"from the “top down\" or \"from the “bottom up,” this course sets its sights on history from the inside out. This means, first, that medical knowledge and practice is understood through the personal experiences of patients and caregivers. Required readings consist largely of primary sources, from elite medical texts to patient diaries. Short research assignments encourage students to adopt the perspectives of a range of actors in various historical eras. &#8232;&#8232;\r\nStudents raved about the course. They thought that the lectures were interesting and that the course “really took advantage of Philadelphia’s rich medical history,” and that the interesting readings complemented the lectures. Students reported that they enjoyed the creative assignments and the course as a whole.\r\n\r\n &#8232;&#8232;Students praised Professor Barnes as well. They thought that Professor Barnes was enthusiastic and passionate about the course and flexible with regard to assignments and due dates. One student commented that Professor Barnes is the “best professor at Penn.” &#8232;&#8232;\r\n\r\nStudents generally agreed that the course required a lot of work. They claimed that Professor Barnes fairly warns students from day one of the amount of work that the course will require. The course’s assignments include two extensive research papers, a shorter paper, two midterms, a final, and weekly assignments.\r\n", "num_students": 78, "path": "/courses/23244/sections/401/reviews/1520-DAVID-S--BARNES", "instructor": {"path": "/instructors/1520-DAVID-S--BARNES", "first_name": "DAVID S.", "last_name": "BARNES", "id": "1520-DAVID-S--BARNES", "name": "DAVID S. BARNES"}, "num_reviewers": 71, "id": "23244-401-1520-DAVID-S--BARNES"}]