[{"ratings": {"rAmountLearned": "2.71", "rDifficulty": "2.53", "rStimulateInterest": "2.00", "rRecommendMajor": "3.21", "rCourseQuality": "2.65", "rWorkRequired": "2.35", "rInstructorAccess": "2.27", "rReadingsValue": "2.82", "rRecommendNonMajor": "2.24", "rCommAbility": "2.64", "rInstructorQuality": "2.73"}, "section": {"name": "INTERNATIONAL POL ECON", "sectionnum": "001", "primary_alias": "PSCI-152-001", "path": "/courses/16349/sections/001", "id": "16349-001", "aliases": ["PSCI-152-001"]}, "comments": "This course examines the politics of international economic relations. Whether we are considering trade or monetary issues among rich countries, or problems of debt and development for emerging economies, an understanding of how economic policies and outcomes are affected by politics is essential. Economic theories of trade and finance allow us to identify the potential gains from exchange between countries, but only by systematically analyzing domestic and international politics can we explain the actual patterns of exchange that we observe. The course will analyze the interplay between politics and economics in three broad areas: international trade, international finance, and economic development. In each section, we will first discuss economic theories that explain the causes and consequences of international commerce, capital flows, and economic growth. We will then explore how political interests, institutions, and ideas alter these predictions, examining both historical examples and current policy debates.\r\n\r\nStudents felt this was a wonderful course and a “great introduction into International Political Economy.” By covering up-to-date issues, the course gave students a framework to understand the actions of governments and other actors. Students felt that the professor did a great job of having the readings compliment the lectures. However, one student did feel that real life examples were needed to ground the theory readings. &#8232;&#8232;\r\n\r\nProfessor Schulz is described as a “well-organized” professor who taught the concepts very clearly. He was also praised for his willingness to hold discussion and questions in lecture and to review the readings. Yet students did find that the Professor could be a bit dry at times. One student said Professor Schulz was “a bit hard to understand which made it hard to gain full benefit of what he was saying.”&#8232;&#8232;\r\n\r\nThis is a political science elective course. ", "num_students": 43, "path": "/courses/16349/sections/001/reviews/2659-HEINER-SCHULZ", "instructor": {"path": "/instructors/2659-HEINER-SCHULZ", "first_name": "HEINER", "last_name": "SCHULZ", "id": "2659-HEINER-SCHULZ", "name": "HEINER SCHULZ"}, "num_reviewers": 40, "id": "16349-001-2659-HEINER-SCHULZ"}]