[{"ratings": {"rInstructorRapport": "3.58", "rTAQuality": "3.25", "rAbilitiesChallenged": "3.33", "rInstructorAttitude": "3.58", "rHomeworkValuable": "3.17", "rReadingsValue": "3.17", "rInstructorConcern": "3.33", "rCourseQuality": "3.23", "rClassPace": "2.17", "rExamsConsistent": "3.33", "rInstructorAccess": "3.58", "rGradeFairness": "3.67", "rArticulateGoals": "2.45", "rOralSkills": "3.17", "rNativeAbility": "3.33", "rInstructorQuality": "3.38", "rWorkRequired": "1.25", "rStimulateInterest": "3.33", "rInstructorEffective": "3.00", "rSkillEmphasis": "3.00"}, "section": {"name": "ADVANCED ITALIAN", "sectionnum": "302", "primary_alias": "ITAL-202-302", "path": "/courses/17563/sections/302", "id": "17563-302", "aliases": ["ITAL-202-302"]}, "comments": "This course aims at developing and deepening language abilities acquired in the first two years of study; it also prepares students for upper-level courses in literature, culture or cinema. Students will increase their vocabulary and speaking skills through the reading, analysis, and discussion of Niccolò Amanniti’s best-selling novel Io non ho paura. Other reading materials will open windows onto aspects of contemporary Italian culture and society. We will place special emphasis on a thorough review of advanced grammar. \r\n\r\nOverall, students really liked this class. One student appreciated the films that the course emphasized in its lessons, because they were both “entertaining and interesting ways in which to present some culture and history.” The one consistent criticism students give the course, however, is its lack of emphasis on grammar. In general, many students took a liking to the intersection between Italian language and culture.&#8232;&#8232;\r\n\r\nStudents had many positive things to say about Professor Johnston, including the way she “inspires her students to enjoy learning Italian and speak it with more ease.” Students also liked how Johnston would break them up into groups to work instead of always emphasizing class discussions.&#8232;&#8232;\r\n\r\nMost of the students who took this class had only started taking Italian while at Penn. Therefore some said it was hard to gain a concrete grasp without having more exposure to Italian grammar. One student recommended that the course be worth two credits. Short weekly compositions and a final project were the bulk of the work. This course is a prerequisite for other 200-level courses. \r\n", "num_students": 14, "path": "/courses/17563/sections/302/reviews/1527-MARINA-DELLA-PUTTA-JOHNSTON", "instructor": {"path": "/instructors/1527-MARINA-DELLA-PUTTA-JOHNSTON", "first_name": "MARINA DELLA PUTTA", "last_name": "JOHNSTON", "id": "1527-MARINA-DELLA-PUTTA-JOHNSTON", "name": "MARINA DELLA PUTTA JOHNSTON"}, "num_reviewers": 13, "id": "17563-302-1527-MARINA-DELLA-PUTTA-JOHNSTON"}]