[{"ratings": {"rAmountLearned": "3.31", "rDifficulty": "2.93", "rStimulateInterest": "3.37", "rRecommendMajor": "3.53", "rCourseQuality": "3.17", "rWorkRequired": "3.10", "rInstructorAccess": "3.29", "rReadingsValue": "3.13", "rRecommendNonMajor": "1.97", "rCommAbility": "3.10", "rInstructorQuality": "3.31"}, "section": {"name": "PHYS BASED ANIMATION", "sectionnum": "001", "primary_alias": "CIS-563-001", "path": "/courses/27176/sections/001", "id": "27176-001", "aliases": ["CIS-563-001"]}, "comments": "This course introduces students to common physically based simulation techniques for animation of fluids and gases, rigid and deformable solids, cloth, explosions, fire, smoke, virtual characters, and other systems. Physical based simulation techniques allow for creation of extremely realistic special effects for movies, video games and surgical simulation systems. The course covers state-of-the-art techniques that are commonly used in current special effects and animation studios and in video games community. To gain hands-on experience, students will implement basic simulators for several systems. The topics will include: Particle Systems, Mass spring systems, Deformable Solids & Fracture, Cloth, Explosions & Fire, Smoke, Fluids, Deformable active characters, Simulation and control of rigid bodies, Rigid body dynamics, Collision detection and handling, Simulation of articulated characters, Simulated characters in games.\r\n\r\nStudents really reported learning a lot in this course.  This is a “a good course for anyone interested in graphics” or “understanding and actually implementing simulations of physical phenomena.” Students stated that the programming assignments are helpful for actually putting into place was has been learned in class.\r\n\r\nStudents thought the professor was “great” and “informative”. However, some students wished several of the assignment had more clarification.\r\n \r\nThis class is intended for upper level undergraduates and/or graduate students in computer science majors. Students thought the workload was hard but rewarding and informative. Many students described this course as “great” or “awesome” and recommended taking the course. Students enjoyed how customization was encouraged in homework to ensure variation among students. There is no midterm or final in this course, but there are regular time-intensive programming assignments.\r\n", "num_students": 40, "path": "/courses/27176/sections/001/reviews/5321-JOSEPH-THEODORE-KIDER", "instructor": {"path": "/instructors/5321-JOSEPH-THEODORE-KIDER", "first_name": "JOSEPH THEODORE", "last_name": "KIDER", "id": "5321-JOSEPH-THEODORE-KIDER", "name": "JOSEPH THEODORE KIDER"}, "num_reviewers": 31, "id": "27176-001-5321-JOSEPH-THEODORE-KIDER"}]