{"coursehistories": {"path": "/coursehistories/3837"}, "description": "How do minds work? This course surveys a wide range of answers to this question from disciplines ranging from philosophy to neuroscience. The course devotes special attention to the use of simple computational and mathematical models. Topics include perception, learning, memory, decision making, emotion and consciousness. \n\n", "semester": "2011C", "name": "INTRO COGNITIVE SCIENCE", "reviews": {"path": "/courses/24164/reviews", "values": [{"ratings": {"rAmountLearned": "2.71", "rDifficulty": "2.19", "rStimulateInterest": "2.70", "rRecommendMajor": "3.42", "rCourseQuality": "2.71", "rWorkRequired": "2.48", "rInstructorAccess": "3.10", "rReadingsValue": "2.21", "rRecommendNonMajor": "2.57", "rCommAbility": "3.03", "rInstructorQuality": "2.95"}, "section": {"name": "INTRO COGNITIVE SCIENCE", "sectionnum": "401", "primary_alias": "CIS-140-401", "path": "/courses/24164/sections/401", "id": "24164-401", "aliases": ["CIS-140-401", "COGS-001-401", "PPE-140-401", "PHIL-044-401", "PSYC-207-401", "LING-105-401"]}, "comments": "This course surveys a wide range of answers to the question “how do minds work?” Students look at\r\ndisciplines ranging from philosophy to neuroscience. The course devotes special attention\r\nto the use of simple computational and mathematical models. Topics include perception,\r\nlearning, memory, decision making, emotion and consciousness.\r\nStudents reported that this course was “scattered” and “random,” but still\r\n“interesting.” Students did note that the nature of the field is broad, and that the\r\nintroductory course just sweeps the surface of the field’s foci. Students felt that the\r\ncontent was “too broad,” so they were unable to “learn anything valuable.” Depending\r\non the student’s interest in the field of cognitive science, some students deemed this\r\ncourse the “best course” at Penn or the “worst course” at Penn.\r\nOverall, students were pleased with Professor Brainard. He offered many office\r\nhours and was “extremely accessible.” In addition, students found office hours very\r\nhelpful. Students noted that they enjoyed Professor Brainard’s lectures. Although\r\nstudents found the course scattered, they recognized that Professor Brainard attempted to\r\nmake connections.\r\nStudent’s found the course relatively difficult, but they noted that recitations,\r\noffice hours, and lectures were very helpful. Students found that the course emphasized\r\nstatistics and scientific analysis more than they had anticipated, which made the work\r\nmore complex and difficult. Overall, there was a “fair amount” of work associated with\r\nthe course. This counts as a Formal Reasoning course for College students. ", "num_students": 176, "path": "/courses/24164/sections/401/reviews/1282-DAVID-HOYT-BRAINARD", "instructor": {"path": "/instructors/1282-DAVID-HOYT-BRAINARD", "first_name": "DAVID HOYT", "last_name": "BRAINARD", "id": "1282-DAVID-HOYT-BRAINARD", "name": "DAVID HOYT BRAINARD"}, "num_reviewers": 164, "id": "24164-401-1282-DAVID-HOYT-BRAINARD"}, {"ratings": {"rAmountLearned": "2.71", "rDifficulty": "2.19", "rStimulateInterest": "3.15", "rRecommendMajor": "3.42", "rCourseQuality": "2.71", "rWorkRequired": "2.48", "rInstructorAccess": "3.10", "rReadingsValue": "2.21", "rRecommendNonMajor": "2.57", "rCommAbility": "3.00", "rInstructorQuality": "3.09"}, "section": {"name": "INTRO COGNITIVE SCIENCE", "sectionnum": "401", "primary_alias": "CIS-140-401", "path": "/courses/24164/sections/401", "id": "24164-401", "aliases": ["CIS-140-401", "COGS-001-401", "PPE-140-401", "PHIL-044-401", "PSYC-207-401", "LING-105-401"]}, "comments": "How do minds work? This course surveys a wide range of answers to this\r\nquestion from the disciplines ranging from philosophy to neuroscience. The course\r\ndevotes special attention to the use of simple computational and mathematical models.\r\nTopics include perception, action, thought, learning, memory and social interaction.\r\nStudents were generally pleased with this course. Most students described the\r\ncourse as “interesting.” One student described it as “A thought provoking course” on “a\r\nvery contemporary and important modern subject.” The broad and interdisciplinary\r\nnature of the course was appreciated by some, but many others described it as\r\n“scattered,” “unorganized,” and “disjointed.”\r\nA student described Professor Ungar as “highly knowledgeable”. Students felt\r\nthat Professor Ungar did a good job of replying to questions on the course Blackboard\r\ndiscussion board. Lecture slides and class recordings were made available to the students.\r\nMost students mentioned that this course required a lot of homework. There were\r\nmany readings, but one student described it as “very interesting reading material” and\r\nwrote that the “course overall helps develop critical thinking and logic.” Some\r\ncomplained that the lectures on the mathematical aspects were rushed. Many students\r\ncommented on the large class size and some would have liked the class to have a\r\nrecitation. Many students found this course useful in deciding their own majors and\r\nrecommended it to anyone. This class fulfills the formal reasoning sector for college\r\nstudents.", "num_students": 176, "path": "/courses/24164/sections/401/reviews/2085-LYLE-H-UNGAR", "instructor": {"path": "/instructors/2085-LYLE-H-UNGAR", "first_name": "LYLE H", "last_name": "UNGAR", "id": "2085-LYLE-H-UNGAR", "name": "LYLE H UNGAR"}, "num_reviewers": 164, "id": "24164-401-2085-LYLE-H-UNGAR"}]}, "credits": null, "primary_alias": "CIS-140", "path": "/courses/24164", "sections": {"path": "/courses/24164/sections", "values": [{"name": "INTRO COGNITIVE SCIENCE", "sectionnum": "401", "primary_alias": "CIS-140-401", "path": "/courses/24164/sections/401", "id": "24164-401", "aliases": ["CIS-140-401", "COGS-001-401", "PPE-140-401", "PHIL-044-401", "PSYC-207-401", "LING-105-401"]}]}, "id": 24164, "aliases": ["CIS-140", "COGS-001", "PPE-140", "PHIL-044", "PSYC-207", "LING-105"]}