{"coursehistories": {"path": "/coursehistories/3493"}, "description": "This course explores the role of the U.S. Supreme Court in political struggles over the distribution and uses of power in the American constitutional system. Issues include the division of powers between state and national governments, and the branches of the federal government; economic powers of private actors and governmental regulators; the authority of governments to enforce or transform racial and gender hierarchies; and the powers of individuals to make basic choices, such as a woman's power to have an abortion. We will pay special attention to how the tasks of justifying the Supreme Court's own power, and constitutionalism more broadly, contribute to logically debatable, but politically powerful constitutional arguments. Readings include Supreme Court decisions and background materials on their historical and political context. \n\n", "semester": "2010C", "name": "CONSTITUTIONAL LAW", "reviews": {"path": "/courses/23677/reviews", "values": [{"ratings": {"rAmountLearned": "3.27", "rDifficulty": "3.02", "rStimulateInterest": "3.07", "rRecommendMajor": "3.64", "rCourseQuality": "3.08", "rWorkRequired": "2.95", "rInstructorAccess": "2.89", "rReadingsValue": "3.04", "rRecommendNonMajor": "2.68", "rCommAbility": "3.20", "rInstructorQuality": "3.26"}, "section": {"name": "CONSTITUTIONAL LAW", "sectionnum": "401", "primary_alias": "PSCI-271-401", "path": "/courses/23677/sections/401", "id": "23677-401", "aliases": ["PSCI-271-401", "PPE-270-401"]}, "comments": "\r\nThis course explores the role of the U.S. Supreme Court in political struggles over the distribution and uses of power in the American constitutional system. Issues include the division of powers between state and national governments, and the branches of the federal government; economic powers of private actors and governmental regulators; the authority of governments to enforce or transform racial and gender hierarchies; and the powers of individuals to make basic choices, such as a woman's power to have an abortion. Special attention is paid to how the tasks of justifying the Supreme Court's own power, and constitutionalism, in general, contribute to logically debatable, but politically powerful constitutional arguments. Readings include Supreme Court decisions and background materials on their historical and political context. \r\n\r\nMany students who took this course described it as “excellent.” Some were surprised that the course focused so heavily on specific cases instead of learning laws, but they found the material interesting, the lectures clear, and the assignments “original.” Some students expressed their hesitation in signing up for the course because of their lack of experience in the field, but found the course to be well taught and were able to “make sense of complicated issues” through lecture. Students also enjoyed the use of clickers in the course as it allowed them to voice opinions, stimulated interaction and fueled discussion. Each student said they were glad they took it. \r\n\r\nThere was not a single negative comment about Professor Smith. He was regarded with respect due to his knowledge of the subject as well as praised for his ability to engage students and make lectures entertaining. Many students found his sense of humor to be refreshing and though he was said to fly through material, he always answered questions well. He was also accessible outside of class to answer questions. More than one student said he was the best professor at Penn, “hands down”.\r\n\r\nThis course should be regarded as challenging but rewarding. The workload was said to be quite heavy and both reading and writing centric. Some students said that not all of the reading was “required” and many lost motivation to read the entire bulk pack throughout the semester. Consequently, some complained this lead to limited student participation in recitation. Overall, the course was recommended to anyone with any remote interest in the subject because of the interesting material and the well-liked professor.\r\n", "num_students": 75, "path": "/courses/23677/sections/401/reviews/1002-ROGERS-M-SMITH", "instructor": {"path": "/instructors/1002-ROGERS-M-SMITH", "first_name": "ROGERS M", "last_name": "SMITH", "id": "1002-ROGERS-M-SMITH", "name": "ROGERS M SMITH"}, "num_reviewers": 69, "id": "23677-401-1002-ROGERS-M-SMITH"}]}, "credits": null, "primary_alias": "PSCI-271", "path": "/courses/23677", "sections": {"path": "/courses/23677/sections", "values": [{"name": "CONSTITUTIONAL LAW", "sectionnum": "401", "primary_alias": "PSCI-271-401", "path": "/courses/23677/sections/401", "id": "23677-401", "aliases": ["PSCI-271-401", "PPE-270-401"]}]}, "id": 23677, "aliases": ["PSCI-271", "PPE-270"]}