[{"ratings": {"rAmountLearned": "2.45", "rDifficulty": "2.40", "rStimulateInterest": "2.89", "rRecommendMajor": "3.22", "rCourseQuality": "2.50", "rWorkRequired": "1.78", "rInstructorAccess": "2.90", "rReadingsValue": "2.13", "rRecommendNonMajor": "2.46", "rCommAbility": "2.73", "rInstructorQuality": "2.95"}, "section": {"name": "INTRO HUMAN EVOLUTION", "sectionnum": "001", "primary_alias": "ANTH-003-001", "path": "/courses/22608/sections/001", "id": "22608-001", "aliases": ["ANTH-003-001"]}, "comments": "\r\nThis course focuses on the scientific study of human evolution describing the emergence, development, and diversification of our species, Homo sapiens. The course will cover the fundamental principles of evolutionary theory and some of the basics of genetics and heredity as they relate to human morphological, physiological, and genetic variation. Then it examines what studies of nonhuman primates (monkeys and apes) can reveal about our own evolutionary past, reviewing the behavioral and ecological diversity seen among living primates. The Course concludes by examining the \"hard\" evidence of human evolution - the fossil and material culture record of human history from our earliest primate ancestors to the emergence of modern Homo sapiens. \r\n\r\nStudents enjoyed the material covered in class. However, the readings and information on blackboard was ‘confusing’ and students were often not sure what they should prepare for. \r\n\r\nMost students described Professor Monge as “unique” and possibly the “most engaging” professor at Penn. She incorporates a lot of stories into the lecture and is extremely entertaining. However, many of the stories she talks about are off-topic and often strayed from the material. Some of the students were discontented as they felt like it was a waste of time. \r\n\r\nThe course allows students to gain understanding into human evolution and appreciation for the methodology in the field. There were diverse opinions on the difficulty of the course. Those who do not have a biology background will find this course harder to follow. On the other hand, some students with strong biology backgrounds said the information was often easy and less interesting. One group of students felt like the course did not focus enough on the ‘human’ aspect.\r\n", "num_students": 147, "path": "/courses/22608/sections/001/reviews/97-JANET-M--MONGE", "instructor": {"path": "/instructors/97-JANET-M--MONGE", "first_name": "JANET M.", "last_name": "MONGE", "id": "97-JANET-M--MONGE", "name": "JANET M. MONGE"}, "num_reviewers": 128, "id": "22608-001-97-JANET-M--MONGE"}]