{"coursehistories": {"path": "/coursehistories/4630"}, "description": "This course is intended for students interested in U.S/Global Healthcare. It includes lectures, discussions, readings, and written assignments focused on various social, cultural, and economic factors that impact the health and illness perceptions and behaviors of various ethnic and minority groups. In particular, it focuses on how culture affects health and disease, and how health and disease affect culture. \n\nThis course takes a critical approach to knowledge development by scrutinizing values, theories, assumptions, and practices cross culturally. It relies upon a range of interdisciplinary approaches to analyze how disease is diagnosed, treated, and experienced differently in various cultural contexts. At the same time, students will have the opportunity to examine and critique cultural assumptions and theories, the shifting nature of cultures, the situational use of cultural traditions, and the ethnocentrism of contemporary Western health care. Special attention is given to the influence of race, class, gender, religious, and spiritual ideas about health and illness. \n\n", "semester": "2011C", "name": "SOCIOCULTURAL INFLUENCES ON HEALTH", "reviews": {"path": "/courses/24861/reviews", "values": [{"ratings": {"rAmountLearned": "3.63", "rDifficulty": "2.04", "rStimulateInterest": "3.78", "rRecommendMajor": "3.81", "rCourseQuality": "3.56", "rWorkRequired": "2.30", "rInstructorAccess": "3.70", "rReadingsValue": "3.52", "rRecommendNonMajor": "2.93", "rCommAbility": "3.74", "rInstructorQuality": "3.71"}, "section": {"name": "SOCIOCULTURAL INFLUENCES ON HEALTH", "sectionnum": "401", "primary_alias": "NURS-315-401", "path": "/courses/24861/sections/401", "id": "24861-401", "aliases": ["NURS-315-401", "NURS-515-401"]}, "comments": "This course is intended for students interested in U.S/Global Healthcare. It includes\r\nlectures, discussions, readings, and written assignments focused on various social,\r\ncultural, and economic factors that impact the health and illness perceptions and\r\nbehaviors of various ethnic and minority groups. In particular, it focuses on how culture\r\naffects health and disease, and how health and disease affect culture. This course takes a\r\ncritical approach to knowledge development by scrutinizing values, theories,\r\nassumptions, and practices cross culturally. It relies upon a range of interdisciplinary\r\napproaches to analyze how disease is diagnosed, treated, and experienced differently in\r\nvarious cultural contexts. At the same time, students have the opportunity to examine and\r\ncritique cultural assumptions and theories, the shifting nature of cultures, the situational\r\nuse of cultural traditions, and the ethnocentrism of contemporary Western health care.\r\nSpecial attention is given to the influence of race, class, gender, religious, and spiritual\r\nideas about health and illness.\r\nThis course was highly praised by the students. Some credit this course as “one of\r\nthe best”. Students felt they learned a lot about cultural competency and would highly\r\nrecommend it to others.\r\nThis course is an elective in the school of nursing. It is open to all students, but\r\ntypically taken by students with a global health minor.", "num_students": 30, "path": "/courses/24861/sections/401/reviews/3857-BARBRA-MANN-WALL", "instructor": {"path": "/instructors/3857-BARBRA-MANN-WALL", "first_name": "BARBRA MANN", "last_name": "WALL", "id": "3857-BARBRA-MANN-WALL", "name": "BARBRA MANN WALL"}, "num_reviewers": 29, "id": "24861-401-3857-BARBRA-MANN-WALL"}]}, "credits": null, "primary_alias": "NURS-315", "path": "/courses/24861", "sections": {"path": "/courses/24861/sections", "values": [{"name": "SOCIOCULTURAL INFLUENCES ON HEALTH", "sectionnum": "401", "primary_alias": "NURS-315-401", "path": "/courses/24861/sections/401", "id": "24861-401", "aliases": ["NURS-315-401", "NURS-515-401"]}]}, "id": 24861, "aliases": ["NURS-315", "NURS-515"]}