{"coursehistories": {"path": "/coursehistories/4192"}, "description": "How do you optimally encode a text file? How do you find shortest paths in a map? How do you desgin a communication network? How do you route data in a network? What are the limits of efficient computation? This course gives a comprehensive introduction to design and analysis of algorithms, and answers along the way to these and many other interesting computational questions. You will learn about problem-solving; advanced data structures such as universal hashing and red-black trees; advanced design and analysis techniques such as dynamic programming and amortized analysis; graph algorithms such as minimum spanning trees and network flos; NP-completeness theory; and approximation algorithms. \n\n", "semester": "2012A", "name": "INTRO TO ALGORITHMS", "reviews": {"path": "/courses/27157/reviews", "values": [{"ratings": {"rAmountLearned": "3.47", "rDifficulty": "3.72", "rStimulateInterest": "3.27", "rRecommendMajor": "3.56", "rCourseQuality": "3.14", "rWorkRequired": "3.33", "rInstructorAccess": "2.89", "rReadingsValue": "2.89", "rRecommendNonMajor": "1.36", "rCommAbility": "3.39", "rInstructorQuality": "3.49"}, "section": {"name": "INTRO TO ALGORITHMS", "sectionnum": "001", "primary_alias": "CIS-320-001", "path": "/courses/27157/sections/001", "id": "27157-001", "aliases": ["CIS-320-001"]}, "comments": "How do you optimally encode a text file? How do you find shortest paths in a map? How do you design a communication network? How do you route data in a network? What are the limits of efficient computation? This course gives a comprehensive introduction to design and analysis of algorithms, and answers along the way to these and many other interesting computational questions. The course will cover problem-solving; advanced data structures such as universal hashing and red-black trees; advanced design and analysis techniques such as dynamic programming and amortized analysis; graph algorithms such as minimum spanning trees and network flos; NP-completeness theory; and approximation algorithms.\r\n\r\nThis course is about how to design algorithms. Students enjoyed how this course made you really think, “The main benefit from this course is that it really makes you think! It is a very interesting course that shows how you can solve a problem much faster if you think about it in a smarter way!” Students stated that the textbook was a great way to refresh previously learned topics in computer science.\r\n\r\nProf. Khanna was lauded as a great professor.  A student stated, “Professor Khanna did an excellent job of promoting student interest in a difficult subject matter to teach.” A few students desired for my examples were provided in class to supplement the class material.\r\n\r\nThis class is intended for juniors in the computer science department but can be taken by students who have completed the prerequisites CIS 120, 161, and 262. In general, students thought that homework was long but very informative. This course’s grading structure is based off 6 homework assignments, 2 midterms and a final. Several students stated that they wished homework were weighted higher in the grade since it is more representative of computer science programming skills.  Students said this class was a “huge time commitment,” and “challenging” but still called the course “excellent,” “intellectually rewarding,” and “worth it.”\r\n", "num_students": 115, "path": "/courses/27157/sections/001/reviews/305-SANJEEV-KHANNA", "instructor": {"path": "/instructors/305-SANJEEV-KHANNA", "first_name": "SANJEEV", "last_name": "KHANNA", "id": "305-SANJEEV-KHANNA", "name": "SANJEEV KHANNA"}, "num_reviewers": 105, "id": "27157-001-305-SANJEEV-KHANNA"}]}, "credits": null, "primary_alias": "CIS-320", "path": "/courses/27157", "sections": {"path": "/courses/27157/sections", "values": [{"name": "INTRO TO ALGORITHMS", "sectionnum": "001", "primary_alias": "CIS-320-001", "path": "/courses/27157/sections/001", "id": "27157-001", "aliases": ["CIS-320-001"]}]}, "id": 27157, "aliases": ["CIS-320"]}