{"coursehistories": {"path": "/coursehistories/2547"}, "description": "Common principles of Circuits, Systems and flows of electron, photons, and other entities as applied to electrical, and non-electrical systems such as optical (plasmonic), fluidic, traffic, neural, electrochemical, and biological circuits. Class demonstration and computer simulations will be given where applicable to help in rapid understanding of concepts and applications. \n\n", "semester": "2009C", "name": "ELEC CIRCUITS & SYS I", "reviews": {"path": "/courses/17307/reviews", "values": [{"ratings": {"rAmountLearned": "2.97", "rDifficulty": "2.86", "rStimulateInterest": "2.95", "rRecommendMajor": "3.32", "rCourseQuality": "2.94", "rWorkRequired": "2.56", "rInstructorAccess": "3.00", "rReadingsValue": "2.15", "rRecommendNonMajor": "1.68", "rCommAbility": "3.30", "rInstructorQuality": "3.36"}, "section": {"name": "ELEC CIRCUITS & SYS I", "sectionnum": "001", "primary_alias": "ESE-215-001", "path": "/courses/17307/sections/001", "id": "17307-001", "aliases": ["ESE-215-001"]}, "comments": "This course focuses on common principles of circuits, systems and flows of electron, photons, and other entities as applied to electrical and non-electrical systems such as optical (plasmonic), fluidic, traffic, neural, electrochemical, and biological circuits. Class demonstration and computer simulations were given where applicable to help in rapid understanding of concepts and applications. \r\n\r\nStudents reported that this course was “basically [a] review of PHYS 151” until the first midterm, introduced some new material before the second midterm, and got into completely new and interesting concepts afterwards, although the last three weeks were considered very hectic. The students mostly appreciated the plentiful examples and practical applications explained in class, although some wished there had been more. The homework was “meaningful” and “actually [tested] the material,” but students wished they had accounted for a greater percentage of their grade, given that they spent 6-8 hours on them every week. The homework was apparently the only source of practice material, and students expressed the need for extra practice problems in order to be better prepared for the exams. While some students felt that exams suitably tested the material and was appropriate for a 50-minute time slot, others felt that because so much material had been covered in class, there was at least one question in the exams on a topic not properly focused on in class. Recitations would “randomly” be held during lecture periods, sometimes without notice, and students were unhappy about the fact the TAs covered problems that were worked out in the book or that were previously explained in class. \r\n\r\nAs much as there were complaints about the TAs being “unsure” and “unprepared”, students heaped praises on Professor Lee. He was clear and concise in his lectures, and came well prepared to class. The pace of the class was rather fast, but Professor Lee “repeated and rehashed” the important concepts a few times before moving on. A student remarked on his impressive skill at drawing circuits – “[He] often [drew] an entire circuit by the time many students have drawn [only] one component.” Students agreed that he stimulated in them an interest in the class and was very approachable with any questions they might have. \r\n\r\nOverall, students enjoyed the course, and found it very useful. The course is highly recommended to majors, but the same cannot be said for non-majors. Computer science students said they found the course “tedious” and systems majors felt they should not have to take this course. \r\n", "num_students": 91, "path": "/courses/17307/sections/001/reviews/355-DANIEL-D--LEE", "instructor": {"path": "/instructors/355-DANIEL-D--LEE", "first_name": "DANIEL D.", "last_name": "LEE", "id": "355-DANIEL-D--LEE", "name": "DANIEL D. LEE"}, "num_reviewers": 88, "id": "17307-001-355-DANIEL-D--LEE"}]}, "credits": null, "primary_alias": "ESE-215", "path": "/courses/17307", "sections": {"path": "/courses/17307/sections", "values": [{"name": "ELEC CIRCUITS & SYS I", "sectionnum": "001", "primary_alias": "ESE-215-001", "path": "/courses/17307/sections/001", "id": "17307-001", "aliases": ["ESE-215-001"]}]}, "id": 17307, "aliases": ["ESE-215"]}