[{"ratings": {"rAmountLearned": "2.91", "rDifficulty": "1.86", "rStimulateInterest": "3.51", "rRecommendMajor": "3.70", "rCourseQuality": "3.13", "rWorkRequired": "1.66", "rInstructorAccess": "3.03", "rReadingsValue": "2.44", "rRecommendNonMajor": "3.24", "rCommAbility": "3.50", "rInstructorQuality": "3.43"}, "section": {"name": "CLIN ISS IN HLTH CR MGMT", "sectionnum": "001", "primary_alias": "HCMG-203-001", "path": "/courses/15859/sections/001", "id": "15859-001", "aliases": ["HCMG-203-001"]}, "comments": "HCMG 203 will explore the effects of the changing health care environment on the physician, patient and health care manager. It is intended for undergraduates with an interest in the subject as well as those who are planning careers as health care providers or managers. The course complements other health care courses by focusing on the individuals who participate in the health care enterprise. There are no prerequisites, as the course will stand on its own content. The course will be divided into modules that focus on the participants of the health care process and the process itself.\r\n\r\nStudents commented that the class was a good follow-up class to HCMG 101. Nearly everyone reported learning a great deal of information and enjoying the class. One student wrote that the course is “good for people deciding between going into business or clinical care.”\r\n\r\nStudents described Professor Asch as “phenomenal.” One student went so far to say that “his classes were life lessons that I will always cherish.” While students reported that many of the guest lectures were “high quality,” some thought that Professor Asch could have done a better job presenting the information.\r\n\r\nSome students wished that there had been more emphasis on the readings in class because they did not seem important until the exams.", "num_students": 74, "path": "/courses/15859/sections/001/reviews/601-DAVID-A-ASCH", "instructor": {"path": "/instructors/601-DAVID-A-ASCH", "first_name": "DAVID A", "last_name": "ASCH", "id": "601-DAVID-A-ASCH", "name": "DAVID A ASCH"}, "num_reviewers": 73, "id": "15859-001-601-DAVID-A-ASCH"}]