{"coursehistories": {"path": "/coursehistories/2734"}, "description": "We live in a world inundated with media and saturated with images. What might be reported through television, documentary films, or magazines was once presented via illustrated texts and prints or else commemorated in public murals or statues. This course will follow the emergence of modern media - culminating in photography, film, and digital media - in an increasingly public and democratic sphere of art. Social changes in courts and cities, especially in the wake of the Industrial and French Revolutions, resulted from increasing capitalism and democracy. Artists had to adjust to new roles, media, and means of support. This course will introduce students from diverse backgrounds to visual media in culture and society, providing both critical and historical tools for visual literacy in the modern world. No Prerequisites. \n\nTaught regularly in spring term. It replaces the former ARTH 102 introductory course and satisfies History of Art 100-level course requirements. \n\nIn consultation with the Undergraduate Chair, CGS students may be allowed to substitute CGS-taught ARTH 101 or 102 courses for the new ARTH 001 OR 002, respectively \n\n", "semester": "2008A", "name": "RISE OF MOD VISUAL MEDIA", "reviews": {"path": "/courses/19774/reviews", "values": [{"ratings": {"rAmountLearned": "2.52", "rDifficulty": "2.27", "rStimulateInterest": "2.12", "rRecommendMajor": "3.02", "rCourseQuality": "2.38", "rWorkRequired": "2.01", "rInstructorAccess": "2.16", "rReadingsValue": "1.65", "rRecommendNonMajor": "2.27", "rCommAbility": "2.70", "rInstructorQuality": "2.60"}, "section": {"name": "RISE OF MOD VISUAL MEDIA", "sectionnum": "001", "primary_alias": "ARTH-002-001", "path": "/courses/19774/sections/001", "id": "19774-001", "aliases": ["ARTH-002-001"]}, "comments": "This course follows the emergence of modern media - culminating in photography, film, and digital media - in an increasingly public and democratic sphere of art.  Social changes in courts and cities, especially in the wake of the Industrial and French Revolutions, resulted from increasing capitalism and democracy. Artists had to adjust to new roles, media, and means of support.  This course will introduce students from diverse backgrounds to visual media in culture and society, providing both critical and historical tools for visual literacy in the modern world. \r\n\t\r\nStudents commented that the course material was “very interesting” and “informative” but often lacked cohesion and felt disorganized.  The course concentrated on individual artists, rather than general artistic movements.  Students found the instructor’s handouts to be more beneficial than assigned textbook readings.\r\n\t\r\nStudents described Professor Silver as “engaging,” “articulate,” and “knowledgeable” but sometimes “disorganized.”  Since the class was team-taught, students felt the instructors were not well coordinated.  Multiple students faulted the course in general as being “unengaging” and a test of “brute memorization.”\r\n\t\r\nThis course has no prerequisites and fulfills the Arts & Letters sector requirement. While there seemed to be a fair amount of assigned reading, students commented that the readings seemed disconnected from the lecture material.  The midterm and final were described as “very difficult” and studying for the exams was made more challenging by the lack of posted Blackboard material.  Students agreed that this is an informative introductory course for those with no art history experience but more knowledgeable students may find the class “boring” or “dry.” \r\n", "num_students": 149, "path": "/courses/19774/sections/001/reviews/1982-LARRY-A--SILVER", "instructor": {"path": "/instructors/1982-LARRY-A--SILVER", "first_name": "LARRY A.", "last_name": "SILVER", "id": "1982-LARRY-A--SILVER", "name": "LARRY A. SILVER"}, "num_reviewers": 120, "id": "19774-001-1982-LARRY-A--SILVER"}, {"ratings": {"rAmountLearned": "2.70", "rDifficulty": "2.43", "rStimulateInterest": "1.95", "rRecommendMajor": "3.19", "rCourseQuality": "2.59", "rWorkRequired": "2.24", "rInstructorAccess": "2.18", "rReadingsValue": "2.19", "rRecommendNonMajor": "2.58", "rCommAbility": "2.47", "rInstructorQuality": "2.43"}, "section": {"name": "RISE OF MOD VISUAL MEDIA", "sectionnum": "001", "primary_alias": "ARTH-002-001", "path": "/courses/19774/sections/001", "id": "19774-001", "aliases": ["ARTH-002-001"]}, "comments": "This course follows the emergence of modern media in an increasingly public and democratic sphere of art.  Because the Industrial and French Revolutions resulted in massive social changes, including increased capitalism and democracy, artists had to adjust to new roles, media, and means of support.  This course will introduce students from diverse backgrounds to visual media in culture and society, providing both critical and historical tools for visual literacy in the modern world. \r\n\r\nStudents commented that the course material was “very interesting” and “informative” but often lacked cohesion and felt disorganized.  The course concentrated on individual artists rather than general artistic movements.  Students found the instructor’s handouts to be more beneficial than assigned textbook readings.  \r\n\r\nStudents described Professor Leja as “extremely knowledgeable” but not always the most “dynamic lecturer.”  Students also criticized her for rushing through material at the end of lecture and seeming disorganized when presenting material.  Since the class was team-taught, students felt the instructors were not well coordinated.  Multiple students faulted the class as being “unengaging” and a test of “brute memorization.”\r\n\r\nThis course has no prerequisites and fulfills the Arts & Letters sector requirement. While there seemed to be a fair amount of assigned reading, students commented that the readings seemed disconnected from the lecture material.  The midterm and final were described as “very difficult” and studying for the exams was made more challenging by the lack of posted Blackboard material.  Students agreed that this is an informative introductory course for those with no art history experience but more knowledgeable students may find the class “boring” or “dry.” \r\n", "num_students": 149, "path": "/courses/19774/sections/001/reviews/2857-MICHAEL-LEJA", "instructor": {"path": "/instructors/2857-MICHAEL-LEJA", "first_name": "MICHAEL", "last_name": "LEJA", "id": "2857-MICHAEL-LEJA", "name": "MICHAEL LEJA"}, "num_reviewers": 80, "id": "19774-001-2857-MICHAEL-LEJA"}]}, "credits": null, "primary_alias": "ARTH-002", "path": "/courses/19774", "sections": {"path": "/courses/19774/sections", "values": [{"name": "RISE OF MOD VISUAL MEDIA", "sectionnum": "001", "primary_alias": "ARTH-002-001", "path": "/courses/19774/sections/001", "id": "19774-001", "aliases": ["ARTH-002-001"]}]}, "id": 19774, "aliases": ["ARTH-002"]}