[{"ratings": {"rAmountLearned": "3.76", "rDifficulty": "3.59", "rStimulateInterest": "3.97", "rRecommendMajor": "3.97", "rCourseQuality": "3.76", "rWorkRequired": "3.76", "rInstructorAccess": "3.53", "rReadingsValue": "3.45", "rRecommendNonMajor": "3.26", "rCommAbility": "3.71", "rInstructorQuality": "3.84"}, "section": {"name": "REAL ESTATE DEVELOPMENT", "sectionnum": "401", "primary_alias": "REAL-821-401", "path": "/courses/28094/sections/401", "id": "28094-401", "aliases": ["REAL-821-401", "REAL-321-401", "ARCH-768-401"]}, "comments": "REAL 821 evaluates \"ground-up\" development as well as re-hab, re-development, and acquisition investments. This class examines raw and developed land and the similarities and differences of traditional real estate product types including office, R & D, retail, warehouses, single family and multi-family residential, mixed use, and land as well as \"specialty\" uses like golf courses, assisted living, and fractional share ownership. Emphasis is on concise analysis and decision-making. This class discusses the development process with topics including market analysis, site acquisition, due diligence, zoning, entitlements, approvals, site planning, building design, construction, financing, leasing, and ongoing management and disposition. Special topics like workouts and running a development company are also discussed. Throughout the course, there is a focus on risk management and leadership issues. Numerous guest lecturers who are leaders in the real estate industry participate in the learning process. The format of this course is predominately case analysis and discussion, some lectures, project visits.\r\n\tThe majority of students thoroughly enjoyed the class, with many students stating that it was the best course they had ever taken. A general theme in the student’s comments was that the course was challenging but a very rewarding academic experience. As one student replied, “I am amazed by the quality of the instructor and class materials.” Most students liked the format of case studies and guest speakers, which contrasted many theory-oriented courses.\r\n\tStudents depicted Professor Nakahara as an extraordinary teacher with great teaching experience and knowledge. Professor Nakahara often gave advice to students, wanting to not only teach them but to help them succeed on a personal level. Students described Professor Nakahara as “a practitioner and not an academic” bringing an invaluable real-world perspective into the cases and discussions that kept students fully engaged. A student commented, “Every class was exciting, yet nerve racking.”\r\n\tThe class was directed towards real estate majors but was labeled as a “great course even to non-real estate majors.” However, a few students felt that the workload was a bit too much and the grading scale was difficult. Professor Nakahara was seen to put in considerable preparation time and expected a reciprocal level of commitment. Prerequisites include: REAL/FNCE 721 & REAL/LGST 804.\r\n", "num_students": 52, "path": "/courses/28094/sections/401/reviews/5525-ASUKA-NAKAHARA", "instructor": {"path": "/instructors/5525-ASUKA-NAKAHARA", "first_name": "ASUKA", "last_name": "NAKAHARA", "id": "5525-ASUKA-NAKAHARA", "name": "ASUKA NAKAHARA"}, "num_reviewers": 47, "id": "28094-401-5525-ASUKA-NAKAHARA"}]