{"coursehistories": {"path": "/coursehistories/3039"}, "description": "Korean Wave (Hallyu), a Korean popular culture phenomenon, is currently raging throughout Asia and is making its way to the West(maybe?) From Korean tele-dramas and K-pop music to their respective celebrity icons, these popular cultural forms from Korea are increasingly becoming part of the everyday landscape and vocabulary. We will attempt to understand and evaluate this cultural phenomenon--its promises and limitations as well as its popularity and backlash against it. More specifically, this course explores the ways in which television, music, manhwa (comic books), and the internet participate in the transnational production and circulation of culture, modernity, tradition, ideology, and politics. One of the central topics that the spring 2007 course will consider is the curious ways in which popular culture repeatedly restages (or translates) Korea's past in order to comment on its present. For example, we will study television dramas such as \"The Immortal Yi Sunsin\" (Korea-Japan relations), \"Chumong\" (Reclamation of northeastern China as part of ancient Korea), and \"Goong\" (Imagining Korea as a constitutional monarchy with its royal family). In addition to these primary texts, we will read theoretical and critical writings on mass culture, new media, narratology, and translation. \n\nSome of the specific topics we will consider are: The \"Yonsama\" phenomenon and the marketing of new masculinity; Korean emotions and melodrams; Imitation vs. Innovation in K-pop; Fictions of history i n historical soap operas; Revival of folk culture; Preservation of traditional values in Postmodern times; Repatriation of Korean American pop stars to Korea; and Youth culture. Requires outside viewing and listening. \n\n", "semester": "2007A", "name": "KOREAN POPULAR CULTURE: Contemporary Korean Popular Culture: The Korean Wave (Hallyu)", "reviews": {"path": "/courses/14315/reviews", "values": [{"ratings": {"rAmountLearned": "2.64", "rDifficulty": "2.55", "rStimulateInterest": "2.45", "rRecommendMajor": "2.91", "rCourseQuality": "2.73", "rWorkRequired": "2.73", "rInstructorAccess": "3.36", "rReadingsValue": "2.55", "rRecommendNonMajor": "2.00", "rCommAbility": "3.09", "rInstructorQuality": "2.82"}, "section": {"name": "KOREAN POPULAR CULTURE: Contemporary Korean Popular Culture: The Korean Wave (Hallyu)", "sectionnum": "401", "primary_alias": "EALC-198-401", "path": "/courses/14315/sections/401", "id": "14315-401", "aliases": ["EALC-198-401", "EALC-598-401"]}, "comments": "", "num_students": 14, "path": "/courses/14315/sections/401/reviews/2396-JINA-KIM", "instructor": {"path": "/instructors/2396-JINA-KIM", "first_name": "JINA", "last_name": "KIM", "id": "2396-JINA-KIM", "name": "JINA KIM"}, "num_reviewers": 11, "id": "14315-401-2396-JINA-KIM"}]}, "credits": null, "primary_alias": "EALC-198", "path": "/courses/14315", "sections": {"path": "/courses/14315/sections", "values": [{"name": "KOREAN POPULAR CULTURE: Contemporary Korean Popular Culture: The Korean Wave (Hallyu)", "sectionnum": "401", "primary_alias": "EALC-198-401", "path": "/courses/14315/sections/401", "id": "14315-401", "aliases": ["EALC-198-401", "EALC-598-401"]}]}, "id": 14315, "aliases": ["EALC-198", "EALC-598"]}