{"coursehistories": {"path": "/coursehistories/706"}, "description": "Topics from among the following: logic, sets, calculus, probability, history and philosophy of mathematics, game theory, geometry, and their relevance to contemporary science and society. \n\n", "semester": "2011C", "name": "IDEAS IN MATHEMATICS", "reviews": {"path": "/courses/24691/reviews", "values": [{"ratings": {"rAmountLearned": "2.18", "rDifficulty": "1.37", "rStimulateInterest": "2.03", "rRecommendMajor": "1.87", "rCourseQuality": "2.50", "rWorkRequired": "1.97", "rInstructorAccess": "3.05", "rReadingsValue": "2.38", "rRecommendNonMajor": "3.23", "rCommAbility": "2.80", "rInstructorQuality": "2.81"}, "section": {"name": "IDEAS IN MATHEMATICS", "sectionnum": "001", "primary_alias": "MATH-170-001", "path": "/courses/24691/sections/001", "id": "24691-001", "aliases": ["MATH-170-001"]}, "comments": "Ideas in Mathematics covers topics from among the following: logic, sets, calculus,\r\nprobability, history and philosophy of mathematics, game theory, geometry, and their\r\nrelevance to contemporary science and society.\r\nOverall, students “greatly enjoyed” this course and reported being “pleasantly\r\nsurprised” by it. A few students reported particularly liking the “practical applications”\r\nof the math concepts they were learning. Some students found that the ease of the\r\nmaterial and pace sometimes rendered the class uninteresting. One student noted that\r\nsome of the concepts covered were learned in “7th grade algebra.”\r\nStudents really liked Professor Liu, describing her as “excellent,” “extremely\r\naccessible and always willing to help out.” Several students noted that Professor Liu was\r\nvery cognizant of the fact that many students did not have a strong background in math,\r\nand she taught “at a level students could understood” and was “always available to help\r\nwith any questions.” Professor Liu read off of PowerPoint slides, which could be\r\n“boring” for students who were familiar with the concepts, and a few noted that they did\r\nnot feel the need to attend lecture, as these PowerPoints were posted online. Professor\r\nLiu “clearly communicated the expectations of the course,” and students knew where\r\nthey stood in the class, with respect to grades, at all times. She was also described as\r\n“kind” and as a teacher who really cares about her students and the subject.\r\nThis course satisfies the Natural Science & Mathematics Sector requirement, and it\r\nmay also be counted toward the General Requirement in Natural Science & Mathematics.\r\nStudents described this course as being easy, and one even noted being “amazed that I get\r\ncollege credit for this class.” Students, many of whom were “not mathematically\r\ninclined,” generally took this course to fulfill their sector requirement, and they found it\r\nto be a very enjoyable way to do so. Students received weekly homework assignments\r\nand quizzes, which they noted were “manageable” and “very fairly graded.” Many\r\nopportunities were also given for extra credit.", "num_students": 158, "path": "/courses/24691/sections/001/reviews/5407-ZHE-LIU", "instructor": {"path": "/instructors/5407-ZHE-LIU", "first_name": "ZHE", "last_name": "LIU", "id": "5407-ZHE-LIU", "name": "ZHE LIU"}, "num_reviewers": 137, "id": "24691-001-5407-ZHE-LIU"}, {"ratings": {"rAmountLearned": "2.00", "rDifficulty": "1.97", "rStimulateInterest": "2.00", "rRecommendMajor": "1.57", "rCourseQuality": "1.95", "rWorkRequired": "2.06", "rInstructorAccess": "2.26", "rReadingsValue": "1.85", "rRecommendNonMajor": "2.31", "rCommAbility": "1.86", "rInstructorQuality": "2.10"}, "section": {"name": "IDEAS IN MATHEMATICS", "sectionnum": "601", "primary_alias": "MATH-170-601", "path": "/courses/24691/sections/601", "id": "24691-601", "aliases": ["MATH-170-601"]}, "comments": "This course covers topics from among the following: logic, sets, calculus,\r\nprobability, history and philosophy of mathematics, game theory, geometry, and their\r\nrelevance to contemporary science and society.\r\nThe majority of students had an underwhelming response to this course. They\r\nreported that it was “frustrating and disappointing” because of the lack of focus and\r\ndriving theme. In addition, since there was no syllabus, it was very difficult to keep track\r\nof the assignments for the class.\r\nA large majority of students were displeased with Professor Rimmer’s\r\nperformance in this class. They felt like he did not care at all. Most reported that he\r\noften came “unprepared for class.” Since he didn’t prepare beforehand, Professor\r\nRimmer often made up problems on the spot, which was not efficient since he was unable\r\nto solve them quickly and often had to backtrack. In addition, students complained that\r\nhe did not respond to emails well and was not easy to get a hold of for any additional\r\nquestions.\r\nThis class is recommended for non-majors. It fulfills the natural science and\r\nmathematics sector.", "num_students": 45, "path": "/courses/24691/sections/601/reviews/4008-NAKIA-ANTHONY-RIMMER", "instructor": {"path": "/instructors/4008-NAKIA-ANTHONY-RIMMER", "first_name": "NAKIA ANTHONY", "last_name": "RIMMER", "id": "4008-NAKIA-ANTHONY-RIMMER", "name": "NAKIA ANTHONY RIMMER"}, "num_reviewers": 42, "id": "24691-601-4008-NAKIA-ANTHONY-RIMMER"}]}, "credits": null, "primary_alias": "MATH-170", "path": "/courses/24691", "sections": {"path": "/courses/24691/sections", "values": [{"name": "IDEAS IN MATHEMATICS", "sectionnum": "001", "primary_alias": "MATH-170-001", "path": "/courses/24691/sections/001", "id": "24691-001", "aliases": ["MATH-170-001"]}, {"name": "IDEAS IN MATHEMATICS", "sectionnum": "601", "primary_alias": "MATH-170-601", "path": "/courses/24691/sections/601", "id": "24691-601", "aliases": ["MATH-170-601"]}]}, "id": 24691, "aliases": ["MATH-170"]}