[{"ratings": {"rAmountLearned": "2.49", "rDifficulty": "2.23", "rStimulateInterest": "2.70", "rRecommendMajor": "3.24", "rCourseQuality": "2.57", "rWorkRequired": "2.36", "rInstructorAccess": "2.76", "rReadingsValue": "2.18", "rRecommendNonMajor": "2.50", "rCommAbility": "3.05", "rInstructorQuality": "3.07"}, "section": {"name": "MDRN WRLD-CLTRL BKGND: The Modern World and Its Cultural Background", "sectionnum": "001", "primary_alias": "ANTH-004-001", "path": "/courses/21252/sections/001", "id": "21252-001", "aliases": ["ANTH-004-001"]}, "comments": "This course is an introduction to the diversity of cultures in the world. The course briefly examines different models of understanding human diversity: ethnicities, religions, languages, political forms, economic structures, cultures, and \"civilizations.\" Students will learn to think about the world as an interconnected whole, and know the significance of culture on a global scale. Students will also acquire a greater appreciation and understanding of cultural differences in the more comprehensive social context. &#8232;&#8232;There were mixed feelings about the class regarding the topics. One student said, \"The course offered a nice wide view of the world that was new and interesting,\" while others claimed, \"the subject was not always interesting\" and \"there was too much information.\" &#8232;&#8232;Student generally enjoyed having Professor Urban. One student said, \"definitely enjoyed the lectures because of Urban's excitement, oratory skill, and mix of pictures, writings, and movie clips.\" Others used words as \"informative\" and \"interactive\" to describe Professor Urban. &#8232;&#8232;This class fulfills Humanities & Social Science Sector and the General Requirement in Society. There are no prerequisites listed for the course. It is open to both freshmen and upperclassmen.", "num_students": 129, "path": "/courses/21252/sections/001/reviews/267-GREGORY-P--URBAN", "instructor": {"path": "/instructors/267-GREGORY-P--URBAN", "first_name": "GREGORY P.", "last_name": "URBAN", "id": "267-GREGORY-P--URBAN", "name": "GREGORY P. URBAN"}, "num_reviewers": 119, "id": "21252-001-267-GREGORY-P--URBAN"}]