[{"ratings": {"rAmountLearned": "2.68", "rDifficulty": "1.88", "rStimulateInterest": "2.82", "rRecommendMajor": "3.58", "rCourseQuality": "2.86", "rWorkRequired": "1.65", "rInstructorAccess": "3.44", "rReadingsValue": "2.49", "rRecommendNonMajor": "2.91", "rCommAbility": "3.38", "rInstructorQuality": "3.28"}, "section": {"name": "MENTAL ILLNESS", "sectionnum": "401", "primary_alias": "SOCI-277-401", "path": "/courses/28157/sections/401", "id": "28157-401", "aliases": ["SOCI-277-401", "HSOC-277-401"]}, "comments": "This course is designed to give a general overview of how sociologists study mental illness. We will be concerned with describing the contributions of sociological research and exploring how these contributions differ from those of psychology, psychiatry, and social work. Throughout the course, students will be concerned with uncovering the assumptions behind different definitions of mental health and exploring their political, social, and legal implications.\r\n\tStudents were positive about the course as a whole, with multiple students noting how “enjoyable” they found it. The exams were described as “fair” and the review sessions were “extremely helpful.” Students were interested by the material, and noted that they “acquired valueable information.” One student was unpleased by the large class size, which he felt made the class a “lecture and exam based course.” The workload was described as “more than manageable.”\r\n\tProfessor Schnittker was universally praised by his students, many of whom enjoyed his accessibility and his willingness to “help students with whatever they need.” One student thought Professor Schnittker was the “best professor” at Penn. He was also praised for his ability to keep lectures interesting.\r\n\tThis course was recommended to “anyone interested in mental illness” and Professor Schnittker received rave reviews. The workload was thought to be manageable and perhaps a tad bit easy, and students were unanimous in enjoying the course.", "num_students": 99, "path": "/courses/28157/sections/401/reviews/1105-JASON-SCHNITTKER", "instructor": {"path": "/instructors/1105-JASON-SCHNITTKER", "first_name": "JASON", "last_name": "SCHNITTKER", "id": "1105-JASON-SCHNITTKER", "name": "JASON SCHNITTKER"}, "num_reviewers": 95, "id": "28157-401-1105-JASON-SCHNITTKER"}]