{"coursehistories": {"path": "/coursehistories/882"}, "description": "The aim of this course is to explore the relationships between philosophy and physics, with a focus on selected issues in modern physics. The course is organized around four main areas. In the first part, we focus on the philosophy and (classical and relativistic) structure of space and time, including the proliferation of physical geometries (Lobachevskian and Riemannian) of curved and \"gunky\" spacetime. Is space-time real? If so, what kind of thing is it? Metaphysically, we have a choice between presentism and eternalism, and regarding the nature of physical objects in spactime there is a choice between endurantism and perdurantism. Is time travel possible? In the second part, we concentrate on the basic metaphysical and epistemological questions posed by physics: causality, determinism, randomness, and the nature of physical laws. How is cause conveyed from one physical body to another? Are the laws of physics true? In the third part, we turn to the principal philosophical issues raised by quantum physics: structural realism and the interpretations of quantum mechanics, non-locality and Bell's theorem, the infamous Schrodinger cat paradox, hidden variables, and quantum measurement. What is primary--particles or waves? Finally, in the fourth part, we investigate the metaphysics underlying Big Bang cosmology, and evidence for a \n\nmultiverse and baby universes. All these philosophical issues will be addressed by looking at some simple examples or episodes taken from modern physics. The bulk of the readings will come from two textbooks (available at the Barnes & Noble University bookstore) and articles in journals. PREREQUISITES: The course is entirely self-contained: all topics in physics that are necessary for understanding the pertinent philosophical problems will be reviewed in class. \n\n", "semester": "2013A", "name": "PHIL OF SCIENCE: PHILOSOPHY OF PHYSICS", "reviews": {"path": "/courses/30858/reviews", "values": [{"ratings": {"rDifficulty": "2.47", "rStimulateInterest": "3.67", "rCourseQuality": "3.40", "rWorkRequired": "1.40", "rInstructorQuality": "3.47", "rCommAbility": "3.40", "rInstructorAccess": "3.33"}, "section": {"name": "PHIL OF SCIENCE: PHILOSOPHY OF PHYSICS", "sectionnum": "401", "primary_alias": "PHIL-425-401", "path": "/courses/30858/sections/401", "id": "30858-401", "aliases": ["PHIL-425-401", "STSC-325-401"]}, "comments": "", "num_students": 20, "path": "/courses/30858/sections/401/reviews/954-ZOLTAN-DOMOTOR", "instructor": {"path": "/instructors/954-ZOLTAN-DOMOTOR", "first_name": "ZOLTAN", "last_name": "DOMOTOR", "id": "954-ZOLTAN-DOMOTOR", "name": "ZOLTAN DOMOTOR"}, "num_reviewers": 15, "id": "30858-401-954-ZOLTAN-DOMOTOR"}]}, "credits": null, "primary_alias": "PHIL-425", "path": "/courses/30858", "sections": {"path": "/courses/30858/sections", "values": [{"name": "PHIL OF SCIENCE: PHILOSOPHY OF PHYSICS", "sectionnum": "401", "primary_alias": "PHIL-425-401", "path": "/courses/30858/sections/401", "id": "30858-401", "aliases": ["PHIL-425-401", "STSC-325-401"]}]}, "id": 30858, "aliases": ["PHIL-425", "STSC-325"]}