{"coursehistories": {"path": "/coursehistories/1131"}, "description": "This course offers an introduction to, and an overview of, many of the key issues confronting urban public schools in America. Conversations about schooling, and urban schooling in particular, are currently at the forefront of public discussions about how to improve the economy and the nation as a whole. In this course we will examine the historical, social, and cultural contexts of urban education and schooling in society. Beginning with philosophical and theoretical perspectives on why we educate, this course will also explore the ways in which schools are implicated in a range of social issues and we will interrogate the role of education in relation to social mobility, life changes, and civic opportunity. This course will also critically examine recent policies and reform efforts which have been designed to remedy the urban public school \"crisis.\" In addition to readings and class discussions, popular media (e.g. news reports, and films and documentaries on urban schools) will also be used to provide students with an opportunity to explore these larger course themes and issues, particularly as they relate to public schools in Philadelphia. \n\n", "semester": "2012A", "name": "URBAN EDUCATION", "reviews": {"path": "/courses/28231/reviews", "values": [{"ratings": {"rAmountLearned": "3.06", "rDifficulty": "2.00", "rStimulateInterest": "2.67", "rRecommendMajor": "3.56", "rCourseQuality": "2.85", "rWorkRequired": "2.33", "rInstructorAccess": "3.22", "rReadingsValue": "2.76", "rRecommendNonMajor": "2.94", "rCommAbility": "2.78", "rInstructorQuality": "2.55"}, "section": {"name": "URBAN EDUCATION", "sectionnum": "401", "primary_alias": "URBS-202-401", "path": "/courses/28231/sections/401", "id": "28231-401", "aliases": ["URBS-202-401", "EDUC-202-401"]}, "comments": "This class is an introduction to the problems that are facing urban public schools in America.  The class is focused on urban schooling. Historical, social and cultural contexts of urban education are analyzed as are philosophical and theoretical perspectives about the need for education.  Recent reforms and policies are also investigated. \r\nStudents felt that the material in this class was very engaging and interesting.  However, students also felt that “There was a lot of reading to do that sometimes it was strenuous.” Overall, students felt that the “course content was great” and “discussions were amazing and readings were valuable.” \r\nStudents were very impressed with Professor Batch’s teaching style. Students were satisfied with her choice of readings for the course. Many students’s felt that the teacher and the readings really “opened their eyes.” \r\nThe students who took this class were upperclassman and underclassman who took the class to fulfill sector and major requirements.", "num_students": 21, "path": "/courses/28231/sections/401/reviews/5188-AMY-J-BACH", "instructor": {"path": "/instructors/5188-AMY-J-BACH", "first_name": "AMY J", "last_name": "BACH", "id": "5188-AMY-J-BACH", "name": "AMY J BACH"}, "num_reviewers": 20, "id": "28231-401-5188-AMY-J-BACH"}]}, "credits": null, "primary_alias": "URBS-202", "path": "/courses/28231", "sections": {"path": "/courses/28231/sections", "values": [{"name": "URBAN EDUCATION", "sectionnum": "401", "primary_alias": "URBS-202-401", "path": "/courses/28231/sections/401", "id": "28231-401", "aliases": ["URBS-202-401", "EDUC-202-401"]}]}, "id": 28231, "aliases": ["URBS-202", "EDUC-202"]}