{"coursehistories": {"path": "/coursehistories/4821"}, "description": "This survey course examines the outbreak, conduct, and aftermath of the First World War. The First World War put an end to the world of the 19th century and laid the foundations of the 20th century, the age of destruction and devastation. This course will examine the war in three components: the long-term and immediate causes of the First World War; the war's catastrophic conduct, on the battlefield and on the home front; and the war's devastating aftermath. While we will discuss military operations and certain battles, this course is not a military history of the war; it covers the social, economic, political and diplomatic aspects that contributed to the war's outbreak and made possible its execution over four devastating years. No preliminary knowledge or coursework is required. \n\n", "semester": "2010A", "name": "WORLD WAR I", "reviews": {"path": "/courses/26220/reviews", "values": [{"ratings": {"rAmountLearned": "3.33", "rDifficulty": "3.00", "rStimulateInterest": "3.38", "rRecommendMajor": "3.50", "rCourseQuality": "3.44", "rWorkRequired": "3.31", "rInstructorAccess": "3.44", "rReadingsValue": "3.06", "rRecommendNonMajor": "2.56", "rCommAbility": "3.56", "rInstructorQuality": "3.50"}, "section": {"name": "WORLD WAR I", "sectionnum": "001", "primary_alias": "HIST-425-001", "path": "/courses/26220/sections/001", "id": "26220-001", "aliases": ["HIST-425-001"]}, "comments": "This survey course examines the outbreak, conduct, and aftermath of the First World War. The First World War put an end to the world of the nineteenth century and laid the foundations of the twentieth century, the age of destruction and devastation. The course examines the war in three components: the long-term and immediate causes of the First World War; the war's catastrophic conduct, on the battlefield and on the home front; and, the war's devastating aftermath. While military operations and certain battles are discussed, this course is not a military history of the war; it covers the social, economic, political and diplomatic aspects that contributed to the war's outbreak and made possible its execution over four devastating years. No preliminary knowledge or coursework is required.\r\n\tStudents unanimously liked this “interesting” class. One student wrote, “This course was fantastic. I couldn’t have asked for anything better. It makes me wish I was a history major.” Students also liked the structure of the course which “analyzed the major players [in the war] separately, then the causes, and then much later in the course, the actual war.” Students said this format “made the countries’ actions make sense.”\r\n\tStudents raved about Professor Holquist. They called him “the most engaging lecturer I’ve had at Penn,” “passionate,” and said “his enthusiasm for the subject is infectious.” One student wrote, “Professor Holquist was very accessible and accommodating throughout the semester. He is incredibly knowledgeable and enthusiastic about the subject matter.” Another added that Professor Holquist made sure to “answer each question in a thorough and interesting manner.”\r\nThis course was recommended for both majors and non-majors. A few students mentioned that there was a lot of required reading that could be “dense” but were sure to add that “the readings were relevant to the course.”\r\n", "num_students": 23, "path": "/courses/26220/sections/001/reviews/3325-PETER-HOLQUIST", "instructor": {"path": "/instructors/3325-PETER-HOLQUIST", "first_name": "PETER", "last_name": "HOLQUIST", "id": "3325-PETER-HOLQUIST", "name": "PETER HOLQUIST"}, "num_reviewers": 17, "id": "26220-001-3325-PETER-HOLQUIST"}]}, "credits": null, "primary_alias": "HIST-425", "path": "/courses/26220", "sections": {"path": "/courses/26220/sections", "values": [{"name": "WORLD WAR I", "sectionnum": "001", "primary_alias": "HIST-425-001", "path": "/courses/26220/sections/001", "id": "26220-001", "aliases": ["HIST-425-001"]}]}, "id": 26220, "aliases": ["HIST-425"]}