[{"ratings": {"rAmountLearned": "2.74", "rDifficulty": "2.07", "rStimulateInterest": "2.30", "rRecommendMajor": "3.41", "rCourseQuality": "2.51", "rWorkRequired": "2.48", "rInstructorAccess": "2.57", "rReadingsValue": "2.63", "rRecommendNonMajor": "2.80", "rCommAbility": "2.66", "rInstructorQuality": "2.51"}, "section": {"name": "INTRO TO SOCIOLOGY", "sectionnum": "001", "primary_alias": "SOCI-001-001", "path": "/courses/16450/sections/001", "id": "16450-001", "aliases": ["SOCI-001-001"]}, "comments": "Sociology provides a unique way to look at human behavior and the world. Sociology is the systematic study of the groups and societies in which people live. In this introductory course, you will examine and analyze how social structures and cultures are created, maintained, and most importantly, how they affect behavior. The course deconstructs our taken for granted world of social interactions and behaviors and examines what theory and research can tell about human social behavior.\r\n\r\nStudents agreed that the course covered material that was “eye-opening and thought-provoking” and offered “a fair introduction to thinking like a sociologist.” The majority of students stated that the core readings were “interesting,” but complained about the superfluous readings. One student proclaimed, “there is a LOT of reading...I’d rather spend more time looking through my notes than reading.”\r\n\r\nStudents praised Professor Lareau-Freeman for her knowledge and accessibility. One student declared, “Lareau-Freeman is awesome. Very approachable. She wants everyone to succeed and is very humble.” Another student lauded Professor Lareau-Freeman for her lectures and said, “Professor Lareau-Freeman was a good lecturer” and “lucidly explained all of the concepts of the course.” The same student attributed Professor Lareau-Freeman’s lecturing skill to her “experience as a field sociologist,” which “helped provide context to some of the concepts covered.” However, many students complained of Professor Lareau-Freeman’s “disorganization” and rapidity in lecturing. &#8232;&#8232;\r\n\r\nThis course is recommended to students that wish to have an introduction into the field of Sociology. However, some students disagreed with that recommendation. One student declared that the “class seemed to be structured for children, not college students” and that “assignments were like busywork.” One student said that “I believe that the load of class [work] should be lighter as it may put off some students (especially non-Majors) from taking other sociology classes in the future.” A number of students complained about the Professors’ grading policies. One student stated that, “the grading used for the midterm was very superficial, and minimally regarded content.” Another student complained that Professor Lareau-Freeman did not post the slides online and was frustrated by this, “especially because Professor Lareau-Freeman moved too fast in lecture to write down all of the content on the slides.”", "num_students": 94, "path": "/courses/16450/sections/001/reviews/4561-ANNETTE-LAREAU", "instructor": {"path": "/instructors/4561-ANNETTE-LAREAU", "first_name": "ANNETTE", "last_name": "LAREAU", "id": "4561-ANNETTE-LAREAU", "name": "ANNETTE LAREAU"}, "num_reviewers": 92, "id": "16450-001-4561-ANNETTE-LAREAU"}, {"ratings": {"rAmountLearned": "3.34", "rDifficulty": "2.24", "rStimulateInterest": "3.57", "rRecommendMajor": "3.66", "rCourseQuality": "3.40", "rWorkRequired": "2.43", "rInstructorAccess": "3.59", "rReadingsValue": "3.34", "rRecommendNonMajor": "2.97", "rCommAbility": "3.66", "rInstructorQuality": "3.60"}, "section": {"name": "INTRO TO SOCIOLOGY", "sectionnum": "601", "primary_alias": "SOCI-001-601", "path": "/courses/16450/sections/601", "id": "16450-601", "aliases": ["SOCI-001-601"]}, "comments": "Sociology provides a unique way to look at human behavior and the world. Sociology is the systematic study of the groups and societies in which people live. In this introductory course, we examine and analyze how social structures and cultures are created, maintained, and most importantly, how they affect behavior. The course deconstructs our taken for granted world of social interactions and behaviors and examines what theory and research can tell about human social behavior. &#8232;&#8232;\r\n\r\nStudents raved about Professor Nopper\\'s Intro to Sociology course, calling it \\\"absolutely fabulous\\\" Students stated that the selected readings were \\\"GREAT,\\\" \\\"interesting,\\\" and contributed to the overall flow of the class. A majority of students lauded the dynamic use of both lecture and PowerPoint slides, which provided a more lively atmosphere. &#8232;\r\n\r\n&#8232;Students heaped praise upon Professor Nopper. One student declared that she \\\"clearly conveys all information, provokes stimulating and valuable debates, and at the same time creates a pleasant atmosphere in the classroom\\\". Another student stated that although the course was not taken \\\"only to fulfill a requirement\\\", as the student was not a sociology major, the course still was \\\"was one of the most rewarding courses I have taken at Penn\\\" due to Professor Nopper\\'s extensive \\\"planning and prep\\\". Students praised Professor Nopper for the structure of the course and her receptiveness and accessibility. One student went as far as to say that \\\"her lectures inspired me throughout the semester and motivated me to do better inside and outside of the classroom\\\".\r\n\r\nStudents stated that they would recommend this course to all students, both Sociology majors and non-majors. ", "num_students": 30, "path": "/courses/16450/sections/601/reviews/4248-TAMARA-K--NOPPER", "instructor": {"path": "/instructors/4248-TAMARA-K--NOPPER", "first_name": "TAMARA K.", "last_name": "NOPPER", "id": "4248-TAMARA-K--NOPPER", "name": "TAMARA K. NOPPER"}, "num_reviewers": 30, "id": "16450-601-4248-TAMARA-K--NOPPER"}]