[{"ratings": {"rAmountLearned": "3.38", "rDifficulty": "2.29", "rStimulateInterest": "3.71", "rRecommendMajor": "3.86", "rCourseQuality": "3.59", "rWorkRequired": "2.57", "rInstructorAccess": "3.33", "rReadingsValue": "2.54", "rRecommendNonMajor": "3.38", "rCommAbility": "3.45", "rInstructorQuality": "3.64"}, "section": {"name": "FORMATION & IMPLEMENT: FORMATION & IMPLEMENTATION OF ENTREP VENTURES", "sectionnum": "001", "primary_alias": "MGMT-806-001", "path": "/courses/27775/sections/001", "id": "27775-001", "aliases": ["MGMT-806-001"]}, "comments": "This advanced course in entrepreneurship centers on writing a comprehensive business plan and implementation plan for a venture of the student’s choice. The course examines ways to profitably launch and exploit business opportunities (as opposed to what opportunity to explore). It allows students to acquire the skill set necessary for crafting winning business models for their ventures - developing and writing coherent and effective plans to start a business in either an independent or a corporate setting. The venture must distinguish itself from existing companies through differential innovation; for example, through an innovative product or service, an innovative production process, a new business model, or by creating a new market.\r\nStudents universally praised MGMT 806 and declared that it was “an essential course for those trying to start their own business.”  They “learned a lot” and felt that they were “going to apply the topics covered during the course.”  A few students had suggestions for improving the course, such as having the talks from guest entrepreneurs discuss more specific topics, focusing more on a “polished pitch deck and maybe even a demo product,” and getting “more feedback from VCs,” but overall, even those students with suggestions “emphatically recommend[ed] the course.”\r\nStudents really appreciated the opportunity to work with Professor Fitzgerald, and they all felt he was “a great professor” with a “no-nonsense, to-the-point approach that is exactly what is required of entrepreneurs in the real world.”  One student declared that Professor Fitzgerald is “probably the best resource on campus” for students looking to start a business and another noted that he “made an effort to be as available to students as possible.”\r\nStudents emphasized that the course “really should be taken for people who know they are going to start a business and have a specific business idea to work on.” MGMT 806 is an MBA course that can count towards the Entrepreneurial Management and Management majors.  MGMT 801 is a prerequisite.  \r\n", "num_students": 29, "path": "/courses/27775/sections/001/reviews/5420-PATRICK-FITZGERALD", "instructor": {"path": "/instructors/5420-PATRICK-FITZGERALD", "first_name": "PATRICK", "last_name": "FITZGERALD", "id": "5420-PATRICK-FITZGERALD", "name": "PATRICK FITZGERALD"}, "num_reviewers": 22, "id": "27775-001-5420-PATRICK-FITZGERALD"}]