{"coursehistories": {"path": "/coursehistories/1699"}, "description": "Introduction to the structure and function of the vertebrate nervous system. We begin with the cellular basis of neuronal activities, then discuss the physiological bases of motor control, sensory systems, motivated behaviors, and higher mental processes. This course is intended for students interested in the neurobiology of behavior, ranging from animal behaviors to clinical disorders. \n\n", "semester": "2010A", "name": "INTRO TO BRAIN & BEHAV", "reviews": {"path": "/courses/25675/reviews", "values": [{"ratings": {"rAmountLearned": "3.06", "rDifficulty": "3.04", "rStimulateInterest": "2.68", "rRecommendMajor": "3.72", "rCourseQuality": "2.76", "rWorkRequired": "2.80", "rInstructorAccess": "3.18", "rReadingsValue": "2.83", "rRecommendNonMajor": "2.18", "rCommAbility": "2.74", "rInstructorQuality": "2.84"}, "section": {"name": "INTRO TO BRAIN & BEHAV", "sectionnum": "401", "primary_alias": "BIBB-109-401", "path": "/courses/25675/sections/401", "id": "25675-401", "aliases": ["BIBB-109-401", "PSYC-109-401", "BIOL-109-401"]}, "comments": "BIBB109 introduces students to the structure and function of the vertebrate nervous system. Starting from the cellular level, students move up to study higher levels of the nervous system. The course is intended for those interested in the neurobiology of behavior in humans and other vertebrate animals. Familiarity with introductory physics and chemistry may be helpful. This class fulfills College Sector V: Living World.\r\n\r\nMost students enjoyed the class, which “really interesting.” For some students, this course was the “most inspiring course” they had ever taken. One student called the course an “excellent overview of current topics in neuroscience.” However, a few students said that there was a lot of information to memorize, and that the lectures were often hard to follow.\r\n\r\nStudents described Professor Muzzio as “very intelligent” and “passionate.” Many students appreciated that she was very accessible and took the time to meet with students and answer their questions. Professor Muzzio “was able to stimulate interest” in a wide range of topics. A few students noted that, whether because of the lecture hall’s acoustics, Professor Muzzio could be hard to understand at times.\r\n\r\nPremedical students usually take this course with some College students who are fulfilling the Living World sector requirement. One student noted that the class was competitive, and a few students commented that the exam did not reflect the material learned.\r\n", "num_students": 154, "path": "/courses/25675/sections/401/reviews/4254-ISABEL-MUZZIO", "instructor": {"path": "/instructors/4254-ISABEL-MUZZIO", "first_name": "ISABEL", "last_name": "MUZZIO", "id": "4254-ISABEL-MUZZIO", "name": "ISABEL MUZZIO"}, "num_reviewers": 137, "id": "25675-401-4254-ISABEL-MUZZIO"}]}, "credits": null, "primary_alias": "BIBB-109", "path": "/courses/25675", "sections": {"path": "/courses/25675/sections", "values": [{"name": "INTRO TO BRAIN & BEHAV", "sectionnum": "401", "primary_alias": "BIBB-109-401", "path": "/courses/25675/sections/401", "id": "25675-401", "aliases": ["BIBB-109-401", "PSYC-109-401", "BIOL-109-401"]}]}, "id": 25675, "aliases": ["BIBB-109", "PSYC-109", "BIOL-109"]}