{"coursehistories": {"path": "/coursehistories/3257"}, "description": "This course uses the history of black displacement to examine community power and advocacy. It examines the methods of advocacy (e.g. case, class, and legislative) and political action through which community activists can influence social policy development and community and institutional change. The course also analyzes selected strategies and tactics of change and seeks to develop alternative roles in the group advocacy, lobbying, public education and public relations, electoral politics, coalition building, and legal and ethical dilemmas in political action. Case studies of neighborhood displacement serve as central means of examining course topics. \n\n", "semester": "2012A", "name": "Neighborhood Displacement and Community Power", "reviews": {"path": "/courses/28247/reviews", "values": [{"ratings": {"rAmountLearned": "2.43", "rDifficulty": "1.93", "rStimulateInterest": "2.86", "rRecommendMajor": "2.29", "rCourseQuality": "2.13", "rWorkRequired": "2.29", "rInstructorAccess": "2.86", "rReadingsValue": "1.62", "rRecommendNonMajor": "2.21", "rCommAbility": "2.57", "rInstructorQuality": "2.67"}, "section": {"name": "Neighborhood Displacement and Community Power", "sectionnum": "601", "primary_alias": "URBS-448-601", "path": "/courses/28247/sections/601", "id": "28247-601", "aliases": ["URBS-448-601"]}, "comments": "This course uses the history of black displacement to examine community power and advocacy.  It examines the methods of advocacy (e.g. case, class, and legislative) and political action through which community activists can influence social policy development and community and institutional change. The course also analyzes selected strategies and tactics of change and seeks to develop alternative roles in the group advocacy, lobbying, public education and public relations, electoral politics, coalition building, and legal and ethical dilemmas in political action.  Case studies of neighborhood displacement serve as central means of examining course topics.\r\n\r\nA majority of students seemed to really enjoy this “fascinating” class, but often felt that the class lacked “definition” and was so loosely-structured that they weren’t sure exactly what they were supposed to be learning or doing at times. While some students enjoyed the fact that students generated a lot of the content of the class, most felt that it needed more organization and structure. Overall, though, students felt that this course was very worthwhile.\r\n\r\nProfessor Palmer was described at “truly inspirational” and clearly “passionate and knowledgeable about the subject matter.” He was said to be able to stimulate student interest, but spent too much time covering the material in the book, which could have been read on their own. Students preferred when Professor Palmer led discussions because he had a lot of knowledge about the subject.\r\n\r\nStudents suggested that anyone with an interest in Urban Studies and neighborhood displacement take this course, but express a desire that the course be more structured.", "num_students": 15, "path": "/courses/28247/sections/601/reviews/1218-WALTER-D-PALMER", "instructor": {"path": "/instructors/1218-WALTER-D-PALMER", "first_name": "WALTER D", "last_name": "PALMER", "id": "1218-WALTER-D-PALMER", "name": "WALTER D PALMER"}, "num_reviewers": 15, "id": "28247-601-1218-WALTER-D-PALMER"}]}, "credits": null, "primary_alias": "URBS-448", "path": "/courses/28247", "sections": {"path": "/courses/28247/sections", "values": [{"name": "Neighborhood Displacement and Community Power", "sectionnum": "601", "primary_alias": "URBS-448-601", "path": "/courses/28247/sections/601", "id": "28247-601", "aliases": ["URBS-448-601"]}]}, "id": 28247, "aliases": ["URBS-448"]}