[{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "3.47", "rStimulateInterest": "2.09", "rRecommendMajor": "3.82", "rCourseQuality": "2.69", "rWorkRequired": "3.85", "rInstructorAccess": "2.59", "rReadingsValue": "2.23", "rRecommendNonMajor": "0.74", "rCommAbility": "1.62", "rInstructorQuality": "2.46"}, "section": {"name": "VISUALIZATION", "sectionnum": "001", "primary_alias": "ARCH-201-001", "path": "/courses/22646/sections/001", "id": "22646-001", "aliases": ["ARCH-201-001"]}, "comments": "Introduces technical drawing and explores its thematic possibilities, through both an analysis of antecedents and the production of new works. These complimentary studies serve both to establish an understanding of representation as the foundation to visual communications and to develop the ability for seeing through drawing. This course is not open to students in their first or second freshman terms at Penn. Students must be rising sophomores to advance register for this course.&#8232;&#8232;Students felt this course served as a decent starting point for those who want to pursue architecture. Students learned “a decent amount of architectural concepts,” but were sometimes lost during class.&#8232;&#8232;While students felt that Professor Brandt cared about the subject, they said she had trouble communicating the material. However, she was eager to help and, as one student reported, “she was always willing to drive to campus to meet with students at additional hours during the week to help us out with our projects.”&#8232;&#8232;This course required substantial amount of work, and students recommended having some experience with drawing before taking this class. Students were also unaware that they would have to learn how to operate computer software. As one student wrote, “It was a bit frustrating to have to keep learning how to use new software (photoshop, illustrator, adding printers, scheduling laser cut sessions), and the second half of the course often felt more like a computer science course than an architecture course, but overall the course improved my drawing skills and my ability to see architectural phenomena”. This course is recommended for majors.", "num_students": 37, "path": "/courses/22646/sections/001/reviews/4743-SUZANNE-K-BRANDT", "instructor": {"path": "/instructors/4743-SUZANNE-K-BRANDT", "first_name": "SUZANNE K", "last_name": "BRANDT", "id": "4743-SUZANNE-K-BRANDT", "name": "SUZANNE K BRANDT"}, "num_reviewers": 36, "id": "22646-001-4743-SUZANNE-K-BRANDT"}]