{"coursehistories": {"path": "/coursehistories/2799"}, "description": "The course provides an introduction to electric circuits that form the basis of modern microelectronic systems. After a brief discussion of power dissipation, the course will review passive and active filters. Laplace transforms will be used to analyze circuits and to represent network functions. The second half of the course will focus on moderns solid-state devices and elctronic circuits including diodes, the metal-oxide-semiconductor (MOSFET) translator and hteir applications such as single stage MOS amplifiers. Use of state-of-the-art CAD packages such as SPICE will be introduced. The associated lab, ESE 206, is required for EE majors. \n\n", "semester": "2011A", "name": "ELEC CIRCUITS & SYS II", "reviews": {"path": "/courses/21649/reviews", "values": [{"ratings": {"rAmountLearned": "2.93", "rDifficulty": "3.48", "rStimulateInterest": "2.22", "rRecommendMajor": "3.37", "rCourseQuality": "2.50", "rWorkRequired": "3.22", "rInstructorAccess": "3.37", "rReadingsValue": "2.31", "rRecommendNonMajor": "1.00", "rCommAbility": "2.54", "rInstructorQuality": "2.83"}, "section": {"name": "ELEC CIRCUITS & SYS II", "sectionnum": "001", "primary_alias": "ESE-216-001", "path": "/courses/21649/sections/001", "id": "21649-001", "aliases": ["ESE-216-001"]}, "comments": "This course provides an introduction to electric circuits that form the basis of modern microelectronic systems. After a brief discussion of power dissipation, the course will review passive and active filters. Laplace transforms will be used to analyze circuits and to represent network functions. The second half of the course will focus on modern solid-state devices and electronic circuits including diodes, the metal-oxide-semiconductor (MOSFET) translator and their applications such as single stage MOS amplifiers. Use of state-of-the-art CAD packages such as SPICE will be introduced. &#8232;&#8232;Most students found the course material to be “well organized,” while others felt that there was “too much to be covered.” &#8232;&#8232;Professor van der Spiegel was considered to be “very knowledgeable and loves what he’s teaching,” but some students commented that his lectures were “unclear” at times. Many agreed that he “sincerely cared about his students’ learning.” Some students said that the professor “goes over too much information too [quickly],” and as a result, found it hard to grasp all of the material.&#8232;&#8232;Overall, students said that the course contained a “lot of material.” Students said that they “benefited from quizzes,” but that the overall workload was quite heavy. This course is suggested for majors only.", "num_students": 37, "path": "/courses/21649/sections/001/reviews/350-JAN-DER-SPIEGEL", "instructor": {"path": "/instructors/350-JAN-DER-SPIEGEL", "first_name": "JAN", "last_name": "DER SPIEGEL", "id": "350-JAN-DER-SPIEGEL", "name": "JAN DER SPIEGEL"}, "num_reviewers": 31, "id": "21649-001-350-JAN-DER-SPIEGEL"}]}, "credits": null, "primary_alias": "ESE-216", "path": "/courses/21649", "sections": {"path": "/courses/21649/sections", "values": [{"name": "ELEC CIRCUITS & SYS II", "sectionnum": "001", "primary_alias": "ESE-216-001", "path": "/courses/21649/sections/001", "id": "21649-001", "aliases": ["ESE-216-001"]}]}, "id": 21649, "aliases": ["ESE-216"]}