[{"ratings": {"rAmountLearned": "3.43", "rDifficulty": "2.50", "rStimulateInterest": "3.61", "rRecommendMajor": "3.61", "rCourseQuality": "3.48", "rWorkRequired": "2.79", "rInstructorAccess": "3.71", "rReadingsValue": "2.93", "rRecommendNonMajor": "3.36", "rCommAbility": "3.68", "rInstructorQuality": "3.75"}, "section": {"name": "HUMAN RIGHTS", "sectionnum": "001", "primary_alias": "PSCI-258-001", "path": "/courses/25016/sections/001", "id": "25016-001", "aliases": ["PSCI-258-001"]}, "comments": "*Political Science 258 focuses on human rights in global, political, and developmental contexts, especially since 1945. Human rights are part of a wide range of academic disciplines, engineering, history, law, philosophy, and religion being among the obvious. These disciplinary perspectives will be touched upon; politics will be the central one. Some of the main topics include justifications; cross-cultural perspectives; global and international institutional developments and foreign policy. Selected topics will include war, hunger, life, reproduction, servitude, consent, information and the environment.\r\n\r\nA vast majority of students really loved this “straightforward” and “thought-provoking” class, even if they had no previously experience or interest in global human rights issues. Even though there is a lot of reading for this course, students felt everything was fresh, as the class used lecture, discussion, video clips, and films to help supplement the material. Overall, students believed this course was not very challenging, yet very enjoyable.\r\n\r\nProfessor Doherty-Sil received unanimously positive reviews from students, being described as “passionate, engaging, friendly, funny, and dedicated.” Furthermore, students believed she was extremely approachable and willing to help if necessary. This “inspiring” professor expects a lot from her students, but students are “happy to do the work” because they believe she “works as hard as her students.”\r\n\r\nThis course was described as “relatively basic, but fun” and students would recommend it to anyone interested in human rights.\r\n\r\n*This review was based on 8 student reviews. \r\n", "num_students": 33, "path": "/courses/25016/sections/001/reviews/3336-EILEEN-M--DOHERTY-SIL", "instructor": {"path": "/instructors/3336-EILEEN-M--DOHERTY-SIL", "first_name": "EILEEN M.", "last_name": "DOHERTY-SIL", "id": "3336-EILEEN-M--DOHERTY-SIL", "name": "EILEEN M. DOHERTY-SIL"}, "num_reviewers": 30, "id": "25016-001-3336-EILEEN-M--DOHERTY-SIL"}]