[{"ratings": {"rAmountLearned": "2.78", "rDifficulty": "2.55", "rStimulateInterest": "1.62", "rRecommendMajor": "3.11", "rCourseQuality": "2.26", "rWorkRequired": "2.27", "rInstructorAccess": "2.14", "rReadingsValue": "2.67", "rRecommendNonMajor": "2.06", "rCommAbility": "1.88", "rInstructorQuality": "1.94"}, "section": {"name": "INTERNATIONAL POL ECON", "sectionnum": "001", "primary_alias": "PSCI-152-001", "path": "/courses/28041/sections/001", "id": "28041-001", "aliases": ["PSCI-152-001"]}, "comments": "This course examines the politics of international economic relations. The course will analyze the interplay between politics and economics in three broad areas: international trade, international finance, and economic development. In each section, we will first discuss economic theories that explain the causes and consequences of international commerce, capital flows, and economic growth. We will then explore how political interests, institutions, and ideas alter these predictions, examining both historical examples and current policy debates.\r\n\tStudents felt that the powerpoint slides and the textbook made the material “very clear,” and also felt that the course material was interesting unto itself. However, some students felt that the exams were too focused on “minutia from the assigned readings” and did not accurately test knowledge of the course material. The course was overall described as “interesting but a little boring,” a sentiment that many students seemed to share.  Another student noted that only “1/3 of the class attends lecture.”\r\n\tProfessor Gray was criticized as a below-average professor: students felt that she “makes the material less interesting than it actually is.” Other students noted that Professor Gray seemed to “care more about her research than her students,” and some faulted her for not being flexible enough when it came to student requests.\r\n \tStudents were interested by the course material, but not thrilled with Professor Gray. The exams were described as somewhat difficult, but otherwise the workload was not commented upon.", "num_students": 97, "path": "/courses/28041/sections/001/reviews/5862-JULIA-GRAY", "instructor": {"path": "/instructors/5862-JULIA-GRAY", "first_name": "JULIA", "last_name": "GRAY", "id": "5862-JULIA-GRAY", "name": "JULIA GRAY"}, "num_reviewers": 88, "id": "28041-001-5862-JULIA-GRAY"}]