[{"ratings": {"rAmountLearned": "2.13", "rDifficulty": "2.39", "rStimulateInterest": "1.52", "rRecommendMajor": "2.65", "rCourseQuality": "2.00", "rWorkRequired": "2.48", "rInstructorAccess": "2.55", "rReadingsValue": "2.00", "rRecommendNonMajor": "1.74", "rCommAbility": "2.00", "rInstructorQuality": "2.23"}, "section": {"name": "HUMAN RIGHTS", "sectionnum": "001", "primary_alias": "PSCI-258-001", "path": "/courses/23676/sections/001", "id": "23676-001", "aliases": ["PSCI-258-001"]}, "comments": "The focus is human rights in global, political, and developmental contexts, especially since 1945. Human rights are part of a wide range of academic disciplines, engineering, history, law, philosophy, and religion being among the obvious. These disciplinary perspectives will be touched upon; politics will be the central one. Some of the main topics include justifications; cross- cultural perspectives; global and international institutional developments and foreign policy. Selected topics will include war, hunger, life, reproduction, servitude, consent, information and the environment. \r\n\r\nIn this course students learned a lot about human rights from the abundant amount of reading and the research project. One student reported that he was “glad [he] took the class.” However, many students would have liked to have greater discussion and focus.\r\n\r\nStudents appreciated that Professor Teune had “very interesting and intelligent things to say about human rights.” However, several students felt the lectures could use a bit more organization.\r\n\r\nThe course has a hefty amount of reading, a research project, group presentations, and a midterm. Students found it challenging to have group presentations and a midterm in the same week.\r\n", "num_students": 29, "path": "/courses/23676/sections/001/reviews/989-HENRY-J-TEUNE", "instructor": {"path": "/instructors/989-HENRY-J-TEUNE", "first_name": "HENRY J", "last_name": "TEUNE", "id": "989-HENRY-J-TEUNE", "name": "HENRY J TEUNE"}, "num_reviewers": 27, "id": "23676-001-989-HENRY-J-TEUNE"}]