[{"ratings": {"rAmountLearned": "1.88", "rDifficulty": "2.31", "rStimulateInterest": "1.63", "rRecommendMajor": "2.38", "rCourseQuality": "2.05", "rWorkRequired": "2.31", "rInstructorAccess": "2.43", "rReadingsValue": "2.63", "rRecommendNonMajor": "1.38", "rCommAbility": "1.56", "rInstructorQuality": "2.27"}, "section": {"name": "URBAN POLITICS IN THE US", "sectionnum": "401", "primary_alias": "PSCI-136-401", "path": "/courses/22319/sections/401", "id": "22319-401", "aliases": ["PSCI-136-401", "URBS-136-401", "AFRC-136-401"]}, "comments": "This course is concerned with the political character of contemporary urban American life. During the semester students will be familiar with the structural and ideological factors that constrain the policy context and define the urban environment as a terrain for commingling, competition and conflict over uses of space. The goal of this course is to throw into relief the complex and sometimes subtle processes that have shaped and continue to shape urban life in the United States. &#8232;&#8232;Many of the students enjoyed this course with a majority stating that, “required readings were extremely interesting.” The only complaint of the class was that, “…very little seemed to ever get accomplished in class.” Those that recommended the course wrote comments such as: “…exploration of a topic most would not ever consider studying.”&#8232;&#8232;Most students that reviewed the course reviewed Professor Read as preforming well as a professor. The majority of complaints commented that the professor was, “…not able to effectively communicate the subject matter.” Students did say that professor Read was willing to meet with students.&#8232;&#8232;This course is not listed as fulfilling any major college requirements. In addition, there are no prerequisites listed. Grading for the course is broken up into class participation, two take home exams, a midterm, and a final. The course is open to both freshmen and upperclassmen.", "num_students": 28, "path": "/courses/22319/sections/401/reviews/3156-ADOLPH-L--REED", "instructor": {"path": "/instructors/3156-ADOLPH-L--REED", "first_name": "ADOLPH L.", "last_name": "REED", "id": "3156-ADOLPH-L--REED", "name": "ADOLPH L. REED"}, "num_reviewers": 23, "id": "22319-401-3156-ADOLPH-L--REED"}]