[{"ratings": {"rAmountLearned": "2.48", "rDifficulty": "2.07", "rStimulateInterest": "2.30", "rRecommendMajor": "3.29", "rCourseQuality": "2.67", "rWorkRequired": "2.31", "rInstructorAccess": "3.02", "rReadingsValue": "2.30", "rRecommendNonMajor": "2.73", "rCommAbility": "3.00", "rInstructorQuality": "2.87"}, "section": {"name": "INTRO TO ASIAN AMER HIST", "sectionnum": "401", "primary_alias": "HIST-155-401", "path": "/courses/27565/sections/401", "id": "27565-401", "aliases": ["HIST-155-401", "ASAM-003-401"]}, "comments": "This course provided an introduction to the history of Asian Pacific Americans, focusing on the wide diversity of migrant experiences, as well as the continuing legacies of Orientalism on American-born APA's. Issues of race, class, gender, and sexuality were also examined.\r\n\r\nStudents enjoyed this course; several class members called the course \" quite interesting.\" One student noted that there was \"a lot to cover\" in the course, but acknowledged that it was an introductory class and therefore the breadth of material \"was anticipated.\" One student found that the “classes were a little bit too disengaged\" and \"would have preferred a seminar style class\" due to the professor's reputation.\r\n\r\nStudents positively reviewed Professor Azuma, calling him \"amazing,\" the \"nicest man, \" and \"dedicated.\" Professor Azuma was described as \"extremely willing to help\" and \"willing to talk over the essay assignments.\" Other students noted his “vast knowledge on the subject matter.\"\r\n\r\nOne student described the workload of the class as \"manageable” and tests as “very fair.\" Another student explained that there was \"not too much work required\" for the class, but students needed to \"keep up with the readings\" in order “to do well on the midterm and final.\"", "num_students": 59, "path": "/courses/27565/sections/401/reviews/627-EIICHIRO-AZUMA", "instructor": {"path": "/instructors/627-EIICHIRO-AZUMA", "first_name": "EIICHIRO", "last_name": "AZUMA", "id": "627-EIICHIRO-AZUMA", "name": "EIICHIRO AZUMA"}, "num_reviewers": 54, "id": "27565-401-627-EIICHIRO-AZUMA"}]