[{"ratings": {"rAmountLearned": "3.14", "rDifficulty": "2.73", "rStimulateInterest": "3.09", "rRecommendMajor": "3.36", "rCourseQuality": "3.12", "rWorkRequired": "2.64", "rInstructorAccess": "3.14", "rReadingsValue": "2.95", "rRecommendNonMajor": "2.82", "rCommAbility": "3.14", "rInstructorQuality": "3.24"}, "section": {"name": "MARKETS,MORALITY&CAPITAL", "sectionnum": "001", "primary_alias": "LGST-226-001", "path": "/courses/24648/sections/001", "id": "24648-001", "aliases": ["LGST-226-001"]}, "comments": "Legal Studies 226 analyzes the market system and its relations with the common good, idea of equal value, freedom, democracy and globalized world through perspective of various social values by studying works of several important philosophers, economists and political theorists including Adam Smith, John Rawls, Amartya Sen, Friedrich Hayek, Karl Marx, Robert Nozick, Ronald Dworkin, J?rgen Habermas, Peter Singer, and others. \r\n\r\nOverall, students considered this class to be thought provoking, as it offers a “comprehensive overview of political philosophy.” The class readings were said to be interesting, as they made students “think about a wide range of different interactions between the market, policy, and the world.”\r\n\r\nMost students regarded Professor Hussain as very knowledgeable on the class topics, as he is “well-prepared and well-organized” and “passionate about his subject.” However, some of the students complained that Professor Hussain was too “judgmental” and “one-sided” when he guided the class discussion. One student wrote that “the course seemed like a study of Professor Hussain’s perspectives, rather than a rational, objective, and critical analysis of course material.” \r\n\r\nIn general, many of the students commented that this course was interesting and extraordinary. Some found that there was too much reading, some of which were not particularly helpful to the in-class discussion. Students did not get their “first grade in the course until after Add/Drop,” and Professor Hussain was a hard grader. \r\n", "num_students": 27, "path": "/courses/24648/sections/001/reviews/2538-WAHEED-HUSSAIN", "instructor": {"path": "/instructors/2538-WAHEED-HUSSAIN", "first_name": "WAHEED", "last_name": "HUSSAIN", "id": "2538-WAHEED-HUSSAIN", "name": "WAHEED HUSSAIN"}, "num_reviewers": 25, "id": "24648-001-2538-WAHEED-HUSSAIN"}]