{"coursehistories": {"path": "/coursehistories/4307"}, "description": "This course examines various business disciplines as they apply to the sports industry. The course provides the student with an overview of the business of the intercollegiate, Olympic and professional sports enterprises. In addition, the course investigates the business related issues encountered by managers of sports organizations and covers how business principles can be applied to effectively address these issues. This course is crosslisted with MGMT815. \n\n", "semester": "2012A", "name": "SPORTS BUSINESS MGMT", "reviews": {"path": "/courses/27673/reviews", "values": [{"ratings": {"rAmountLearned": "2.56", "rDifficulty": "1.86", "rStimulateInterest": "3.03", "rRecommendMajor": "2.89", "rCourseQuality": "2.69", "rWorkRequired": "1.94", "rInstructorAccess": "2.91", "rReadingsValue": "2.06", "rRecommendNonMajor": "2.83", "rCommAbility": "3.25", "rInstructorQuality": "2.94"}, "section": {"name": "SPORTS BUSINESS MGMT", "sectionnum": "401", "primary_alias": "LGST-809-401", "path": "/courses/27673/sections/401", "id": "27673-401", "aliases": ["LGST-809-401", "MGMT-815-401"]}, "comments": "LGST809 is concerned with how and why people behave as consumers. Its goals are to: (1) provide conceptual understanding of consumer behavior, (2) provide experience in the application of buyer behavior concepts to marketing management decisions and social policy decision-making; and (3) to develop analytical capability in using behavioral research.\r\n\r\n\tMost students agreed that this was a “great all around course.” One student thought it was a great “inside look at how economics work behind the scenes” while another noted that the course was “well informed from an insider’s perspective. ”Students thought the class was “dynamic and entertaining,” although one student noted that the slides were “too dense.”\r\n\t\r\n\tThe majority of students thought that Professor Rosner was a great teacher because he “has an amazing knowledge of the sports world” and “knows everything, and a little bit more, about the matter.” Other students thought he was hilarious. Another student noticed that Professor Rosner “facilitates discussion and conversations well, but doesn’t do it enough.”\r\n\t\r\nIn this course, students commented that “sports knowledge is required to do well” and that while there is “wasn’t much work from day-to-day, the final project and exams were pretty hard.” One student said, “I had to work my tail off to prep for the negotiation and exams” while another noted that it was “hard to figure out exactly how each league worked and determine how they really compare.” LGST 809 course is for MBA students only. \r\n", "num_students": 62, "path": "/courses/27673/sections/401/reviews/713-SCOTT-R--ROSNER", "instructor": {"path": "/instructors/713-SCOTT-R--ROSNER", "first_name": "SCOTT R.", "last_name": "ROSNER", "id": "713-SCOTT-R--ROSNER", "name": "SCOTT R. ROSNER"}, "num_reviewers": 55, "id": "27673-401-713-SCOTT-R--ROSNER"}]}, "credits": null, "primary_alias": "LGST-809", "path": "/courses/27673", "sections": {"path": "/courses/27673/sections", "values": [{"name": "SPORTS BUSINESS MGMT", "sectionnum": "401", "primary_alias": "LGST-809-401", "path": "/courses/27673/sections/401", "id": "27673-401", "aliases": ["LGST-809-401", "MGMT-815-401"]}]}, "id": 27673, "aliases": ["LGST-809", "MGMT-815"]}