[{"ratings": {"rAmountLearned": "3.15", "rDifficulty": "3.43", "rStimulateInterest": "3.29", "rRecommendMajor": "3.27", "rCourseQuality": "3.14", "rWorkRequired": "3.29", "rInstructorAccess": "3.28", "rReadingsValue": "3.17", "rRecommendNonMajor": "1.83", "rCommAbility": "3.24", "rInstructorQuality": "3.36"}, "section": {"name": "CONTEMPORARY POL THOUGHT", "sectionnum": "001", "primary_alias": "PSCI-182-001", "path": "/courses/16352/sections/001", "id": "16352-001", "aliases": ["PSCI-182-001"]}, "comments": "Students agreed that the course was \\\"challenging,\\\" but \\\"intellectually stimulating\\\" and \\\"satisfying\\\". A number of students stated that \\\"all texts required for the course [were] engaging\\\" and \\\"sometimes difficult to interpret,\\\" but with Professor Green\\'s assistance each student was able to formulate a concrete and educated understanding and reaction to the readings. &#8232;\r\n\r\nStudents praised Professor Green for his hard work and dedication to his students. As one student said, \\\"He seems to love to teach and he CARES that we learn. That distinguishes him above most of my professors.\\\" All students said that Professor Green was characterized as \\\"knowledgeable, articulate, and engaging\\\" in addition to being accessible and willing to help with any confusion or question. Another student emphasized Professor Green\\'s willingness to \\\"often ask the class for its opinion and treat the students as peers, which is extremely refreshing.\\\"\r\n\r\nSome students complained about the difficulty and complexity of the paper topics as \\\"some of the concepts were so abstract,\\\" but concluded that Professor Green helped to make sense of them with excellent \\\"feedback.\\\" However, most students said that they would not recommend this course to a non-major or as a first for aspiring political scientists, stating \\\"this is the first political science course I have ever taken, and I feel that the level is more designed for an intermediate political science student than a beginner.\\\"", "num_students": 47, "path": "/courses/16352/sections/001/reviews/4538-JEFFREY-E--GREEN", "instructor": {"path": "/instructors/4538-JEFFREY-E--GREEN", "first_name": "JEFFREY E.", "last_name": "GREEN", "id": "4538-JEFFREY-E--GREEN", "name": "JEFFREY E. GREEN"}, "num_reviewers": 45, "id": "16352-001-4538-JEFFREY-E--GREEN"}]