[{"ratings": {"rAmountLearned": "3.56", "rDifficulty": "3.58", "rStimulateInterest": "3.56", "rRecommendMajor": "3.50", "rCourseQuality": "3.44", "rWorkRequired": "3.41", "rInstructorAccess": "3.94", "rReadingsValue": "2.81", "rRecommendNonMajor": "1.97", "rCommAbility": "3.72", "rInstructorQuality": "3.61"}, "section": {"name": "COGNITIVE NEUROSCIENCE", "sectionnum": "001", "primary_alias": "PSYC-149-001", "path": "/courses/26688/sections/001", "id": "26688-001", "aliases": ["PSYC-149-001"]}, "comments": "The course studies the neural systems that underlie human perception, memory, and language, and of the pathological syndromes that result from damage to these systems.\r\nIn general, students found that they learned a lot in this course and described the content as very interesting and well-structured. Many noted, however, that the course moved very quickly and covered a lot of material in a short period of time, which at times made it “stressful.”\r\nStudents heaped praise upon Professor Thompson-Schill and described her as an excellent lecturer, with a complete mastery of the material. One student noted that “The amount of time and effort she puts into this course is staggering, and it shows - the course is excellent. Some professors put on a show the first day of class and make it seem fantastic, but then it becomes more mundane. In this class, every day was like another first day.” Students also noted that Professor Thompson-Schill was very eager to help students outside of class. Some, however, felt that she was unduly hard on struggling students.\r\n\r\nMost students in the course found it extremely challenging. Some noted that they would recommend it to strong science students because of the pressure put on those who struggle in the course. Students described the workload as very demanding. ", "num_students": 40, "path": "/courses/26688/sections/001/reviews/1944-SHARON-L--THOMPSON-SCHILL", "instructor": {"path": "/instructors/1944-SHARON-L--THOMPSON-SCHILL", "first_name": "SHARON L.", "last_name": "THOMPSON-SCHILL", "id": "1944-SHARON-L--THOMPSON-SCHILL", "name": "SHARON L. THOMPSON-SCHILL"}, "num_reviewers": 34, "id": "26688-001-1944-SHARON-L--THOMPSON-SCHILL"}]