[{"ratings": {"rAmountLearned": "2.52", "rDifficulty": "3.35", "rStimulateInterest": "1.82", "rRecommendMajor": "3.42", "rCourseQuality": "2.23", "rWorkRequired": "3.19", "rInstructorAccess": "2.00", "rReadingsValue": "2.03", "rRecommendNonMajor": "1.43", "rCommAbility": "1.85", "rInstructorQuality": "1.88"}, "section": {"name": "INTRO BIOLOGY B", "sectionnum": "001", "primary_alias": "BIOL-102-001", "path": "/courses/15403/sections/001", "id": "15403-001", "aliases": ["BIOL-102-001"]}, "comments": "This course is the companion course to BIOL101, which may be taken before or after BIOL102. A parallel set of courses is recommended for Biology majors and pre-med students, as BIOL101/102 spends less time on molecular biology. The focus of this course is on animal biology, with emphases on physiology, evolution, and ecology. This course consists of both a lecture and a lab. The class uses Campbell and Reece’s “Biology” and “The Photographic Atlas for the Biology Laboratory”, and consists of three midterms and a final. Labs also require a manual and a dissecting kit.\r\n\r\nAlthough many students felt that the course was too fast-paced, most stated that they “learned a lot.” Students noted that although the second part of the class was easier than the first, the material covered during this part (evolution and ecology) was not on the MCAT, and thus could have been compressed into a smaller portion of the course. Although the class is intended for non-majors, most students in the class took it in major, and they agreed that the speed and depth of the course would be “overwhelming” for non-majors.\r\n\r\nStudents had a range of comments about Professor Schmidt. Many felt that his lectures and slides were disorganized, so that it was hard to tell from lectures what material was important. They also noted that Prof. Schmidt would “flood [students] with information,” and test only a little. Many students wished that Prof. Schmidt would have provided more explanations in place of mere examples. Most agreed that Prof. Schmidt is “brilliant” and “passionate” about the material, but thought that he had “trouble bringing it down to [a student] level.”&#8232;&#8232;\r\n\r\nStudents felt that they were not given enough time to complete exams, and that doing well relied more on “rote memorization” and speed than on comprehension of material. Several students noted that the exam questions in the first half of the course were poorly worded and confusing. Exams were also difficult to study for because of the level of detail in the slides and in the textbook. With the amount of information tested, one student stated that the course was “hard if you didn’t take AP” in high school.", "num_students": 250, "path": "/courses/15403/sections/001/reviews/191-PAUL-STUTZ-SCHMIDT", "instructor": {"path": "/instructors/191-PAUL-STUTZ-SCHMIDT", "first_name": "PAUL STUTZ", "last_name": "SCHMIDT", "id": "191-PAUL-STUTZ-SCHMIDT", "name": "PAUL STUTZ SCHMIDT"}, "num_reviewers": 248, "id": "15403-001-191-PAUL-STUTZ-SCHMIDT"}, {"ratings": {"rAmountLearned": "2.52", "rDifficulty": "3.35", "rStimulateInterest": "2.76", "rRecommendMajor": "3.42", "rCourseQuality": "2.23", "rWorkRequired": "3.19", "rInstructorAccess": "2.98", "rReadingsValue": "2.03", "rRecommendNonMajor": "1.43", "rCommAbility": "3.14", "rInstructorQuality": "3.11"}, "section": {"name": "INTRO BIOLOGY B", "sectionnum": "001", "primary_alias": "BIOL-102-001", "path": "/courses/15403/sections/001", "id": "15403-001", "aliases": ["BIOL-102-001"]}, "comments": "This course is the companion course to BIOL101, which may be taken before or after BIOL102. A parallel set of courses is recommended for Biology majors or pre-med students, since BIOL101 and BIOL102 spend less time on molecular biology. Instead, the focus of this course is on animal biology, with emphases on physiology, evolution, and ecology. This course consists of both a lecture and a lab. The class uses the newest edition of Campbell and Reece’s “Biology” and “The Photographic Atlas for the Biology Laboratory,” and consists of three midterms and a final. Labs also require a manual and a dissecting kit.\r\n\r\nAlthough many students felt that the course was too fast-paced, most stated that they “learned a lot.” Students noted that although the second part of the class was easier than the first, the material covered during this part (evolution and ecology) was not on the MCAT, and thus could have been compressed into a smaller portion of the course. Although the class is intended for non-majors, most students in the class took it in major, and they agreed that the speed and depth of the course would be “overwhelming” for non-majors. &#8232;&#8232;\r\n\r\nStudents described Professor Robinson as an “excellent” teacher whose lectures were clear, concise, and organized. They noted that she did a good job of emphasizing important points in lectures and study sessions. A few students mentioned her sense of humor, encouraging future students to “ask her about her barbiturate joke.” Students felt that Prof. Robinson prepared them well for her exams, which were fairly graded. Lecture slides, recordings, and old exams were all made available on the Blackboard site.\r\n\r\nHowever, students felt that they were not given enough time to complete exams, and that doing well relied more on “rote memorization” and speed than on comprehension of material. Several students noted that the exam questions in the first half of the course were poorly worded and confusing. Exams were also difficult to study for because of the level of detail in the slides and in the textbook. With the amount of information tested, one student stated that the course was “hard if you didn’t take AP” in high school.", "num_students": 250, "path": "/courses/15403/sections/001/reviews/1290-LINDA-J--ROBINSON", "instructor": {"path": "/instructors/1290-LINDA-J--ROBINSON", "first_name": "LINDA J.", "last_name": "ROBINSON", "id": "1290-LINDA-J--ROBINSON", "name": "LINDA J. ROBINSON"}, "num_reviewers": 248, "id": "15403-001-1290-LINDA-J--ROBINSON"}, {"ratings": {"rAmountLearned": "3.41", "rDifficulty": "3.17", "rStimulateInterest": "2.83", "rRecommendMajor": "3.40", "rCourseQuality": "2.84", "rWorkRequired": "3.26", "rInstructorAccess": "3.23", "rReadingsValue": "3.17", "rRecommendNonMajor": "2.41", "rCommAbility": "2.43", "rInstructorQuality": "2.98"}, "section": {"name": "INTRO BIOLOGY B", "sectionnum": "601", "primary_alias": "BIOL-102-601", "path": "/courses/15403/sections/601", "id": "15403-601", "aliases": ["BIOL-102-601"]}, "comments": "This is the LPS section of BIOL102, which is the companion course to BIOL101. A parallel set of courses is recommended for Biology majors and pre-med students, as BIOL101/102 spends less time on molecular biology. Instead, the focus of this course is on animal biology, with emphases on physiology, evolution, and ecology. This course consists of both a lecture and a lab. The class uses Campbell and Reece’s “Biology” and “The Photographic Atlas for the Biology Laboratory”, and consists of three midterms and a final. Labs also require a manual and a dissecting kit.\r\n\r\nStudents described this course as enjoyable; one student enthused that it “sparked a sincere interest in biology.” Students nearly unanimously noted that the course was geared towards what “would help [them] most in possible future classes.” Most students took this course as pre-meds preparing for the MCAT and found the extra study material provided by Professor Witmer extremely useful.\r\n\r\nStudents described Professor Witmer as “dedicated,” “phenomenal,” and “incredible”, basing that praise on her willingness to put extra effort into helping students prepare for exams and for the MCAT. Although some students noted a tendency for Prof. Witmer to play favorites, all agreed that she was “courteous” and knowledgeable. One student did comment that Prof. Witmer faced a “measureable language barrier” and could have been more confident during lectures. &#8232;&#8232;\r\n\r\nStudents said that this course had many assignments, but that the problem sets were very useful for review and were “not just busy work.” Some test questions were ambiguous, even “tricky,” but students agreed that the grading of exams was fair. Exams themselves were “dense” but do-able. One student summed up the overall workload as preparation “for the level of academic work expected in medical school.”", "num_students": 56, "path": "/courses/15403/sections/601/reviews/2880-XIAOHONG-ZOU-WITMER", "instructor": {"path": "/instructors/2880-XIAOHONG-ZOU-WITMER", "first_name": "XIAOHONG ZOU", "last_name": "WITMER", "id": "2880-XIAOHONG-ZOU-WITMER", "name": "XIAOHONG ZOU WITMER"}, "num_reviewers": 54, "id": "15403-601-2880-XIAOHONG-ZOU-WITMER"}]