{"coursehistories": {"path": "/coursehistories/4891"}, "description": "This is an advanced undergraduate course on the life and death of stars. The course will cover the structure of stellar interiors, nuclear reactions and the formation of elements, stellar evolution, supernovae, and the physics of white dwarfs, neutron stars, and black holes. We will approach these topics from both theoretical and observational perspectives. \n\n", "semester": "2011A", "name": "LIFE AND DEATH OF STARS", "reviews": {"path": "/courses/21310/reviews", "values": [{"ratings": {"rAmountLearned": "2.83", "rDifficulty": "2.80", "rStimulateInterest": "3.17", "rRecommendMajor": "3.50", "rCourseQuality": "3.33", "rWorkRequired": "2.33", "rInstructorAccess": "3.67", "rReadingsValue": "2.50", "rRecommendNonMajor": "1.83", "rCommAbility": "3.67", "rInstructorQuality": "3.83"}, "section": {"name": "LIFE AND DEATH OF STARS", "sectionnum": "001", "primary_alias": "ASTR-392-001", "path": "/courses/21310/sections/001", "id": "21310-001", "aliases": ["ASTR-392-001"]}, "comments": "ASTR392 is an advanced undergraduate course on the life and death of stars. The course will cover the structure of stellar interiors, nuclear reactions and the formation of elements, stellar evolution, supernovae, and the physics of white dwarfs, neutron stars, and black holes. The class approaches these topics from both theoretical and observational perspectives.\r\n\r\nStudents described this class as “excellent,” with a small class size that made for a “uniquely intimate learning environment.” Although the class is exclusively about astronomy, it does cover a wide range of physics topics, and as one student remarked, “it was nice to see four years of physics classes come together and be utilized in the same subject.”\r\n\r\nReviews for this class were highly complimentary of Professor Sako, describing him as an “outstanding” teacher with a “mastery” over course material. Professor Sako was able to relate difficult concepts in a “lucid manner,” and he never hesitated to answer questions or help students.\r\n\r\nThe homework assignments were described as “fair,” and the readings as helpful. However, several students complained about the textbook, which was “extremely difficult to digest” and went over students’ heads. One student felt that this class would be interesting and enjoyable to a non-physics major, provided he could keep up with the math.\r\n", "num_students": 6, "path": "/courses/21310/sections/001/reviews/3898-MASAO-SAKO", "instructor": {"path": "/instructors/3898-MASAO-SAKO", "first_name": "MASAO", "last_name": "SAKO", "id": "3898-MASAO-SAKO", "name": "MASAO SAKO"}, "num_reviewers": 6, "id": "21310-001-3898-MASAO-SAKO"}]}, "credits": null, "primary_alias": "ASTR-392", "path": "/courses/21310", "sections": {"path": "/courses/21310/sections", "values": [{"name": "LIFE AND DEATH OF STARS", "sectionnum": "001", "primary_alias": "ASTR-392-001", "path": "/courses/21310/sections/001", "id": "21310-001", "aliases": ["ASTR-392-001"]}]}, "id": 21310, "aliases": ["ASTR-392"]}