{"coursehistories": {"path": "/coursehistories/2548"}, "description": "Basic ideas of probability theory. Combinatorics. Random variables and functions of random variables. Means, moments and generating functions. Order statistics and special distributions. Inequalities and the central limit theorem. \n\n", "semester": "2010C", "name": "ENGINEERING PROBABILITY", "reviews": {"path": "/courses/23025/reviews", "values": [{"ratings": {"rAmountLearned": "2.93", "rDifficulty": "3.03", "rStimulateInterest": "2.69", "rRecommendMajor": "3.37", "rCourseQuality": "2.48", "rWorkRequired": "2.73", "rInstructorAccess": "2.93", "rReadingsValue": "2.31", "rRecommendNonMajor": "1.97", "rCommAbility": "2.83", "rInstructorQuality": "2.98"}, "section": {"name": "ENGINEERING PROBABILITY", "sectionnum": "001", "primary_alias": "ESE-301-001", "path": "/courses/23025/sections/001", "id": "23025-001", "aliases": ["ESE-301-001"]}, "comments": "ESE 301 covers basic ideas of probability theory including combinatorics, random variables and functions of random variables, means, moments and generating functions, order statistics and special distributions, and inequalities and the central limit theorem. \r\n\r\nThough many students found this course to be “difficult,” they also gave it high marks, calling it “very interesting” with “great content.” Homework assignments were described as “very difficult,” with many students wishing that there had been a recitation to review homework problems. Students appreciated Dr. Keenan’s use of PowerPoint slides for definitions and the chalkboard for examples. However, students also felt that examples should play a more central role in the class.\r\n\r\nStudents felt that Dr. Keenan “taught the concepts well” and was “very interesting.” Dr. Keenan was described as an “engaging instructor” who was “clear and helpful.” Many students stressed that he “was always helpful and had a great ability to “convey the material.” When students had a question outside of class, Dr. Kennan was always “easy to reach” via e-mail. \r\n\r\nThis class is highly recommended for major students, for whom the class is required.\r\n", "num_students": 47, "path": "/courses/23025/sections/001/reviews/1167-JOHN-D-KEENAN", "instructor": {"path": "/instructors/1167-JOHN-D-KEENAN", "first_name": "JOHN D", "last_name": "KEENAN", "id": "1167-JOHN-D-KEENAN", "name": "JOHN D KEENAN"}, "num_reviewers": 43, "id": "23025-001-1167-JOHN-D-KEENAN"}]}, "credits": null, "primary_alias": "ESE-301", "path": "/courses/23025", "sections": {"path": "/courses/23025/sections", "values": [{"name": "ENGINEERING PROBABILITY", "sectionnum": "001", "primary_alias": "ESE-301-001", "path": "/courses/23025/sections/001", "id": "23025-001", "aliases": ["ESE-301-001"]}]}, "id": 23025, "aliases": ["ESE-301"]}