{"coursehistories": {"path": "/coursehistories/3836"}, "description": "This is an introductory course about Basic Algorithms and Data Structures using the Java programming language. We introduce elementary concepts about the complexity of an algorithm and methods for analyzing the running time of software. We describe data structures like stacks, queues, lists, trees, priority queues, maps, hash tables and graphs, and we discuss how to implement them efficiently and how to use them in problems-solving software. A larger project introducing students to some of the challenges of software development concludes the course. \n\n", "semester": "2011C", "name": "PROG LANG AND TECH II", "reviews": {"path": "/courses/24162/reviews", "values": [{"ratings": {"rAmountLearned": "2.95", "rDifficulty": "2.82", "rStimulateInterest": "2.11", "rRecommendMajor": "3.64", "rCourseQuality": "2.33", "rWorkRequired": "3.06", "rInstructorAccess": "2.61", "rReadingsValue": "2.52", "rRecommendNonMajor": "1.58", "rCommAbility": "1.91", "rInstructorQuality": "2.23"}, "section": {"name": "PROG LANG AND TECH II", "sectionnum": "001", "primary_alias": "CIS-121-001", "path": "/courses/24162/sections/001", "id": "24162-001", "aliases": ["CIS-121-001"]}, "comments": "This is an introductory course about Basic Algorithms and Data Structures using\r\nthe Java programming language. Elementary concepts about the complexity of an\r\nalgorithm and methods for analyzing the running time of software are introduced. Data\r\nstructures like stacks, queues, lists, trees, priority queues, maps, hash tables and graphs\r\nare described, along with discussion on how to implement them efficiently and how to\r\nuse them in problems-solving software. A larger project introducing students to some of\r\nthe challenges of software development concludes the course.\r\nStudents were pleased with the content of the course, calling it “an essential\r\ncourse for a CIS major” that “[prepared] individuals for technical interviews.” The class\r\nwas perceived to be “very difficult,” but instilled “a superb understanding [of] many\r\nconcepts that are required to move forward as a computer scientist.” Unfortunately, the\r\nclass was “extremely poorly organized.” Homework instructions were “vague” and\r\n“constantly needed corrections,” making it difficult to get an early start on them.\r\nA few students praised Professor Daniilidis for being “very approachable and\r\nfriendly.” However, students expressed the general sentiment that he was “underprepared\r\nfor class,” often “[making] a mistake on the board and [later retracting] his\r\nstatement, causing confusion in the class.” One student said that the TAs were “relatively\r\nhelpful,” but almost all others opined that they were “especially disorganized in the way\r\n[they grade homework and interact with students],” and often provided contradictory and\r\n“confusing answers on the discussion board,” where questions were “rarely [responded to\r\nin] a timely manner.”\r\nThe class exams “were reasonable and fairly theoretical.” The majority of the\r\nclass felt that the homework and final project were “very difficult,” requiring a lot of selfreading,\r\nbut also serving as a good way to learn the course material. One student strongly\r\nrecommended non-CIS students against taking the class, saying that its “applications\r\noutside of [computer science] are slim to none.”", "num_students": 92, "path": "/courses/24162/sections/001/reviews/312-KONSTANTINOS-DANIILIDIS", "instructor": {"path": "/instructors/312-KONSTANTINOS-DANIILIDIS", "first_name": "KONSTANTINOS", "last_name": "DANIILIDIS", "id": "312-KONSTANTINOS-DANIILIDIS", "name": "KONSTANTINOS DANIILIDIS"}, "num_reviewers": 83, "id": "24162-001-312-KONSTANTINOS-DANIILIDIS"}]}, "credits": null, "primary_alias": "CIS-121", "path": "/courses/24162", "sections": {"path": "/courses/24162/sections", "values": [{"name": "PROG LANG AND TECH II", "sectionnum": "001", "primary_alias": "CIS-121-001", "path": "/courses/24162/sections/001", "id": "24162-001", "aliases": ["CIS-121-001"]}]}, "id": 24162, "aliases": ["CIS-121"]}