{"coursehistories": {"path": "/coursehistories/5018"}, "description": "This course applies psychological research to economic theory, investigating what happens when agents have human limitations and complications. The effects of limited cognitive capacities, willpower, and self-interest will be considered. \n\n", "semester": "2011A", "name": "BEHAVIORAL ECON & PSYCH", "reviews": {"path": "/courses/22309/reviews", "values": [{"ratings": {"rAmountLearned": "2.93", "rDifficulty": "2.46", "rStimulateInterest": "3.05", "rRecommendMajor": "3.43", "rCourseQuality": "2.78", "rWorkRequired": "1.85", "rInstructorAccess": "3.17", "rReadingsValue": "1.81", "rRecommendNonMajor": "2.59", "rCommAbility": "3.05", "rInstructorQuality": "3.08"}, "section": {"name": "BEHAVIORAL ECON & PSYCH", "sectionnum": "401", "primary_alias": "PPE-203-401", "path": "/courses/22309/sections/401", "id": "22309-401", "aliases": ["PPE-203-401", "PSYC-265-401"]}, "comments": "This course applies psychological research to economic theory, investigating what happens when agents have human limitations, and complications. The effects of limited cognitive capacities, willpower, and self-interest are considered. &#8232;&#8232;Overall, students found the course material “interesting” and “very informative” and praised its real-life applications. The course was split into three units, and several students felt that the last two were more clear and “relatable” than the first. &#8232;&#8232;Most students raved about Professor Dana, calling him “fantastic,” “extremely intelligent,” and “hilarious.” In the words of one student, he is “very good at breaking down concepts,” while another claimed that he “provided annotated lecture slides which were extremely helpful.” Some appreciated the ease with which Professor Dana could “get students involved in a 200+ person lecture,” while others felt that this emphasis on class discussion made the lectures “boring” or “confusing,” causing him to “occasionally lose students’ attention.”&#8232;&#8232;According to one student, this was a course where “going to class was fun.” Students claimed that the reading was “minimal.” Several felt that prior experience with Economics courses was not vital to understanding the material or achieving success.", "num_students": 208, "path": "/courses/22309/sections/401/reviews/4078-JASON-D--DANA", "instructor": {"path": "/instructors/4078-JASON-D--DANA", "first_name": "JASON D.", "last_name": "DANA", "id": "4078-JASON-D--DANA", "name": "JASON D. DANA"}, "num_reviewers": 188, "id": "22309-401-4078-JASON-D--DANA"}]}, "credits": null, "primary_alias": "PPE-203", "path": "/courses/22309", "sections": {"path": "/courses/22309/sections", "values": [{"name": "BEHAVIORAL ECON & PSYCH", "sectionnum": "401", "primary_alias": "PPE-203-401", "path": "/courses/22309/sections/401", "id": "22309-401", "aliases": ["PPE-203-401", "PSYC-265-401"]}]}, "id": 22309, "aliases": ["PPE-203", "PSYC-265"]}