{"coursehistories": {"path": "/coursehistories/399"}, "description": "The writing of individually selected projects (a novel, a group of short stories) with reading assignments and discussion of student works-in-progress. \n\nSee the English Department's website at www.english.upenn.edu for a description of the current offerings. \n\n", "semester": "2012A", "name": "ADVANCED FICTION WRITING", "reviews": {"path": "/courses/27306/reviews", "values": [{"ratings": {"rAmountLearned": "3.33", "rDifficulty": "2.67", "rStimulateInterest": "3.42", "rRecommendMajor": "3.50", "rCourseQuality": "3.38", "rWorkRequired": "2.33", "rInstructorAccess": "3.42", "rReadingsValue": "3.25", "rRecommendNonMajor": "2.75", "rCommAbility": "3.25", "rInstructorQuality": "3.46"}, "section": {"name": "ADVANCED FICTION WRITING", "sectionnum": "301", "primary_alias": "ENGL-115-301", "path": "/courses/27306/sections/301", "id": "27306-301", "aliases": ["ENGL-115-301"]}, "comments": "The class was conducted as a seminar. Every student wrote three stories during the semester; each story was discussed by the group. The instructor would, from time to time, suggest works of fiction that he hoped would be illustrative and inspirational but there were no required books. Attendance and active class participation were essential. Students were expected to email a short piece of writing to the professor prior to the start of the course.\r\n\r\nMost students enjoyed the workshop element of this class and \"found it very helpful.\" Some class members, however, wanted \"more readings and discussions\" to supplement the workshops. The workshop format, in which students critiqued one piece by one student \"for an hour of class time,\" was \"a little stressful\" for some students. Despite the intimidating format, many students felt that the critiques helped them improve their writing \"because of the open forum\" of the course. \r\n\r\nStudents heaped praise on Professor Apple, calling him \"one of the best professors at Penn.\" Professor Apple's \"comments\" were \"very constructive.\" He \"communicated the subject matter well\" and was \"always willing to help students.\" Class members \"appreciated his vast experience in both writing and teaching.\" Students greatly valued his advice, and expressed a desire to continue their writing under his guidance.\r\n\r\nSome students expressed apprehension about the grading system of this class.  A few class members felt that they wished for more grades rather than feedback to \"understand quantitatively\" their progress. The feedback alone created uncertainty about grades; students had \"no sense of what\" their final grades would be.", "num_students": 15, "path": "/courses/27306/sections/301/reviews/436-MAX-APPLE", "instructor": {"path": "/instructors/436-MAX-APPLE", "first_name": "MAX", "last_name": "APPLE", "id": "436-MAX-APPLE", "name": "MAX APPLE"}, "num_reviewers": 13, "id": "27306-301-436-MAX-APPLE"}]}, "credits": null, "primary_alias": "ENGL-115", "path": "/courses/27306", "sections": {"path": "/courses/27306/sections", "values": [{"name": "ADVANCED FICTION WRITING", "sectionnum": "301", "primary_alias": "ENGL-115-301", "path": "/courses/27306/sections/301", "id": "27306-301", "aliases": ["ENGL-115-301"]}]}, "id": 27306, "aliases": ["ENGL-115"]}