[{"ratings": {"rAmountLearned": "3.37", "rDifficulty": "2.74", "rStimulateInterest": "3.84", "rRecommendMajor": "3.81", "rCourseQuality": "3.58", "rWorkRequired": "2.65", "rInstructorAccess": "3.63", "rReadingsValue": "3.07", "rRecommendNonMajor": "3.02", "rCommAbility": "3.88", "rInstructorQuality": "3.82"}, "section": {"name": "GRK WRLD AFTER ALEX GRT", "sectionnum": "401", "primary_alias": "ANCH-323-401", "path": "/courses/25575/sections/401", "id": "25575-401", "aliases": ["ANCH-323-401", "CLST-323-401"]}, "comments": "This class is designed as a detailed investigation of the world created by Alexander the Great. It covers the three hundred year period known as the Hellenistic Age from the career of Alexander the Great (354-323 BC) until the defeat of Antony and Cleopatra at the Battle of Actium (31 BC). This was a period during which the world of the Greeks underwent extraordinary and far-reaching changes, as Greek culture was established as far afield as northwestern India, central Asia and Egypt. In the same period kingdoms controlled by Alexanders's Successors used Greek culture to define their rule, establishing a Greek culture of the elite in regions which previously had been dominated by the Persians. As Greek and non-Greek worlds collided, a new interpretation of Greek culture emerged, giving rise, among other things, to universities and professional schools, state subsidized health care, triumphalist architecture, the heroization of the noble savage, coinage with royal portraits, the deification of men and a multitude of other social, artistic and political forms familiar to us. It was an age of radical change, dislocation, as Greek populations colonized regions previously unknown to them.\r\n\r\nStudents seemed to great enjoy the class, describing it as “excellent” and “wonderful.” One student noted that he “learned a lot from the course” and another said that he “absolutely loved the class.” While most shared this positive view, one student thought that it was “a very hard class.”\r\n\r\nStudents loved Professor McInerney, describing him as “great,” “refreshing,” and as “one of those professors you have to take at Penn.” They felt it was obvious that “this field is one of Professor McInerney’s specialties” and that “he does an amazing job of making the boring parts better.”\r\n\r\nA common concern that students had was related to the readings, which were described as “very dry” and “boring” by some students. Students also felt that “it would benefit the students to have more discussion time,” and that the quizzes were “too difficult” and required “an unreasonable amount of detail.” However, students felt that the exams were reasonable.", "num_students": 51, "path": "/courses/25575/sections/401/reviews/84-JEREMY-MCINERNEY", "instructor": {"path": "/instructors/84-JEREMY-MCINERNEY", "first_name": "JEREMY", "last_name": "MCINERNEY", "id": "84-JEREMY-MCINERNEY", "name": "JEREMY MCINERNEY"}, "num_reviewers": 47, "id": "25575-401-84-JEREMY-MCINERNEY"}]