{"coursehistories": {"path": "/coursehistories/5585"}, "description": "A new field has slowly begun to emerge within the traditional discipline of academic philosophy: African-American Philosophy. \"African American Philosophy\" refers here to conceptually and analytically rigorous philosophical studies of topics closely related to the social, legal, economic, historical, and cultural experiences of US peoples of African descent. The field has appeared in tandem with a striking increase in the number of professionally trained philosophers of African descent holding the Ph.D. in philosophy, and employed as full-time teachers and scholars. A recent estimate puts the number of philosophers of African descent working in the US at about one hundred; and about twenty of these are African-American women. A significant body of scholarship now describes, explains, critiques, and evaluates African American culture, slavery, oppression, discrimination, integration, segregation, equality, gender politics, labor, families, health, mental health, and the significance of race to identity, morality, ethics, politics, democracy, public policy, law, science, technology, the humanities and the arts. This unique lecture course will be a thematic introduction to African American Philosophy since 1960. Weekly topics will be chosen from among these clusters: Slavery, Colonialism, Oppression and Freedom; \n\nSegregation, Integration and Equality; Gender, Sex and Sexualities; Reproductive Rights and Responsibilities; Religion and Spiritualism; Rebellion, Protest, Social Movements and Citizenship; Economic Welfare, Labor and Inequality; Violence, Crime and Punishment; Education, Affirmative Action and Diversity; Reparations and Forgiveness; Identities and Stereotypes; Nature, Science and Health; Psychology, Psychiatry and Mental Health; Pragmatism; Existentialism; and the Sociology of Philosophy. We will read works by Cornell West, Adrian Piper, Charles Mills, Lewis Gordon, Anita Allen, Anthony Appiah, Lucius Outlaw, Naomi Zack, Lawrence Thomas, Bill Lawson, Michele Moody Adams and others. For most undergraduate students, evaluation in the course will be based on a mid-term and final exam with essay and objective components. Advanced students and graduate students enrolled in the course will have an opportunity to write a substantial supervised paper on a topic of their own choosing in lieu of the exams. \n\n", "semester": "2012C", "name": "AFRICAN AMERICAN PHIL", "reviews": {"path": "/courses/29493/reviews", "values": [{"ratings": {"rDifficulty": "2.80", "rTAQuality": "3.20", "rStimulateInterest": "3.60", "rCourseQuality": "3.20", "rWorkRequired": "3.00", "rInstructorQuality": "3.60", "rCommAbility": "3.50", "rInstructorAccess": "3.60"}, "section": {"name": "AFRICAN AMERICAN PHIL", "sectionnum": "401", "primary_alias": "PHIL-252-401", "path": "/courses/29493/sections/401", "id": "29493-401", "aliases": ["PHIL-252-401", "PHIL-552-401", "AFRC-254-401", "AFRC-552-401"]}, "comments": "", "num_students": 15, "path": "/courses/29493/sections/401/reviews/1927-ANITA-L-ALLEN-CASTELLITTO", "instructor": {"path": "/instructors/1927-ANITA-L-ALLEN-CASTELLITTO", "first_name": "ANITA L", "last_name": "ALLEN-CASTELLITTO", "id": "1927-ANITA-L-ALLEN-CASTELLITTO", "name": "ANITA L ALLEN-CASTELLITTO"}, "num_reviewers": 5, "id": "29493-401-1927-ANITA-L-ALLEN-CASTELLITTO"}]}, "credits": null, "primary_alias": "PHIL-252", "path": "/courses/29493", "sections": {"path": "/courses/29493/sections", "values": [{"name": "AFRICAN AMERICAN PHIL", "sectionnum": "401", "primary_alias": "PHIL-252-401", "path": "/courses/29493/sections/401", "id": "29493-401", "aliases": ["PHIL-252-401", "PHIL-552-401", "AFRC-254-401", "AFRC-552-401"]}]}, "id": 29493, "aliases": ["PHIL-252", "PHIL-552", "AFRC-254", "AFRC-552"]}