[{"ratings": {"rAmountLearned": "3.44", "rDifficulty": "2.62", "rStimulateInterest": "3.48", "rRecommendMajor": "3.64", "rCourseQuality": "3.40", "rWorkRequired": "3.16", "rInstructorAccess": "3.39", "rReadingsValue": "3.24", "rRecommendNonMajor": "3.24", "rCommAbility": "3.76", "rInstructorQuality": "3.55"}, "section": {"name": "CORP DEV: MERG & ACQUIS", "sectionnum": "001", "primary_alias": "MGMT-721-001", "path": "/courses/27765/sections/001", "id": "27765-001", "aliases": ["MGMT-721-001"]}, "comments": "", "num_students": 60, "path": "/courses/27765/sections/001/reviews/3377-SAIKAT-CHAUDHURI", "instructor": {"path": "/instructors/3377-SAIKAT-CHAUDHURI", "first_name": "SAIKAT", "last_name": "CHAUDHURI", "id": "3377-SAIKAT-CHAUDHURI", "name": "SAIKAT CHAUDHURI"}, "num_reviewers": 45, "id": "27765-001-3377-SAIKAT-CHAUDHURI"}, {"ratings": {"rAmountLearned": "3.35", "rDifficulty": "2.60", "rStimulateInterest": "3.55", "rRecommendMajor": "3.72", "rCourseQuality": "3.51", "rWorkRequired": "3.09", "rInstructorAccess": "3.57", "rReadingsValue": "3.19", "rRecommendNonMajor": "3.44", "rCommAbility": "3.74", "rInstructorQuality": "3.67"}, "section": {"name": "CORP DEV: MERG & ACQUIS", "sectionnum": "002", "primary_alias": "MGMT-721-002", "path": "/courses/27765/sections/002", "id": "27765-002", "aliases": ["MGMT-721-002"]}, "comments": "MGMT 721 explores the various modes of corporate development available to managers to drive firm growth and change, including alliances, outsourcing, corporate venturing, and particularly mergers and acquisitions. The objectives are three-fold: (1) to arm students with a set of tools to facilitate the selection of the appropriate growth strategy in a given situation; (2) to provide students with insights as to how to manage partnerships like alliances, outsourcing, and corporate venturing; and, (3) to develop a comprehensive framework for executing M&As, from initiation to implementation. The emphasis is on strategic and operational aspects of these transactions, rather than financial considerations. The course begins by examining the different modes of corporate development, including the applicability and management approaches for each, particularly various types of partnerships. It then delves into acquisition screening and deal-making. Afterwards, it considers in detail post-merger integration. The course ends with the presentation of project work and a review of the course learnings. In terms of its pedagogical approach, this is designed to be an interactive, applied, case-based course with accompanying conceptual readings to help structure students’ thinking. Given the nature of the course, students also apply the lessons from the cases to understand the challenges and implications of relevant recent and on-going deals. In addition, guest speakers with experience in investment banking, consulting, and industry are invited to share their perspectives. A semester-long group project is intended to give students the opportunity to apply their learning from the course to a context that is most interesting and relevant to them.\r\nStudents universally felt that MGMT 721 was “very enjoyable” and “one of the best classes…at Wharton.”  Several described the class as “well-structured,” and while there was a lot of reading, a few noted that the requirement to submit a write-up before class was “well worth the higher quality discussion that resulted.” Overall, students felt that the class provided a “comprehensive,” “not finance oriented” overview of M&A and gave them practical knowledge that they could apply in the real world.  While a couple students suggested adding more variety to the cases studied, this was a minor complaint among the enthusiastic praise for the course as a whole.   \r\nAccording to Professor Chaudhuri’s students, “Wharton needs more professors like [him]”.  Many described Professor Chaudhuri as “extremely knowledgeable,” “very engaged,” and “a good facilitator” of class discussions. Professor Chaudhuri “[came] to each class with a highly-developed roadmap for each case.”  Several further appreciated that Professor Chaudhuri “[held them] accountable for knowing the material” and “[did] a good job getting students interested.”\r\nSeveral students noted that the workload was heavy due to a lot of reading and high expectation for preparation.  MGMT 654, MGMT 611, or MGMT 612 is required as a prerequisite.  MGMT 721 can count towards the Entrepreneurial Management, Management, and Strategic Management majors. \r\n", "num_students": 61, "path": "/courses/27765/sections/002/reviews/3377-SAIKAT-CHAUDHURI", "instructor": {"path": "/instructors/3377-SAIKAT-CHAUDHURI", "first_name": "SAIKAT", "last_name": "CHAUDHURI", "id": "3377-SAIKAT-CHAUDHURI", "name": "SAIKAT CHAUDHURI"}, "num_reviewers": 51, "id": "27765-002-3377-SAIKAT-CHAUDHURI"}, {"ratings": {"rAmountLearned": "2.64", "rDifficulty": "2.41", "rStimulateInterest": "2.27", "rRecommendMajor": "2.59", "rCourseQuality": "2.58", "rWorkRequired": "2.59", "rInstructorAccess": "2.95", "rReadingsValue": "2.86", "rRecommendNonMajor": "2.36", "rCommAbility": "2.73", "rInstructorQuality": "2.75"}, "section": {"name": "CORP DEV: MERG & ACQUIS", "sectionnum": "701", "primary_alias": "MGMT-721-701", "path": "/courses/27765/sections/701", "id": "27765-701", "aliases": ["MGMT-721-701"]}, "comments": "", "num_students": 34, "path": "/courses/27765/sections/701/reviews/4431-HARBIR-SINGH", "instructor": {"path": "/instructors/4431-HARBIR-SINGH", "first_name": "HARBIR", "last_name": "SINGH", "id": "4431-HARBIR-SINGH", "name": "HARBIR SINGH"}, "num_reviewers": 27, "id": "27765-701-4431-HARBIR-SINGH"}]