{"coursehistories": {"path": "/coursehistories/3880"}, "description": "Museums, mural arts, mummers on Moyamenssing, skateboarding at Love Park, Fifty-Second Street, vendors, The Arts Garage and local arts spaces. These can be seen as places our communities come together to tell themselves about themselves. But who is telling these stories, from which vantage points, and at what costs and benefits to various communities? We explore how scholarship-at its best and most effective-transcends and transgresses boundaries between academic and public spaces, to create a broader arena for intellectural exchangeand cross-cultural dialogue. this course thus positions itself at the intersection local arts and public culture and of community studies and applied social science to inspire a dialogue and inquiry. Class-members jointly explore the many ways in which cultural research, traditional arts, and community studies are brought to public audiences. In particular, we will discuss how modern public scholars can work to reconcile the ideas and ideals so often discussed in the academy which practice in the community. Our class will engage in critical assessment of both cultural and programming and civically engaged scholarship, with an eye toward developing a more politically aware practice and more collaborative, community-sensitive models for action. \n\n", "semester": "2007C", "name": "Public Arts, Liberal Arts: Applied Ethnography and Community", "reviews": {"path": "/courses/13287/reviews", "values": [{"ratings": {"rAmountLearned": "3.43", "rDifficulty": "2.14", "rStimulateInterest": "3.86", "rRecommendMajor": "3.71", "rCourseQuality": "3.71", "rWorkRequired": "2.29", "rInstructorAccess": "4.00", "rReadingsValue": "2.57", "rRecommendNonMajor": "3.29", "rCommAbility": "3.71", "rInstructorQuality": "3.86"}, "section": {"name": "Public Arts, Liberal Arts: Applied Ethnography and Community", "sectionnum": "640", "primary_alias": "FOLK-579-640", "path": "/courses/13287/sections/640", "id": "13287-640", "aliases": ["FOLK-579-640"]}, "comments": "Students felt the class was engaging and that the two professors made an excellent teaching team.  They noted that the instructors encouraged analytically thinking and student opinions.", "num_students": 8, "path": "/courses/13287/sections/640/reviews/3560-NANCY-WATTERSON", "instructor": {"path": "/instructors/3560-NANCY-WATTERSON", "first_name": "NANCY", "last_name": "WATTERSON", "id": "3560-NANCY-WATTERSON", "name": "NANCY WATTERSON"}, "num_reviewers": 7, "id": "13287-640-3560-NANCY-WATTERSON"}]}, "credits": null, "primary_alias": "FOLK-579", "path": "/courses/13287", "sections": {"path": "/courses/13287/sections", "values": [{"name": "Public Arts, Liberal Arts: Applied Ethnography and Community", "sectionnum": "640", "primary_alias": "FOLK-579-640", "path": "/courses/13287/sections/640", "id": "13287-640", "aliases": ["FOLK-579-640"]}]}, "id": 13287, "aliases": ["FOLK-579"]}