{"coursehistories": {"path": "/coursehistories/748"}, "description": "This course examines the technical and managerial challenges presented by emerging and evolving technologies. Particular consideration is given to the forces affecting the nature and rate of technological innovation and the managerial options available to both established and entrepreneurial organizations. In doing so, we explore both internal and external sources of innovation as well as the appropriate strategies and processes for capitalizingon them. The course will be taught in seminar fashion with substantial class discussion. Assigned and supplementary readings will be augmented by cases and occasional guest lectures. Students will prepare a variety of written assignments, including case analyses and two research papers dealing with selected technologies, firms and industries. \n\n", "semester": "2012A", "name": "MANAGEMENT OF TECHNOLOGY", "reviews": {"path": "/courses/27751/reviews", "values": [{"ratings": {"rAmountLearned": "3.61", "rDifficulty": "2.51", "rStimulateInterest": "3.79", "rRecommendMajor": "3.74", "rCourseQuality": "3.67", "rWorkRequired": "2.74", "rInstructorAccess": "3.74", "rReadingsValue": "3.49", "rRecommendNonMajor": "3.28", "rCommAbility": "3.82", "rInstructorQuality": "3.81"}, "section": {"name": "MANAGEMENT OF TECHNOLOGY", "sectionnum": "001", "primary_alias": "MGMT-237-001", "path": "/courses/27751/sections/001", "id": "27751-001", "aliases": ["MGMT-237-001"]}, "comments": "Management 237 examines the technical and managerial challenges presented by emerging and evolving technologies. Particular consideration is given to the forces affecting the nature and rate of technological innovation and the managerial options available to both established and entrepreneurial organizations. In doing so, the class explores both internal and external sources of innovation as well as the appropriate strategies and processes for capitalizing on them. The course is taught in seminar fashion with substantial class discussion. Assigned and supplementary readings are augmented by cases and occasional guest lectures. Students prepare a variety of written assignments, including case analyses and two research papers dealing with selected technologies, firms and industries.\r\nMany students described MGMT 237 as one of the best classes they had taken yet.  Students found the course “eye opening,” “interesting,” and “inspiring,” and a couple of students noted that they particularly enjoyed the “extremely interesting discussions every class” and the guest speakers.  \r\nAlmost all students felt that Professor Chaudhuri was one of the best professors they had ever had.  They appreciated that he was “energetic, knowledgeable, and had a great rapport with the class” and felt that he “[did] an excellent job facilitating student discussion.” \r\nOne student noted that MGMT 237 required “up to 3-5 hours of [reading] per lecture” and participation in class “was competitive.”  Another student mentioned that coordinating a final paper with a group of seven to eight students was a challenge.  MGMT 100 and MGMT 101 are prerequisites.  The course is a requirement for Management and Technology sophomore students and is not open to other students.", "num_students": 51, "path": "/courses/27751/sections/001/reviews/3377-SAIKAT-CHAUDHURI", "instructor": {"path": "/instructors/3377-SAIKAT-CHAUDHURI", "first_name": "SAIKAT", "last_name": "CHAUDHURI", "id": "3377-SAIKAT-CHAUDHURI", "name": "SAIKAT CHAUDHURI"}, "num_reviewers": 47, "id": "27751-001-3377-SAIKAT-CHAUDHURI"}]}, "credits": null, "primary_alias": "MGMT-237", "path": "/courses/27751", "sections": {"path": "/courses/27751/sections", "values": [{"name": "MANAGEMENT OF TECHNOLOGY", "sectionnum": "001", "primary_alias": "MGMT-237-001", "path": "/courses/27751/sections/001", "id": "27751-001", "aliases": ["MGMT-237-001"]}]}, "id": 27751, "aliases": ["MGMT-237"]}