[{"ratings": {"rAmountLearned": "2.75", "rDifficulty": "3.19", "rStimulateInterest": "2.63", "rRecommendMajor": "2.75", "rCourseQuality": "2.56", "rWorkRequired": "3.38", "rInstructorAccess": "2.63", "rReadingsValue": "2.56", "rRecommendNonMajor": "1.69", "rCommAbility": "2.47", "rInstructorQuality": "2.94"}, "section": {"name": "NANOSCALE SYSTEMS BIOL", "sectionnum": "401", "primary_alias": "CBE-555-401", "path": "/courses/22757/sections/401", "id": "22757-401", "aliases": ["CBE-555-401", "MEAM-555-401", "BE-555-401"]}, "comments": "\r\nCBE 555 discusses, through lectures and laboratory demonstration, the elaboration of various stresses on cellular structures, influences of interaction pathways and convolutions of incessant thermal motions will be discussed via lectures and laboratory demonstration. Topics range from protein folding/forced unfolding to biomolecule associations, cell and membrane mechanics, and cell motility. Frequent hands-on exposure to modern methods in the field is a significant element of the course in the laboratory. \r\n\r\nMany students found this course to be “disorganized,” as the professor used “guest speakers” that assign work. Several said that it was “difficult to keep track of” so many different assignments from “so many people.” Some students stated that some of the post-docs were “uncooperative” and rude. In addition, several students wished that the assignments were based on concepts learned in class rather than the other way around. However, students generally agreed that the content of the class was “good” and “well suited” for graduate students. \r\n\r\nCBE 555 is a graduate level course, but is open to seniors. Students would recommend this course only for major-students. \r\n\r\nThis review is based on the 8 student comments that were submitted.\r\n", "num_students": 22, "path": "/courses/22757/sections/401/reviews/772-DENNIS-E--DISCHER", "instructor": {"path": "/instructors/772-DENNIS-E--DISCHER", "first_name": "DENNIS E.", "last_name": "DISCHER", "id": "772-DENNIS-E--DISCHER", "name": "DENNIS E. DISCHER"}, "num_reviewers": 18, "id": "22757-401-772-DENNIS-E--DISCHER"}]