[{"ratings": {"rAmountLearned": "2.07", "rDifficulty": "3.48", "rStimulateInterest": "2.37", "rRecommendMajor": "2.80", "rCourseQuality": "1.73", "rWorkRequired": "3.15", "rInstructorAccess": "3.32", "rReadingsValue": "2.03", "rRecommendNonMajor": "0.90", "rCommAbility": "1.81", "rInstructorQuality": "2.50"}, "section": {"name": "MATH FOUND COMP SCI", "sectionnum": "001", "primary_alias": "CIS-160-001", "path": "/courses/17126/sections/001", "id": "17126-001", "aliases": ["CIS-160-001"]}, "comments": "This course provides an introduction to proof principles and logics, functions and relations, induction principles, combinatorics and graph theory, as well as a rigorous grounding in writing and reading mathematical proofs. It is the first course for the basic mathematical concepts and techniques needed in computer science.\r\n\r\nStudents found the course material to be very hard and frustrating. Describing the course as “dense” and “confusing,” many students felt the class lectures were “obscure” and lacking in examples, and the homework very difficult. Some students did not see the connection with the course and the rest of the CIS curriculum.\r\n\r\nStudents found Professor Gallier to be a “passionate,” “funny and engaging” teacher. Most students found that attendance to Professor Gallier’s office hours was required, because without him going over the homework in that time, the assignments were impossible.\r\n\r\nMany students cited the difficulty of the homework, along with grading concerns for it. As many students got answers from office hours or copied solutions, the median homework scores were extremely high. This course is required for CIS undergraduates, and is recommended to be taken freshman year. \r\n", "num_students": 88, "path": "/courses/17126/sections/001/reviews/248-JEAN-HENRI-GALLIER", "instructor": {"path": "/instructors/248-JEAN-HENRI-GALLIER", "first_name": "JEAN HENRI", "last_name": "GALLIER", "id": "248-JEAN-HENRI-GALLIER", "name": "JEAN HENRI GALLIER"}, "num_reviewers": 84, "id": "17126-001-248-JEAN-HENRI-GALLIER"}]