{"coursehistories": {"path": "/coursehistories/4934"}, "description": "Mummies of the Silk Road This course takes advantage of, and is premised upon, the unique opportunity afforded by the extraordinary exhibition entitled \"Secrets of the Silk Road,\" which is being shown at the University of Pennsylvania Museum of Archaeology and Anthropology from February 5-June 5, 2010. The exhibition is comprised of more than a hundred objects, including two mummies (roughly 1800 BC and 800 BC) and the magnificent trappings of a third (early 5th century AD). Among the artifacts are attractive foodstuffs, splendid textiles, finely made shoes, unusual headgear, beautiful jewelry, evocative statues and figurines, mysterious mortuary accessories, manuscripts in a variety of languages and scripts, Sasanian coins, fine paintings, and much else besides. All of these materials come from the Xinjiang Uyghur Autonomous Region (XUAR) of the People's Republic of China, which geographically may be referred to as Eastern Central Asia (ECA) and ethnically as Uyghurstan or East Turkestan. We will study eac of the items for the exhibition in depth and will also reference other related mummies (actually naturally desiccated corpses) and materials from the museums and archaeological institutes of the XUAR. In the process of doing so, we will familiarize ourselves with the inhabitants, languages, places, and history of \n\nthe region. Moreover, it is the aim of the course to situate ECA within the context of the whole of Eurasia. Our discussions will touch upon ancient and modern DNA, blood types, physical anthropology, bronze technology, the spread of agriculture and oasis technology, the utilization of the horse and other domesticated animals, wheeled vehicles, textiles, climate, geography, and all other aspects of the region that are relevant to life there during the Bronze Age, Iron Age, and medieval period. \n\n", "semester": "2011A", "name": "MUMMIES OF THE SILK ROAD", "reviews": {"path": "/courses/21528/reviews", "values": [{"ratings": {"rAmountLearned": "3.43", "rDifficulty": "2.41", "rStimulateInterest": "3.71", "rRecommendMajor": "3.54", "rCourseQuality": "3.34", "rWorkRequired": "2.29", "rInstructorAccess": "3.46", "rReadingsValue": "3.36", "rRecommendNonMajor": "3.14", "rCommAbility": "3.57", "rInstructorQuality": "3.63"}, "section": {"name": "MUMMIES OF THE SILK ROAD", "sectionnum": "401", "primary_alias": "EALC-233-401", "path": "/courses/21528/sections/401", "id": "21528-401", "aliases": ["EALC-233-401", "EALC-633-401"]}, "comments": "", "num_students": 39, "path": "/courses/21528/sections/401/reviews/77-VICTOR-H--MAIR", "instructor": {"path": "/instructors/77-VICTOR-H--MAIR", "first_name": "VICTOR H.", "last_name": "MAIR", "id": "77-VICTOR-H--MAIR", "name": "VICTOR H. MAIR"}, "num_reviewers": 32, "id": "21528-401-77-VICTOR-H--MAIR"}]}, "credits": null, "primary_alias": "EALC-233", "path": "/courses/21528", "sections": {"path": "/courses/21528/sections", "values": [{"name": "MUMMIES OF THE SILK ROAD", "sectionnum": "401", "primary_alias": "EALC-233-401", "path": "/courses/21528/sections/401", "id": "21528-401", "aliases": ["EALC-233-401", "EALC-633-401"]}]}, "id": 21528, "aliases": ["EALC-233", "EALC-633"]}