[{"ratings": {"rAmountLearned": "2.26", "rDifficulty": "2.21", "rStimulateInterest": "1.98", "rRecommendMajor": "2.81", "rCourseQuality": "2.24", "rWorkRequired": "2.35", "rInstructorAccess": "2.60", "rReadingsValue": "2.00", "rRecommendNonMajor": "2.23", "rCommAbility": "2.28", "rInstructorQuality": "2.22"}, "section": {"name": "WORLD FILM HIST '45-PRES", "sectionnum": "601", "primary_alias": "CINE-102-601", "path": "/courses/22808/sections/601", "id": "22808-601", "aliases": ["CINE-102-601", "ARTH-109-601", "ENGL-092-601"]}, "comments": "Focusing on movies made after 1945, this course allows students to learn and to sharpen methods, terminologies, and tools needed for the critical analysis of film. Requirements include readings in film history and film analysis, an analytical essay, a research paper, a final exam, and active participation. &#8232;&#8232;\r\n\r\nStudents agreed that the films were “great!” They commented that the class material was interesting and very informative. However, some felt that the readings and lectures were not always related to the topics of the paper assignments.\r\n\r\n&#8232;&#8232;Professor McGrath was described as “very nice.” Students agreed that she is approachable and accessible both in and out of class. However, most students felt that Professor McGrath could be more organized with lecturing and note-taking during class. The students felt as if the professor sometimes “assumed that the students were knowledgeable about things they aren't.”&#8232;&#8232;\r\n\r\nhis course fulfills the Arts and Letters sector. One student said that this class is great for “someone who is trying to fulfill a sector requirement.” Students say that there isn't much day-to-day work and that when work is given “it is necessary to understand the material and to succeed in class.” However, students were concerned with the excessive amount of time devoted to discussing films when the exams focused mostly on the reading.\r\n", "num_students": 54, "path": "/courses/22808/sections/601/reviews/3284-CAITLIN-MCGRATH", "instructor": {"path": "/instructors/3284-CAITLIN-MCGRATH", "first_name": "CAITLIN", "last_name": "MCGRATH", "id": "3284-CAITLIN-MCGRATH", "name": "CAITLIN MCGRATH"}, "num_reviewers": 49, "id": "22808-601-3284-CAITLIN-MCGRATH"}]