[{"ratings": {"rAmountLearned": "3.21", "rDifficulty": "2.89", "rStimulateInterest": "3.20", "rRecommendMajor": "3.85", "rCourseQuality": "3.22", "rWorkRequired": "2.60", "rInstructorAccess": "3.35", "rReadingsValue": "3.53", "rRecommendNonMajor": "2.30", "rCommAbility": "3.35", "rInstructorQuality": "3.52"}, "section": {"name": "POETICS OF ARCHITECTURE", "sectionnum": "401", "primary_alias": "ARCH-411-401", "path": "/courses/22651/sections/401", "id": "22651-401", "aliases": ["ARCH-411-401", "ARCH-711-401"]}, "comments": "This course in theory and history reconsiders the architecture of the twentieth century and asks questions about the building's most visible and articulate surface: the facade. Added to the typical concerns with production and representation is a topic of design and experience that is often overlooked: performance. The course argues a simple thesis: the way the building looks is largely determined by what the building does. &#8232;&#8232;\r\n\r\nStudents found the lecture portion of the course to be \"very informative.\" The examples used in the course were clear and grounded as well. A few students, however, found the requirements for the assignments to be unclear.&#8232;\r\n\r\n&#8232;All students agreed that Professor Leatherbarrow was an \"expert on the subject and very enthusiastic about it.\" According to students, he genuinely cared about \"cultivating student interest in the subject matter.\"&#8232;&#8232;\r\n\r\nThe prerequisite for this course is ARCH 401. This course was recommended to all students interested in architecture, as many students commented that Professor Leatherbarrow's teaching \"nurtures responsible architects.\"\r\n", "num_students": 27, "path": "/courses/22651/sections/401/reviews/1788-DAVID-E-LEATHERBARROW", "instructor": {"path": "/instructors/1788-DAVID-E-LEATHERBARROW", "first_name": "DAVID E", "last_name": "LEATHERBARROW", "id": "1788-DAVID-E-LEATHERBARROW", "name": "DAVID E LEATHERBARROW"}, "num_reviewers": 24, "id": "22651-401-1788-DAVID-E-LEATHERBARROW"}]