{"coursehistories": {"path": "/coursehistories/2054"}, "description": "For Spring 2012 - If Risk Analy & Env Mgmt is closed after the pre-registration period, please e-mail Kyle Dix at kyledix@wharton.upenn.edu to be added to the wait list for the class. Please be sure to include your Name, Student ID #, what section you are interested in (OPIM, BPUB, or ESE) and list what class level you are in. We will do our best to accomodate as many students as possible on the wait list. \n\n", "semester": "2009A", "name": "RISK ANALY & ENV MGMT", "reviews": {"path": "/courses/16270/reviews", "values": [{"ratings": {"rAmountLearned": "2.13", "rDifficulty": "1.98", "rStimulateInterest": "2.20", "rRecommendMajor": "2.44", "rCourseQuality": "2.19", "rWorkRequired": "2.32", "rInstructorAccess": "3.02", "rReadingsValue": "2.06", "rRecommendNonMajor": "1.91", "rCommAbility": "2.57", "rInstructorQuality": "2.52"}, "section": {"name": "RISK ANALY & ENV MGMT", "sectionnum": "401", "primary_alias": "OPIM-261-401", "path": "/courses/16270/sections/401", "id": "16270-401", "aliases": ["OPIM-261-401", "ESE-567-401", "OPIM-761-401", "BPUB-961-401", "BPUB-761-401", "BPUB-261-401"]}, "comments": "This course is designed to introduce students to the complexities of making decisions about threats to human health and the environment when people’s perceptions of risks and their decision-making processes differ from expert views. The course explores the role of techniques such as decision analysis, cost-benefit analysis, risk assessment and risk perception in structuring risk-management decisions. In addition to teaching students how to recognize the limitations of individuals in processing information, OPIM 261 examines policy tools such as risk communication, incentive systems, third party inspection, insurance and regulation in different problem contexts. The course is cross-listed with OPIM 761, BPUB 261, 761, 961, and ESE 567.\r\n\r\nSome students said that this course was informative and helped spark interest in risk analysis. Many commented that the course was generally a broad overview of various elements of public health risk. Students mentioned that a “better connection needs to be drawn between public health risks and impacts on business.” Some students also said the class was too theoretical.\r\n\r\nProfessor Kunreuther was said to be “very open and approachable.” Many students mentioned that they were impressed with his expertise in the field. However, they also noted that his “slides are always confusing, hard to read and irrelevant.”\r\n\r\nThis course was offered to both undergraduates and MBA students. Many commented that they did not appreciate the mix and would have preferred if it was taught separately for the two classes of students. One student also mentioned that OPIM 261 is a “great course especially for environmental studies majors looking into consulting.” Students commented that there was an “unnecessary amount of graded assignments throughout the semester.” Grading was said to be highly subjective.", "num_students": 56, "path": "/courses/16270/sections/401/reviews/1657-HOWARD-KUNREUTHER", "instructor": {"path": "/instructors/1657-HOWARD-KUNREUTHER", "first_name": "HOWARD", "last_name": "KUNREUTHER", "id": "1657-HOWARD-KUNREUTHER", "name": "HOWARD KUNREUTHER"}, "num_reviewers": 55, "id": "16270-401-1657-HOWARD-KUNREUTHER"}]}, "credits": null, "primary_alias": "OPIM-261", "path": "/courses/16270", "sections": {"path": "/courses/16270/sections", "values": [{"name": "RISK ANALY & ENV MGMT", "sectionnum": "401", "primary_alias": "OPIM-261-401", "path": "/courses/16270/sections/401", "id": "16270-401", "aliases": ["OPIM-261-401", "ESE-567-401", "OPIM-761-401", "BPUB-961-401", "BPUB-761-401", "BPUB-261-401"]}]}, "id": 16270, "aliases": ["OPIM-261", "ESE-567", "OPIM-761", "BPUB-961", "BPUB-761", "BPUB-261"]}