{"coursehistories": {"path": "/coursehistories/277"}, "description": "Myths are traditional stories that have endured many years. Some of them have to do with events of great importance, such as the founding of a nation. Others tell the stories of great heroes and heroines and their exploits and courage over adversity. Still others are simple tales about otherwise unremarkable people who get into trouble or do some great deed. What are we to make of all these tales, and why do people seem to like to hear them? This course will focus on the myths of ancient Greece and Rome, as well as a contemporary American ones, as a way of exploring the nature of myth and the function it plays for individuals, societies, and nations. We will also pay some attention to the way the Greeks and Romans themselves understood their ownmyths. Are myths subtle codes that contain some universal truth? Are they a window on the deep recesses of a particular culture? Are they entertaining stories that people like to tell over and over? Are they a set of blinders that all of us wear, though we do not realize it? Investigate these questions a variety of topics creation of the universe between gods and mortals, religion and family, sex,love, madness, and death. \n\n", "semester": "2010A", "name": "GREEK & ROMAN MYTHOLOGY", "reviews": {"path": "/courses/25824/reviews", "values": [{"ratings": {"rAmountLearned": "2.44", "rDifficulty": "2.28", "rStimulateInterest": "2.25", "rRecommendMajor": "3.34", "rCourseQuality": "2.52", "rWorkRequired": "2.79", "rInstructorAccess": "2.36", "rReadingsValue": "2.97", "rRecommendNonMajor": "2.57", "rCommAbility": "2.67", "rInstructorQuality": "2.57"}, "section": {"name": "GREEK & ROMAN MYTHOLOGY", "sectionnum": "401", "primary_alias": "CLST-200-401", "path": "/courses/25824/sections/401", "id": "25824-401", "aliases": ["CLST-200-401", "COML-200-401"]}, "comments": "This course focuses on the myths of ancient Greece and Rome, as well as a few contemporary American ones, as a way of exploring the nature of myth and the function it plays for individuals, societies, and nations. In addition, the way that the Greeks and Romans themselves understood their own myths is examined. Readings include works by Homer, Hesiod, Ovid, Virgil, and Apollodorus. \r\n\r\nOverall, students had positive reviews for the course, saying it was “very interesting.” However, several students noted that there was a discrepancy in content between the first and second half of the semester, and there was a shift from being “literature-based” to being more focused on history and politics. For many students, this shift was accompanied by a heavier reading load, and some students had trouble keeping up with the new material. However, students noted that “recitations were helpful” in digesting the material.\r\n\r\nStudents generally thought that Professor Farrell was “passionate” and “knowledgeable.” While he “went on a lot of tangents” and lecture was at times “monotonous,” overall Professor Farrell did a “great job” highlighting important passages and concepts from the readings through use of slides and discussion.\r\n\r\nAlthough students recommend this course to majors and non-majors, many complained that “there was an inordinate amount of work to be done and several weekly assignments to keep track of,” while others said “all the material was a joy to read.” Online quizzes were administered weekly. In addition, “the tests were very demanding, and students were often short on time.” This course fulfills the Arts and Letters sector, as well as the Cross-Cultural Analysis requirement.", "num_students": 185, "path": "/courses/25824/sections/401/reviews/263-JOSEPH-A-FARRELL", "instructor": {"path": "/instructors/263-JOSEPH-A-FARRELL", "first_name": "JOSEPH A", "last_name": "FARRELL", "id": "263-JOSEPH-A-FARRELL", "name": "JOSEPH A FARRELL"}, "num_reviewers": 165, "id": "25824-401-263-JOSEPH-A-FARRELL"}]}, "credits": null, "primary_alias": "CLST-200", "path": "/courses/25824", "sections": {"path": "/courses/25824/sections", "values": [{"name": "GREEK & ROMAN MYTHOLOGY", "sectionnum": "401", "primary_alias": "CLST-200-401", "path": "/courses/25824/sections/401", "id": "25824-401", "aliases": ["CLST-200-401", "COML-200-401"]}]}, "id": 25824, "aliases": ["CLST-200", "COML-200"]}