{"coursehistories": {"path": "/coursehistories/3907"}, "description": "This lecture course and a companion laboratory course (MEAM 147) build upon the concepts of Newtonian (classical) mechanics and their application to engineered systems. This course introduces students to mechanical principles that are the foundation of upper-level engineering courses including MEAM 210 and 211. The three major parts of this course are: I. Vector Mechanics; II. Statics and Structures; and III. Kinematics and Dynamics. Topics include: vector analysis, statics of rigid bodies, introduction to deformable bodies, friction, kinematics of motion, work and energy, and dynamics of particles. Case studies will be introduced, and the role of Newtonian mechanics in emerging applications including bio- and nano- technologies will be discussed. \n\n", "semester": "2011C", "name": "INTRO TO MECHANICS", "reviews": {"path": "/courses/24714/reviews", "values": [{"ratings": {"rAmountLearned": "2.83", "rDifficulty": "2.48", "rStimulateInterest": "2.83", "rRecommendMajor": "3.67", "rCourseQuality": "2.79", "rWorkRequired": "2.95", "rInstructorAccess": "3.27", "rReadingsValue": "2.28", "rRecommendNonMajor": "1.95", "rCommAbility": "2.95", "rInstructorQuality": "2.98"}, "section": {"name": "INTRO TO MECHANICS", "sectionnum": "001", "primary_alias": "MEAM-110-001", "path": "/courses/24714/sections/001", "id": "24714-001", "aliases": ["MEAM-110-001"]}, "comments": "This lecture course and a companion laboratory course (MEAM 147) build upon\r\nthe concepts of Newtonian (classical) mechanics and their application to engineered\r\nsystems. This course introduces students to mechanical principles that are the foundation\r\nof upper-level engineering courses including MEAM 210 and 211. The course focuses\r\non vector mechanics; statics and structures; and kinematics and dynamics. Topics\r\ninclude vector analysis, statics of rigid bodies, introduction to deformable bodies,\r\nfriction, kinematics of motion, work and energy, and dynamics of particles.\r\nA student stated “The online homework seems like busy work, but the hand in\r\nproblems are a good indicator if what shows up on.” Students stated that this course\r\ntaught material very close to Physics 150 with an engineering focus, but students stated\r\nthat it was “easier and better” than Physics 150. Students stated the lab course reinforced\r\nthe material in this course quite well.\r\nStudents stated that Carpick was “engaging.” Students appreciated the numerous\r\nin-class demonstrations. Students stated that Carpick and all the TAs were very willing\r\nto help students help all the material. “Helpful” and “friendly” were two common\r\nadjectives to describe Carpick. A student stated, “The course is a lot of work, and it can\r\nbe challenging but the professors and TAs are there to make sure people do well and are\r\nalways available. They basically double the amount of office hours in the week before an\r\nexam, which is very helpful.”\r\nThis course is primarily meant for freshman engineers interested in pursuing a\r\nMechanical Engineering degree. Students definitely recommended that all engineers take\r\nthis course instead of Physics 150 if their major gives them the option.", "num_students": 69, "path": "/courses/24714/sections/001/reviews/4017-ROBERT-W--CARPICK", "instructor": {"path": "/instructors/4017-ROBERT-W--CARPICK", "first_name": "ROBERT W.", "last_name": "CARPICK", "id": "4017-ROBERT-W--CARPICK", "name": "ROBERT W. CARPICK"}, "num_reviewers": 66, "id": "24714-001-4017-ROBERT-W--CARPICK"}]}, "credits": null, "primary_alias": "MEAM-110", "path": "/courses/24714", "sections": {"path": "/courses/24714/sections", "values": [{"name": "INTRO TO MECHANICS", "sectionnum": "001", "primary_alias": "MEAM-110-001", "path": "/courses/24714/sections/001", "id": "24714-001", "aliases": ["MEAM-110-001"]}]}, "id": 24714, "aliases": ["MEAM-110"]}