{"coursehistories": {"path": "/coursehistories/4060"}, "description": "This lecture course will introduce students to a broad range of topics that fall under the heading of American health policy. Its main emphasis will be on the history of health care in America from the U.S. Civil War to the present day. Some of the themes addressed include: American public health movements and hospitals, private health insurance (such as Blue Cross/Blue Shield),industrial health and workmen's compensation, the welfare state (in Europe and the U.S.), women's health, especially maternal and infant care programs, Medicare/Medicaid, the Clinton Health Plan, injured soldiers and the Veterans Administration. \n\n", "semester": "2011A", "name": "AMERICAN HEALTH POLICY", "reviews": {"path": "/courses/21889/reviews", "values": [{"ratings": {"rAmountLearned": "3.10", "rDifficulty": "2.57", "rStimulateInterest": "2.76", "rRecommendMajor": "3.43", "rCourseQuality": "2.89", "rWorkRequired": "2.71", "rInstructorAccess": "2.86", "rReadingsValue": "2.68", "rRecommendNonMajor": "2.62", "rCommAbility": "3.12", "rInstructorQuality": "3.11"}, "section": {"name": "AMERICAN HEALTH POLICY", "sectionnum": "401", "primary_alias": "HSOC-150-401", "path": "/courses/21889/sections/401", "id": "21889-401", "aliases": ["HSOC-150-401", "SOCI-152-401"]}, "comments": "In “American Health Policy,” students are introduced to a broad range of topics falling under the heading of American health policy. The course emphasizes history of healthcare from the U.S. Civil War to the present day. Major themes addressed include: American public health movements and hospitals; private health insurance like Blue Cross; industrial health and workman’s compensation; the welfare state (in Europe and the U.S.); women’s health; Medicare/Medicaid; the Clinton Health Plan; injured soldiers; and the Veterans Administration.\r\n\r\nIn general, students felt that they learned a lot from both lecture and assigned readings. Coursework was described as “comprehensive,” “practical,” and “interesting.” Students valued the use of anecdotes and case studies as tools for teaching concepts.\r\n\r\nProfessor Linker received stellar reviews from all of her students. Many described her as “knowledgeable,” “insightful,” and “engaging.” Students remarked on her use of multimedia and humor to create a “light mood” that encouraged active discussion. Though every student considered Professor Linker’s teaching style suitable, there were frequent complaints about her relying on too much assigned reading. Additionally, she had trouble adequately covering all of the reading material during lecture.\r\n\r\nThe course is taken by all kinds of students, especially HSOC majors, and a large portion of the workload is attributed to assigned readings. The class has a midterm, final paper, and final exam. Students who keep up with the readings and partake in class discussions should expect to do well.\r\n", "num_students": 49, "path": "/courses/21889/sections/401/reviews/3990-BETH-LINKER", "instructor": {"path": "/instructors/3990-BETH-LINKER", "first_name": "BETH", "last_name": "LINKER", "id": "3990-BETH-LINKER", "name": "BETH LINKER"}, "num_reviewers": 46, "id": "21889-401-3990-BETH-LINKER"}]}, "credits": null, "primary_alias": "HSOC-150", "path": "/courses/21889", "sections": {"path": "/courses/21889/sections", "values": [{"name": "AMERICAN HEALTH POLICY", "sectionnum": "401", "primary_alias": "HSOC-150-401", "path": "/courses/21889/sections/401", "id": "21889-401", "aliases": ["HSOC-150-401", "SOCI-152-401"]}]}, "id": 21889, "aliases": ["HSOC-150", "SOCI-152"]}