{"coursehistories": {"path": "/coursehistories/2745"}, "description": "Techniques of modern astronomical observations, including: detection of light from the radio through gamma rays; sources of noise in astronomical measurements; image analysis and reduction techniques; telescope optics and adaptive optics; spectroscopic measurements; radio interferometry and spectroscopy. \n\n", "semester": "2011C", "name": "ASTROMETHODS&INSTRUMENTS", "reviews": {"path": "/courses/24022/reviews", "values": [{"ratings": {"rAmountLearned": "3.57", "rDifficulty": "3.00", "rStimulateInterest": "3.14", "rRecommendMajor": "4.00", "rCourseQuality": "3.43", "rWorkRequired": "2.57", "rInstructorAccess": "4.00", "rReadingsValue": "3.29", "rRecommendNonMajor": "0.43", "rCommAbility": "3.57", "rInstructorQuality": "3.71"}, "section": {"name": "ASTROMETHODS&INSTRUMENTS", "sectionnum": "001", "primary_alias": "ASTR-503-001", "path": "/courses/24022/sections/001", "id": "24022-001", "aliases": ["ASTR-503-001"]}, "comments": "In this course students learn a modern object-oriented programming language;\r\ntechniques for producing reliable, reusable, and efficient code; and some algorithms that\r\nare ubiquitous in numerical solutions of problems in astronomy and physics, such as\r\nnumerical integration, matrix operations, fast Fourier transforms, and model-fitting. By\r\nthe end of the semester, students should have the skills and knowledge to solve the\r\nnumerical problems that arise in their own research.\r\nStudent’s found the material in the class to be quite useful in solidifying there\r\nunderstanding of astronomy at a practice level. They believed the course was well\r\ndesigned and executed. Student’s got a good overview of instruments and analysis\r\ntechniques.\r\nOne student said, “Dr. Bernstein is among the most organized, straightforward\r\nprofessors I've had. He clearly has taken a ton of time to prepare his course materials and\r\nmakes great effort to present them in a logical manner for students to understand. He\r\nalso does a really good job of making himself available outside of class to answer\r\nquestions about homework, and the problems he gives us are always comprehensive and\r\ninstructive.”\r\nStudents’ recommend the course anyone doing work in instrumentation. The\r\nProfessor will not assume previous experience with any programming language.\r\n*Based on 6 student reviews", "num_students": 9, "path": "/courses/24022/sections/001/reviews/2060-GARY-M--BERNSTEIN", "instructor": {"path": "/instructors/2060-GARY-M--BERNSTEIN", "first_name": "GARY M.", "last_name": "BERNSTEIN", "id": "2060-GARY-M--BERNSTEIN", "name": "GARY M. BERNSTEIN"}, "num_reviewers": 7, "id": "24022-001-2060-GARY-M--BERNSTEIN"}]}, "credits": null, "primary_alias": "ASTR-503", "path": "/courses/24022", "sections": {"path": "/courses/24022/sections", "values": [{"name": "ASTROMETHODS&INSTRUMENTS", "sectionnum": "001", "primary_alias": "ASTR-503-001", "path": "/courses/24022/sections/001", "id": "24022-001", "aliases": ["ASTR-503-001"]}]}, "id": 24022, "aliases": ["ASTR-503"]}