{"coursehistories": {"path": "/coursehistories/2659"}, "description": "What we call \"economics\" was originally part of a larger science, the queen of the sciences: the study of politics. Constitutions, laws, governments, citizenship, war, peace, prosperity and poverty - all these were dimensions of an inquiry into what is necessary and useful to the good life of mankind. Indeed the English phase political economy translates two Greek words /oikos/ or \" house\" and /nomos / \"law\". In this course we will be concerned with texts in political economy from the early 18th century to the recent past. Our purpose is the interrogation of those along three dimensions: the constitutive intellectual parts of a science of profit and loss; the relation of such a science to moral questions; and finally the effects of economics as an ideology on the polit ical constitutions of our time. \n\nOriginally optimistic, its foundations were challenged in the 19th century by reactionary pessimism and radical critique but in the last decade of the 20th century, the collapse of soviet communism seemed to confirm what neo-liberals had long proclaimed: the supremacy of market economies and the universal denominator of money, or exchange, value. The benefits of global markets were expected by some to dispel the very sources of conflict among peoples and states, and enthusiasts even proclaimed \"the end of history\". That brief period is now behind us and we confront a new pluralism of beliefs and opinion about what is \"valuable\" that challenges the central tenets of western political discourse. \n\n", "semester": "2004C", "name": "MONEY AND MARKETS", "reviews": {"path": "/courses/5787/reviews", "values": [{"ratings": {"rAmountLearned": "2.50", "rDifficulty": "2.52", "rStimulateInterest": "2.56", "rRecommendMajor": "2.96", "rCourseQuality": "2.67", "rWorkRequired": "2.11", "rInstructorAccess": "2.85", "rReadingsValue": "3.00", "rRecommendNonMajor": "2.11", "rCommAbility": "2.96", "rInstructorQuality": "2.96"}, "section": {"name": "MONEY AND MARKETS", "sectionnum": "001", "primary_alias": "PSCI-186-001", "path": "/courses/5787/sections/001", "id": "5787-001", "aliases": ["PSCI-186-001"]}, "comments": "", "num_students": 33, "path": "/courses/5787/sections/001/reviews/265-ELLEN-LEE-KENNEDY", "instructor": {"path": "/instructors/265-ELLEN-LEE-KENNEDY", "first_name": "ELLEN LEE", "last_name": "KENNEDY", "id": "265-ELLEN-LEE-KENNEDY", "name": "ELLEN LEE KENNEDY"}, "num_reviewers": 27, "id": "5787-001-265-ELLEN-LEE-KENNEDY"}]}, "credits": null, "primary_alias": "PSCI-186", "path": "/courses/5787", "sections": {"path": "/courses/5787/sections", "values": [{"name": "MONEY AND MARKETS", "sectionnum": "001", "primary_alias": "PSCI-186-001", "path": "/courses/5787/sections/001", "id": "5787-001", "aliases": ["PSCI-186-001"]}]}, "id": 5787, "aliases": ["PSCI-186"]}