[{"ratings": {"rAmountLearned": "2.61", "rDifficulty": "2.37", "rStimulateInterest": "2.82", "rRecommendMajor": "3.38", "rCourseQuality": "2.80", "rWorkRequired": "2.49", "rInstructorAccess": "3.45", "rReadingsValue": "2.61", "rRecommendNonMajor": "2.75", "rCommAbility": "3.47", "rInstructorQuality": "3.28"}, "section": {"name": "HIST OF SEXUALITY IN US", "sectionnum": "401", "primary_alias": "HIST-349-401", "path": "/courses/26213/sections/401", "id": "26213-401", "aliases": ["HIST-349-401", "GSOC-349-401"]}, "comments": "This course focuses on the history of sexuality in the U.S. It explores the past to consider why sexuality has been so central to American identities, culture, and politics. Primary documents and other readings focus on the history of sexual ideology and regulation; popular culture and changing sexual practices; the emergence of distinct sexual identities and communities; the politics of sexuality; and the relationship between sexual and other forms of social difference, such as gender, race, ethnicity, age, and class. The topic covered are relevant to current political debate, among them: sexual representation and censorship, sexual violence, adolescent sexuality, the politics of reproduction, gay and lesbian sexualities and sexually transmitted diseases. The literature to be read in this course includes: Kathy Peiss, Major Problems in the History of American Sexuality; Harriet Jacobs, Incidents in the Life of a Slave Girl; Andrew Tone, Devices & Desires: A History of Contraceptives in America; Gay New York: Gender, George Chauncey Urban Culture and the Making of the Gay Male World, 1890-1940; Janice Irvine, Talk About Sex. The critical assessments for this course include two essays, each worth 20% of the final grade, a primary document paper worth 35% and a take-home exam in an essay question format worth 25%. \r\n\r\nThere were mixed reviews over this course, however many students thought the “content is very interesting” but thought the “class discussions seemed dull” and the material “could have been conveyed in a more interesting way.” Some students did really enjoy the class and thought the use of film and popular culture was fascinating. Overall, the students enjoyed the class but were not satisfied with class discussions, yet they agreed that they were “provided with a new understanding of sexuality.”\r\n\r\nThe students agree that Professor Peiss “is a great teacher” and was “glad to answer questions” and was “extremely accessible.” They thought Professor Peiss was “very passionate about the subject” but thought she should “make the lecture time more interactive” and engaging.\r\n\r\nStudents commented that “there is a fair amount of work,” even considered a “ridiculous” amount by a few, but the assignments were “engaging” and “original.” The “entire course grade is based on four papers,” said one student.\r\n", "num_students": 71, "path": "/courses/26213/sections/401/reviews/650-KATHY-PEISS", "instructor": {"path": "/instructors/650-KATHY-PEISS", "first_name": "KATHY", "last_name": "PEISS", "id": "650-KATHY-PEISS", "name": "KATHY PEISS"}, "num_reviewers": 66, "id": "26213-401-650-KATHY-PEISS"}]