[{"ratings": {"rAmountLearned": "3.01", "rDifficulty": "2.16", "rStimulateInterest": "3.30", "rRecommendMajor": "3.54", "rCourseQuality": "3.08", "rWorkRequired": "2.17", "rInstructorAccess": "3.01", "rReadingsValue": "2.71", "rRecommendNonMajor": "3.04", "rCommAbility": "3.50", "rInstructorQuality": "3.45"}, "section": {"name": "TECHNOLOGY & SOCIETY", "sectionnum": "401", "primary_alias": "STSC-003-401", "path": "/courses/26820/sections/401", "id": "26820-401", "aliases": ["STSC-003-401", "HSOC-003-401", "SOCI-033-401"]}, "comments": "From the colonial period to the present, Americans have relied on technology to shape their lives, landscapes and society. This unique, abiding and often tumultuous relationship is one of the defining elements of the American experience. From factory floor to suburban kitchens, from eccentric inventors to student demonstrators, from Model T to iMacs, the diversity of American technological developments reflects -- and has helped define -- the most crucial developments in American history. This course will provide a historical understanding of the role that technology has played in American society from the late 19th century to the present day. The underlying assumption is that technology is simultaneously a reflection and cultural values, and a factor (one of many) in shaping the continuous development of those values.\r\n\r\nMany students found the subject matter of this class to be very interesting. While they noted that the course could often become somewhat “dull,” many also said that material learned from this class will change their perspective of the “relationship between people and the technology they use.” In addition, students said that they foresee being able to discuss concepts from this course in conversation. Many said that it was important to know that this course is history-based, and not as much focused on modern day technology.\r\n\r\nStudents said Professor Ensminger was a great lecturer overall. Some students complained that he “did not seem to want to discuss the course outside of class” and that his lectures sometimes grew tedious. Others thought that his “unique lecturing style was particularly effective” and that he was overall “articulate.” Some warned that he speaks very quickly, so a laptop is usually necessary for note-taking, and since there is no textbook for the course, you have to attend lecture and pay attention. Professor Ensminger is an especially good lecturer “when he [discusses] his area of expertise (computers).”\r\n\r\nMany students complained about the grading system in this class and that the “exams were far too specific to be fair.” They said that there was an overwhelming amount of reading and that it was impossible to read all of it, so students were forced to pick which information to learn. One student reported that “the curve made it hard to enjoy the course.”\r\n", "num_students": 163, "path": "/courses/26820/sections/401/reviews/664-NATHAN-ENSMENGER", "instructor": {"path": "/instructors/664-NATHAN-ENSMENGER", "first_name": "NATHAN", "last_name": "ENSMENGER", "id": "664-NATHAN-ENSMENGER", "name": "NATHAN ENSMENGER"}, "num_reviewers": 151, "id": "26820-401-664-NATHAN-ENSMENGER"}]