{"coursehistories": {"path": "/coursehistories/2527"}, "description": "This course will provide an introduction to modern Irish literature, focusing on the tension between Ireland's violent history and its heroic mythology. This tension leaves its mark not only on the ravaged landscape, but also on the English language, which displays its \"foreignness\" most strongly in the hands of Irish writers. Readings will span the genres of poetry, drama, fiction, and history, and will include works by Sommerville and Ross, Yeats, George Moore, Joyce, Synge, O'Casey, Beckett, Edna O'Brien, and Brian Friel. \n\nSee the English Department's website at www.english.upenn.edu for a description of the current offerings. \n\n", "semester": "2009A", "name": "IRISH LITERATURE", "reviews": {"path": "/courses/15612/reviews", "values": [{"ratings": {"rAmountLearned": "3.43", "rDifficulty": "2.57", "rStimulateInterest": "3.76", "rRecommendMajor": "3.76", "rCourseQuality": "3.76", "rWorkRequired": "2.76", "rInstructorAccess": "3.81", "rReadingsValue": "3.67", "rRecommendNonMajor": "3.05", "rCommAbility": "3.57", "rInstructorQuality": "3.71"}, "section": {"name": "IRISH LITERATURE", "sectionnum": "001", "primary_alias": "ENGL-058-001", "path": "/courses/15612/sections/001", "id": "15612-001", "aliases": ["ENGL-058-001"]}, "comments": "This course is an introduction to modern Irish literature, beginning with the Celtic Revival of the early 1900s. The class focuses on several key topics: literature and nationalism, language and territory, gender and tradition, art and violence, and sexuality and citizenship. Special attention is paid to the contrast of Ireland’s violent history and its heroic mythology. Students will read books and poetry by Yeats, Joyce, O’Casey, Friel, Synge, etc.\r\nAlthough students found the work for the class to be demanding, they also claimed to have learned a lot about Irish history and writing. Students also admitted to finding a “great[er] appreciation for poetry.” The class was described as the “perfect balance of open debate and focused lecture.”\r\nStudents described Professor Esty as “entertaining” and “funny.” He set the bar high for his students and encouraged them to write essays on unfamiliar topics so that they could explore them further. Students also appreciated the way Professor Esty welcomed and valued each student’s intellectual input.\r\nMany students recommended this class to both English and non-English majors as a good introductory English class. They felt that they always came to class excited to learn.", "num_students": 22, "path": "/courses/15612/sections/001/reviews/4304-JOSHUA-ESTY", "instructor": {"path": "/instructors/4304-JOSHUA-ESTY", "first_name": "JOSHUA", "last_name": "ESTY", "id": "4304-JOSHUA-ESTY", "name": "JOSHUA ESTY"}, "num_reviewers": 21, "id": "15612-001-4304-JOSHUA-ESTY"}]}, "credits": null, "primary_alias": "ENGL-058", "path": "/courses/15612", "sections": {"path": "/courses/15612/sections", "values": [{"name": "IRISH LITERATURE", "sectionnum": "001", "primary_alias": "ENGL-058-001", "path": "/courses/15612/sections/001", "id": "15612-001", "aliases": ["ENGL-058-001"]}]}, "id": 15612, "aliases": ["ENGL-058"]}