[{"ratings": {"rAmountLearned": "2.91", "rDifficulty": "2.02", "rStimulateInterest": "3.37", "rRecommendMajor": "3.37", "rCourseQuality": "3.23", "rWorkRequired": "2.36", "rInstructorAccess": "3.44", "rReadingsValue": "2.69", "rRecommendNonMajor": "3.21", "rCommAbility": "3.56", "rInstructorQuality": "3.58"}, "section": {"name": "EAST/WEST:MDRN WRLD HIST: East&West: A Hitchhiker's Guide to the Cultural History of the Modern World", "sectionnum": "401", "primary_alias": "SAST-063-401", "path": "/courses/28126/sections/401", "id": "28126-401", "aliases": ["SAST-063-401", "ANTH-063-401", "HIST-087-401"]}, "comments": "Sugar and Spices.  Tea and Coffee.  Opium and Cocaine.  Hop aboard the Indian Ocean dhows, Chinese junks, Dutch schooners, and British and American clipper ships that made possible the rise of global capitalism, new colonial relationships, and the intensified forms of cultural change.  How have the desires to possess and consume particular commodities shaped cultures and the course of modern history?  This class introduces students to the cultural history of the modern world through an interdisciplinary analysis of connections between East and West, South and North.  Following the circulation of commodities and the development of modern capitalism, the course examines the impact of global exchange on interactions and relationships between regions, nations, cultures, and peoples and the influences on cultural practices and meanings.  The role of slavery and labor migrations, colonial and imperial relations, and struggles for economic and political independence are also considered. From the role of spices in the formation of European joint stock companies circa 1600 to the contemporary cocaine trade, the course's use of both original primary sources and secondary readings written by historians and anthropologists will enable particular attention to the ways that global trade has impacted social, cultural, and political formations and practices throughout the world. Recitation will not meet every week.  Lecture sessions will be shortened those weeks that recitations are held.\r\n\r\n\tStudents loved this “immensely interesting” class, with many calling it one of their favorite courses at Penn. Described as “a wonderful synthesis between different schools of thinking,” students appreciated the amount of material covered, with one student “truly shocked by how much [he/she] learned from this course.” There were several long but “well-selected” reading assignments, and most students felt the engaging lectures and course content made the readings manageable.\r\n\r\n\tProfessor Mitchell received raves from her students, and was described as “fantastic,” “incredibly engaging,” and “brilliant.” Students loved her ability to “make every single lecture interesting and informative” as well as her attention to student concerns about the workload. Many students praised her enthusiasm and dedication to the subject. Several students attributed the course’s success to Mitchell’s “terrific” teaching style, with many claiming she is “one of the most incredible lecturers” at Penn.\r\n\r\n\tWhile the workload for the course was oftentimes heavy, with several readings, many appreciated Professor Mitchell making “it very clear as to what big picture topics [they] should know by the end of it all.” The one major criticism of the course concerned a voiceover PowerPoint project, with students complaining about the difficulty of using the technology. Though many students took the class to fulfill the Humanities and Social Sciences sector, the interesting course content and professor made it well worth taking, with one student saying they were “so glad I stumbled upon it.” This course is recommended for both History and South Asian Studies majors as well as non-majors who have not yet taken a history course at Penn.", "num_students": 114, "path": "/courses/28126/sections/401/reviews/4096-LISA-MITCHELL", "instructor": {"path": "/instructors/4096-LISA-MITCHELL", "first_name": "LISA", "last_name": "MITCHELL", "id": "4096-LISA-MITCHELL", "name": "LISA MITCHELL"}, "num_reviewers": 105, "id": "28126-401-4096-LISA-MITCHELL"}]