{"coursehistories": {"path": "/coursehistories/872"}, "description": "This is an introductory course in modern political philosophy. Political philosophy addresses the justification and legitimate purposes of political power; the basic rights of individuals; the justification of property; capitalism vs. socialism vs. the welfare state; economic justice and the fair distribution of income and wealth; the constitutional requirements of a democracy; and the meaning of the freedom and equality of citizens. These are the kinds of questions we will investigate. The course is organized around the social contract tradition in political philosophy and the utilitarian response to it. Our primary focus is the works of the major social contract philosophers--Thomas Hobbes, John Locke, Jean Jacques Rousseau, and John Rawls--and the major utilitarian philosophers--David Hume, Adam Smith, Jeremy Benthams, and John Stuart Mill. Karl Marx is discussed as a critic of capitalism and constitutional democracy. \n\n", "semester": "2010A", "name": "THE SOCIAL CONTRACT", "reviews": {"path": "/courses/26597/reviews", "values": [{"ratings": {"rAmountLearned": "2.75", "rDifficulty": "2.63", "rStimulateInterest": "1.78", "rRecommendMajor": "3.31", "rCourseQuality": "2.48", "rWorkRequired": "2.51", "rInstructorAccess": "2.54", "rReadingsValue": "2.75", "rRecommendNonMajor": "1.94", "rCommAbility": "2.33", "rInstructorQuality": "2.29"}, "section": {"name": "THE SOCIAL CONTRACT", "sectionnum": "401", "primary_alias": "PHIL-008-401", "path": "/courses/26597/sections/401", "id": "26597-401", "aliases": ["PHIL-008-401", "PPE-008-401"]}, "comments": "This course examined the history and significance of social contract doctrine for modern social and political thought. In particular, students studied the works of Thomas Hobbes, John Locke, and Rousseau, and of utilitarian critics of social contract doctrine, namely David Hume, Adam Smith, J.S. Mill, and Karl Marx. This course thus serves as an introduction to many of the major figures in modern political philosophy.\r\n\r\nIn terms of the class structure, students’ responses were mixed. While some students stated that the slides shown in class were “not very informative,” some students found them useful. Because the slides were not available on blackboard, some students spent more time “copying what was on the slides than absorbing the materials in class.” Overall, students still found the class “rewarding and useful.”\r\n\r\nStudents described Professor Tan as “knowledgeable” and “thoughtful.” According to students, he paused in class to allow time for questions, and “he took time to learn the names of the participating students in the 100+ class.” His passion for teaching was clear to many students as well. However, students commented that there were some communication problems in class, especially due to his “soft-spoken nature” and the tendency to be “slightly monotone at times.”\r\n\r\nMany students found the workload for the class to be “manageable and reasonable.” Paper questions were also “very fair.” Stating that this course teaches “theories and ideas that everyone should be exposed to,” students recommended this course to everyone who is interested in taking a philosophy class.", "num_students": 97, "path": "/courses/26597/sections/401/reviews/1660-KOK-CHOR-TAN", "instructor": {"path": "/instructors/1660-KOK-CHOR-TAN", "first_name": "KOK-CHOR", "last_name": "TAN", "id": "1660-KOK-CHOR-TAN", "name": "KOK-CHOR TAN"}, "num_reviewers": 86, "id": "26597-401-1660-KOK-CHOR-TAN"}]}, "credits": null, "primary_alias": "PHIL-008", "path": "/courses/26597", "sections": {"path": "/courses/26597/sections", "values": [{"name": "THE SOCIAL CONTRACT", "sectionnum": "401", "primary_alias": "PHIL-008-401", "path": "/courses/26597/sections/401", "id": "26597-401", "aliases": ["PHIL-008-401", "PPE-008-401"]}]}, "id": 26597, "aliases": ["PHIL-008", "PPE-008"]}