{"coursehistories": {"path": "/coursehistories/1194"}, "description": "An introduction to the diversity of cultures in the world. This course is divided into two parts. The first briefly examines different models of understanding human diversity: ethnicities, religions, languages, political forms, economic structures, cultures, and \"civilizations\". Students will learn to think about the world as an interconnected whole, and know the significance of culture on a global scale. The second part is an introduction to area studies, in which we undertake a survey of the different regions of theworld. We conduct the survey paying attention to the different aspects of human diversities, which we examine in the first part of this course. Students will acquire a greater appreciation and understanding of cultural differences in the more comprehensive social context. \n\n", "semester": "2009A", "name": "MDRN WRLD - CLTRL BKGND", "reviews": {"path": "/courses/15306/reviews", "values": [{"ratings": {"rAmountLearned": "2.24", "rDifficulty": "2.00", "rStimulateInterest": "1.40", "rRecommendMajor": "2.93", "rCourseQuality": "1.96", "rWorkRequired": "2.43", "rInstructorAccess": "2.14", "rReadingsValue": "2.62", "rRecommendNonMajor": "2.10", "rCommAbility": "1.88", "rInstructorQuality": "1.79"}, "section": {"name": "MDRN WRLD - CLTRL BKGND", "sectionnum": "001", "primary_alias": "ANTH-004-001", "path": "/courses/15306/sections/001", "id": "15306-001", "aliases": ["ANTH-004-001"]}, "comments": "This course is an introduction to the diversity of cultures in the world. It is divided into two parts; The first briefly examines different models of understanding human diversity: ethnicity, religions, languages, political forms, economic structures, cultures, and civilizations. Students will learn to think about the world as an interconnected whole, and know the significance of culture on a global scale. The second part is an introduction to area studies where students survey a certain part of the world. The survey pays attention to the different aspects of human diversities examined during the first part of the course. Students will acquire a greater appreciation and understanding of cultural differences in the more comprehensive social context.\r\n\r\nStudents reviews on this course were mixed. Some found the course fascinating and appreciated the focus on Asian cultures. Others described the material covered as “self-taught…Professor Kim provides a superficial summary of key points and trends in lecture, while much of the material is learned through the well-chosen but much more insightful readings assigned.” Several called the lectures dry saying that the material was “incredibly interesting” but the “presentation was lacking.”\r\n\r\nProfessor Kim was considered slightly \"dry,\" but\r\nmost said he was fair and knew a lot of about this course and area of study.\r\n\r\nStudents mentioned that there was a lot of reading for this course, and that the location at the Penn museum was very inconvenient. However, the professor put up slides after every class and the midterms were straightforward.", "num_students": 53, "path": "/courses/15306/sections/001/reviews/4238-JAESOK-KIM", "instructor": {"path": "/instructors/4238-JAESOK-KIM", "first_name": "JAESOK", "last_name": "KIM", "id": "4238-JAESOK-KIM", "name": "JAESOK KIM"}, "num_reviewers": 52, "id": "15306-001-4238-JAESOK-KIM"}]}, "credits": null, "primary_alias": "ANTH-004", "path": "/courses/15306", "sections": {"path": "/courses/15306/sections", "values": [{"name": "MDRN WRLD - CLTRL BKGND", "sectionnum": "001", "primary_alias": "ANTH-004-001", "path": "/courses/15306/sections/001", "id": "15306-001", "aliases": ["ANTH-004-001"]}]}, "id": 15306, "aliases": ["ANTH-004"]}