[{"ratings": {"rAmountLearned": "1.85", "rDifficulty": "2.08", "rStimulateInterest": "1.27", "rRecommendMajor": "1.92", "rCourseQuality": "1.69", "rWorkRequired": "2.58", "rInstructorAccess": "2.19", "rReadingsValue": "1.92", "rRecommendNonMajor": "1.27", "rCommAbility": "1.38", "rInstructorQuality": "1.30"}, "section": {"name": "PRINCIPLES OF ADVERTISNG", "sectionnum": "001", "primary_alias": "MKTG-235-001", "path": "/courses/16111/sections/001", "id": "16111-001", "aliases": ["MKTG-235-001"]}, "comments": "MKTG235 will concentrate on concepts and theories of advertising as they apply to the strategic decisions of an advertising or brand manager. Emphasis will be placed on product positioning, the communication process, and the measurement and evaluation of advertising effects.\r\n\r\nStudents felt the course lacked a “solid structure” and had an unclear focus. Some felt the course was too focused on what the course materials were, stating that “any questions that are not directly related to the studies the professor found are not answered.”\r\n\r\nSome students felt that Professor Armstrong was confusing and did not allow students to “think critically” about the material. Others felt that he was very available to the students and offered an “eccentric take on the world of advertising.”\r\n\r\nMany students felt the assignments were very limited and confusing at times. In addition, one student said that “a lot of group work sneaks up on you.” The class requires several individual written assignments and an advertising plan for a new or existing product. This class was neither strongly recommended nor discouraged to both majors and non-majors.", "num_students": 29, "path": "/courses/16111/sections/001/reviews/1615-J--SCOTT-ARMSTRONG", "instructor": {"path": "/instructors/1615-J--SCOTT-ARMSTRONG", "first_name": "J. SCOTT", "last_name": "ARMSTRONG", "id": "1615-J--SCOTT-ARMSTRONG", "name": "J. SCOTT ARMSTRONG"}, "num_reviewers": 28, "id": "16111-001-1615-J--SCOTT-ARMSTRONG"}, {"ratings": {"rAmountLearned": "3.10", "rDifficulty": "2.18", "rStimulateInterest": "3.57", "rRecommendMajor": "3.76", "rCourseQuality": "3.31", "rWorkRequired": "2.47", "rInstructorAccess": "3.31", "rReadingsValue": "2.29", "rRecommendNonMajor": "3.14", "rCommAbility": "3.55", "rInstructorQuality": "3.59"}, "section": {"name": "PRINCIPLES OF ADVERTISNG", "sectionnum": "002", "primary_alias": "MKTG-235-002", "path": "/courses/16111/sections/002", "id": "16111-002", "aliases": ["MKTG-235-002"]}, "comments": "This course focuses on management’s use of advertising in the marketing mix. Concepts and theories that apply to the decisions brand or advertising managers face will be addressed in depth. Product positioning, the communication process, and metrics for evaluating advertisements’ success will also be covered thoroughly.\r\n\r\nThis class was widely enjoyed. Many of the students found it to be a “great class” and would “highly-recommend it.” The only complaint was that the undefined scope of the course led to it being a little too broad.\r\n\r\nProfessor Williams was extremely well-liked with very few negative comments. Several students said that Professor Williams was “the best they’ve had at Penn.”\r\n\r\nStudents liked having a large final project instead of a final exam and appreciated that it “applied what we’ve learned to a real business.” Students were also impressed with other projects in their “creativity and quality of work.”", "num_students": 52, "path": "/courses/16111/sections/002/reviews/1617-PATTI-WILLIAMS", "instructor": {"path": "/instructors/1617-PATTI-WILLIAMS", "first_name": "PATTI", "last_name": "WILLIAMS", "id": "1617-PATTI-WILLIAMS", "name": "PATTI WILLIAMS"}, "num_reviewers": 52, "id": "16111-002-1617-PATTI-WILLIAMS"}]