{"coursehistories": {"path": "/coursehistories/107"}, "description": "The Roman Empire was one of the few great world states-one that unified a large area around the Mediterranean Sea-an area never subsequently united as part of a single state. Whereas the great achievements of the Greeks were in the realm of ideas and concepts (democracy, philosophy, art, literature, drama) those of the Romans tended to be in the pragmatic spheres of ruling and controlling subject peoples and integrating them under the aegis of an imperial state. Conquest, warfare, administration, and law making were the great successes of the Roman state. We will look at this process from its inception and trace the formation of Rome's Mediterranean empire over the last three centuries BC; we shall then consider the social, economic and political consequences of this great achievement, especially the great political transition from the Republic (rule by the Senate) to the Principate (rule by emperors). We shall also consider limitations to Roman power and various types of challenges, military, cultural, and religious, to the hegemony of the Roman state. Finally, we shall try to understand the process of the development of a distinctive Roman culture from the emergence new forms of literature, like satire, to the gladiatorial arena as typical elements that contributed to a Roman social order. \n\n", "semester": "2008A", "name": "ANCIENT ROME", "reviews": {"path": "/courses/19726/reviews", "values": [{"ratings": {"rAmountLearned": "2.75", "rDifficulty": "2.66", "rStimulateInterest": "2.78", "rRecommendMajor": "3.31", "rCourseQuality": "2.84", "rWorkRequired": "2.88", "rInstructorAccess": "2.59", "rReadingsValue": "2.80", "rRecommendNonMajor": "2.26", "rCommAbility": "3.07", "rInstructorQuality": "3.21"}, "section": {"name": "ANCIENT ROME", "sectionnum": "401", "primary_alias": "ANCH-027-401", "path": "/courses/19726/sections/401", "id": "19726-401", "aliases": ["ANCH-027-401", "HIST-027-401"]}, "comments": "The Roman Empire was unique in that although it unified many Mediterranean territories, these territories never formed a cohesive Roman state. The ancient Greeks were renowned for their accomplishments in disciplines such as democracy, philosophy, art, literature and drama. Contrastingly, the ancient Romans focused more on ruling their expansive empire and maintaining their imperialist grasp in the Mediterranean region of the world. This course examines the conquests, military campaigns, and decrees of the ancient Roman civilization from the year 300 B.C. to 0. Further topics include the socioeconomic and sociopolitical ramifications of ruling such an expansive empire as well as the transformation of the Roman Republic (Senate rule) into the Principate (emperor rule). The military, cultural, and political limits of Roman rule are also examined. Furthermore, the course examines the inception and evolution of a distinctive Roman culture, namely novel forms of literature (such as satire) and entertainment such as the gladiatorial arena.     \r\n\r\nSome students remarked that the Power Points in lecture were hard to follow and occasionally included superfluous information that made the course “dry.” One student mentioned that they would have liked Professor Grey to “talk more about the end of the empire.” One student claimed that the course “seemed to require background knowledge that was advanced for an introductory course.” Similarly, another student mentioned “for an introductory history course, I felt that there was too much time spent analyzing literary tradition.”\r\n\r\nStudents praised Professor Grey for his “articulate” communication style and engaging lectures. Another student stated that Professor Grey’s “preparation for class was unparalleled” and that he was unequivocally “the most dynamic professor in my 4 years at Penn.” In separate instances, students mentioned that the course was “well taught” and that Professor Grey “really knew what he was talking about.” In a comparison to the Roman orator Tacitus, one student stated the Grey was “an oratorical expert.”  However, one student mentioned that Professor Grey could have interacted more with the lecture audience and that some students felt “removed.” \r\n\r\nStudents stated that the assigned readings were both “useful” and “manageable”, and that the midterm was “fair.”", "num_students": 136, "path": "/courses/19726/sections/401/reviews/2844-CAMPBELL-AINSWORTH-GREY", "instructor": {"path": "/instructors/2844-CAMPBELL-AINSWORTH-GREY", "first_name": "CAMPBELL AINSWORTH", "last_name": "GREY", "id": "2844-CAMPBELL-AINSWORTH-GREY", "name": "CAMPBELL AINSWORTH GREY"}, "num_reviewers": 98, "id": "19726-401-2844-CAMPBELL-AINSWORTH-GREY"}]}, "credits": null, "primary_alias": "ANCH-027", "path": "/courses/19726", "sections": {"path": "/courses/19726/sections", "values": [{"name": "ANCIENT ROME", "sectionnum": "401", "primary_alias": "ANCH-027-401", "path": "/courses/19726/sections/401", "id": "19726-401", "aliases": ["ANCH-027-401", "HIST-027-401"]}]}, "id": 19726, "aliases": ["ANCH-027", "HIST-027"]}