{"coursehistories": {"path": "/coursehistories/2551"}, "description": "Model Building and Linear Programming: Graphical Methods and The Simplex Method, the LINDO and LINGO Computer Packages, Degeneracies, Minimization and the BigM and the Two-Phase Methods, and Goal Programming. Sensitivity Analysis: Geometric and Algebraic Approaches, The Computer and Sensitivity Analysis, The Dual of An LP Problem, The Dual Theorem, Shadow Prices, Complementary Slackness, The Dual Simplex Method, and The Revised Simplex Method. Integer Programming: The Branch and Bound Method, Enumeration Methods, and the Cutting Plane Method. Nonlinear Programming: Review of Differential Calculus, Convex and Concave Functions, Solving NLP Problems with One Variable, Uncontraint Nonlinear Optimization with Several Variables, Lagrange Multipliers and Constraint Nonlinear Optimization with Several Variables, The Kuhn-Tucker Conditions and Quadratic Programming. \n\n", "semester": "2009A", "name": "OPTIMIZATION OF SYSTEMS", "reviews": {"path": "/courses/15703/reviews", "values": [{"ratings": {"rAmountLearned": "2.25", "rDifficulty": "2.13", "rStimulateInterest": "1.06", "rRecommendMajor": "3.00", "rCourseQuality": "2.08", "rWorkRequired": "2.25", "rInstructorAccess": "3.38", "rReadingsValue": "3.00", "rRecommendNonMajor": "1.31", "rCommAbility": "2.22", "rInstructorQuality": "2.14"}, "section": {"name": "OPTIMIZATION OF SYSTEMS", "sectionnum": "001", "primary_alias": "ESE-304-001", "path": "/courses/15703/sections/001", "id": "15703-001", "aliases": ["ESE-304-001"]}, "comments": "Model Building and Linear Programming: Graphical Methods and The Simplex Method, the LINDO and LINGO Computer Packages, Degeneracies, Minimization and the Big M and the two-Phase Methods, and Goal Programming. Sensitivity Analysis: Geometric and Algebraic Approaches, the Computer and Sensitivity Analysis. The Dual of an LP Problem, the Dual Theorem, Shadow Prices, Complementary Slackness, the Dual Simplex Method, and the Revised Simplex Method. Integer Programming: the Branch and Bound Method, Enumeration Methods, and the Cutting Plane Method. Nonlinear Programming: Review of Differential Calculus, Convex and Concave Functions, Solving NLP Problems with One Variable, Unconstraint Nonlinear Optimization with Several Variables, Lagrange Multipliers and Constraint Nonlinear Optimization with Several Variables, the Kuhn-Tucker Conditions and Quadratic Programming.\r\n\r\nStudents generally found the course to be extremely useful and engaging, even stating that “no changes” ought to be made to the course in the future. Many students felt that they learned real life applications of conceptual ideas in class, though time was dedicated to only a few core examples rather than multiple case studies.\r\n\r\nMany students praised Dr. Carchidi’s availability, approachability, and comprehensiveness, especially in his notes. Students cited Dr. Carchidi as having particularly plentiful office hours and creating excellent notes that at times “served to replace the text.” Students did, however, express that lectures seemed to be presentations of the notes, rather than going beyond the already comprehensive notes.\r\n\r\nSome students, all of whom seem to have been in ESE, felt that the course was conceptually difficult, but that the homeworks paralleled the exams. Students found the class engaging and fairly graded.", "num_students": 37, "path": "/courses/15703/sections/001/reviews/774-MICHAEL-A--CARCHIDI", "instructor": {"path": "/instructors/774-MICHAEL-A--CARCHIDI", "first_name": "MICHAEL A.", "last_name": "CARCHIDI", "id": "774-MICHAEL-A--CARCHIDI", "name": "MICHAEL A. CARCHIDI"}, "num_reviewers": 37, "id": "15703-001-774-MICHAEL-A--CARCHIDI"}]}, "credits": null, "primary_alias": "ESE-304", "path": "/courses/15703", "sections": {"path": "/courses/15703/sections", "values": [{"name": "OPTIMIZATION OF SYSTEMS", "sectionnum": "001", "primary_alias": "ESE-304-001", "path": "/courses/15703/sections/001", "id": "15703-001", "aliases": ["ESE-304-001"]}]}, "id": 15703, "aliases": ["ESE-304"]}