[{"ratings": {"rAmountLearned": "3.65", "rDifficulty": "2.52", "rStimulateInterest": "3.62", "rRecommendMajor": "3.49", "rCourseQuality": "3.56", "rWorkRequired": "3.43", "rInstructorAccess": "2.89", "rReadingsValue": "3.65", "rRecommendNonMajor": "3.41", "rCommAbility": "3.66", "rInstructorQuality": "3.66"}, "section": {"name": "ENG ENTREPRENEURSHIP I", "sectionnum": "401", "primary_alias": "EAS-545-401", "path": "/courses/27253/sections/401", "id": "27253-401", "aliases": ["EAS-545-401", "IPD-545-401"]}, "comments": "Designed expressly for students having a keen interest in technological innovation, this course investigates the roles of inventors and founders in successful technology ventures.  Through case studies and guest speakers, the course introduces the knowledge and skills needed to recognize and seize a high-tech entrepreneurial opportunity - be it a product or service - and then successfully launch a startup or spin-off company.  The course studies key areas of intellectual property, its protection and strategic value; opportunity analysis and concept testing; shaping technology driven inventions into customer-driven products; constructing defensible competitive strategies; acquiring resources in the form of capital, people and strategic partners; and the founder's leadership role in an emerging high-tech company.  Throughout the course emphasis is placed on decisions faced by founders, and on the sequential risks and determinants of success in the early growth phase of a technology venture. The course is designed for, but not restricted to, students of engineering and applied science and assumes no prior business education.\r\n\r\nStudents found this class highly interesting, and they felt that they left the classroom with new applicable knowledge. Students found that they felt more comfortable with the business side of the engineering industry, some even felt expressed that \"This course was so inspiring that it has made me want to start  own venture.\" One student noted that the course \"was a great survey of practical issues, principles and lingo that every entrepreneur needs to know.\"\r\n\r\nStudents found Prof. Cassel very interesting and an engaging instructor. Students found his guest lecturers very helpful when it came to real world applications of everything they learned.\r\n\r\nStudents found the readings interesting, but there was a lot of work to do in the class. There were weekly papers and quizzes. Part of the students' grade was class participation, so future students should be prepared to ask questions and answer them. Overall, students found this class very interesting. Students recommended this course to anyone who is interested the workings of business in engineering. The class is mainly comprised of engineering graduate students but is available to juniors and seniors.\r\n", "num_students": 81, "path": "/courses/27253/sections/401/reviews/317-THOMAS-A--CASSEL", "instructor": {"path": "/instructors/317-THOMAS-A--CASSEL", "first_name": "THOMAS A.", "last_name": "CASSEL", "id": "317-THOMAS-A--CASSEL", "name": "THOMAS A. CASSEL"}, "num_reviewers": 68, "id": "27253-401-317-THOMAS-A--CASSEL"}, {"ratings": {"rAmountLearned": "3.73", "rDifficulty": "2.67", "rStimulateInterest": "3.83", "rRecommendMajor": "3.79", "rCourseQuality": "3.85", "rWorkRequired": "3.20", "rInstructorAccess": "3.39", "rReadingsValue": "3.59", "rRecommendNonMajor": "3.60", "rCommAbility": "3.87", "rInstructorQuality": "3.92"}, "section": {"name": "ENG ENTREPRENEURSHIP I", "sectionnum": "402", "primary_alias": "EAS-545-402", "path": "/courses/27253/sections/402", "id": "27253-402", "aliases": ["EAS-545-402", "IPD-545-402"]}, "comments": "Designed expressly for students having a keen interest in technological innovation, this course investigates the roles of inventors and founders in successful technology ventures.  Through case studies and guest speakers, the course introduces the knowledge and skills needed to recognize and seize a high-tech entrepreneurial opportunity - be it a product or service - and then successfully launch a startup or spin-off company.  The course studies key areas of intellectual property, its protection and strategic value; opportunity analysis and concept testing; shaping technology driven inventions into customer-driven products; constructing defensible competitive strategies; acquiring resources in the form of capital, people and strategic partners; and the founder's leadership role in an emerging high-tech company.  Throughout the course emphasis is placed on decisions faced by founders, and on the sequential risks and determinants of success in the early growth phase of a technology venture. The course is designed for, but not restricted to, students of engineering and applied science and assumes no prior business education.\r\nStudents enjoyed this course because they felt that they took home a lot information that was applicable in the field of engineering entrepreneurship. Students commented that it was \"a crash course in finance and accounting for engineers. It provided a lot of learning opportunities.\" One student noted that after taking this course, he \"felt like he learned enough from this one course to be somewhat comfortable with starting a company.\"\r\n\r\nStudent had nothing but positive reviews for Prof. Babin claiming that the he is very knowledgeable and an engaging instructor. Prof. Babin was able to make the class more interesting by being able to draw on great examples from his own experiences. One student highlighted that he \"wanted to hear more of Prof. Babin's insights into other topics.\"\r\n\r\nStudents seemed have overall enjoyed the class. The class is mainly comprised of engineering graduate students but is available to juniors and seniors. Students recommended this course to anyone who is interested the workings of business in engineering.\r\n\r\nThis course review is based on the eight student comments that were submitted.\r\n", "num_students": 41, "path": "/courses/27253/sections/402/reviews/1595-JEFFREY-A--BABIN", "instructor": {"path": "/instructors/1595-JEFFREY-A--BABIN", "first_name": "JEFFREY A.", "last_name": "BABIN", "id": "1595-JEFFREY-A--BABIN", "name": "JEFFREY A. BABIN"}, "num_reviewers": 41, "id": "27253-402-1595-JEFFREY-A--BABIN"}]