[{"ratings": {"rAmountLearned": "3.20", "rDifficulty": "2.47", "rStimulateInterest": "3.40", "rRecommendMajor": "3.43", "rCourseQuality": "3.13", "rWorkRequired": "2.13", "rInstructorAccess": "3.14", "rReadingsValue": "3.00", "rRecommendNonMajor": "2.73", "rCommAbility": "3.33", "rInstructorQuality": "3.27"}, "section": {"name": "ADVANCED FICTION WRITING", "sectionnum": "301", "primary_alias": "ENGL-115-301", "path": "/courses/21594/sections/301", "id": "21594-301", "aliases": ["ENGL-115-301"]}, "comments": "This seminar-styled class focuses on student’s writing and feedback from classmates and from Professor Apple. Class meetings consist of discussions based on student-penned stories.\r\n\r\nStudents felt that ENGL 115 was a challenging yet rewarding course. While the course was considered demanding at times, students remarked that the lessons helped their writing “develop exponentially.” One commented that the content and the guidance of Professor Apple, pushed him/her to “reconsider writing as an art form with nuances and challenges.” It did not come without criticism, however, as one student cautioned that the course was too focused on “a certain genre of fiction,” and that this can be “damaging for students who are interested in writing different genres.”\r\n\r\nFor the most part, students had glowing comments about Professor Apple. Described as “incredible,” “wise,” “warm,” and “the man,” students considered him “the ideal professor.” Though one complained that his style of offering feedback was “aggressive,” others found him to be encouraging. The majority of students felt that his direction helped strengthen them as writers, and several noted their desire to enroll in his other courses in the future. As one student stated succinctly, “I can’t wait to take another class” with Professor Apple.\r\n\r\nOverall, the workload was considered challenging but manageable. Students were asked to write three stories during the semester, and were given recommended, but not required, readings. Grades were based on said writings, attendance and class participation.\r\n\r\nThis review is based on the 5 student comments that were submitted.\r\n", "num_students": 15, "path": "/courses/21594/sections/301/reviews/436-MAX-APPLE", "instructor": {"path": "/instructors/436-MAX-APPLE", "first_name": "MAX", "last_name": "APPLE", "id": "436-MAX-APPLE", "name": "MAX APPLE"}, "num_reviewers": 15, "id": "21594-301-436-MAX-APPLE"}]