{"coursehistories": {"path": "/coursehistories/1368"}, "description": "One half of the course is devoted to the study of time series, including ARIMA modeling and forecasting. The other half studies modifications in random variables due to deductibles, co-payments, policy limits, and elements of simulation. This course is a possible entry point into the actuarial science program. No INSR course is a pre-requisite for INSR 831. The Society of Actuaries has approved INSR 831 for VEE credit on the topic of time series. \n\n", "semester": "2010A", "name": "APPL STAT METHD FOR ACTU", "reviews": {"path": "/courses/26241/reviews", "values": [{"ratings": {"rAmountLearned": "3.50", "rDifficulty": "3.07", "rStimulateInterest": "3.00", "rRecommendMajor": "3.62", "rCourseQuality": "3.24", "rWorkRequired": "3.07", "rInstructorAccess": "3.36", "rReadingsValue": "3.14", "rRecommendNonMajor": "2.07", "rCommAbility": "3.23", "rInstructorQuality": "3.47"}, "section": {"name": "APPL STAT METHD FOR ACTU", "sectionnum": "401", "primary_alias": "INSR-260-401", "path": "/courses/26241/sections/401", "id": "26241-401", "aliases": ["INSR-260-401", "INSR-831-401"]}, "comments": "One half of INSR260 is devoted to the study of time series, including ARIMA modeling and forecasting. The other half studies modifications in random variables due to deductibles, co-payments, policy limits, and elements of simulation. This course is a possible entry point into the actuarial science program. No INSR course is a pre-requisite for INSR 831.\r\n\r\nStudents “enjoyed this course a lot.” However, the second half of the course relied heavily on “statistical software” and some felt that this could have been introduced more slowly.\r\n\r\nStudents said that “Professor Lemaire is a great professor” and “is able to clearly explain complex problems.” \r\n\r\nStudents reported that the homework was sometimes too long and did not always directly pertain to information taught in class. This review is based on the 5 student comments which were submitted.", "num_students": 18, "path": "/courses/26241/sections/401/reviews/675-JEAN-H--LEMAIRE", "instructor": {"path": "/instructors/675-JEAN-H--LEMAIRE", "first_name": "JEAN H.", "last_name": "LEMAIRE", "id": "675-JEAN-H--LEMAIRE", "name": "JEAN H. LEMAIRE"}, "num_reviewers": 17, "id": "26241-401-675-JEAN-H--LEMAIRE"}, {"ratings": {"rAmountLearned": "3.50", "rDifficulty": "3.07", "rStimulateInterest": "3.14", "rRecommendMajor": "3.62", "rCourseQuality": "3.24", "rWorkRequired": "3.07", "rInstructorAccess": "3.14", "rReadingsValue": "3.14", "rRecommendNonMajor": "2.07", "rCommAbility": "3.14", "rInstructorQuality": "3.24"}, "section": {"name": "APPL STAT METHD FOR ACTU", "sectionnum": "401", "primary_alias": "INSR-260-401", "path": "/courses/26241/sections/401", "id": "26241-401", "aliases": ["INSR-260-401", "INSR-831-401"]}, "comments": "INSR 260 is the Applied Statistical Methods for Actuaries. One half of the course is devoted to the study of time series, including ARIMA modeling and forecasting. The other half studies modifications in random variables due to deductibles, co-payments, policy limits, and elements of simulation. This course is a possible entry point into the actuarial science program. No INSR course is a pre-requisite for INSR 831, but one semester of probability is a prerequisite. The Society of Actuaries has approved INSR 831 for VEE credit on the topic of time series. \r\n\r\nMany students found this course to be incredibly interesting, “more so than expected” in some cases. As taught by Professor Stine, this course has a heavy emphasis on computer programming usage and statistical software. \r\n\r\nProfessor Stine received praise from students for his approach which encourages students “to think critically about statistical data”. Others said he was an interesting professor, although he could be “intimidating” and “disconnected” at times. Some recommended that he go at a slower pace, because of the complex nature of the software used. This review is based upon 5 critiques of the course.", "num_students": 18, "path": "/courses/26241/sections/401/reviews/1162-ROBERT-A-STINE", "instructor": {"path": "/instructors/1162-ROBERT-A-STINE", "first_name": "ROBERT A", "last_name": "STINE", "id": "1162-ROBERT-A-STINE", "name": "ROBERT A STINE"}, "num_reviewers": 17, "id": "26241-401-1162-ROBERT-A-STINE"}]}, "credits": null, "primary_alias": "INSR-260", "path": "/courses/26241", "sections": {"path": "/courses/26241/sections", "values": [{"name": "APPL STAT METHD FOR ACTU", "sectionnum": "401", "primary_alias": "INSR-260-401", "path": "/courses/26241/sections/401", "id": "26241-401", "aliases": ["INSR-260-401", "INSR-831-401"]}]}, "id": 26241, "aliases": ["INSR-260", "INSR-831"]}