[{"ratings": {"rAmountLearned": "2.78", "rDifficulty": "2.28", "rStimulateInterest": "2.33", "rRecommendMajor": "3.00", "rCourseQuality": "2.74", "rWorkRequired": "2.78", "rInstructorAccess": "3.56", "rReadingsValue": "2.61", "rRecommendNonMajor": "2.78", "rCommAbility": "2.72", "rInstructorQuality": "3.00"}, "section": {"name": "ENERGY SYS, RES & TECH", "sectionnum": "001", "primary_alias": "MEAM-250-001", "path": "/courses/26358/sections/001", "id": "26358-001", "aliases": ["MEAM-250-001"]}, "comments": "This course presents a comprehensive overview of the global demand for energy, and the resource availability and technology used in its current and future supply. Through a personal energy audit, students are made aware of the extensive role that energy plays in modern life, both directly, through electricity and transportation fuel, and indirectly in the manufacturing of goods they use. The course covers how that energy is supplied, the anticipated global growth in energy demand, the resource availability and the role of science and technology in meeting that demand in a world concerned about climate change. The roles of conservation, improved efficiency and renewable energy in meeting future demand in a sustainable, environmentally benign way are covered.\r\n\r\nOverall, students found the course material “very interesting.” Many thought that the “thorough overview of all energy sources: conventional and renewable” and the “comprehensive analysis of technologies and economical [factors]” showed them the importance and relevance of energy systems, resources, and technologies. As such, many students reported learning a lot from this class. Although some students thought that too much emphasis was placed on the policies rather than the technologies.\r\n\r\nStudents thought that the class was taught “very well” as Professor Jackson shared his “knowledge,” “experience,” and “comprehensive analysis.” Although many students described Professor Jackson as “kind, friendly, and approachable,” other students felt that his lectures occasionally fell flat. Some students wished there was more “student-teacher interaction” within the lecture.\r\n\r\nMany students commented on the difficulty of having homework due on the same day as quizzes. One student remarked that the “quizzes [seemed] a little hard and the grading [was] a little harsh.” Overall, the course is recommended to those in engineering as a course to survey the policies surrounding the energy systems, resources, and technology.\r\n\r\nThis review is based on the 8 student comments which were submitted. ", "num_students": 20, "path": "/courses/26358/sections/001/reviews/5231-ANDREW-JACKSON", "instructor": {"path": "/instructors/5231-ANDREW-JACKSON", "first_name": "ANDREW", "last_name": "JACKSON", "id": "5231-ANDREW-JACKSON", "name": "ANDREW JACKSON"}, "num_reviewers": 19, "id": "26358-001-5231-ANDREW-JACKSON"}]