{"coursehistories": {"path": "/coursehistories/3877"}, "description": "In a February 5, 2007 press release President Amy Gutmann stated that Penn will develope a \"comprehensive sustainability plan by 2009.This includes completing a comprehensive inventory of all its greenhouse gas emissions; purchasing at least 15 percent of its electricity from renewable sources; adopting an energy efficient appliance purchasing program; committing to a policy that new construction be built to the US Green Building Council LEED Silver standards, or equivalent; and providing access to public transit for faculty, students, and staff.\" \n\nThis course will examine Penn's \"environmental footprint\",what is being done to reduce this footprint, and present ideas for further improvements. The students will build on the work of others, document existing efforts, and benchmark against other universities. The course will explore the issues mentioned above and will also address issues such as stormwater management, the greening of campus, and leadership in the nearby community. The students will establish baseline data and measurement strategies so that success can be measured, and then will develop strategies to collect and analyze additional data. Included in the course will be the concepts of environmental management systems, secondary impacts [eg, commuting habits of Penn employees], pollution prevention, and life-cycle analysis. \n\nEach student or group of students, will select sn area of focus for their research exercise (eg, energy, recycling, green buildings) and develop a report that can be used by the Penn administration to advance Penn's efforts toward sustainability. The students will also develop a cumulative class report summarizing their ideas for improvement.This report will be delivered the President's Office. \n\n", "semester": "2010C", "name": "Toward Environmental Sustainability on Penn's Campus", "reviews": {"path": "/courses/23017/reviews", "values": [{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "2.19", "rStimulateInterest": "3.00", "rRecommendMajor": "3.19", "rCourseQuality": "3.13", "rWorkRequired": "2.00", "rInstructorAccess": "2.87", "rReadingsValue": "2.44", "rRecommendNonMajor": "2.88", "rCommAbility": "3.19", "rInstructorQuality": "3.00"}, "section": {"name": "Toward Environmental Sustainability on Penn's Campus", "sectionnum": "660", "primary_alias": "ENVS-494-660", "path": "/courses/23017/sections/660", "id": "23017-660", "aliases": ["ENVS-494-660"]}, "comments": "", "num_students": 20, "path": "/courses/23017/sections/660/reviews/5331-DANIEL-K-GAROFALO", "instructor": {"path": "/instructors/5331-DANIEL-K-GAROFALO", "first_name": "DANIEL K", "last_name": "GAROFALO", "id": "5331-DANIEL-K-GAROFALO", "name": "DANIEL K GAROFALO"}, "num_reviewers": 16, "id": "23017-660-5331-DANIEL-K-GAROFALO"}]}, "credits": null, "primary_alias": "ENVS-494", "path": "/courses/23017", "sections": {"path": "/courses/23017/sections", "values": [{"name": "Toward Environmental Sustainability on Penn's Campus", "sectionnum": "660", "primary_alias": "ENVS-494-660", "path": "/courses/23017/sections/660", "id": "23017-660", "aliases": ["ENVS-494-660"]}]}, "id": 23017, "aliases": ["ENVS-494"]}