[{"ratings": {"rAmountLearned": "2.31", "rDifficulty": "2.12", "rStimulateInterest": "2.71", "rRecommendMajor": "3.31", "rCourseQuality": "2.59", "rWorkRequired": "1.88", "rInstructorAccess": "3.07", "rReadingsValue": "2.29", "rRecommendNonMajor": "2.60", "rCommAbility": "3.05", "rInstructorQuality": "2.86"}, "section": {"name": "TELEVISON STUDIES", "sectionnum": "401", "primary_alias": "CINE-150-401", "path": "/courses/15487/sections/401", "id": "15487-401", "aliases": ["CINE-150-401", "ENGL-078-401"]}, "comments": "As a complex cultural product, television lends itself to a variety of critical approaches that build on, run parallel to, or depart from film studies. This introductory course in television studies begins with an overview of the medium’s history and explores how technical and industrial changes correspond to developing conventions of genre, programming, and aesthetics. Along the way, it involves analysis of key concepts and theoretical debates that shaped the field. In particular, it focuses on approaches to textual analysis in combination with industry research, and critical engagements with the political, social and cultural dimensions of television as popular culture.\r\n\r\nMost students found the course material “very interesting.” One wrote that it included “[v]ery in-depth coverage of the history of broadcasting and television.” The same student also stated, “we stayed on topics for too long,” while another complained that “the material was somewhat dry.” Several comments called for “much more discussion in class.” Students felt that they learned a moderate amount from this course.\r\n\r\nMost found that Professor Johnson was a good lecturer and one wrote that “lecture was always worthwhile.” Others explained, however, that the professor “could have presented the information in a [better] way to keep attention during the class period.”\r\n\r\nThe difficulty and amount of work required by this course was low. A few students complained about the grading, one calling it “weird” and another complaining that the “attendance/participation component [was] valued too highly.” This course was somewhat strongly recommended to majors.", "num_students": 51, "path": "/courses/15487/sections/401/reviews/4279-VICTORIA-E-JOHNSON", "instructor": {"path": "/instructors/4279-VICTORIA-E-JOHNSON", "first_name": "VICTORIA E", "last_name": "JOHNSON", "id": "4279-VICTORIA-E-JOHNSON", "name": "VICTORIA E JOHNSON"}, "num_reviewers": 46, "id": "15487-401-4279-VICTORIA-E-JOHNSON"}]