[{"ratings": {"rAmountLearned": "1.67", "rDifficulty": "2.31", "rStimulateInterest": "1.23", "rRecommendMajor": "2.34", "rCourseQuality": "1.59", "rWorkRequired": "2.11", "rInstructorAccess": "2.22", "rReadingsValue": "1.55", "rRecommendNonMajor": "1.80", "rCommAbility": "1.79", "rInstructorQuality": "1.74"}, "section": {"name": "Natural Disturbances and Human Disasters", "sectionnum": "001", "primary_alias": "GEOL-103-001", "path": "/courses/27483/sections/001", "id": "27483-001", "aliases": ["GEOL-103-001"]}, "comments": "\tNatural disturbances play a fundamental role in sculpturing landscapes and structuring natural and human-based ecosystems. This course explores the natural and social science of disturbances by analyzing their geologic causes, their ecological and social consequences, and the role of human behavior in disaster reduction and mitigation. Volcanoes, earthquakes, floods, droughts, fires, and extraterrestrial impacts are analyzed and compared.\r\n\r\n\tStudents mostly found the class boring and uninteresting, though many agreed it was a good way to fulfill one of the college’s requirements.  One student described the course as “dense and static,” while another said, “it was difficult to be engaged with the material.”   Students seemed to feel that they did not learn very much from the course, with one student going so far as to say, “there is no information I am going to take away from this course moving forward.”  \r\n\r\n\tStudents described Professor Scatena as very uninteresting in lectures especially since he speaks in “monotone.”  One student noted that he teaches in a “nonchalant and unenthusiastic way.”  His slides were described as “incoherent” and students felt that there was a disconnect between lecture material and what was on the exams.  Students said Professor Scatena was “very accessible” outside of class and was very willing to help students further understand the material.  Additionally, one student mentioned that Professor Scatena “cared a lot about the subject and the success of his students.”\r\n\r\n\tThis course was recommended for students trying to fulfill requirements in the college.  One student said it “was perfect to fulfill the science requirement if you are trying to get out of taking a hard class.”  However, several students noted that the class requires constant studying because there are three midterms, and the “exams are very difficult” which require “pure memorization.”", "num_students": 197, "path": "/courses/27483/sections/001/reviews/1839-FREDERICK-N--SCATENA", "instructor": {"path": "/instructors/1839-FREDERICK-N--SCATENA", "first_name": "FREDERICK N.", "last_name": "SCATENA", "id": "1839-FREDERICK-N--SCATENA", "name": "FREDERICK N. SCATENA"}, "num_reviewers": 194, "id": "27483-001-1839-FREDERICK-N--SCATENA"}]