{"coursehistories": {"path": "/coursehistories/4345"}, "description": "The service sector in the global economy is going through a revolution and accounts for an increasingly dominant proportion of the gross domestic product and employment base of developed and growing economies. \n\nThis course is designed to focus on the unique marketing and strategic problems faced by firms and the service arm of manufacturing firms. The overall learning objective is to understand the strategic initiatives that are necessary to build world-class services. In order to achieve this objective an attempt will be made to: (i) develop an understanding of the strategic difference between marketing goods and marketing services, (ii) identify and capitalize on the sources of competitive advantage in services, (iii) appreciate the cross-functional nature of the service delivery process (iv) build an overarching model of strategic service management, and (v) build strategic models for e-services. \n\nThe course is highly interdisciplinary in flavor. It deals with broad based strategies both for core services as well as professional services. It is designed to demonstrate how familiar elements of the marketing mix need to dovetail with operating strategies, information systems, and human resources policies in order to deliver lasting values to both internal and external customers. The course has a liberal sprinkling of some of the most important issues faced by service managers today, including (i) globalization of service (ii) leveraging technology to better serve the customer, (iii) customer satisfaction and service quality, and (v) emerging e-services. This course is appropriate for all management students, especially those who aspire to be connected with the core or professional service sector, consulting, the service-centric manufacturing sector, and e-services. \n\n", "semester": "2009A", "name": "SPECIAL TOPICS: Monetizing Emerging Interactive Media", "reviews": {"path": "/courses/16121/reviews", "values": [{"ratings": {"rAmountLearned": "1.76", "rDifficulty": "1.73", "rStimulateInterest": "1.44", "rRecommendMajor": "1.87", "rCourseQuality": "1.59", "rWorkRequired": "2.31", "rInstructorAccess": "2.78", "rReadingsValue": "1.34", "rRecommendNonMajor": "1.42", "rCommAbility": "1.42", "rInstructorQuality": "1.50"}, "section": {"name": "SPECIAL TOPICS: Monetizing Emerging Interactive Media", "sectionnum": "001", "primary_alias": "MKTG-768-001", "path": "/courses/16121/sections/001", "id": "16121-001", "aliases": ["MKTG-768-001"]}, "comments": "", "num_students": 53, "path": "/courses/16121/sections/001/reviews/4452-STEVEN-ENNEN", "instructor": {"path": "/instructors/4452-STEVEN-ENNEN", "first_name": "STEVEN", "last_name": "ENNEN", "id": "4452-STEVEN-ENNEN", "name": "STEVEN ENNEN"}, "num_reviewers": 48, "id": "16121-001-4452-STEVEN-ENNEN"}]}, "credits": null, "primary_alias": "MKTG-768", "path": "/courses/16121", "sections": {"path": "/courses/16121/sections", "values": [{"name": "SPECIAL TOPICS: Monetizing Emerging Interactive Media", "sectionnum": "001", "primary_alias": "MKTG-768-001", "path": "/courses/16121/sections/001", "id": "16121-001", "aliases": ["MKTG-768-001"]}]}, "id": 16121, "aliases": ["MKTG-768"]}