{"coursehistories": {"path": "/coursehistories/3913"}, "description": "This is the second half of the Near East sequence. This course surveys Islamic civilization from circa 600 (the rise of Islam) to the start of the modern era and concentrates on political, social, and cultural trends. Although the emphasis will be on Middle Eastern societies, we will occasionally consider developments in other parts of the world, such as sub-Saharan Africa, Central Asia, and Spain, where Islamic civilization was or has been influential. Our goal is to understand the shared features that have distinguished Islamic civilization as well as the varieties of experience that have endowed it with so much diversity. \n\n", "semester": "2012A", "name": "INTRO TO MIDDLE EAST", "reviews": {"path": "/courses/27848/reviews", "values": [{"ratings": {"rAmountLearned": "2.88", "rDifficulty": "2.58", "rStimulateInterest": "3.25", "rRecommendMajor": "3.46", "rCourseQuality": "2.88", "rWorkRequired": "2.67", "rInstructorAccess": "3.21", "rReadingsValue": "2.79", "rRecommendNonMajor": "2.65", "rCommAbility": "3.50", "rInstructorQuality": "3.50"}, "section": {"name": "INTRO TO MIDDLE EAST", "sectionnum": "401", "primary_alias": "NELC-102-401", "path": "/courses/27848/sections/401", "id": "27848-401", "aliases": ["NELC-102-401", "HIST-023-401"]}, "comments": "This course is the second half of the Near East sequence. It surveys Islamic civilization from the rise of Islam at around 600 A.D. to the start of the modern era. Major focuses of the course include political, social, and cultural trends. Although the emphasis is on Middle Eastern societies, the course also offers insight into developments in other parts of the world where Islamic civilization was or has been influential, such as Sub-Saharan Africa, Central Asia, and Spain. The goal of this course is to understand the shared features that have distinguished Islamic civilization as well as the varieties of experience that have endowed it with so much diversity.\r\n\r\nMany students reported enjoying this course. One said it was an “[e]xcellent course on history of the Middle East” and many others agreed. While many agreed that the course content was great, many students noted that they would have preferred this course if it had been “a small seminar with 8-10 students, instead of the current format with 25-40.”  Many students also felt frustrated with the assignments and felt that they “didn’t really enhance the understanding of the course material.” Another student agreed, adding, “The writing assignments weren’t tied to what [was] actually learned in class.”\r\n\r\nAlmost all the students agreed that Professor Cobb is extremely knowledgeable about the course material. Students raved about Professor Cobb, calling him incredible, excellent, and very engaging. Yet another student noted that he “established that he was willing to help in [any way] that he could [and was] a phenomenal lecturer.” According to the majority of students, Professor Cobb “did a terrific job of communicating the subject matter, delivering his lectures with didactic precision interlaced with humor.” However, a couple of students found his humor to be “at times very sarcastic” and noted that he “can be a little bit hard to follow.”\r\n\r\nThe majority of reviewers noted that the grading for this course could be very difficult depending on the TA. One student said “the TA… graded [assignments] unfairly” while another said that the grading “was excessively harsh.” However, many students would recommend this course to a major or non-major and anyone “even mildly interested in the history of the Middle East” — although one reviewer warned that subject matter can be “slightly redundant if you have taken other courses on the Middle East.” This course satisfies the History & Tradition Sector and the Cross Cultural Analysis.", "num_students": 29, "path": "/courses/27848/sections/401/reviews/4473-PAUL-MICHAEL-COBB", "instructor": {"path": "/instructors/4473-PAUL-MICHAEL-COBB", "first_name": "PAUL MICHAEL", "last_name": "COBB", "id": "4473-PAUL-MICHAEL-COBB", "name": "PAUL MICHAEL COBB"}, "num_reviewers": 24, "id": "27848-401-4473-PAUL-MICHAEL-COBB"}]}, "credits": null, "primary_alias": "NELC-102", "path": "/courses/27848", "sections": {"path": "/courses/27848/sections", "values": [{"name": "INTRO TO MIDDLE EAST", "sectionnum": "401", "primary_alias": "NELC-102-401", "path": "/courses/27848/sections/401", "id": "27848-401", "aliases": ["NELC-102-401", "HIST-023-401"]}]}, "id": 27848, "aliases": ["NELC-102", "HIST-023"]}