[{"ratings": {"rAmountLearned": "3.08", "rDifficulty": "2.41", "rStimulateInterest": "3.45", "rRecommendMajor": "3.55", "rCourseQuality": "3.27", "rWorkRequired": "2.34", "rInstructorAccess": "3.26", "rReadingsValue": "3.08", "rRecommendNonMajor": "3.11", "rCommAbility": "3.54", "rInstructorQuality": "3.54"}, "section": {"name": "MASTERPIECES OF FR CINEM", "sectionnum": "401", "primary_alias": "FREN-230-401", "path": "/courses/23125/sections/401", "id": "23125-401", "aliases": ["FREN-230-401", "CINE-245-401"]}, "comments": "This course introduced students to key films of the French film canon, selected over a period ranging from the origins of French cinema to the present. Students were also introduced to the key critical concepts (such as the notion of the \"auteur\" film genre) informing the discussion of films in France. The films were studied in both an historical and theoretical context, related to their period styles (e.g. \"le realisme poetique,\" \"la Nouvelle Vague,\" etc.), their \"auteurs,\" the nature of the French star system, the role of the other arts, as well to the critical debates they have sparked among critics and historians. Students acquired the analytical tools in French to discuss films as artistic and as cultural texts. &#8232;&#8232;\r\n\r\nMany students enjoyed the class, finding it “thought-provoking and interesting.” \r\nHowever, some student felt that the selection of films for the class was “poorly chosen,” and students in the French recitation section were upset that their recitations were only half conducted in French. They felt that such an environment was not helpful to the study of the French language.\r\n\r\nStudents enjoyed Professor Met, describing him as “fun,” “engaging,” “passionate,” and a “great lecturer.” Students appreciated Professor Met’s explanation of the material, and they liked that he taught “about French cinema in a way it could be grasped.” They also liked that he explained “cultural notes to those of us who weren’t taking the class in French too.” Some students felt that Professot Met’s lecturing style was a bit stilted, explaining that “he tends to become very repetitive and held back by one question or one thought.” Overall, students commended Professor Met on his knowledge and command of the material.&#8232;\r\n\r\nThe class could be taken as a French credit or as a Cinema Studies credit, and to receive French credit, students needed to enroll in the French recitation. Cinema Studies students felt that they could understand the class material without knowledge of French culture. Some of the French students felt that the class was “more geared towards the cinema studies kids rather than the French kids.”&#8232;&#8232;\r\n", "num_students": 42, "path": "/courses/23125/sections/401/reviews/1459-PHILIPPE-C--MET", "instructor": {"path": "/instructors/1459-PHILIPPE-C--MET", "first_name": "PHILIPPE C.", "last_name": "MET", "id": "1459-PHILIPPE-C--MET", "name": "PHILIPPE C. MET"}, "num_reviewers": 42, "id": "23125-401-1459-PHILIPPE-C--MET"}]