[{"ratings": {"rAmountLearned": "1.76", "rDifficulty": "3.29", "rStimulateInterest": "1.44", "rRecommendMajor": "2.82", "rCourseQuality": "1.44", "rWorkRequired": "2.82", "rInstructorAccess": "2.18", "rReadingsValue": "1.76", "rRecommendNonMajor": "0.53", "rCommAbility": "1.33", "rInstructorQuality": "1.67"}, "section": {"name": "STRCTRE AT THE NANOSCALE", "sectionnum": "001", "primary_alias": "MSE-360-001", "path": "/courses/23473/sections/001", "id": "23473-001", "aliases": ["MSE-360-001"]}, "comments": "MSE 360 covers basic principles of material structure and organization from nano to macro sizes. This course covers the fundamentals of materials structure including the crystalline, liquid crystalline and glassy states as well as 1-D, 2-D and 3-D structure and defects. Examples will be used from the different classes of materials - metallic, semiconductor, inorganic, polymeric - with particular emphasis on important components of structure on the nano-scale including particles, surfaces, interfaces and defects.\r\n\r\nMany students felt that even though they had put a good deal of effort into the class, they did not learn as much as they could have, as they believed that the professor did not devote a sufficient amount of effort to teaching the course. Fortunately, many felt that the material was not too difficult to understand with outside effort.\r\n\r\nSome students reported that Professor Murray showed passion for the material he taught, which seemingly “rubbed off” on them. However, other felt that he was not able to “effectively teach the material” because he was focused more on his research. Many students complained about the large volume of assigned readings that were not correlated with lectures. Several students felt that material was presented “sloppily,” reporting that notation was not always consistent between slides. Students also found Professor Murray to be “disorganized and cluttered” as well as difficult to reach. \r\n\r\nThe course is a requirement for MSE majors, but was not recommended to non-majors.\r\n\r\nThis review was based on the 5 student comments that were submitted.\r\n", "num_students": 21, "path": "/courses/23473/sections/001/reviews/4041-CHRISTOPHER-B--MURRAY", "instructor": {"path": "/instructors/4041-CHRISTOPHER-B--MURRAY", "first_name": "CHRISTOPHER B.", "last_name": "MURRAY", "id": "4041-CHRISTOPHER-B--MURRAY", "name": "CHRISTOPHER B. MURRAY"}, "num_reviewers": 18, "id": "23473-001-4041-CHRISTOPHER-B--MURRAY"}]