{"coursehistories": {"path": "/coursehistories/1596"}, "description": "Over the past two decades, the public imagination has been gripped by the concept of globalization. Scholars, corporations, advertisers and government officials have latched onto this idea as a defining feature of our current era.These various constituencies use globalization not only to account for epochal shifts in our economy and society, but also to justify new types of business strategy and public policy. This course will examine three interlinked dimensions of globalization: Global economic processes (e.g. the transnational operations of multinational firms that have given rise to a new international division of labor); cultural globalization (e.g. the spread of American brands like Coca Cola, Nike and Hollywood films), and political globalization (e.g. the rise of supranational organizations like the IMF, World Bank and WTO that promote the idea of free markets). \n\nMoreover, we will study globalization in the context of cities because, given their centrality to globalization processes, it is in cities that we can best understand how globalization takes place. In cities, we can study the global economic processes that restructure urban space, giving rise to new financial districts, international art exhibits and post-modern architecture and entrepreneurial strategies that seek to elevate cities to world city status. The course will examine these processes in a comparative light, contrasting urban globalization processes in Europe and North America with those in Latin America, Asia and Africa. \n\n", "semester": "2002C", "name": "GLOBALIZ,CITIES&PUB POL", "reviews": {"path": "/courses/3616/reviews", "values": [{"ratings": {"rAmountLearned": "3.27", "rDifficulty": "2.73", "rStimulateInterest": "3.55", "rRecommendMajor": "3.18", "rCourseQuality": "3.27", "rWorkRequired": "2.73", "rInstructorAccess": "3.82", "rReadingsValue": "2.82", "rRecommendNonMajor": "3.00", "rCommAbility": "3.73", "rInstructorQuality": "3.73"}, "section": {"name": "GLOBALIZ,CITIES&PUB POL", "sectionnum": "601", "primary_alias": "URBS-457-601", "path": "/courses/3616/sections/601", "id": "3616-601", "aliases": ["URBS-457-601", "SOCI-435-601"]}, "comments": "", "num_students": 16, "path": "/courses/3616/sections/601/reviews/1768-MARK-P-GAIGE", "instructor": {"path": "/instructors/1768-MARK-P-GAIGE", "first_name": "MARK P", "last_name": "GAIGE", "id": "1768-MARK-P-GAIGE", "name": "MARK P GAIGE"}, "num_reviewers": 11, "id": "3616-601-1768-MARK-P-GAIGE"}]}, "credits": null, "primary_alias": "URBS-457", "path": "/courses/3616", "sections": {"path": "/courses/3616/sections", "values": [{"name": "GLOBALIZ,CITIES&PUB POL", "sectionnum": "601", "primary_alias": "URBS-457-601", "path": "/courses/3616/sections/601", "id": "3616-601", "aliases": ["URBS-457-601", "SOCI-435-601"]}]}, "id": 3616, "aliases": ["URBS-457", "SOCI-435"]}