{"coursehistories": {"path": "/coursehistories/3092"}, "description": "The course focuses on financial tools, techniques, and best practices used in buyouts (financial buyers) and acquisitions (strategic buyers). While it will touch upon various strategic, organizational, and general management issues, the main lens for studying these transactions will be a financial one. It will explore how different buyers approach the process of finding, evaluating, and analyzing opportunities in the corporate-control market; how they structure deals and how deal structure affects both value creation and value division; how they add value after transaction completion; and how they realizetheir ultimate objectives (such as enhanced market position or a profitable exit). The course is divided into two broad modules. The first module covers buyouts by private equity partnerships, and the second one studies mergers and acquisitions. \n\n", "semester": "2011C", "name": "FNCE OF BUYOUTS & ACQS", "reviews": {"path": "/courses/24430/reviews", "values": [{"ratings": {"rAmountLearned": "2.76", "rDifficulty": "2.74", "rStimulateInterest": "2.36", "rRecommendMajor": "3.36", "rCourseQuality": "2.80", "rWorkRequired": "2.74", "rInstructorAccess": "3.07", "rReadingsValue": "2.63", "rRecommendNonMajor": "1.88", "rCommAbility": "2.79", "rInstructorQuality": "2.67"}, "section": {"name": "FNCE OF BUYOUTS & ACQS", "sectionnum": "001", "primary_alias": "FNCE-251-001", "path": "/courses/24430/sections/001", "id": "24430-001", "aliases": ["FNCE-251-001"]}, "comments": "*Finance 251 focuses on financial tools, techniques, and best practices in buyouts (financial buyers) and acquisitions (strategic buyers). While it will touch upon various strategic, organizational, and general management issues, the main lens for studying these transactions will be a financial one. It will explore how different buyers approach the process of finding, evaluating, and analyzing opportunities in the corporate-control market; how they structure deals and how deal structure affects both value creation and value division; how they add value after transaction completion; and how they realize their ultimate objectives (such as enhanced market position or a profitable exit.) The course is divided into two broad modules. The first module covers buyouts by private equity partnerships and the second one examines mergers and acquisitions. \r\n\r\nStudents believed that this was “a great course overall” and recommended the course to students interested in going into M&A/PE as a career. However, students highly suggested that others take FNCE 207 (Corporate Valuation), or at least have had some form of banking internship, before taking this course. One commented that “the deal proposals require some prior experience.” \r\n\r\nMost students really enjoyed Professor Savor’s teaching styles. Some described him as “one of the best teachers at Wharton.” One student stated that Professor Savor would be even better if he “would change the wording on the exams, which was sometimes difficult to understand.” Professor Savor was also described as having “an incredible wealth of knowledge on the material.” \r\n\r\nMost students taking this course were Wharton upperclassmen, specifically those concentrating in Finance. Most would recommend this course to students planning to go into the investment banking or private equity field. \r\n\r\n*This review is based on 8 student comments.\r\n", "num_students": 56, "path": "/courses/24430/sections/001/reviews/3968-PAVEL-G--SAVOR", "instructor": {"path": "/instructors/3968-PAVEL-G--SAVOR", "first_name": "PAVEL G.", "last_name": "SAVOR", "id": "3968-PAVEL-G--SAVOR", "name": "PAVEL G. SAVOR"}, "num_reviewers": 52, "id": "24430-001-3968-PAVEL-G--SAVOR"}, {"ratings": {"rAmountLearned": "3.09", "rDifficulty": "2.76", "rStimulateInterest": "3.08", "rRecommendMajor": "3.64", "rCourseQuality": "3.17", "rWorkRequired": "2.72", "rInstructorAccess": "3.28", "rReadingsValue": "2.86", "rRecommendNonMajor": "2.03", "rCommAbility": "3.22", "rInstructorQuality": "3.21"}, "section": {"name": "FNCE OF BUYOUTS & ACQS", "sectionnum": "002", "primary_alias": "FNCE-251-002", "path": "/courses/24430/sections/002", "id": "24430-002", "aliases": ["FNCE-251-002"]}, "comments": "", "num_students": 48, "path": "/courses/24430/sections/002/reviews/3968-PAVEL-G--SAVOR", "instructor": {"path": "/instructors/3968-PAVEL-G--SAVOR", "first_name": "PAVEL G.", "last_name": "SAVOR", "id": "3968-PAVEL-G--SAVOR", "name": "PAVEL G. SAVOR"}, "num_reviewers": 45, "id": "24430-002-3968-PAVEL-G--SAVOR"}]}, "credits": null, "primary_alias": "FNCE-251", "path": "/courses/24430", "sections": {"path": "/courses/24430/sections", "values": [{"name": "FNCE OF BUYOUTS & ACQS", "sectionnum": "001", "primary_alias": "FNCE-251-001", "path": "/courses/24430/sections/001", "id": "24430-001", "aliases": ["FNCE-251-001"]}, {"name": "FNCE OF BUYOUTS & ACQS", "sectionnum": "002", "primary_alias": "FNCE-251-002", "path": "/courses/24430/sections/002", "id": "24430-002", "aliases": ["FNCE-251-002"]}]}, "id": 24430, "aliases": ["FNCE-251"]}