{"coursehistories": {"path": "/coursehistories/4208"}, "description": "Immigration has always been a part of European and world history, but the recent 'wave' of immigration since the early 1960s, in both academic and vernacular discourse (including popular culture and the media ), is attributed a particular significance as the greatest transformation of European societies. The recent 'wave' is generally understood in cultural and religious terms, putting in focus the question of cultural and national identity as the main concern. Islam and the Middle East has thus moved into the center of immigration debate, which in turn is at the center of political discourse. The result is the culturalization of the entire political debate. We will first explore how immigration was conceptualized in different historical periods and the relationship between immigration debate and political discourse of particular historical contexts. We will then analyze how the recent wave of immigration is conceptualized and policed. In this context, we will discuss how the conceptualization was related to the transformation of the political system and the emergence of the extreme right in Western Europe. We will take up examples from academic research on immigration and culture, the coverage of immigration in the media, and the way Europeans talk about immigration \n\nWe will first explore how immigration was conceptualized in different historical periods and the relationship between immigration debate and political discourse of particular historical contexts. We will then analyze how the recent wave of immigration is conceptualized and policed. In this context, we will discuss how the conceptualization was related to the transformation of the political system and the emergence of the extreme right in Western Europe. We will take up examples from academic research on immigration and culture, the coverage of immigration in the media, and the way Europeans talk about immigration in everyday settings. Through this type of analysis, we will explore how immigrants have become a culturalized and religious category rather than a labor/class issue as in the past. \n\nWe will also relate the immigration debate in Europe to larger debates on the \"West-Islam\" divide (for example: clash of cultures alliance of civilizations), \"the War on Terror,\" citizenship and democratic participation, gender equality, freedom of speech and other relevant current issues and debates. \n\n", "semester": "2009A", "name": "The Politics of Muslim Immigration in Europe", "reviews": {"path": "/courses/15542/reviews", "values": [{"ratings": {"rAmountLearned": "2.13", "rDifficulty": "2.87", "rStimulateInterest": "1.60", "rRecommendMajor": "2.20", "rCourseQuality": "2.00", "rWorkRequired": "3.40", "rInstructorAccess": "2.60", "rReadingsValue": "1.73", "rRecommendNonMajor": "1.20", "rCommAbility": "1.87", "rInstructorQuality": "2.07"}, "section": {"name": "The Politics of Muslim Immigration in Europe", "sectionnum": "401", "primary_alias": "COMM-312-401", "path": "/courses/15542/sections/401", "id": "15542-401", "aliases": ["COMM-312-401"]}, "comments": "", "num_students": 15, "path": "/courses/15542/sections/401/reviews/4290-FERRUH-YILMAZ", "instructor": {"path": "/instructors/4290-FERRUH-YILMAZ", "first_name": "FERRUH", "last_name": "YILMAZ", "id": "4290-FERRUH-YILMAZ", "name": "FERRUH YILMAZ"}, "num_reviewers": 15, "id": "15542-401-4290-FERRUH-YILMAZ"}]}, "credits": null, "primary_alias": "COMM-312", "path": "/courses/15542", "sections": {"path": "/courses/15542/sections", "values": [{"name": "The Politics of Muslim Immigration in Europe", "sectionnum": "401", "primary_alias": "COMM-312-401", "path": "/courses/15542/sections/401", "id": "15542-401", "aliases": ["COMM-312-401"]}]}, "id": 15542, "aliases": ["COMM-312"]}