[{"ratings": {"rAmountLearned": "2.39", "rDifficulty": "2.34", "rStimulateInterest": "2.16", "rRecommendMajor": "2.12", "rCourseQuality": "2.05", "rWorkRequired": "1.34", "rInstructorAccess": "2.76", "rReadingsValue": "1.54", "rRecommendNonMajor": "2.29", "rCommAbility": "2.21", "rInstructorQuality": "2.29"}, "section": {"name": "ENERGY,OIL&GLOBAL WARMIN", "sectionnum": "001", "primary_alias": "PHYS-016-001", "path": "/courses/16314/sections/001", "id": "16314-001", "aliases": ["PHYS-016-001"]}, "comments": "This course explores the oft-discussed topic of energy production and consumption. Throughout the semester, students examine a number of alternative modes of energy generation, studying the physical and technical aspects of each and also their societal, environmental, and economic impacts. Specific topics and readings change each semester to match current events. This course fulfills the Natural Science and Math sector requirement.\r\n\r\nStudents found the course interesting and relevant. As one student commented, the course is a “great combination of physics and applications of physical models in the real world.” The course is targeted towards “non-science majors” according to the registrar; however, several students commented that a previous knowledge of physics was assumed.\r\n\r\nStudents thought Professor Lande was “interesting” and “smart,” and enjoyed the interactive nature of his lectures. However, many were disappointed with the format of the course. Several felt that it was “disorganized” and that readings were sporadically assigned. Students found it difficult to understand the more complicated physics topics from the lectures and felt that they had to “do a lot of learning on their own.”\r\n\r\nThe only evaluations for the class were a midterm and final. Though the workload was light, many students felt that without problem sets they were not prepared for the physics calculations on tests. As one student wrote, “the professor will go over a mathematical question once in class and expect you to understand and repeat on an exam.” Many suggested that more resources should be made available, like practice exams. Though challenging, tests had a “huge curve.”", "num_students": 82, "path": "/courses/16314/sections/001/reviews/1672-KENNETH-LANDE", "instructor": {"path": "/instructors/1672-KENNETH-LANDE", "first_name": "KENNETH", "last_name": "LANDE", "id": "1672-KENNETH-LANDE", "name": "KENNETH LANDE"}, "num_reviewers": 77, "id": "16314-001-1672-KENNETH-LANDE"}]