{"coursehistories": {"path": "/coursehistories/4596"}, "description": "This course examines the supply side of global markets for pure risks. Pure risks can be broadly defined as risks that are beyond the core competencies of the majority of firms in the economy. These are risks that must be managed or avoided in order to enable management to add value by focusing on the firm's primary activity. An important category of pure risks encompasses those risks that traditionally were managed by purchasing insurance - the risk of reduction of firm value due to fires, natural disasters, liability lawsuits, work injuries, and other types of accidents or legal actions. However, pure risks also include other sources of volatility that have not traditionally been traded in insurance markets. The latter category includes weather risk, credit risk, and foreign exchange risk, among others. The course examines insurance and financial markets, \"alternative market\" approaches to dealing with pure risks such as captive insurance companies, the global market for reinsurance, and markets for securitized risk products such as catastrophe bonds, mortality index bonds, and life insurance reserve financing securitizations. \n\nThis course is intended to complement Insurance 811,\"Risk and Crisis Management.\" INSR 811 focuses on how firms can use various types of hedging instruments to manage pure risks, i.e, its emphasis is primarily on the demand side of markets for pure risks, whereas INSR 812 examines the supply side of these markets. \n\n", "semester": "2010C", "name": "MARKETS FOR PURE RISK", "reviews": {"path": "/courses/23265/reviews", "values": [{"ratings": {"rAmountLearned": "3.20", "rDifficulty": "2.40", "rStimulateInterest": "3.30", "rRecommendMajor": "3.00", "rCourseQuality": "3.10", "rWorkRequired": "2.20", "rInstructorAccess": "3.22", "rReadingsValue": "2.70", "rRecommendNonMajor": "2.80", "rCommAbility": "3.60", "rInstructorQuality": "3.30"}, "section": {"name": "MARKETS FOR PURE RISK", "sectionnum": "002", "primary_alias": "INSR-812-002", "path": "/courses/23265/sections/002", "id": "23265-002", "aliases": ["INSR-812-002"]}, "comments": "", "num_students": 10, "path": "/courses/23265/sections/002/reviews/4380-JOAN-LAMM-TENNANT", "instructor": {"path": "/instructors/4380-JOAN-LAMM-TENNANT", "first_name": "JOAN", "last_name": "LAMM-TENNANT", "id": "4380-JOAN-LAMM-TENNANT", "name": "JOAN LAMM-TENNANT"}, "num_reviewers": 10, "id": "23265-002-4380-JOAN-LAMM-TENNANT"}]}, "credits": null, "primary_alias": "INSR-812", "path": "/courses/23265", "sections": {"path": "/courses/23265/sections", "values": [{"name": "MARKETS FOR PURE RISK", "sectionnum": "002", "primary_alias": "INSR-812-002", "path": "/courses/23265/sections/002", "id": "23265-002", "aliases": ["INSR-812-002"]}]}, "id": 23265, "aliases": ["INSR-812"]}