[{"ratings": {"rAmountLearned": "3.04", "rDifficulty": "2.09", "rStimulateInterest": "2.89", "rRecommendMajor": "3.62", "rCourseQuality": "2.96", "rWorkRequired": "2.51", "rInstructorAccess": "3.40", "rReadingsValue": "3.01", "rRecommendNonMajor": "3.07", "rCommAbility": "2.97", "rInstructorQuality": "3.16"}, "section": {"name": "AFRICA SINCE 1800", "sectionnum": "401", "primary_alias": "HIST-076-401", "path": "/courses/23204/sections/401", "id": "23204-401", "aliases": ["HIST-076-401", "AFRC-076-401", "AFST-076-401"]}, "comments": "The class covers the major themes, events, and personalities in African history from the early nineteenth century through the 1960's. The class material include the abolition of slave trade, European Imperialism, impact of colonial rule, African resistance, religious and cultural movements, rise of nationalism and pan-Africanism, issues of ethnicity and \"tribalism\" in modern Africa.&#8232;\r\n\r\n&#8232;All students agreed that the class was “wonderful” and “interesting.” However, some felt that the course covered too much information for one semester. They expressed that some of the material was “too broad both chronologically and geographically” and that it relied excessively on the readings. Students said that the readings were interesting and that the material was engaging even to those who know little about History and Africa. Overall, the class “piqued interest to learn more.”&#8232;&#8232;\r\n\r\nStudents raved about the “passionate and knowledgeable” Professor Cassanelli. Even though some expressed that he was a little disorganized in lectures and starts and ended class late, he genuinely cared about the material and the students. One student said that, “Professor Cassanelli is an incredible lecturer who is truly fascinated by the material and completely engaged in teaching it.” Students praised Professor Cassanelli for providing extra help to insure that the students developed a better understanding of the material.&#8232;&#8232;\r\n\r\nGenerally, students felt that the work requirements were fine. Some students expressed that the readings, although interesting and informative, were “excessive” and that the journals were “tedious.” This course fulfills the History and Tradition sector requirement.\r\n", "num_students": 150, "path": "/courses/23204/sections/401/reviews/658-LEE-V-CASSANELLI", "instructor": {"path": "/instructors/658-LEE-V-CASSANELLI", "first_name": "LEE V", "last_name": "CASSANELLI", "id": "658-LEE-V-CASSANELLI", "name": "LEE V CASSANELLI"}, "num_reviewers": 138, "id": "23204-401-658-LEE-V-CASSANELLI"}]