{"coursehistories": {"path": "/coursehistories/1989"}, "description": "This course is an upper level course that discusses the behavior of materials, the selection of materials in mechanical components, and the mechanics of deformable bodies. It is intended for students interested in material science, mechanical engineering, and civil engineering. The topics covered include: Stress. Strain. Principal Stresses. Compatibility. Elastic stress-strain relations. Strain energy. Plane strain. Plane stress. Rods and trusses. Bending of beams. Torsion. Rotating disks. Castigliano's Theorem. Dummy loads. Principle of virtual work. The Rayleigh-Ritz Methods. Introduction to the finite element method. Non-linear material behavior. Yielding. Failure. \n\n", "semester": "2011A", "name": "MECHANICS OF MATERIALS", "reviews": {"path": "/courses/22025/reviews", "values": [{"ratings": {"rAmountLearned": "1.93", "rDifficulty": "3.50", "rStimulateInterest": "1.43", "rRecommendMajor": "2.00", "rCourseQuality": "1.60", "rWorkRequired": "3.29", "rInstructorAccess": "1.71", "rReadingsValue": "1.64", "rRecommendNonMajor": "0.57", "rCommAbility": "1.43", "rInstructorQuality": "1.67"}, "section": {"name": "MECHANICS OF MATERIALS", "sectionnum": "401", "primary_alias": "MEAM-454-401", "path": "/courses/22025/sections/401", "id": "22025-401", "aliases": ["MEAM-454-401", "MEAM-554-401"]}, "comments": "This course is an upper level course that discusses the behavior of materials, the selection of materials in mechanical components, and the mechanics of deformable bodies. The topics covered include: stress, strain, principal stresses, compatibility, elastic stress-strain relations, strain energy, plane strain, plane stress, rods and trusses, bending of beams, torsion, rotating disks, Castigliano's theorem, dummy loads, principle of virtual work, the Rayleigh-Ritz Methods, introduction to the finite element method, non-linear material behavior, yielding and failure.&#8232;&#8232;Most students reported not liking the class due to the poor teaching and unhelpful TA’s. One student commented that the course was too theoretical and insufficient in real world applications.&#8232;&#8232;Many students indicated that Professor Ponte-Castaneda put little or no effort into the class. One student even pointed out that Professor Ponte-Castaneda would sometimes come to class and just recopy the book on the board. Students remarked that the professor “taught without any emphasis” and did not give out additional practice problems outside the book. &#8232;&#8232;Consequently, the discrepancy between class, homework, and exam material led students to find the exams “particularly difficult.” Students also found the weekly homework “challenging,” but it was only worth 10% of the grade. This course is intended for students interested in material science, mechanical engineering, and civil engineering.", "num_students": 16, "path": "/courses/22025/sections/401/reviews/1571-PEDRO-PONTE-CASTANEDA", "instructor": {"path": "/instructors/1571-PEDRO-PONTE-CASTANEDA", "first_name": "PEDRO", "last_name": "PONTE-CASTANEDA", "id": "1571-PEDRO-PONTE-CASTANEDA", "name": "PEDRO PONTE-CASTANEDA"}, "num_reviewers": 15, "id": "22025-401-1571-PEDRO-PONTE-CASTANEDA"}]}, "credits": null, "primary_alias": "MEAM-454", "path": "/courses/22025", "sections": {"path": "/courses/22025/sections", "values": [{"name": "MECHANICS OF MATERIALS", "sectionnum": "401", "primary_alias": "MEAM-454-401", "path": "/courses/22025/sections/401", "id": "22025-401", "aliases": ["MEAM-454-401", "MEAM-554-401"]}]}, "id": 22025, "aliases": ["MEAM-454", "MEAM-554"]}