[{"ratings": {"rAmountLearned": "1.72", "rDifficulty": "2.31", "rStimulateInterest": "2.00", "rRecommendMajor": "2.07", "rCourseQuality": "1.83", "rWorkRequired": "3.00", "rInstructorAccess": "2.48", "rReadingsValue": "1.38", "rRecommendNonMajor": "1.76", "rCommAbility": "2.24", "rInstructorQuality": "1.97"}, "section": {"name": "MYTHOLOGY & THE MOVIES", "sectionnum": "401", "primary_alias": "ANTH-160-401", "path": "/courses/22620/sections/401", "id": "22620-401", "aliases": ["ANTH-160-401", "CINE-106-401"]}, "comments": "This course looks at popular Hollywood movies as a form of mythology that people use to interpret, organize and make sense of the world around them. It applies theories from anthropology and mythology as well as analyzing the incorporation of movie mythology into everyday life through fan culture, merchandise, advertising and related media.&#8232;&#8232;Many students expressed frustration with this course. While they found the subject matter intriguing, the class required more computer knowledge than students expected. This is explained by one student who wrote, “While the class was incredibly interesting and showed a lot of very interesting ways to look at movies, I think the way the instructor approached certain aspects were unfair. In particular, the fact that a lot of the work we had to was related to computers and a lot of the points I lost [on exams] were because of computer problems.  This is an anthropology course, not a computer science course”. &#8232;&#8232;Students were displeased with the fact that they learned more about Professor Krasniewicz’s personal life and the kinds of movies she enjoys than about mythology. Students also felt that the material presented in class wasn’t always relevant to other material. They called Professor Krasniewicz’s connections among subjects “forced” and “odd,” though she was very knowledgeable on the individual subjects. &#8232;&#8232;The final creative project was difficult for many students who weren’t initially exposed to the complicated computer software, and one student felt it was “…completely irrelevant to the course. It has nothing to do with mythology, nor movies, and is entirely too time consuming for such an irrelevant class.” ", "num_students": 41, "path": "/courses/22620/sections/401/reviews/2851-LOUISE-KRASNIEWICZ", "instructor": {"path": "/instructors/2851-LOUISE-KRASNIEWICZ", "first_name": "LOUISE", "last_name": "KRASNIEWICZ", "id": "2851-LOUISE-KRASNIEWICZ", "name": "LOUISE KRASNIEWICZ"}, "num_reviewers": 35, "id": "22620-401-2851-LOUISE-KRASNIEWICZ"}]