[{"ratings": {"rAmountLearned": "3.56", "rDifficulty": "2.33", "rStimulateInterest": "3.70", "rRecommendMajor": "3.61", "rCourseQuality": "3.62", "rWorkRequired": "3.23", "rInstructorAccess": "3.70", "rReadingsValue": "3.59", "rRecommendNonMajor": "3.18", "rCommAbility": "3.77", "rInstructorQuality": "3.81"}, "section": {"name": "ENG ENTREPRENEURSHIP I", "sectionnum": "001", "primary_alias": "EAS-545-001", "path": "/courses/24259/sections/001", "id": "24259-001", "aliases": ["EAS-545-001"]}, "comments": "Engineers and scientists create and lead great companies, hiring managers when\r\nand where needed to help execute their vision. Designed expressly for students having a\r\nkeen interest in technological innovation, this course investigates the roles of inventors\r\nand founders in successful technology ventures. Through case studies and guest\r\nspeakers, we introduce the knowledge and skills needed to recognize and seize a hightech\r\nentrepreneurial opportunity - be it a product or service - and then successfully launch\r\na startup or spin-off company. The course studies key areas of intellectual property, its\r\nprotection and strategic value; opportunity analysis and concept testing; shaping\r\ntechnology driven inventions into customer-driven products; constructing defensible\r\ncompetitive strategies; acquiring resources in the form of capital, people and strategic\r\npartners; and the founder's leadership role in an emerging high-tech company.\r\nThroughout the course emphasis is placed on decisions faced by founders, and on the\r\nsequential risks and determinants of success in the early growth phase of a technology\r\nventure. The course is designed for, but not restricted to, students of engineering and\r\napplied science and assumes no prior business education.\r\nThe general consensus from the undergrads and graduate students who completed\r\nthis course was that it was very helpful, interesting and useful. Students felt that it was\r\neasy to fall behind because there is much reading and writing involved in the class. Some\r\nexpressed disappointment in the fact that the professor chose outdated case studies and\r\nfelt that most of the class time was done to re-hash the case studies, feeling that this was a\r\nwaste of time.\r\nThere were mixed feelings about this professor. Most of the students thought that\r\nthe professor was very good: \"He is a brilliant Instructor and I learned so much more than\r\nthought I would learn.\" Professor Babin was approachable for questions and he chose\r\ncase studies with useful information. However, the professor was not forgiving when\r\nsome students had to miss class for job interviews. Some students wished that the\r\nprofessor would update the case studies integrated in the class discussions.\r\nThere was no midterm or project in this class. For this reason, much of your\r\ngrade is heavily based on participation in class discussion and quizzes. Missing a class is\r\nprohibited due to the fact that discussion is a large component of the class. Nevertheless,\r\nmany students would agree that they learned a lot in this class, the information was very\r\nuseful, and that this was a great class.", "num_students": 52, "path": "/courses/24259/sections/001/reviews/1595-JEFFREY-A--BABIN", "instructor": {"path": "/instructors/1595-JEFFREY-A--BABIN", "first_name": "JEFFREY A.", "last_name": "BABIN", "id": "1595-JEFFREY-A--BABIN", "name": "JEFFREY A. BABIN"}, "num_reviewers": 47, "id": "24259-001-1595-JEFFREY-A--BABIN"}, {"ratings": {"rAmountLearned": "3.33", "rDifficulty": "2.88", "rStimulateInterest": "3.68", "rRecommendMajor": "3.63", "rCourseQuality": "3.51", "rWorkRequired": "3.49", "rInstructorAccess": "3.58", "rReadingsValue": "3.51", "rRecommendNonMajor": "3.39", "rCommAbility": "3.85", "rInstructorQuality": "3.78"}, "section": {"name": "ENG ENTREPRENEURSHIP I", "sectionnum": "002", "primary_alias": "EAS-545-002", "path": "/courses/24259/sections/002", "id": "24259-002", "aliases": ["EAS-545-002"]}, "comments": "This course is designed expressly for students having a keen interest in\r\ntechnological innovation, as students investigate the roles of inventors and founders in\r\nsuccessful technology ventures. Through case studies and guest speakers, the knowledge\r\nand skills needed to recognize and seize a high-tech entrepreneurial opportunity - be it a\r\nproduct or service – are introduced and then used to successfully launch a startup or spinoff\r\ncompany. The course studies key areas of intellectual property, its protection and\r\nstrategic value, opportunity analysis, concept testing, shaping technology driven\r\ninventions into customer-driven products, constructing defensible competitive strategies,\r\nacquiring resources in the form of capital, people and strategic partners, and the founder's\r\nleadership role in an emerging high-tech company. Throughout the course emphasis is\r\nplaced on decisions faced by founders, and on the sequential risks and determinants of\r\nsuccess in the early growth phase of a technology venture. The course is designed for, but\r\nnot restricted to, students of engineering and applied science and assumes no prior\r\nbusiness education.\r\nThe majority of the students felt that it was one of the “best engineering courses”\r\ngiven at Penn. They felt that the course was extremely “well organized” and that it\r\nprovided a lot of “valuable knowledge” about entrepreneurship and starting up a\r\nbusinesses. Students also felt that the material taught in this class would forever directly\r\napply to their experience in the workforce.\r\nStudents were very pleased with Professor Cassel, describing him as “very nice\r\nand helpful.”\r\nThis course required a lot of work and time commitment. There is also a lot of\r\n“busy work” throughout the semester. In addition, some of the students felt that the\r\ngrading was rather tough. However, students did feel that the class was “worth the\r\ninvestment.” Prerequisites for this course are simply a junior, senior, or graduate level\r\nstanding.", "num_students": 47, "path": "/courses/24259/sections/002/reviews/317-THOMAS-A--CASSEL", "instructor": {"path": "/instructors/317-THOMAS-A--CASSEL", "first_name": "THOMAS A.", "last_name": "CASSEL", "id": "317-THOMAS-A--CASSEL", "name": "THOMAS A. CASSEL"}, "num_reviewers": 42, "id": "24259-002-317-THOMAS-A--CASSEL"}]