[{"ratings": {"rAmountLearned": "2.40", "rDifficulty": "2.30", "rStimulateInterest": "2.50", "rRecommendMajor": "2.80", "rCourseQuality": "2.50", "rWorkRequired": "2.60", "rInstructorAccess": "2.90", "rReadingsValue": "2.70", "rRecommendNonMajor": "2.10", "rCommAbility": "3.00", "rInstructorQuality": "2.92"}, "section": {"name": "LITERATURES OF JAZZ", "sectionnum": "401", "primary_alias": "ENGL-080-401", "path": "/courses/21581/sections/401", "id": "21581-401", "aliases": ["ENGL-080-401", "MUSC-080-401", "AFRC-079-401"]}, "comments": "This course covers the “conversation about jazz” which ranges across history, politics, romance, and what it means to be (and seek to remain) human. Students become involved in this conversation, first by learning that jazz originates out of local circumstance, which means that students must pay close attention to Philadelphia as an important chapter in the jazz story. From there, students proceed by utilizing readings from numerous forms of cultural meditation- fiction, poetry, autobiography, album liner notes, reviews, film, and oral narrative-as a prelude to making their own contributions to the jazz conversation. To that end, students undertake to write reviews, make their own films or photographs, participate in live jam sessions, create and perform poems. Writers and musicians in the course include Ishmael Reed, Louis Armstrong, Toni Morrison, Charlie Parker, Miles Davis, August Wilson, John Coltrane, and Wynton Marsalis. &#8232;&#8232;Students generally thought that the novels chosen for this course were interesting and that the course was culturally enriching. Students reported that it is a good course for students whose interests lie within “jazz, English, African American history, and pop culture.” Some students complained that the goals of the course were not always clear and that class discussions sometimes seemed tangential. &#8232;&#8232;Students commented more about the course than they did about Professor Beavers, but some reported that Professor Beavers was knowledgeable about the material. &#8232;&#8232;Students generally thought that the reading for this course was heavy and several thought that Professor Beavers was tough on papers. Overall, students agreed that the course was difficult but manageable.&#8232;&#8232;This review is based on the 5 student comments that were submitted.", "num_students": 15, "path": "/courses/21581/sections/401/reviews/1408-HERMAN-BEAVERS", "instructor": {"path": "/instructors/1408-HERMAN-BEAVERS", "first_name": "HERMAN", "last_name": "BEAVERS", "id": "1408-HERMAN-BEAVERS", "name": "HERMAN BEAVERS"}, "num_reviewers": 13, "id": "21581-401-1408-HERMAN-BEAVERS"}]