{"coursehistories": {"path": "/coursehistories/1245"}, "description": "This course is designed for students who are interested in pursuing an international career and for those who plan to work for industrial and financial corporations that operate in emerging markets. The course will deal with the economic and political problems of macroeconomic adjustment, corruption, the transition economies, and international financial transactions. All of these topics will be illustrated with in-depth studies of economies in Africa, Asia, Latin America, the Middle East, Eastern Europe, and China. \n\n", "semester": "2011C", "name": "NATIONS, POL AND MARKETS", "reviews": {"path": "/courses/24089/reviews", "values": [{"ratings": {"rAmountLearned": "3.10", "rDifficulty": "2.77", "rStimulateInterest": "2.79", "rRecommendMajor": "3.40", "rCourseQuality": "2.81", "rWorkRequired": "2.50", "rInstructorAccess": "2.41", "rReadingsValue": "2.60", "rRecommendNonMajor": "2.77", "rCommAbility": "2.80", "rInstructorQuality": "2.74"}, "section": {"name": "NATIONS, POL AND MARKETS", "sectionnum": "001", "primary_alias": "BPUB-289-001", "path": "/courses/24089/sections/001", "id": "24089-001", "aliases": ["BPUB-289-001"]}, "comments": "Business and Public Policy 289 is designed for students who are interested in pursuing an international career and for those who plan to work for industrial and financial corporations that operate in emerging markets. The course will deal with the economic and political problems of macroeconomic adjustment, corruption, the transition economies, and international financial transactions. All of these topics will be illustrated with in-depth studies of economies in Africa, Asia, Latin America, the Middle East, Eastern Europe, and China.\r\n\r\nMost students felt that this was a fantastic class. Several students praised the “integration of current events” in the material. However, others mentioned that they were not happy with the course. A couple of students complained that more emphasis was placed on memorization than on actual learning. \r\n\r\nA majority of students praised Professor Pack. They applauded Professor Pack’s “ability to supplement the theory and case studies with personal experiences.” Most students felt that Professor Pack was engaging and experienced. However, several students complained that Professor Pack’s PowerPoint presentations were disorganized and that he often lectured without assessing the class’s understanding of the material that he had assigned as homework, leading to a great deal of confusion. \r\n\r\nIn terms of audience, students felt that this course is great for students who are interested in the policies regarding global development, but is not intended as much for students that are interested in the quantitative side of the situation. In terms of workload, several students mentioned that there was confusion surrounding assessments. One student wrote that there were “too many readings for the class and it was unclear how to study for exams.” The prerequisites for this course are ECON002 and FNCE102. \r\n", "num_students": 32, "path": "/courses/24089/sections/001/reviews/1806-HOWARD-PACK", "instructor": {"path": "/instructors/1806-HOWARD-PACK", "first_name": "HOWARD", "last_name": "PACK", "id": "1806-HOWARD-PACK", "name": "HOWARD PACK"}, "num_reviewers": 32, "id": "24089-001-1806-HOWARD-PACK"}]}, "credits": null, "primary_alias": "BPUB-289", "path": "/courses/24089", "sections": {"path": "/courses/24089/sections", "values": [{"name": "NATIONS, POL AND MARKETS", "sectionnum": "001", "primary_alias": "BPUB-289-001", "path": "/courses/24089/sections/001", "id": "24089-001", "aliases": ["BPUB-289-001"]}]}, "id": 24089, "aliases": ["BPUB-289"]}