[{"ratings": {"rAmountLearned": "3.74", "rDifficulty": "3.13", "rStimulateInterest": "3.70", "rRecommendMajor": "3.91", "rCourseQuality": "3.68", "rWorkRequired": "3.00", "rInstructorAccess": "3.74", "rReadingsValue": "3.57", "rRecommendNonMajor": "2.96", "rCommAbility": "3.70", "rInstructorQuality": "3.81"}, "section": {"name": "MEANING OF DEMOCRACY", "sectionnum": "001", "primary_alias": "PSCI-281-001", "path": "/courses/23678/sections/001", "id": "23678-001", "aliases": ["PSCI-281-001"]}, "comments": "This course provides a broad, humanistic survey to some of the most important ideas, debates, and problems connected to the study of democracy. The course is divided into three segments: the democratic citizen, the democratic People, and the democratic world.\r\n\r\nStudents were very positive about the content of this course. One student in particular said that it was “extremely interesting and intellectually challenging.” Another student remarked on the “incredible curriculum.” Although there was a lot of assigned reading, the students found that Professor Green did a good job of reviewing it during class.\r\n\r\nStudents raved about Professor Green. Several hailed him as the best professor they have ever encountered at Penn. One student said Professor Green has “every quality that one looks for in a Professor.” He “cared about what his students learned” and was “always willing to talk after class and during office hours.” The majority of students remarked on his exceptional teaching skills, his ability to effectively communicate a “dense” subject, his talent, and how thought-provoking each lecture was.\r\n\r\nAlthough an upper level Political Science course, several of the students stated that they would recommend this course to all Penn students.\r\n", "num_students": 33, "path": "/courses/23678/sections/001/reviews/4538-JEFFREY-E--GREEN", "instructor": {"path": "/instructors/4538-JEFFREY-E--GREEN", "first_name": "JEFFREY E.", "last_name": "GREEN", "id": "4538-JEFFREY-E--GREEN", "name": "JEFFREY E. GREEN"}, "num_reviewers": 29, "id": "23678-001-4538-JEFFREY-E--GREEN"}]