{"coursehistories": {"path": "/coursehistories/2266"}, "description": "A survey of cultural productions by Latinas/os (i.e. people of Latin American descent who have been raised in the U.S.) that usually will focus on the twentieth century, but might at times examine earlier periods instead. The course will take a culturally and historically informed approach to a wide range of novels, poems, plays, and films, and will sometimes include visual art and music. Writers and artists might include Am?rico Paredes, Piri Thomas, Cherr?e Moraga, Sandra Cisneros, Julia Alvarez, Junot D?az, Cristina Garc?a, El Teatro Campesino, John Leguizamo, Carmen Lomas Garza, the Hernandez Brothers, and Los Tigres del Norte. \n\nSee the English Department's website at www.english.upenn.edu for a description of the current offerings. \n\n", "semester": "2011A", "name": "LATINA/O LITERATURE", "reviews": {"path": "/courses/21580/reviews", "values": [{"ratings": {"rAmountLearned": "3.22", "rDifficulty": "2.11", "rStimulateInterest": "2.67", "rRecommendMajor": "3.22", "rCourseQuality": "3.00", "rWorkRequired": "2.17", "rInstructorAccess": "3.56", "rReadingsValue": "3.44", "rRecommendNonMajor": "3.12", "rCommAbility": "3.11", "rInstructorQuality": "3.11"}, "section": {"name": "LATINA/O LITERATURE", "sectionnum": "401", "primary_alias": "ENGL-070-401", "path": "/courses/21580/sections/401", "id": "21580-401", "aliases": ["ENGL-070-401", "LALS-060-401"]}, "comments": "This introductory survey course focuses on the literature written by Latinos/-as, subjects of Latin American and Spanish Caribbean descent living in the U.S. Utilizing a range of books that shape the category of Latino literature along with selected essays and films, the course explores questions of how the heterogeneous diaspora that comes to be called ‘Latino’ problematizes ideas of race, class, and language in the U.S., and asks students to consider how it does so in dialogue with Latin America and the Caribbean.\r\n\r\nMost students enjoyed this “informative” course, and came out of the semester feeling that the course material was “very interesting.” The material was fresh and opened the mind of at least one student to “so many issues unknown before.” One student declared that it was “one of the best courses” taken at Penn thus far, and another noted that the course inspired consideration of a minor in Latin American studies. \r\n\r\nProfessor Ellis Neyra was well regarded among students enrolled in ENGL 70, and most students enthusiastically commented that they enjoyed having her as a professor. Described as “flexible” and “approachable,” students appreciated the level of interest she exhibited in both her students and her class, and her willingness to meet on a one on one basis in order to provide feedback on their work. One student said she was a “truly amazing instructor” who displayed a “deep passion for the course.” Her efforts were not without criticism, however. One student lamented the lack of student-based discussion in class, and another complained that lectures tended to not be “very engaging,” making it “difficult to focus in class.” Still, the overall feedback for Professor Ellis Neyra was positive.\r\n\r\nStudents were pleased that the workload was maintained at a fair level, and commented that the reading selections were “relevant and enjoyable.” Although there was some level of confusion regarding how grades were given, the general feedback was positive. Most students enthusiastically recommended the course.\r\n", "num_students": 19, "path": "/courses/21580/sections/401/reviews/5341-RACHEL-E-ELLIS", "instructor": {"path": "/instructors/5341-RACHEL-E-ELLIS", "first_name": "RACHEL E", "last_name": "ELLIS", "id": "5341-RACHEL-E-ELLIS", "name": "RACHEL E ELLIS"}, "num_reviewers": 19, "id": "21580-401-5341-RACHEL-E-ELLIS"}]}, "credits": null, "primary_alias": "ENGL-070", "path": "/courses/21580", "sections": {"path": "/courses/21580/sections", "values": [{"name": "LATINA/O LITERATURE", "sectionnum": "401", "primary_alias": "ENGL-070-401", "path": "/courses/21580/sections/401", "id": "21580-401", "aliases": ["ENGL-070-401", "LALS-060-401"]}]}, "id": 21580, "aliases": ["ENGL-070", "LALS-060"]}