{"coursehistories": {"path": "/coursehistories/3123"}, "description": "This course is intended to give students an in-depth understanding of the ways in which medical practice and medical decision-making are guided by modern American law. Students will learn how the law's regulatory powers have been used to set boundaries in medicine and, in turn, how medical practice and theory have informed modern legal develoments. The field of health care law sits at a crossroads where many of life's \"big questions\" converge, and consequently is shaped, more than any other legal discipline, by social, ethical, cultural and economic influences. By the end of this course, students should have an understanding both of the current state of American health law, and of the social forces that have shaped its historical development. \n\n", "semester": "2010C", "name": "LAW AND MEDICINE", "reviews": {"path": "/courses/23250/reviews", "values": [{"ratings": {"rAmountLearned": "3.44", "rDifficulty": "2.44", "rStimulateInterest": "3.28", "rRecommendMajor": "3.78", "rCourseQuality": "3.50", "rWorkRequired": "2.22", "rInstructorAccess": "3.67", "rReadingsValue": "2.94", "rRecommendNonMajor": "3.06", "rCommAbility": "3.61", "rInstructorQuality": "3.50"}, "section": {"name": "LAW AND MEDICINE", "sectionnum": "301", "primary_alias": "HSOC-252-301", "path": "/courses/23250/sections/301", "id": "23250-301", "aliases": ["HSOC-252-301"]}, "comments": "This course is intended to give students an in-depth understanding of the ways in which medical practice and medical decision-making are guided by modern American law. Students learn how the law's regulatory powers have been used to set boundaries in medicine and, in turn, how medical practice and theory have informed modern legal developments. The field of health care law sits at a crossroads where many of life's \"big questions\" converge, and consequently is shaped, more than any other legal discipline, by social, ethical, cultural and economic influences. By the end of this course, students should have an understanding both of the current state of American health law, and of the social forces that have shaped its historical development. &#8232;&#8232;\r\n\r\nOverall students thoroughly enjoyed this “fascinating” and “interesting” class. There was a good amount of classroom debate. One student described that there was, “a comfortable atmosphere of asking questions and sharing opinions within the classroom.” Several students even claimed that this was their favorite course at Penn. &#8232;\r\n\r\nStudents praised Professor Zuraw for her ability to stimulate learning through discussion and participation. One student commented, “Professor Zuraw's enthusiasm in the subject area is very contagious!” Students felt that Professor Zuraw was very accessible. A student related how Professor Zuraw encouraged students, “to meet with her outside of class to further discuss our papers or topics we touched upon in class.” &#8232;\r\n\r\n&#8232;There are no prerequisites for this course. This course does not fulfill any of the General Requirements. The class is open to Freshmen and Upperclassmen.\r\n", "num_students": 29, "path": "/courses/23250/sections/301/reviews/5626-RACHEL-ZURAW", "instructor": {"path": "/instructors/5626-RACHEL-ZURAW", "first_name": "RACHEL", "last_name": "ZURAW", "id": "5626-RACHEL-ZURAW", "name": "RACHEL ZURAW"}, "num_reviewers": 22, "id": "23250-301-5626-RACHEL-ZURAW"}]}, "credits": null, "primary_alias": "HSOC-252", "path": "/courses/23250", "sections": {"path": "/courses/23250/sections", "values": [{"name": "LAW AND MEDICINE", "sectionnum": "301", "primary_alias": "HSOC-252-301", "path": "/courses/23250/sections/301", "id": "23250-301", "aliases": ["HSOC-252-301"]}]}, "id": 23250, "aliases": ["HSOC-252"]}