[{"ratings": {"rAmountLearned": "2.49", "rDifficulty": "2.54", "rStimulateInterest": "2.18", "rRecommendMajor": "3.21", "rCourseQuality": "2.39", "rWorkRequired": "2.50", "rInstructorAccess": "2.64", "rReadingsValue": "2.38", "rRecommendNonMajor": "2.39", "rCommAbility": "2.75", "rInstructorQuality": "2.55"}, "section": {"name": "THE FAMILY", "sectionnum": "401", "primary_alias": "SOCI-004-401", "path": "/courses/16452/sections/401", "id": "16452-401", "aliases": ["SOCI-004-401", "GSOC-004-401"]}, "comments": "This course examines the family in the United States from a sociological perspective. What is the family? Is there a singular definition of family? What purpose do families serve in our society? How does the government affect the family? How and why is the family changing over time? Are these changes beneficial or detrimental to adults, children, and society overall? These questions are raised while studying the family as an institution rooted in historical and social contexts. This course also addresses issues of the contemporary U.S. family, considering how race and class shape the diversity in family experiences.\r\n\r\nStudents found this course \\\"very interesting,\\\" \\\"informative,\\\" and \\\"valuable.\\\" They learned a lot about the family, and some even noted that the material challenged their own perceptions and contributed new perspectives on family life.&#8232;\r\n\r\nStudents noted Professor Harknett\\'s \\\"good teaching style.\\\" They also liked that she posted all of the lecture slides to Blackboard. Some, however, felt as though she was unwilling to discuss course content, instead advising students to consult their TAs.\r\n\r\nMany students felt as though there was \\\"too much reading.\\\" They found the assigned readings \\\"numerous,\\\" \\\"very lengthy,\\\" and \\\"repetitive,\\\" with articles often overlapping in content and many reaching the same conclusions. Additionally, many students felt as though the amount of work required for the \\\"short\\\" paper assignments was significantly underestimated. One senior commented that she felt \\\"overwhelmed\\\" by the amount of work required for these papers, indicating that it was excessive, especially for an intro level course. This course fulfills the Society sector and Quantitative Data Analysis requirement.", "num_students": 78, "path": "/courses/16452/sections/401/reviews/2687-KRISTEN-HARKNETT", "instructor": {"path": "/instructors/2687-KRISTEN-HARKNETT", "first_name": "KRISTEN", "last_name": "HARKNETT", "id": "2687-KRISTEN-HARKNETT", "name": "KRISTEN HARKNETT"}, "num_reviewers": 75, "id": "16452-401-2687-KRISTEN-HARKNETT"}]