{"coursehistories": {"path": "/coursehistories/484"}, "description": "The focus of this course is on the valuation of companies. Topics discussed include discounted cash flow techniques and valuation using alternative valuation techniques such as price multiples. Emphasis is on developing the required information for valuation from financial statements and other information sources. \n\n", "semester": "2011C", "name": "CORPORATE VALUATION", "reviews": {"path": "/courses/24424/reviews", "values": [{"ratings": {"rAmountLearned": "3.47", "rDifficulty": "3.88", "rStimulateInterest": "2.69", "rRecommendMajor": "3.32", "rCourseQuality": "3.11", "rWorkRequired": "3.92", "rInstructorAccess": "2.81", "rReadingsValue": "2.76", "rRecommendNonMajor": "1.22", "rCommAbility": "3.19", "rInstructorQuality": "3.10"}, "section": {"name": "CORPORATE VALUATION", "sectionnum": "001", "primary_alias": "FNCE-207-001", "path": "/courses/24424/sections/001", "id": "24424-001", "aliases": ["FNCE-207-001"]}, "comments": "The focus of Finance 207 is on the valuation of companies. Topics discussed include discounted cash flow techniques and valuation using alternative valuation techniques such as price multiples. Emphasis is placed on developing the required information for valuation from financial statements and other information sources. \r\n\r\nGenerally, students thought this was one of the best finance classes in Wharton and said the class would \"serve as a great resource in the future,\" especially in preparing for investment banking.\r\n\r\nStudents agreed that Professor Holthausen presented the material well and was concerned about students succeeding. However, some people thought he expected his students to have previous knowledge of corporate valuation and therefore was reluctant to answer questions in class.\r\n\r\nAlmost all students thought the amount of coursework was very extensive, especially regarding group projects. The class required \"considerable commitment both in terms of time and ability,\" but was ultimately rewarding. Prerequisites include FNCE 100, ACCT 101, and STAT 101-111. Acct 201 is recommended.\r\n", "num_students": 73, "path": "/courses/24424/sections/001/reviews/1431-ROBERT-W--HOLTHAUSEN", "instructor": {"path": "/instructors/1431-ROBERT-W--HOLTHAUSEN", "first_name": "ROBERT W.", "last_name": "HOLTHAUSEN", "id": "1431-ROBERT-W--HOLTHAUSEN", "name": "ROBERT W. HOLTHAUSEN"}, "num_reviewers": 72, "id": "24424-001-1431-ROBERT-W--HOLTHAUSEN"}, {"ratings": {"rAmountLearned": "3.28", "rDifficulty": "3.80", "rStimulateInterest": "2.42", "rRecommendMajor": "3.33", "rCourseQuality": "2.85", "rWorkRequired": "3.91", "rInstructorAccess": "2.68", "rReadingsValue": "2.57", "rRecommendNonMajor": "1.33", "rCommAbility": "2.84", "rInstructorQuality": "2.81"}, "section": {"name": "CORPORATE VALUATION", "sectionnum": "002", "primary_alias": "FNCE-207-002", "path": "/courses/24424/sections/002", "id": "24424-002", "aliases": ["FNCE-207-002"]}, "comments": "Finance 207 focuses on the valuation of companies. Topics discussed include discounted cash flow techniques and valuation using alternative valuation techniques such as price multiples. Emphasis is on developing the required information for valuation from financial statements and other information sources.\r\n\r\nMost students felt that the FNCE 207 was “essential” and “a must for anyone who wants to go into investment banking.”  One senior concluded that it was the “most useful finance class at Wharton.”  Students noted that the course covers a lot of “theory and practical material.”  While most students thought that the course was very valuable, a few felt that it “fell flat of expectations.”\r\n\r\nStudents had mixed opinions about Professor Holthausen.  Some described him as “extremely knowledgeable” and said that he did “an excellent job of covering all the intricacies of financial valuation.”   Others described him as “angry,” “arrogant,” and “intimidating.”  While some students appreciated the amount of detail that Professor Holthausen covered, a couple felt that the focus on detail caused the “theme of the class to be completely missed.”     \r\n\r\nStudents all seemed to agree that the course was “extremely difficult and time consuming.”  A couple said that taking the course “made the semester miserable” because of the enormous time commitment.   In particular, students said that they spent a lot of hours working on a “very work intensive” valuation project in which each team had to value a corporation.  A few students complained that the instructions “did not make very clear how the project would be graded,” which they felt was unfair, as the project represented a large portion of the final grade.  FNCE 100, ACCT 101, and STAT 101 or the equivalent are prerequisites.  Accounting 201 is recommended.  One student noted that the course was more useful for students who did not already have internship experience in investment banking.  Another recommended taking the class as a junior before – but not during – OCR.\r\n", "num_students": 73, "path": "/courses/24424/sections/002/reviews/1431-ROBERT-W--HOLTHAUSEN", "instructor": {"path": "/instructors/1431-ROBERT-W--HOLTHAUSEN", "first_name": "ROBERT W.", "last_name": "HOLTHAUSEN", "id": "1431-ROBERT-W--HOLTHAUSEN", "name": "ROBERT W. HOLTHAUSEN"}, "num_reviewers": 71, "id": "24424-002-1431-ROBERT-W--HOLTHAUSEN"}]}, "credits": null, "primary_alias": "FNCE-207", "path": "/courses/24424", "sections": {"path": "/courses/24424/sections", "values": [{"name": "CORPORATE VALUATION", "sectionnum": "001", "primary_alias": "FNCE-207-001", "path": "/courses/24424/sections/001", "id": "24424-001", "aliases": ["FNCE-207-001"]}, {"name": "CORPORATE VALUATION", "sectionnum": "002", "primary_alias": "FNCE-207-002", "path": "/courses/24424/sections/002", "id": "24424-002", "aliases": ["FNCE-207-002"]}]}, "id": 24424, "aliases": ["FNCE-207"]}