[{"ratings": {"rAmountLearned": "2.87", "rDifficulty": "3.34", "rStimulateInterest": "2.53", "rRecommendMajor": "3.03", "rCourseQuality": "2.65", "rWorkRequired": "3.63", "rInstructorAccess": "3.00", "rReadingsValue": "2.00", "rRecommendNonMajor": "1.20", "rCommAbility": "2.93", "rInstructorQuality": "3.16"}, "section": {"name": "STOCH SYS ANALYSIS SIMUL", "sectionnum": "001", "primary_alias": "ESE-303-001", "path": "/courses/23027/sections/001", "id": "23027-001", "aliases": ["ESE-303-001"]}, "comments": "ESE 303 explores stochastic systems, which could loosely be defined as anything random that changes in time. Stochastic systems are at the core of a number of disciplines in engineering such as communication systems and machine learning. The goal of the class is to learn how to model, analyze and simulate stochastic systems. The class is divided in four blocks: Markov chains, continuous time Markov chains, Gaussian processes and stationary processes. Introduction to Probability Models by Sheldon M. Ross is used as the textbook for the class.\r\n\r\nMany students enjoyed the course, although some students thought that lecture focused too much on PowerPoint slides. Some students found that the course tried to cover too much material and that they were unsure what the most important topics were. One student reported, “this really was one of the most interesting classes I have taken at Penn.” \r\n\r\nProfessor Ribeiro was generally positively regarded. Students reported that the professor and his lectures were of “excellent quality.” However, other students reported that he could be “condescending” at times. Furthermore, some students found that Professor Ribeiro “taught the course in a manner which is very difficult for students to comprehend.”\r\n\r\nThis is a junior level class, although some sophomores and seniors elect to take it as well. Most students found the class to be “lots of work.” However, students generally found that the course load was manageable once they grasped the topics covered in class.\r\n", "num_students": 43, "path": "/courses/23027/sections/001/reviews/4320-ALEJANDRO-RIBEIRO", "instructor": {"path": "/instructors/4320-ALEJANDRO-RIBEIRO", "first_name": "ALEJANDRO", "last_name": "RIBEIRO", "id": "4320-ALEJANDRO-RIBEIRO", "name": "ALEJANDRO RIBEIRO"}, "num_reviewers": 34, "id": "23027-001-4320-ALEJANDRO-RIBEIRO"}]