[{"ratings": {"rAmountLearned": "2.50", "rDifficulty": "2.22", "rStimulateInterest": "2.56", "rRecommendMajor": "3.33", "rCourseQuality": "2.68", "rWorkRequired": "2.39", "rInstructorAccess": "3.28", "rReadingsValue": "2.00", "rRecommendNonMajor": "2.12", "rCommAbility": "3.00", "rInstructorQuality": "3.05"}, "section": {"name": "NEW MEDIA AND POLITICS", "sectionnum": "601", "primary_alias": "COMM-397-601", "path": "/courses/21505/sections/601", "id": "21505-601", "aliases": ["COMM-397-601"]}, "comments": "This course seeks to trace the evolving relationship between new media and the political process from three perspectives: the voter, political campaigns and candidates, and the news media. The course begins with a broad overview of the main theories of political communication and U.S. political campaigns leading up to 1996, the year the internet debuted in a presidential campaign. It will then follow this evolution from the 1996 presidential campaign through the 2010 midterm campaigns and suggest implications going into the 2012 campaign. In addition, the course will examine issues of new media and activism, governance and transparency.&#8232;Students highly praised this course and said that they learned a lot. Some of the highlights include great guest speakers and a useful class Facebook group that stimulated many class discussions.&#8232;&#8232;&#8232;&#8232;Professor Winneg also received great reviews. As one student wrote “[Professor Winneg] understands and appreciates his students”. Another described him as “fair” and “flexible”. Even though his lectures can sometimes be “dry”, Professor Winneg overall received high marks with students.&#8232;&#8232;&#8232;&#8232;This course is recommended to majors. Anyone interested in a career in media or communications should consider taking this course.", "num_students": 19, "path": "/courses/21505/sections/601/reviews/5327-KENNETH-WINNEG", "instructor": {"path": "/instructors/5327-KENNETH-WINNEG", "first_name": "KENNETH", "last_name": "WINNEG", "id": "5327-KENNETH-WINNEG", "name": "KENNETH WINNEG"}, "num_reviewers": 19, "id": "21505-601-5327-KENNETH-WINNEG"}]