{"coursehistories": {"path": "/coursehistories/4284"}, "description": "A broad introduction to the history of Jewish civilization from its Biblical beginnings to the Middle Ages, with the main focus on the formative period of classical rabbinic Judaism and on the symbiotic relationship between Judaism, Christianity, and Islam. \n\n", "semester": "2012A", "name": "JEWS & JUDAISM IN ANTQTY", "reviews": {"path": "/courses/27563/reviews", "values": [{"ratings": {"rAmountLearned": "3.30", "rDifficulty": "2.56", "rStimulateInterest": "3.74", "rRecommendMajor": "3.63", "rCourseQuality": "3.48", "rWorkRequired": "2.85", "rInstructorAccess": "3.74", "rReadingsValue": "3.00", "rRecommendNonMajor": "3.00", "rCommAbility": "3.78", "rInstructorQuality": "3.86"}, "section": {"name": "JEWS & JUDAISM IN ANTQTY", "sectionnum": "401", "primary_alias": "HIST-139-401", "path": "/courses/27563/sections/401", "id": "27563-401", "aliases": ["HIST-139-401", "NELC-051-401", "JWST-156-401", "NELC-451-401", "RELS-120-401"]}, "comments": "This course is designed as a broad introduction to the history of Jewish civilization from its Biblical beginnings until the Middle Ages. The main focus of the course is on the formative period of classical rabbinic Judaism and on the symbiotic relationship between Judaism, Christianity, and Islam. Course readings include the Old Testament of the Bible.\r\n\r\nThis course was enjoyable, informational, and entertaining according to almost all students surveyed. “I learned a lot on the matter, and the course also opened up my perspective,” one student wrote. A couple students specifically noted that the course put the Bible in historical context, which greatly added to their appreciation of the content and course. A few students, however, felt disconnected from the subject matter due to their religion; as one student noted, they felt “[less] invested in the subject matter (in fact, at times I felt lost because I was not Jewish…)” One student enjoyed the course because the reliance on primary source text helped them to engage with the material and with current scholarly debates regarding that material. \r\n\r\nEvery student surveyed felt that Professor Dorhmann was “engaging, excited about the material, sharp, incredibly knowledgeable, and really invested in her students.” As one student explained, “The instructor was wonderful. [She] really stimulated student interst and was able to give over the content manner in an engaging way.” Professor Dohrmann’s teaching style “helped make the material fascinating,” and Professor Dohrmann’s demand of the classroom made every class exciting. Another student particularly liked Professor Dohrmann’s skill at “putting old and complex documents into layman’s terms and making the material relatable to those without much background knowledge.” Students also felt that Professor Dohrmann was a very fair grader. A few students, however, noted that Professor Dohrmann could move in “broad strokes” and “cover too much material” in one lecture. Despite this, the majority of students felt that “her excitement for what she's teaching is contagious, and she manages to make dry readings come to life.”\r\n\r\nThe expected workload for this class, according to students, is little until the end of the semester when there is both a final research paper (15 pages) and a final, in addition to a midterm. Many students felt there the reading was a bit lengthy — one student noted, “there was a ton of reading, but overall, it was useful and important to the course.” However, the majority of students would recommend the course to anyone, regardless of religion or major. As one student wrote, “Despite this being a class about Judaism, both Jews and non-Jews feel comfortable with how she handles the topics… She is wonderful for both freshman and seniors alike.”", "num_students": 35, "path": "/courses/27563/sections/401/reviews/2674-NATALIE-B-DOHRMANN", "instructor": {"path": "/instructors/2674-NATALIE-B-DOHRMANN", "first_name": "NATALIE B", "last_name": "DOHRMANN", "id": "2674-NATALIE-B-DOHRMANN", "name": "NATALIE B DOHRMANN"}, "num_reviewers": 30, "id": "27563-401-2674-NATALIE-B-DOHRMANN"}]}, "credits": null, "primary_alias": "HIST-139", "path": "/courses/27563", "sections": {"path": "/courses/27563/sections", "values": [{"name": "JEWS & JUDAISM IN ANTQTY", "sectionnum": "401", "primary_alias": "HIST-139-401", "path": "/courses/27563/sections/401", "id": "27563-401", "aliases": ["HIST-139-401", "NELC-051-401", "JWST-156-401", "NELC-451-401", "RELS-120-401"]}]}, "id": 27563, "aliases": ["HIST-139", "NELC-051", "JWST-156", "NELC-451", "RELS-120"]}