{"coursehistories": {"path": "/coursehistories/5249"}, "description": "This course provides an understanding of the major materials issues for current and emerging energy technologies. It includes a classification of materials for energy applications involving generation, transmission and storage of electricity; current and future uses of fossil fuels, with emphasis on higher efficiency uses of fossil fuels and \"all electric\" applications (e.g. transportation and power generation) and new materials as technology enablers for future energy sources: nuclear, fuel cells, solar, wind. \n\n", "semester": "2011C", "name": "ENERGY STORAGE & TECHNOL", "reviews": {"path": "/courses/24808/reviews", "values": [{"ratings": {"rAmountLearned": "2.91", "rDifficulty": "2.68", "rStimulateInterest": "3.03", "rRecommendMajor": "2.85", "rCourseQuality": "2.77", "rWorkRequired": "3.03", "rInstructorAccess": "3.09", "rReadingsValue": "2.91", "rRecommendNonMajor": "3.09", "rCommAbility": "3.06", "rInstructorQuality": "3.09"}, "section": {"name": "ENERGY STORAGE & TECHNOL", "sectionnum": "001", "primary_alias": "MSE-545-001", "path": "/courses/24808/sections/001", "id": "24808-001", "aliases": ["MSE-545-001"]}, "comments": "This course provides an understanding of the major materials issues for current\r\nand emerging energy technologies. It includes a classification of materials for energy\r\napplications involving generation, transmission, and storage of electricity; current and\r\nfuture uses of fossil fuels, with emphasis on higher efficiency uses of fossil fuels and \"all\r\nelectric\" applications (e.g. transportation and power generation) and new materials as\r\ntechnology enablers for future energy sources: nuclear, fuel cells, solar, wind.\r\nMany students stated that they thought the course material was extremely\r\ninteresting but a few students complained that the lecture notes were “unprofessional,”\r\n“chaotic,” and “unoriginal.”\r\nMany students appreciated his emails stating current topics in energy storage\r\ntechnology. Some students complained that he was very involved in his research and did\r\nnot have much time to see students outside of class.\r\nThis class is meant for seniors or graduate students in the materials science\r\nengineering department. However, this class can be taken by any engineer and was\r\n“highly recommended to anyone wanting a good overview of energy technology.”\r\nOnly 7 students submitted written reviews for this class.", "num_students": 40, "path": "/courses/24808/sections/001/reviews/4041-CHRISTOPHER-B--MURRAY", "instructor": {"path": "/instructors/4041-CHRISTOPHER-B--MURRAY", "first_name": "CHRISTOPHER B.", "last_name": "MURRAY", "id": "4041-CHRISTOPHER-B--MURRAY", "name": "CHRISTOPHER B. MURRAY"}, "num_reviewers": 35, "id": "24808-001-4041-CHRISTOPHER-B--MURRAY"}]}, "credits": null, "primary_alias": "MSE-545", "path": "/courses/24808", "sections": {"path": "/courses/24808/sections", "values": [{"name": "ENERGY STORAGE & TECHNOL", "sectionnum": "001", "primary_alias": "MSE-545-001", "path": "/courses/24808/sections/001", "id": "24808-001", "aliases": ["MSE-545-001"]}]}, "id": 24808, "aliases": ["MSE-545"]}