[{"ratings": {"rAmountLearned": "3.42", "rDifficulty": "2.75", "rStimulateInterest": "3.58", "rRecommendMajor": "3.75", "rCourseQuality": "3.50", "rWorkRequired": "2.92", "rInstructorAccess": "3.92", "rReadingsValue": "3.08", "rRecommendNonMajor": "3.50", "rCommAbility": "3.67", "rInstructorQuality": "3.67"}, "section": {"name": "PRINCIPLES AND PRACTICE OF QUALITY IMPROVEMENT AND SAFETY I", "sectionnum": "401", "primary_alias": "NURS-612-401", "path": "/courses/23551/sections/401", "id": "23551-401", "aliases": ["NURS-612-401", "HPR-504-401"]}, "comments": "Healthcare delivery is complex and constantly changing. A primary mission of leading healthcare organizations is to advance the quality of patient care by striving to deliver care that is safe, effective, efficient, timely, cost-effective, and patient-centered (Institute of Medicine). The goal of this interprofessional course is to provide students with a broad overview of the principles and tools of quality improvement and patient safety in healthcare as well address the knowledge, skills and attitudes as defined by the Quality and Safety Education for Nurses (QSEN) guidelines. It provides a foundation for students or practicing clinicians who are interested in quality improvement and patient safety research, administration, or clinical applications. Content addresses the history of the quality improvement process in healthcare, quality databases and improvement process tools and programs. Through the use of case studies and exercises students become familiar with the use of several quality improvement programs and tools. For example, the Plan-Do-Study- Act (PDSA) cycle, Six Sigma and the Toyota Production System known as Lean Production processes are addressed. Students can use this course to identify the tools and design the methods that they plan to employ in a quality improvement or patient safety project in their area of interest.This course is also cross listed as Health Policy Research (HPR-504-401).\r\n\r\nMany students reported that this class centered on readings prior to class, which then corresponded to numerous guest speakers. Students described the guest speakers as “excellent” and generally felt that they provided good insight into the various topics. Students reported that the course involved numerous exercises, projects, and lectures that they felt aided in their understanding of the topic and were pertinent to further nursing classes and careers. Some students did not like that the readings were posted only one day before class, as they felt that it did not give them sufficient time to prepare. Some also felt that there was no real “flow” to the course. However, all comments reflected that students were glad that they took the course.\r\n\r\nAccording to many studnets, the professor provided an “excellent overview” of materials covered in the course. Students reported that the lecturers were “wonderful” and there were many “diverse guest lecturers.” Others complained that the professor did not assign the required readings” in a timely fashion.” Students generally felt that the professor “raised many questions while teaching us tools that could be used to answer them.” According to many, the professor provided a strong background to the material, and the majority of lectures were “outstanding.”\r\n\r\nThe class was not described as particularly difficult. However, students commented that it was often difficult to know where one’s grade stood. Students noted that there was “very little assignment feedback.” Several felt that the jargon used in the course was often difficult for those not familiar with the subject matter.\r\n", "num_students": 15, "path": "/courses/23551/sections/401/reviews/2288-KATHLEEN-G--BURKE", "instructor": {"path": "/instructors/2288-KATHLEEN-G--BURKE", "first_name": "KATHLEEN G.", "last_name": "BURKE", "id": "2288-KATHLEEN-G--BURKE", "name": "KATHLEEN G. BURKE"}, "num_reviewers": 12, "id": "23551-401-2288-KATHLEEN-G--BURKE"}, {"ratings": {"rAmountLearned": "3.42", "rDifficulty": "2.75", "rStimulateInterest": "3.58", "rRecommendMajor": "3.75", "rCourseQuality": "3.50", "rWorkRequired": "2.92", "rInstructorAccess": "4.00", "rReadingsValue": "3.08", "rRecommendNonMajor": "3.50", "rCommAbility": "3.75", "rInstructorQuality": "3.67"}, "section": {"name": "PRINCIPLES AND PRACTICE OF QUALITY IMPROVEMENT AND SAFETY I", "sectionnum": "401", "primary_alias": "NURS-612-401", "path": "/courses/23551/sections/401", "id": "23551-401", "aliases": ["NURS-612-401", "HPR-504-401"]}, "comments": "The goal of this inter-professional course is to provide students with a broad overview of the principles and tools of quality improvement and patient safety in healthcare as well address the knowledge, skills and attitudes as defined by the Quality and Safety Education for Nurses (QSEN) guidelines. It will provide a foundation for students or practicing clinicians who are interested in quality improvement and patient safety research, administration, or clinical applications. Content will address the history of the quality improvement process in healthcare, quality databases and improvement process tools and programs. Through the use of case studies and exercises students will be become familiar with the use of several quality improvement programs and tools. For example, the Plan-Do-Study- Act (PDSA) cycle, Six Sigma and the Toyota Production System known as Lean Production processes will be addressed. Students can use this course to identify the tools and design the methods that they plan to employ in a quality improvement or patient safety project in their area of interest.\r\n\r\nMost students enjoyed this course, Many described it as “challenging” but “interesting.” Another student stated that this course was an “excellent overview of quality of safety.”\r\n\r\nStudents generally enjoyed the numerous guest lecturers. Some noted that the guest lectures were “wonderful” and “outstanding.” Many students wished for more constructive feedback on assignments.\r\n\r\nThis course is open to anyone interested in health care delivery quality improvement. This class was an eclectic mix of doctors, nurses and pharmacists. One student felt that the diversity made for a very beneficial class.\r\n", "num_students": 15, "path": "/courses/23551/sections/401/reviews/5662-JENNIFER-S--MYERS", "instructor": {"path": "/instructors/5662-JENNIFER-S--MYERS", "first_name": "JENNIFER S.", "last_name": "MYERS", "id": "5662-JENNIFER-S--MYERS", "name": "JENNIFER S. MYERS"}, "num_reviewers": 12, "id": "23551-401-5662-JENNIFER-S--MYERS"}]