[{"ratings": {"rAmountLearned": "3.13", "rDifficulty": "3.50", "rStimulateInterest": "2.40", "rRecommendMajor": "3.11", "rCourseQuality": "2.91", "rWorkRequired": "3.15", "rInstructorAccess": "2.78", "rReadingsValue": "2.33", "rRecommendNonMajor": "1.45", "rCommAbility": "2.66", "rInstructorQuality": "2.85"}, "section": {"name": "FINANCIAL DERIVATIVES", "sectionnum": "001", "primary_alias": "FNCE-206-001", "path": "/courses/27426/sections/001", "id": "27426-001", "aliases": ["FNCE-206-001"]}, "comments": "The purpose of FNCE 206 is to provide the student with the necessary skills to value and to employ options, futures, and related financial contracts. In order to provide a useful treatment of these topics in an environment that is changing rather rapidly, it is necessary to stress the fundamentals and to explore the topics at a technical level. The topics that will be covered include the valuation of futures contracts on stock indices, on commodities and Treasury instruments; the valuation of options; empirical evidence; strategies with respect to these assets; dynamic asset allocation strategies, of which portfolio insurance is an example; swaps; and the use (and misuse) of derivatives in the context of corporate applications. One-third of the course will be devoted to futures, a third to options, and a third to their applications. Many of the applications will be sprinkled along with the coverage of futures and options.\r\n\r\nMost students commented that “the conceptual and practical aspects of the class were well managed.” Students found the cases to be “informative,” but not as useful as other class material. One student commented that a more “academic treatment” of derivatives may have been helpful. Many students commented that FNCE 206 was the “most valuable” course they have taken at Penn.\r\n\r\nMost comments regarding Professor Ramaswamy were positive. Consistent with the sentiment of most students, one student said, “Professor Ramaswamy did a great job communicating the course concepts and bringing our attention to nuanced issues dealing with financial derivatives.” Other students commented that Professor Ramaswamy was “always willing to accommodate questions.”\r\n\r\nOverall, students found this course to be worthwhile but “difficult” because the pace was “too fast” and exams were hard. FNCE 206 has no prerequisites; however, FNCE 101 and STAT 102 are recommended and can be taken concurrently. \r\n", "num_students": 79, "path": "/courses/27426/sections/001/reviews/1854-KRISHNA-RAMASWAMY", "instructor": {"path": "/instructors/1854-KRISHNA-RAMASWAMY", "first_name": "KRISHNA", "last_name": "RAMASWAMY", "id": "1854-KRISHNA-RAMASWAMY", "name": "KRISHNA RAMASWAMY"}, "num_reviewers": 68, "id": "27426-001-1854-KRISHNA-RAMASWAMY"}]