[{"ratings": {"rAmountLearned": "2.51", "rDifficulty": "3.31", "rStimulateInterest": "1.75", "rRecommendMajor": "2.86", "rCourseQuality": "2.00", "rWorkRequired": "2.98", "rInstructorAccess": "2.02", "rReadingsValue": "2.16", "rRecommendNonMajor": "1.16", "rCommAbility": "1.94", "rInstructorQuality": "2.07"}, "section": {"name": "MODERN PHYSICS", "sectionnum": "001", "primary_alias": "PHYS-102-001", "path": "/courses/16316/sections/001", "id": "16316-001", "aliases": ["PHYS-102-001"]}, "comments": "This course, which fulfills the Physical World requirement, is a continuation of Physics 101, a prerequisite for the class. The course is an introduction to classical electricity and magnetism, relativity theory, optics, and the quantum theory of matter, requiring a background in calculus. It must be taken with the Phys-102 lab. This course is suggested for pre-health students.\r\n\r\nStudents found the course content “interesting” and “fascinating,” especially topics covered in the later parts of the course, like nuclear physics and theory of relativity.\r\n\r\nStudents thought Professor Durian was “organized” and “very clear” in his explanation of the math involved, however some students thought his lectures were monotonous and “dull.” Some also complained that Professor Durian’s teaching style was “condescending” and that he “teaches the course very simply, as if he is talking to kindergartners.”\r\n\r\nAs a result, students felt that the practice problems discussed in class did not match up to the difficulty of the problems on the exams. Several suggested that having a TA for the class would have been helpful to further their understanding of the material.", "num_students": 61, "path": "/courses/16316/sections/001/reviews/2652-DOUGLAS-J--DURIAN", "instructor": {"path": "/instructors/2652-DOUGLAS-J--DURIAN", "first_name": "DOUGLAS J.", "last_name": "DURIAN", "id": "2652-DOUGLAS-J--DURIAN", "name": "DOUGLAS J. DURIAN"}, "num_reviewers": 56, "id": "16316-001-2652-DOUGLAS-J--DURIAN"}, {"ratings": {"rAmountLearned": "2.56", "rDifficulty": "3.33", "rStimulateInterest": "1.61", "rRecommendMajor": "3.17", "rCourseQuality": "1.88", "rWorkRequired": "2.91", "rInstructorAccess": "2.49", "rReadingsValue": "2.53", "rRecommendNonMajor": "1.19", "rCommAbility": "1.81", "rInstructorQuality": "1.98"}, "section": {"name": "MODERN PHYSICS", "sectionnum": "002", "primary_alias": "PHYS-102-002", "path": "/courses/16316/sections/002", "id": "16316-002", "aliases": ["PHYS-102-002"]}, "comments": "", "num_students": 51, "path": "/courses/16316/sections/002/reviews/973-PAUL-SOVEN", "instructor": {"path": "/instructors/973-PAUL-SOVEN", "first_name": "PAUL", "last_name": "SOVEN", "id": "973-PAUL-SOVEN", "name": "PAUL SOVEN"}, "num_reviewers": 43, "id": "16316-002-973-PAUL-SOVEN"}, {"ratings": {"rAmountLearned": "2.23", "rDifficulty": "2.47", "rStimulateInterest": "2.24", "rRecommendMajor": "2.42", "rCourseQuality": "2.11", "rWorkRequired": "2.37", "rInstructorAccess": "3.15", "rReadingsValue": "2.26", "rRecommendNonMajor": "1.61", "rCommAbility": "1.93", "rInstructorQuality": "2.25"}, "section": {"name": "MODERN PHYSICS", "sectionnum": "601", "primary_alias": "PHYS-102-601", "path": "/courses/16316/sections/601", "id": "16316-601", "aliases": ["PHYS-102-601"]}, "comments": "Recommended for pre-health students, Phys101/Phys102 cover introductory topics in physics including electricity, magnetism, relativity theory, optics and the quantum theory of matter. This course fulfills the quantitative data analysis requirement and the physical world sector requirement for the College. Background in calculus is required.\r\n\r\nStudent feedback ranged considerably on both the quality of the course and the professor. Some found it very difficult and complained about feeling underprepared for exams, while others were quite happy with the quality of notes available and the amount of homework given. One student ranted about the “terrific course structure,” while another described it as “the worst course I have ever taken.” Appropriately, one student commented, “The course was exactly what I needed as a pre-med requirement - nuts and bolts of physics.”\r\n\r\nProfessor Allen had to fill in for another professor which resulted greater course disorganization. Several students commented that they could tell his specialty is astronomy and not physics, and that he “still appears new to teaching physics.” Students criticized lectures for moving too fast and covering too much superfluous information, and they wished for greater emphasis on key concepts. Many students, however, acknowledged that he taught with enthusiasm and truly cared about his students by making himself available during office hours. Some students liked how professor Allen brought in models and problems from readings in his lecture. One grad student even ranked professor Allen as one of best he had. Opinions were definitely strong on both sides.\r\n\r\nThis course fulfills the physical world sector requirement. Most people took the course because it was a major requirement or because they needed it to prepare for the MCAT. The majority of students found the course challenging.", "num_students": 82, "path": "/courses/16316/sections/601/reviews/4527-PETER-ALLEN", "instructor": {"path": "/instructors/4527-PETER-ALLEN", "first_name": "PETER", "last_name": "ALLEN", "id": "4527-PETER-ALLEN", "name": "PETER ALLEN"}, "num_reviewers": 77, "id": "16316-601-4527-PETER-ALLEN"}]