[{"ratings": {"rAmountLearned": "2.33", "rDifficulty": "3.63", "rStimulateInterest": "1.43", "rRecommendMajor": "2.73", "rCourseQuality": "1.76", "rWorkRequired": "2.97", "rInstructorAccess": "2.08", "rReadingsValue": "2.30", "rRecommendNonMajor": "0.45", "rCommAbility": "2.40", "rInstructorQuality": "2.11"}, "section": {"name": "MECHANICS OF SOLIDS", "sectionnum": "001", "primary_alias": "MEAM-354-001", "path": "/courses/27734/sections/001", "id": "27734-001", "aliases": ["MEAM-354-001"]}, "comments": "This course builds on the fundamentals of solid mechanics taught in MEAM 210 and addresses more advanced problems in strength of materials.  The course introduces a wide array of applications from traditional engineering disciplines as well as emerging areas such as biotechnology and nanotechnology.  The methods of analysis developed in this course will form the cornerstone of machine design and also more advanced topics in the mechanics of materials.\r\n\r\nStudents found this class to be \"challenging\" and the topic dry, but nonetheless they found it \"informative and beneficial for problem solving in mechanics of solids.\" Some students found the material difficult due to class leaning on multi-variable calculus for problem solving and the fact that the course moves quickly through a lot of information.\r\n\r\nStudents thought that Professor Purohit \"did the best he can\" given the course topic. Students expressed that they would have found it helpful if Professor Purohit had set up a \"Blackboard site with homework assignments, grades posted, and homework solutions.\"\r\n\r\nStudents found that “most of the homework problems were theory based, but they were then not very helpful in learning to do the types of problems that were on the exams.\" Pre-requisites of the class include MEAM 210 or equivalent, BE200 or permission of instructor.\r\n\r\nThis review is based on the eight student comments that were submitted.\r\n", "num_students": 49, "path": "/courses/27734/sections/001/reviews/3364-PRASHANT-KISHORE-PUROHIT", "instructor": {"path": "/instructors/3364-PRASHANT-KISHORE-PUROHIT", "first_name": "PRASHANT KISHORE", "last_name": "PUROHIT", "id": "3364-PRASHANT-KISHORE-PUROHIT", "name": "PRASHANT KISHORE PUROHIT"}, "num_reviewers": 46, "id": "27734-001-3364-PRASHANT-KISHORE-PUROHIT"}]