[{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "2.68", "rStimulateInterest": "2.50", "rRecommendMajor": "3.11", "rCourseQuality": "2.67", "rWorkRequired": "3.04", "rInstructorAccess": "1.29", "rReadingsValue": "2.46", "rRecommendNonMajor": "2.32", "rCommAbility": "2.21", "rInstructorQuality": "2.27"}, "section": {"name": "CL RESEARCH EMERG MED I", "sectionnum": "601", "primary_alias": "BIBB-320-601", "path": "/courses/24049/sections/601", "id": "24049-601", "aliases": ["BIBB-320-601"]}, "comments": "Clinical Research in Emergency Medicine I is an LPS course that is designed to\r\nteach students the fundamentals of clinical research. It highlights basic research design,\r\nresearch ethics, data collection, and good clinical practices. Students work closely with\r\nfaculty in the Emergency Department at CHOP and HUP, engaging in screening,\r\nrecruiting, and consenting patients for a variety of studies. The course also includes a\r\nsupplemental seminar series that introduces students to innovative, focused areas of\r\nmedical research. This course stresses independent thinking, professional responsibility,\r\nand personal accountability.\r\nNearly all students reported learning a lot from their experience working in the\r\nEmergency Department and found the clinical aspect of the course to be both “enjoyable”\r\nand “valuable.” One student described it as an “interesting introduction to clinical\r\nresearch,” and another reported that it was “realistic” to what students will encounter in\r\ntheir futures in medicine.\r\nOverall, students reported feeling frustrated with Dr. Hollander for being\r\n“ambiguous about grading,” especially for the clinical portion, and “unwilling to discuss\r\nthe class, exams, and grades.” Dr. Hollander posted answers to exams but would not\r\naddress students’ individual concerns. One student noted that Dr. Hollander’s failure to\r\ndiscuss topics related to exams “stymies full understanding and can leave students\r\nconfused.”\r\nGrades for this course were determined by: two midterm exams, a final exam, and\r\na clinical portion. Students generally agreed that the midterms were “difficult.” While a\r\ncouple of students thought the exams tested “relevant knowledge” and were\r\n“straightforward,” others expressed frustration with their “tricky wording.” The second\r\nmidterm tested students on “operational material” and knowledge of hospital procedures,\r\nwhich a couple of students found difficult to prepare for and noted that students’ grades\r\nwere lower for this exam compared to the others. The final seemed more “fair,”\r\nhowever. Overall, students found the course to be valuable, though demanding, and one\r\nstudent recommended that it be taken by “every student who is pre-health bound.” The\r\npermission of the instructor is required for enrollment in this course.", "num_students": 34, "path": "/courses/24049/sections/601/reviews/173-JUDD-E--HOLLANDER", "instructor": {"path": "/instructors/173-JUDD-E--HOLLANDER", "first_name": "JUDD E.", "last_name": "HOLLANDER", "id": "173-JUDD-E--HOLLANDER", "name": "JUDD E. HOLLANDER"}, "num_reviewers": 34, "id": "24049-601-173-JUDD-E--HOLLANDER"}]