{"coursehistories": {"path": "/coursehistories/3838"}, "description": "You know how to program, but do you know how computers really work? How do millions of transistors come together to form a complete computing system? This bottom-up course begins with transistors and simple computer hardware structures, continues with low-level programming using primative machine instructions, and finishes with an introduction to all aspects of computer systems architecture and serves as the foundation for subsequent computer systems courses, such as Digital Systems Organization and Design (CIS 371), Computer Operating Systems (CIS 380), and Compilers and Interpreters (CIS 341). \n\nThe course will consider the SPARC architecture, boolean logic, number systems,and computer arithmetic; macro assembly language programming and subroutine linkages; the operating system interface and input/output; understanding the output of the C compiler; the use of the C programming language to generate specific assembly language instructions. \n\n", "semester": "2009C", "name": "INTRO TO COMP SYSTEMS", "reviews": {"path": "/courses/17127/reviews", "values": [{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "3.58", "rStimulateInterest": "2.38", "rRecommendMajor": "3.29", "rCourseQuality": "2.59", "rWorkRequired": "3.63", "rInstructorAccess": "2.49", "rReadingsValue": "1.68", "rRecommendNonMajor": "1.18", "rCommAbility": "2.42", "rInstructorQuality": "2.66"}, "section": {"name": "INTRO TO COMP SYSTEMS", "sectionnum": "001", "primary_alias": "CIS-240-001", "path": "/courses/17127/sections/001", "id": "17127-001", "aliases": ["CIS-240-001"]}, "comments": "This course teaches the bottom-level workings of a computer, beginning with transistors and simple computer hardware structures, and builds itself up to low-level programming, and eventually with computer architecture. It is a precursor to computer systems courses that expand on the content.\r\n\r\nStudents reported learning a lot from the class, although they felt it was a bit rushed and compressed. Students liked the overall practicality of the material taught except for a section that was created by the professor himself.\r\n\r\nStudents had mixed reviews about Professor Roth. Some considered him a poor teacher while others noted that once you got used to his sarcastic/humorous personality, he was very engaging and patient in explaining complex topics.  All students agreed that they learned a lot from this course. \r\n\r\nStudents complained about the inordinate amount of work for this class as well as the difficult exam questions that were not similar to the homework. This course is a required class for most computer science related majors and has a prerequisite of CIS 110. \r\n", "num_students": 113, "path": "/courses/17127/sections/001/reviews/1322-AMIR-ROTH", "instructor": {"path": "/instructors/1322-AMIR-ROTH", "first_name": "AMIR", "last_name": "ROTH", "id": "1322-AMIR-ROTH", "name": "AMIR ROTH"}, "num_reviewers": 102, "id": "17127-001-1322-AMIR-ROTH"}]}, "credits": null, "primary_alias": "CIS-240", "path": "/courses/17127", "sections": {"path": "/courses/17127/sections", "values": [{"name": "INTRO TO COMP SYSTEMS", "sectionnum": "001", "primary_alias": "CIS-240-001", "path": "/courses/17127/sections/001", "id": "17127-001", "aliases": ["CIS-240-001"]}]}, "id": 17127, "aliases": ["CIS-240"]}