{"coursehistories": {"path": "/coursehistories/3059"}, "description": "This course studies institutions in developing economies. The first section of the course will cover the organization of production in traditional agrarian societies. Topics will include land, labor and credit markets. The second section of the course will focus on the role of the community in facilitating the transition to the modern market economy. Here we will study how the community spreads information, permits the formation of informal networks and organizes collective institutions, allowing individuals to take advantage of new economic opportunities. \n\n", "semester": "2011C", "name": "TOPICS IN DEVELOPMENT", "reviews": {"path": "/courses/24279/reviews", "values": [{"ratings": {"rAmountLearned": "2.16", "rDifficulty": "2.74", "rStimulateInterest": "2.21", "rRecommendMajor": "3.16", "rCourseQuality": "2.23", "rWorkRequired": "3.21", "rInstructorAccess": "3.42", "rReadingsValue": "1.24", "rRecommendNonMajor": "0.89", "rCommAbility": "2.06", "rInstructorQuality": "2.73"}, "section": {"name": "TOPICS IN DEVELOPMENT", "sectionnum": "001", "primary_alias": "ECON-261-001", "path": "/courses/24279/sections/001", "id": "24279-001", "aliases": ["ECON-261-001"]}, "comments": "Economics 261 studies institutions in developing economies. The first section of the course covers the organization of production in traditional agrarian societies. Topics include land, labor and credit markets. The second section of the course focuses on the role of the community in facilitating the transition to the modern market economy. Here, students will study how the community spreads information, permits the formation of informal networks and organizes collective institutions, allowing individuals to take advantage of new economic opportunities.\r\n\r\nThis course had no lectures. Students conducted independent research either individually or in small groups and presented their work to Professor Behrman. Students found this course \"very helpful for developing research skills.\"\r\n\r\nStudents enjoyed working with Professor Behrman and appreciated that \"he was always willing to talk to students about anything.\" Numerous students felt that ECON104 (econometrics) should be a prerequisite for this class, for students without any background in econometrics felt at a disadvantage.\r\n", "num_students": 24, "path": "/courses/24279/sections/001/reviews/4786-JERE-R-BEHRMAN", "instructor": {"path": "/instructors/4786-JERE-R-BEHRMAN", "first_name": "JERE R", "last_name": "BEHRMAN", "id": "4786-JERE-R-BEHRMAN", "name": "JERE R BEHRMAN"}, "num_reviewers": 22, "id": "24279-001-4786-JERE-R-BEHRMAN"}]}, "credits": null, "primary_alias": "ECON-261", "path": "/courses/24279", "sections": {"path": "/courses/24279/sections", "values": [{"name": "TOPICS IN DEVELOPMENT", "sectionnum": "001", "primary_alias": "ECON-261-001", "path": "/courses/24279/sections/001", "id": "24279-001", "aliases": ["ECON-261-001"]}]}, "id": 24279, "aliases": ["ECON-261"]}