{"coursehistories": {"path": "/coursehistories/1927"}, "description": "\"Two fundamental questions structure this course: (1)What kinds of factors shape population health in various parts of the world in the twenty-first century? and (2)What kinds of intellectual tools are necessary in order to study global health? Grasping the deeper \"socialness\" of health and health care in a variety of cultures and time periods requires a sustained interdisciplinary approach. \"Health and Societies: Global Perspectives\" blends the methods of history, sociology, anthropology and related disciplines in order to expose the layers of causation and meaning beneath what we often see as straightforward, common-sense responses to bioloogical phenomena. Assignments throughout the semester provide a hands-on introduction to researchstrageties in these core disciplines. The course culminates with pragmatic, student-led assessments of global health policies designed to identify creative and cost effective solutions to the most persistent health problems in the world today.\" \n\n", "semester": "2010A", "name": "HEALTH & SOCIETIES", "reviews": {"path": "/courses/26226/reviews", "values": [{"ratings": {"rAmountLearned": "3.13", "rDifficulty": "2.66", "rStimulateInterest": "3.35", "rRecommendMajor": "3.75", "rCourseQuality": "3.07", "rWorkRequired": "3.36", "rInstructorAccess": "3.11", "rReadingsValue": "2.86", "rRecommendNonMajor": "2.78", "rCommAbility": "3.24", "rInstructorQuality": "3.33"}, "section": {"name": "HEALTH & SOCIETIES", "sectionnum": "001", "primary_alias": "HSOC-010-001", "path": "/courses/26226/sections/001", "id": "26226-001", "aliases": ["HSOC-010-001"]}, "comments": "This course focused on sociocultural studies of health and disease by exploring how policy analysts, medical care providers, and scholars from a variety of disciplines including anthropology, history and sociology have crafted responses to such real world problems as malnutrition, epidemic disease, and the inequitable distribution of health resources. \r\n\r\nMany students felt that this was a great class that taught them a tremendous amount. Although there was “an enormous group project that requires a lot of work,” many declared this to be the best class they have taken at Penn and found the “enlightening” lectures to be thoroughly rewarding.\r\n\r\nStudents heaped praise on Professor Barnes and found him to be “inspiring, passionate” and “dedicated to his teaching.” Students frequently described Professor Barnes as “enthusiastic,” “knowledgeable” and “intellectually stimulating.” \r\n\r\nThe class fulfills the Humanities and Social Science sector requirement. Students found the course to be “work-intensive” and felt the assignments, especially the large group project at the end of the semester, were demanding, but highly recommended the class to majors and non-majors alike.\r\n", "num_students": 148, "path": "/courses/26226/sections/001/reviews/1520-DAVID-S--BARNES", "instructor": {"path": "/instructors/1520-DAVID-S--BARNES", "first_name": "DAVID S.", "last_name": "BARNES", "id": "1520-DAVID-S--BARNES", "name": "DAVID S. BARNES"}, "num_reviewers": 141, "id": "26226-001-1520-DAVID-S--BARNES"}]}, "credits": null, "primary_alias": "HSOC-010", "path": "/courses/26226", "sections": {"path": "/courses/26226/sections", "values": [{"name": "HEALTH & SOCIETIES", "sectionnum": "001", "primary_alias": "HSOC-010-001", "path": "/courses/26226/sections/001", "id": "26226-001", "aliases": ["HSOC-010-001"]}]}, "id": 26226, "aliases": ["HSOC-010"]}