[{"ratings": {"rAmountLearned": "1.88", "rDifficulty": "2.00", "rStimulateInterest": "2.00", "rRecommendMajor": "2.18", "rCourseQuality": "2.06", "rWorkRequired": "2.40", "rInstructorAccess": "3.12", "rReadingsValue": "1.71", "rRecommendNonMajor": "1.06", "rCommAbility": "2.53", "rInstructorQuality": "2.50"}, "section": {"name": "Research Methods in Environmental Studies", "sectionnum": "660", "primary_alias": "ENVS-533-660", "path": "/courses/24353/sections/660", "id": "24353-660", "aliases": ["ENVS-533-660"]}, "comments": "This course is designed to prepare Master of Environmental Studies students to\r\nundertake their Capstone exercises. In this course, how to identify an appropriate research\r\nproject, how to design a research plan, and how to prepare a detailed proposal are\r\ndiscussed. Each student should enter the course with a preliminary research plan and\r\nshould have identified an advisor. By the end of the course, each student is expected to\r\nhave a completed Capstone proposal that has been reviewed and approved by his/her\r\nadvisor.\r\nStudents in this course generally agreed that they did not learn much, saying the\r\ncourse was “not very useful.” Several found the course to be “a bit repetitive” and\r\n“better suited for people unfamiliar with the research process.” However, most students\r\nagreed that it was helpful for “staying on track to complete a capstone proposal.” Many\r\nstudents commented that there was little student interaction, which they thought would\r\nhave made the course more helpful.\r\nNot many students reported directly on the professor for this course. Those who\r\ndid called Professor Kulik an “excellent instructor,” “very approachable,” and “a nice\r\nman.” However, a couple of students noted that Professor Kulik repeatedly ended class\r\nvery early. One student remarked that Professor Kulik, “cancelled classes,… consistently\r\nstarted late, dismissed class early and did not provide any insight into project ideas with\r\nhis conversation or homework submissions.”\r\nGenerally, students did not remark on the difficulty of the course. One student\r\nremarked that the “readings weren’t necessary” and that the professor “never referred to”\r\nthe purchased book in class.", "num_students": 19, "path": "/courses/24353/sections/660/reviews/4317-MICHAEL-KULIK", "instructor": {"path": "/instructors/4317-MICHAEL-KULIK", "first_name": "MICHAEL", "last_name": "KULIK", "id": "4317-MICHAEL-KULIK", "name": "MICHAEL KULIK"}, "num_reviewers": 18, "id": "24353-660-4317-MICHAEL-KULIK"}]