[{"ratings": {"rAmountLearned": "2.72", "rDifficulty": "2.93", "rStimulateInterest": "2.65", "rRecommendMajor": "3.07", "rCourseQuality": "2.63", "rWorkRequired": "2.49", "rInstructorAccess": "3.47", "rReadingsValue": "1.86", "rRecommendNonMajor": "1.53", "rCommAbility": "2.79", "rInstructorQuality": "3.21"}, "section": {"name": "EVOLUTIONARY BIOLOGY", "sectionnum": "001", "primary_alias": "BIOL-230-001", "path": "/courses/19843/sections/001", "id": "19843-001", "aliases": ["BIOL-230-001"]}, "comments": "This course approaches various theories of evolution from a molecular and genetic standpoint. Students who take this course must have a basic background in Mendelian genetics, having completed a prior Biology introductory course (101 and 102, or 121). Students will read the original text of evolution, Origins of the Species, by Charles Darwin, and additional readings on Blackboard as complements to a standard textbook. Such readings emphasize the focus on evolution research and methodology placed in this course.\r\n\r\nGrades were determined from two midterms, a term paper and a comprehensive final exam. Recitation participation and attendance also factored in to students’ grades. Students commented that this course moved at a fast pace, and that it was “hard to keep up” without the textbook. Sometimes lectures were difficult to follow because there were no lecture slides for at least part of the course, and diagrams on the board were not always clearly labeled. However, later on in the semester, Professor Schmidt began providing lecture slides. \r\n\r\nStudents seemed to enjoy Professor Schmidt’s lectures. Students described him as “knowledgeable” and “funny,” and his lectures as “interesting.” One student commented, “The professor speaks very well, but some concepts are not explained clearly.” Students rated Professor Schmidt as very accessible, and one student noted his “emphasis on a very fair grading system.” Overall, students said they enjoyed the course and the professor, but issues with clarity and pace made it hard at times.\r\n", "num_students": 51, "path": "/courses/19843/sections/001/reviews/191-PAUL-STUTZ-SCHMIDT", "instructor": {"path": "/instructors/191-PAUL-STUTZ-SCHMIDT", "first_name": "PAUL STUTZ", "last_name": "SCHMIDT", "id": "191-PAUL-STUTZ-SCHMIDT", "name": "PAUL STUTZ SCHMIDT"}, "num_reviewers": 43, "id": "19843-001-191-PAUL-STUTZ-SCHMIDT"}]