{"coursehistories": {"path": "/coursehistories/1694"}, "description": "Design projects in various areas of bioengineering; projects are chosen by the students with approval of the instructor in the Spring semester of the Junior year; a project brief, interim reports, a final report, and a presentation are required. Also emphasized are report writing, scheduling, project risk assessment, multidisciplinary environments and ethics. \n\n", "semester": "2010C", "name": "SENIOR DESIGN PROJECT", "reviews": {"path": "/courses/22690/reviews", "values": [{"ratings": {"rAmountLearned": "1.95", "rDifficulty": "2.40", "rStimulateInterest": "2.51", "rRecommendMajor": "2.86", "rCourseQuality": "2.05", "rWorkRequired": "3.12", "rInstructorAccess": "2.60", "rReadingsValue": "1.60", "rRecommendNonMajor": "0.49", "rCommAbility": "2.67", "rInstructorQuality": "2.52"}, "section": {"name": "SENIOR DESIGN PROJECT", "sectionnum": "001", "primary_alias": "BE-495-001", "path": "/courses/22690/sections/001", "id": "22690-001", "aliases": ["BE-495-001"]}, "comments": "BE 495 is the Senior Design course. Design projects in various areas of bioengineering are undertaken by students. Projects are chosen by the students with approval of the instructor in the Spring semester of their Junior year; a project brief, interim reports, a final report, and a presentation are required. The course is open only to BE Seniors. \r\n\r\nMany students had felt that this class was a waste of time, especially those who didn’t plan to become a professional engineer. A majority of the students felt that the lectures were rather pointless and also scheduled at a time that conflicted with review sessions. Students reported that the class was “based almost entirely in the lab,” and many felt that they didn’t “didn’t get too much out of” “the attempts to make it a ‘class.’” Students generally found the biweekly reports and project brief to be “tedious” and “redundant.”  Another issue that some students had with this class was that they felt that the projects weren’t screened properly or selected carefully. As a result, several groups had to “struggle to mold their projects into a design process that matched the course's objectives” because in some cases, “the clients did not actually have a senior design appropriate project.” Several students also felt that there wasn’t any support available to them and that they struggled to figure out the solutions themselves.\r\n\r\nAlthough Dr. Winkelstein is listed as the instructor for the course, each design group had a different assigned professor.  Students generally wished that Dr. Winkelstein had designed the course better, and each group had different experiences with their professors and their clients.\r\n\r\nStudents generally agreed that “the differentiation between design and research was valuable to realize.” The consultant-client relationship emphasized was described as “interesting and probably industry-relevant.” The course helped students to “effectively work well in groups.” However, the course received low ratings, and students generally didn’t feel that they learned much from it. This course is required for all BE majors, and it was not recommended for non-majors.\r\n", "num_students": 68, "path": "/courses/22690/sections/001/reviews/1795-BETH-A--WINKELSTEIN", "instructor": {"path": "/instructors/1795-BETH-A--WINKELSTEIN", "first_name": "BETH A.", "last_name": "WINKELSTEIN", "id": "1795-BETH-A--WINKELSTEIN", "name": "BETH A. WINKELSTEIN"}, "num_reviewers": 64, "id": "22690-001-1795-BETH-A--WINKELSTEIN"}, {"ratings": {"rAmountLearned": "1.95", "rDifficulty": "2.40", "rStimulateInterest": "3.02", "rRecommendMajor": "2.86", "rCourseQuality": "2.05", "rWorkRequired": "3.12", "rInstructorAccess": "3.17", "rReadingsValue": "1.60", "rRecommendNonMajor": "0.49", "rCommAbility": "3.05", "rInstructorQuality": "3.11"}, "section": {"name": "SENIOR DESIGN PROJECT", "sectionnum": "001", "primary_alias": "BE-495-001", "path": "/courses/22690/sections/001", "id": "22690-001", "aliases": ["BE-495-001"]}, "comments": "This course is a senior design project. Design projects in various areas of bioengineering; projects are chosen by the students with approval of the instructor in the spring semester of the junior year; a project brief, interim reports, a final report, and a presentation are required. Also emphasized are report writing, scheduling, project risk assessment, multidisciplinary environments and ethics.\r\n\r\nThe majority of this course consisted of a senior design project. Most students said that “projects should be selected more carefully.” Some students felt that the lectures were a bit “useless” and that there was “a lot of busy work in this course.” Although some students felt that they “learned a lot from the clients and [their] group members,” others said that their projects “were not suitable for a senior design project.”\r\n\r\nStudents generally agreed that Professor Rizk was “awesome” and that they liked his organization. \r\n\r\nOverall, the workload of the course depended heavily on which project the group members got. Students tended to agree that much of the work was “busy work.” Assignments included a project brief and biweekly reports. This course is required for all BE Majors.\r\n", "num_students": 68, "path": "/courses/22690/sections/001/reviews/4750-MICHAEL-RIZK", "instructor": {"path": "/instructors/4750-MICHAEL-RIZK", "first_name": "MICHAEL", "last_name": "RIZK", "id": "4750-MICHAEL-RIZK", "name": "MICHAEL RIZK"}, "num_reviewers": 64, "id": "22690-001-4750-MICHAEL-RIZK"}, {"ratings": {"rAmountLearned": "1.95", "rDifficulty": "2.40", "rStimulateInterest": "2.51", "rRecommendMajor": "2.86", "rCourseQuality": "2.05", "rWorkRequired": "3.12", "rInstructorAccess": "2.70", "rReadingsValue": "1.60", "rRecommendNonMajor": "0.49", "rCommAbility": "2.53", "rInstructorQuality": "2.53"}, "section": {"name": "SENIOR DESIGN PROJECT", "sectionnum": "001", "primary_alias": "BE-495-001", "path": "/courses/22690/sections/001", "id": "22690-001", "aliases": ["BE-495-001"]}, "comments": "Design projects in various areas of bioengineering; projects are chosen by the students with approval of the instructor in the Spring semester of the Junior year; a project brief, interim reports, a final report, and a presentation are required. Also emphasized are report writing, scheduling, project risk assessment, multidisciplinary environments and ethics.\r\n\r\nStudents generally found the course objectives to be inflexible for a range of projects, thus calling for more careful screening of the projects. Many students found the lectures to be unhelpful and the work to be repetitious at times.\r\n\r\nOverall, students agreed that Professor Salinas was willing to offer them help and advice.\r\n\r\nThis course is the required senior design project for BE majors. Students generally reported that it required a “tremendous” amount of work.\r\n", "num_students": 68, "path": "/courses/22690/sections/001/reviews/5290-CHELSEA-N-SALINAS", "instructor": {"path": "/instructors/5290-CHELSEA-N-SALINAS", "first_name": "CHELSEA N", "last_name": "SALINAS", "id": "5290-CHELSEA-N-SALINAS", "name": "CHELSEA N SALINAS"}, "num_reviewers": 64, "id": "22690-001-5290-CHELSEA-N-SALINAS"}]}, "credits": null, "primary_alias": "BE-495", "path": "/courses/22690", "sections": {"path": "/courses/22690/sections", "values": [{"name": "SENIOR DESIGN PROJECT", "sectionnum": "001", "primary_alias": "BE-495-001", "path": "/courses/22690/sections/001", "id": "22690-001", "aliases": ["BE-495-001"]}]}, "id": 22690, "aliases": ["BE-495"]}