{"coursehistories": {"path": "/coursehistories/5607"}, "description": "Ancient battles have offered great source material for Hollywood movies, such as Gladiator and Troy, the result being the aggrandizement and glamorization of warfare in antiquity. But what were ancient battles really like? What weapons and tactics were used? What innovations and developments in ancient warfare changed the playing field? And who were the leading characters on the battlefield that lead their armies to victory? \n\nThrough a survey of some of the great battles of the Ancient Near East (Egypt, Israel, Assyria) and the Classical World (Greece, Macedonia, Rome), this course will lead you to explore issues such as the historical context of ancient warfare, how different aspects of warfare evolve over time, and the role and effects of war in ancient society, on soldier and citizen alike. Each week we will tackle some of the most notable battles fought in the Mediterranean region from the Bronze Age to the first century CE, including the campaign of the Egyptian pharaoh Thutmosis III against Megiddo, Homer's Trojan War, the Athenian/Persian naval battle at Salamis, and the Roman army's siege of Masada. We will discuss ancient attitudes toward war and violence, the technical aspects of armor, weaponry, and tactics, and the strategy of individual battles and wars. Additionally, we will debate the validity of the ancient literary sources and the archaeological evidence that provide information about war and warfare in antiquity, and we will review the problems associated with the use of this evidence. Additional topics of inquiry include the role of animals in war, depictions of war in ancient art, and the portrayal of warfare in Hollywood. \n\n", "semester": "2013A", "name": "GRT BTLS ANCH WRLD", "reviews": {"path": "/courses/29825/reviews", "values": [{"ratings": {"rDifficulty": "2.30", "rStimulateInterest": "3.40", "rCourseQuality": "3.23", "rWorkRequired": "3.00", "rInstructorQuality": "3.31", "rCommAbility": "3.60", "rInstructorAccess": "3.40"}, "section": {"name": "GRT BTLS ANCH WRLD", "sectionnum": "601", "primary_alias": "ANCH-219-601", "path": "/courses/29825/sections/601", "id": "29825-601", "aliases": ["ANCH-219-601", "CLST-219-601"]}, "comments": "", "num_students": 17, "path": "/courses/29825/sections/601/reviews/6440-LINDA-MEIBERG", "instructor": {"path": "/instructors/6440-LINDA-MEIBERG", "first_name": "LINDA", "last_name": "MEIBERG", "id": "6440-LINDA-MEIBERG", "name": "LINDA MEIBERG"}, "num_reviewers": 13, "id": "29825-601-6440-LINDA-MEIBERG"}]}, "credits": null, "primary_alias": "ANCH-219", "path": "/courses/29825", "sections": {"path": "/courses/29825/sections", "values": [{"name": "GRT BTLS ANCH WRLD", "sectionnum": "601", "primary_alias": "ANCH-219-601", "path": "/courses/29825/sections/601", "id": "29825-601", "aliases": ["ANCH-219-601", "CLST-219-601"]}]}, "id": 29825, "aliases": ["ANCH-219", "CLST-219"]}