{"coursehistories": {"path": "/coursehistories/1341"}, "description": "This course offers an intensive survey of the major currents in Jewish culture and society from the late middle ages to the present. Focusing upon the different societies in which Jews have lived, the course explores Jewish responses to the political, socio-economic, and cultural challenges of modernity.Topics to be covered include the political emancipation of Jews, the creation of new religious movements within Judaism, Jewish socialism, Zionism, the Holocaust, and the emergence of new Jewish communities in Israel and the United States. No prior background in Jewish history is expected. \n\n", "semester": "2012A", "name": "JEWS IN THE MODERN WORLD", "reviews": {"path": "/courses/27564/reviews", "values": [{"ratings": {"rAmountLearned": "2.72", "rDifficulty": "2.38", "rStimulateInterest": "2.15", "rRecommendMajor": "3.36", "rCourseQuality": "2.69", "rWorkRequired": "2.28", "rInstructorAccess": "2.78", "rReadingsValue": "2.29", "rRecommendNonMajor": "2.59", "rCommAbility": "3.13", "rInstructorQuality": "2.92"}, "section": {"name": "JEWS IN THE MODERN WORLD", "sectionnum": "401", "primary_alias": "HIST-141-401", "path": "/courses/27564/sections/401", "id": "27564-401", "aliases": ["HIST-141-401", "RELS-122-401", "NELC-053-401", "JWST-158-401"]}, "comments": "This course offers an intensive survey of the major currents in Jewish culture and society from the late middle ages to the present.  Focusing upon the different societies in which Jews have lived, the course explores Jewish responses to the political, socioeconomic, and cultural challenges of modernity.  Topics to be covered include the political emancipation of Jews, the creation of new religious movements within Judaism, Jewish socialism, Zionism, the Holocaust, and the emergence of new Jewish communities in Israel and the United States.  No prior background in Jewish history is expected.\r\n\r\n\tA common theme among many of the students was the feeling that they “learned a lot from this course,” and that it was both “interesting and moving,” becoming increasingly better in the latter half of the semester.  However, a number of students felt that the course was “too broad” and that it would have been nice for it to have been “narrowed down to focus on certain topics.”  A couple of students appreciated being assigned source materials instead of secondary sources as they were “very valuable in grasping the material,” but wished there could have been recitation sections where they would “be able to discuss certain issues and themes.” \r\n\r\n\tStudents liked Professor Wenger, finding her “passion for the course content obvious.”  One student found that Professor Wenger “gave very useful feedback when discussing essays or course material,” and said Professor Wenger had the “ability to communicate the subject so fluidly.”  Still, one student commented that Professor Wenger “could have done a better job engaging students vis-à-vis multimedia.”\r\n\r\n\tThis course fulfills History and Tradition and Cross-Cultural Analysis for College students.  Students found the work for this course to be “manageable,” with “two papers, one midterm, and a final,” but at least one student stated that there was so much material that “absorbing the content and keeping up with the readings seemed difficult.”  Though it is a Jewish history course, one student commented that “the course would also be stimulating for non-Jews.”", "num_students": 53, "path": "/courses/27564/sections/401/reviews/1488-BETH-S--WENGER", "instructor": {"path": "/instructors/1488-BETH-S--WENGER", "first_name": "BETH S.", "last_name": "WENGER", "id": "1488-BETH-S--WENGER", "name": "BETH S. WENGER"}, "num_reviewers": 50, "id": "27564-401-1488-BETH-S--WENGER"}]}, "credits": null, "primary_alias": "HIST-141", "path": "/courses/27564", "sections": {"path": "/courses/27564/sections", "values": [{"name": "JEWS IN THE MODERN WORLD", "sectionnum": "401", "primary_alias": "HIST-141-401", "path": "/courses/27564/sections/401", "id": "27564-401", "aliases": ["HIST-141-401", "RELS-122-401", "NELC-053-401", "JWST-158-401"]}]}, "id": 27564, "aliases": ["HIST-141", "RELS-122", "NELC-053", "JWST-158"]}