{"coursehistories": {"path": "/coursehistories/584"}, "description": "This course will provide an introduction to the history of Asian Pacific Americans, focusing on the wide diversity of migrant experiences, as well as the continuing legacies of Orientalism on American-born APA's. Issues of race, class, gender, and sexuality will also be examined. \n\n", "semester": "2011A", "name": "INTRO TO ASIAN AMER HIST", "reviews": {"path": "/courses/21854/reviews", "values": [{"ratings": {"rAmountLearned": "2.86", "rDifficulty": "1.77", "rStimulateInterest": "2.92", "rRecommendMajor": "3.43", "rCourseQuality": "3.07", "rWorkRequired": "2.00", "rInstructorAccess": "3.37", "rReadingsValue": "2.57", "rRecommendNonMajor": "3.04", "rCommAbility": "3.41", "rInstructorQuality": "3.34"}, "section": {"name": "INTRO TO ASIAN AMER HIST", "sectionnum": "401", "primary_alias": "HIST-155-401", "path": "/courses/21854/sections/401", "id": "21854-401", "aliases": ["HIST-155-401", "ASAM-003-401"]}, "comments": "This course provides an introduction to the history of Asian Pacific Americans, focusing on the wide diversity of migrant experiences, as well as the continuing legacies of racism on American-born APA's. Issues of race, class, gender, and sexuality are examined.&#8232;&#8232;&#8232;Students generally enjoyed this course and reported learning a lot from it. The material was “eye-opening” and gave students a “very comprehensive understanding of the experiences and history of Asian immigrants” to America. One student felt that the material became “a little repetitive” as the course went on, but most students found the subject matter to be “interesting” and “quite enjoyable.”&#8232;&#8232;&#8232;Students appreciated Professor Azuma’s genuine concern for and dedication to his students. Professor Azuma was always ready and willing to read drafts of students’ papers before their submission and provide “helpful feedback.” He also made a point to engage with the students during lectures “to make sure [they] understood the material” and “was always willing to talk over problems” concerning essays. The course was very “lecture-driven,” but Professor Azuma’s energy and “passion” for the subject “made boring history lessons interesting.” Students described his lecture style as “stimulating,” “animated,” and “engaging.” The overall impression of Professor Azuma was that he was a “great professor.”&#8232;&#8232;&#8232;This course was taken by many non-History majors to fulfill the History & Tradition sector requirement. Students who were not necessarily interested in history reported being “glad” that this was the course they chose to fulfill their requirement. Coursework was generally light, and students found Professor Azuma to be a “pretty easy grader.” The course was comprised of essays that were based on particular readings, and of exams that were “based heavily on the lecture material.” Assigned readings were not heavily weighted, and students found the readings “fun and stimulating.”", "num_students": 65, "path": "/courses/21854/sections/401/reviews/627-EIICHIRO-AZUMA", "instructor": {"path": "/instructors/627-EIICHIRO-AZUMA", "first_name": "EIICHIRO", "last_name": "AZUMA", "id": "627-EIICHIRO-AZUMA", "name": "EIICHIRO AZUMA"}, "num_reviewers": 60, "id": "21854-401-627-EIICHIRO-AZUMA"}]}, "credits": null, "primary_alias": "HIST-155", "path": "/courses/21854", "sections": {"path": "/courses/21854/sections", "values": [{"name": "INTRO TO ASIAN AMER HIST", "sectionnum": "401", "primary_alias": "HIST-155-401", "path": "/courses/21854/sections/401", "id": "21854-401", "aliases": ["HIST-155-401", "ASAM-003-401"]}]}, "id": 21854, "aliases": ["HIST-155", "ASAM-003"]}