{"coursehistories": {"path": "/coursehistories/4173"}, "description": "This introductory course explores the economics and politics of public policy to examine why, how and with what success/failure government intervenes in a variety of areas: the environment, income redistribution, social security, regulation. The course also examines the growing importance of allowing competitive markets to provide publicly funded services, taking advantage of private management approaches to fostering innovation in public management: vouchers (for medical care, education and housing), and contracting with private firms for provision of \"public\" services. Although not current events course many of these issues will incorporate discussion of the issues in the context of a new presidential administration, in an unusual economic environment. \n\n", "semester": "2012A", "name": "POLTCL ECON OF PUB SECTR", "reviews": {"path": "/courses/27072/reviews", "values": [{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "1.67", "rStimulateInterest": "2.63", "rRecommendMajor": "2.83", "rCourseQuality": "2.94", "rWorkRequired": "2.70", "rInstructorAccess": "3.03", "rReadingsValue": "2.80", "rRecommendNonMajor": "2.40", "rCommAbility": "3.25", "rInstructorQuality": "3.18"}, "section": {"name": "POLTCL ECON OF PUB SECTR", "sectionnum": "401", "primary_alias": "BPUB-770-401", "path": "/courses/27072/sections/401", "id": "27072-401", "aliases": ["BPUB-770-401", "BPUB-201-401"]}, "comments": "The Political Economy of the Public Sector course explores the economics and politics of public policy to provide an analytic framework for considering why, how and with what success/failure government intervenes in a variety of policy areas. Particular attention will be paid to important policy issues relating to taxation, social security, low-income assistance, health insurance, education (both K-12 and higher ed), the environment, and government deficits. The costs and benefits of alternative policies will be explored along with the distribution of responsibilities between the federal, state, and local governments. While the course will focus primarily on U.S. policies, the topics covered (e.g. tax reform, deficits versus austerity, etc.) are currently at the center of the policy debate in many other industrialized countries as well.\r\nMost students found that this course was “useful” an “interesting topic” and an “excellent overview of economic public policy in the US.” Many students found that they “learned a great deal bout public finance in the US and the federal government regulations and programs, and also on a more general approach of public policy.” However, some students found this class to me “more theoretical than practical.”\r\nAll students thought that Professor Rosenbaum was great because he “cares very much about making sure his students understand the course material.” Students found that he is “enthusiastic” “very accessible” and “very good at explaining.” However, one student found that his “enthusiasm leads him to be a little long-winded at times.”\r\nThe majority of students did not like that there were “daily homework assignments and “frequent exams” which was “unneeded” and “frustrating.” Students also found that the reading was “outdated.”  This is an MBA course. It’s prerequisite is “A basic understanding of microeconomics.” Along with lectures there is a midterm and final exam.  This review is based on seven comments.\r\n", "num_students": 35, "path": "/courses/27072/sections/401/reviews/6066-LAURENCE-S--SEIDMAN", "instructor": {"path": "/instructors/6066-LAURENCE-S--SEIDMAN", "first_name": "LAURENCE S.", "last_name": "SEIDMAN", "id": "6066-LAURENCE-S--SEIDMAN", "name": "LAURENCE S. SEIDMAN"}, "num_reviewers": 33, "id": "27072-401-6066-LAURENCE-S--SEIDMAN"}]}, "credits": null, "primary_alias": "BPUB-770", "path": "/courses/27072", "sections": {"path": "/courses/27072/sections", "values": [{"name": "POLTCL ECON OF PUB SECTR", "sectionnum": "401", "primary_alias": "BPUB-770-401", "path": "/courses/27072/sections/401", "id": "27072-401", "aliases": ["BPUB-770-401", "BPUB-201-401"]}]}, "id": 27072, "aliases": ["BPUB-770", "BPUB-201"]}