{"coursehistories": {"path": "/coursehistories/979"}, "description": "This course seeks to introduce students to the diversity of doctrines held and practices performed by Buddhists in Asia. By focusing on how specific beliefs and practices are tied to particular locations and particular times, we will be able to explore in detail the religious institutions, artistic, architectural, and musical traditions, textual production and legal and doctrinal developments of Buddhism over time and within its socio-historical context. Religion is never divorced from its place and its time. Furthermore, by geographically and historically grounding the study of these religions we will be able to examine how their individual ethic, cosmological and soteriological systems effect local history, economics, politics, and material culture. We will concentrate first on the person of the Buddha, his many biographies and how he has been followed and worshipped in a variety of ways from Lhasa, Tibet to Phrae, Thailand. From there we touch on the foundational teachings of the Buddha with an eye to how they have evolved and transformed over time. Finally, we focus on the practice of Buddhist ritual, magic and ethics in monasteries and among aly communities in Asia and even in the West. This section will confront the way Buddhists have thought of issues such as \"Just-War,\" Women's Rights and Abortion. \n\nWhile no one quarter course could provide a detailed presentation of the beliefs and practices of Buddhism, my hope is that we will be able to look closely at certain aspects of these religions by focusing on how they are practiced in places like Nara, Japan or Vietnam, Laos. \n\n", "semester": "2013A", "name": "INTRO BUDDHISM", "reviews": {"path": "/courses/30955/reviews", "values": [{"ratings": {"rDifficulty": "2.31", "rTAQuality": "3.35", "rStimulateInterest": "3.88", "rCourseQuality": "3.82", "rWorkRequired": "2.58", "rInstructorQuality": "3.89", "rCommAbility": "3.85", "rInstructorAccess": "3.19"}, "section": {"name": "INTRO BUDDHISM", "sectionnum": "401", "primary_alias": "RELS-173-401", "path": "/courses/30955/sections/401", "id": "30955-401", "aliases": ["RELS-173-401", "EALC-015-401", "SAST-142-401"]}, "comments": "", "num_students": 35, "path": "/courses/30955/sections/401/reviews/4968-JUSTIN-THOMAS-MCDANIEL", "instructor": {"path": "/instructors/4968-JUSTIN-THOMAS-MCDANIEL", "first_name": "JUSTIN THOMAS", "last_name": "MCDANIEL", "id": "4968-JUSTIN-THOMAS-MCDANIEL", "name": "JUSTIN THOMAS MCDANIEL"}, "num_reviewers": 28, "id": "30955-401-4968-JUSTIN-THOMAS-MCDANIEL"}]}, "credits": null, "primary_alias": "RELS-173", "path": "/courses/30955", "sections": {"path": "/courses/30955/sections", "values": [{"name": "INTRO BUDDHISM", "sectionnum": "401", "primary_alias": "RELS-173-401", "path": "/courses/30955/sections/401", "id": "30955-401", "aliases": ["RELS-173-401", "EALC-015-401", "SAST-142-401"]}]}, "id": 30955, "aliases": ["RELS-173", "EALC-015", "SAST-142"]}