{"coursehistories": {"path": "/coursehistories/568"}, "description": "This course covers the social, political, and economic history of the United States from the end of the Civil War to the present. Topics to be discussed include Reconstruction, politics in the Gilded Age, late nineteenth-century urbanization and immigration, Populism, Progressivism, the rise of the United States to world power, the culture and politics of the twenties, the New Deal, the Cold War, post-World War II America, the turbulence of the sixties, the conservative resurgence, and the move toward a more pluralistic society. \n\n", "semester": "2011A", "name": "US HISTORY 1865-PRESENT", "reviews": {"path": "/courses/21842/reviews", "values": [{"ratings": {"rAmountLearned": "2.81", "rDifficulty": "2.48", "rStimulateInterest": "2.57", "rRecommendMajor": "2.97", "rCourseQuality": "2.59", "rWorkRequired": "2.77", "rInstructorAccess": "3.19", "rReadingsValue": "2.53", "rRecommendNonMajor": "2.58", "rCommAbility": "3.16", "rInstructorQuality": "2.68"}, "section": {"name": "US HISTORY 1865-PRESENT", "sectionnum": "001", "primary_alias": "HIST-021-001", "path": "/courses/21842/sections/001", "id": "21842-001", "aliases": ["HIST-021-001"]}, "comments": "This course looks at the United States History from 1865 To Present. This course covers the social, political, and economic history of the United States from the end of the Civil War to the present. Topics to be discussed include Reconstruction, politics in the Gilded Age, late nineteenth-century urbanization and immigration, Populism, Progressivism, the rise of the United States to world power, the culture and politics of the twenties, the New Deal, the Cold War, post-World War II America, the turbulence of the sixties, the conservative resurgence, and the move toward a more pluralistic society.&#8232;&#8232;&#8232;&#8232;Most students found this course very interesting and felt that they learned a lot about American history. Some students felt, however, that the class was a bit biased about certain topics.&#8232;&#8232;&#8232;&#8232;Students enjoyed Professor Schrum. He was praised for his “passion for history and his desire to pass that interest on to students”. &#8232;&#8232;&#8232;&#8232;This course fulfills the History & Tradition Sector requirement. Students also commented that it was reading intensive.", "num_students": 42, "path": "/courses/21842/sections/001/reviews/5167-ETHAN-D--SCHRUM", "instructor": {"path": "/instructors/5167-ETHAN-D--SCHRUM", "first_name": "ETHAN D.", "last_name": "SCHRUM", "id": "5167-ETHAN-D--SCHRUM", "name": "ETHAN D. SCHRUM"}, "num_reviewers": 37, "id": "21842-001-5167-ETHAN-D--SCHRUM"}]}, "credits": null, "primary_alias": "HIST-021", "path": "/courses/21842", "sections": {"path": "/courses/21842/sections", "values": [{"name": "US HISTORY 1865-PRESENT", "sectionnum": "001", "primary_alias": "HIST-021-001", "path": "/courses/21842/sections/001", "id": "21842-001", "aliases": ["HIST-021-001"]}]}, "id": 21842, "aliases": ["HIST-021"]}