{"coursehistories": {"path": "/coursehistories/4098"}, "description": "This course offers an introduction to three major types of formal reasoning: deductive, inductive (probabilistic and statistical) and practical (also known as decision-making). First, and most centrally, we will be focusing on the logical structure of valid deductive arguments, i.e., arguments in which it is not possible for the conclusion to be false, given that the premises are all true. The pertinent argument-forms will be developed within the context of classical sentential and predicate logics with suitable extensions that include reasoning about various aspects of the world in terms of relations and functions. Our main objective in the deductive module is to expose students in a wide variety of contexts to the analysis of deductive arguments that includes appraising their correctness or incorrectness. Logical problem solving is used as a major pedagogic device. Next, we turn to correct inductive argument forms, i.e., arguments in which it is improbable that the conclusion be false, given that the premises are true. We present and study inductive arguments within the frameworks of elementary proability theory and statistics. Introduction of basic probabilistic and statistical concepts offers students the opportunity to extend deductive modes of reasoning to vastly more general forms of reasoning that rely on incomplete, limited, \n\nunreliable or uncertain information. We provide detailed examples that show how to analyze simple inductive argument-forms and illustrate what formal techniques are applicable in basic probabilistic and statistical problem solving. Additional examples are provided in the treatments of classical hypothesis testing and regression analysis. In the third and shortest module, we introduce some of the central ideas of (statistical) decision theory, without trying to treat the subject exhaustively that of course cannot be done in a single course. A decision problem usually has an objective to be attained and a collection of alternative choices with which to achieve it. The issue is then which choice will best achieve the specified objective. In this module we start with the most elementary decision-theoretic concepts, sketch some of the main principles of decision theory, and move gradually to the treatment of various unility-theoretic paradoxes and illustrative decision matrix examples. Finally, we indicate how reasoning based on optimization in decision theory arises also in game theory. The course is designed for students with a minimal background in mathematics. \n\n", "semester": "2013A", "name": "LOGIC & FORMAL REASONING", "reviews": {"path": "/courses/30845/reviews", "values": [{"ratings": {"rDifficulty": "2.30", "rTAQuality": "3.00", "rStimulateInterest": "2.70", "rCourseQuality": "2.58", "rWorkRequired": "1.80", "rInstructorQuality": "3.00", "rCommAbility": "3.20", "rInstructorAccess": "3.00"}, "section": {"name": "LOGIC & FORMAL REASONING", "sectionnum": "001", "primary_alias": "PHIL-015-001", "path": "/courses/30845/sections/001", "id": "30845-001", "aliases": ["PHIL-015-001"]}, "comments": "", "num_students": 16, "path": "/courses/30845/sections/001/reviews/954-ZOLTAN-DOMOTOR", "instructor": {"path": "/instructors/954-ZOLTAN-DOMOTOR", "first_name": "ZOLTAN", "last_name": "DOMOTOR", "id": "954-ZOLTAN-DOMOTOR", "name": "ZOLTAN DOMOTOR"}, "num_reviewers": 12, "id": "30845-001-954-ZOLTAN-DOMOTOR"}]}, "credits": null, "primary_alias": "PHIL-015", "path": "/courses/30845", "sections": {"path": "/courses/30845/sections", "values": [{"name": "LOGIC & FORMAL REASONING", "sectionnum": "001", "primary_alias": "PHIL-015-001", "path": "/courses/30845/sections/001", "id": "30845-001", "aliases": ["PHIL-015-001"]}]}, "id": 30845, "aliases": ["PHIL-015"]}