[{"ratings": {"rAmountLearned": "3.19", "rDifficulty": "3.19", "rStimulateInterest": "2.79", "rRecommendMajor": "3.76", "rCourseQuality": "2.96", "rWorkRequired": "3.43", "rInstructorAccess": "3.07", "rReadingsValue": "2.62", "rRecommendNonMajor": "1.12", "rCommAbility": "3.27", "rInstructorQuality": "3.20"}, "section": {"name": "INTRO TO CHEMICAL ENG", "sectionnum": "001", "primary_alias": "CBE-160-001", "path": "/courses/25724/sections/001", "id": "25724-001", "aliases": ["CBE-160-001"]}, "comments": "This course provides students with an introduction to analysis of processes used in the chemical and pharmaceutical industries. Emphasis is placed on the development of flow sheets and material balances for chemical processes. Students are also introduced to modern process simulation software.\r\n\r\nMost of the class was in agreement about several aspects of this course. They all agreed that this was a very challenging course; but they also said it was a good introductory course, the material was very interesting, and they learned a great deal from it. Students agreed that the problems sets were long and tedious; and exams are long and difficult; but then they also felt that the grading system and the homework policy were “harsh, but fair.\" There was general enthusiasm about the use of Excel and ASPEN in the course and they also praised the system of mid-lecture problems which helped them “get accustomed to the material,\" and “served as a good introduction to the kinds of problems [they] would be encountering.” However, some students did mention that the mid-lecture problems and the homework sets did reflect the difficulty of the exams.\r\n\r\nStudents enthusiastically praised Dr Holleran as an “excellent” and “motivating” professor. They greatly appreciated his comprehensive and organized lectures, clear style of teaching, and the use of every-day language that “doesn’t go over your head” to explain even the most difficult topics of the course. The students were very pleased that he “signposted” his lectures, “reiterated important points,\" and didn’t “make the topics boring.\" Many students mentioned that they were able to take very good notes during lecture, and hardly ever needed to refer to the book. A few students felt he sometimes “rushed through lectures” and spoke in a “monotonous tone.\"\r\n\r\nOverall, the course received very high ratings. This course is a requirement for all CBE majors and they generally take it in their Freshman year. It is recommended to CD students who are thinking about CBE. ", "num_students": 52, "path": "/courses/25724/sections/001/reviews/3908-SEAN-HOLLERAN", "instructor": {"path": "/instructors/3908-SEAN-HOLLERAN", "first_name": "SEAN", "last_name": "HOLLERAN", "id": "3908-SEAN-HOLLERAN", "name": "SEAN HOLLERAN"}, "num_reviewers": 50, "id": "25724-001-3908-SEAN-HOLLERAN"}]