[{"ratings": {"rAmountLearned": "3.54", "rDifficulty": "2.95", "rStimulateInterest": "3.41", "rRecommendMajor": "3.85", "rCourseQuality": "3.48", "rWorkRequired": "2.65", "rInstructorAccess": "2.77", "rReadingsValue": "3.27", "rRecommendNonMajor": "3.24", "rCommAbility": "3.32", "rInstructorQuality": "3.40"}, "section": {"name": "CONTEMPORARY ART", "sectionnum": "001", "primary_alias": "ARTH-287-001", "path": "/courses/26986/sections/001", "id": "26986-001", "aliases": ["ARTH-287-001", "ARTH-687-001"]}, "comments": "Many people experience the art of our time as bewildering, shocking, too ordinary (my kid could do that), too intellectual (elitist), or simply not as art. Yet what makes this art engaging is that it raises the question of what art is or can be, employs a range of new materials and technologies, and addresses previously excluded audiences. It invades non-art spaces, blurs the boundaries between text and image, document and performance, asks questions about institutional frames (the museum, gallery, and art journal), and generates new forms of criticism. Much of the \"canon\" of what counts as important is still in flux, especially for the last twenty years. And the stage is no longer centered only on the United States and Europe, but is becoming increasingly global. The course will introduce students to the major movements and artists of the post-war period, with emphasis on social and historical context, critical debates, new media, and the changing role of the spectator/participant.\r\n\r\nStudents came away from this course on contemporary art with a sense of satisfaction.  Most participants noted that they had developed a much firmer grasp of both the theory and history of contemporary through the course.  While the course was generally effective, students also noted that the course was at times “difficult to follow” and generally “above the level” of the class members.\r\n\r\nStudents praised Professor Silverman’s “vast knowledge” and “engaging manner.”  The sole criticism of her teaching style was that she occasionally presented the subject matter with such expertise that it became inaccessible to students.  One student commented that she “sometimes assumed students possessed prior knowledge that they did not.”  Nonetheless, Professor Silverman’s “approachability” partly counteracted her occasional misestimations of the appropriate level.\r\n\r\nStudents, who were almost exclusively members of majors that pertained to art, did not find the course unusually difficult.  Neither the workload nor the assessments were considered problematic.  Students maintained that this was among the best art history courses they had ever taken, and strongly recommended it to others.", "num_students": 61, "path": "/courses/26986/sections/001/reviews/5288-KAJA-SILVERMAN", "instructor": {"path": "/instructors/5288-KAJA-SILVERMAN", "first_name": "KAJA", "last_name": "SILVERMAN", "id": "5288-KAJA-SILVERMAN", "name": "KAJA SILVERMAN"}, "num_reviewers": 52, "id": "26986-001-5288-KAJA-SILVERMAN"}]