{"coursehistories": {"path": "/coursehistories/5162"}, "description": "Sugar and Spices. Tea and Coffee. Opium and Cocaine. Hop aboard the Indian Ocean dhows, Chinese junks, Dutch schooners, and British and American clipper ships that made possible the rise of global capitalism, new colonial relationships, and the intensified forms of cultural change. How have the desires to possess and consume particular commodities shaped cultures and the course of modern history? This class introduces students to the cultural history of the modern world through an interdisciplinary analysis of connections between East and West, South and North. Following the circulation of commodities and the development of modern capitalism, the course examines the impact of global exchange on interactions and relationships between regions, nations, cultures, and peoples and the influences on cultural practices and meanings. The role of slavery and labor migrations, colonial and imperial relations, and struggles for economic and political independence are also considered. \n\nFrom the role of spices in the formation of European joint stock companies circa 1600 to the contemporary cocaine trade, the course's use of both original primary sources and secondary readings written by historians and anthropologists will enable particular attention to the ways that global trade has impacted social, cultural, and political formations and practices throughout the world. \n\nRecitation will not meet every week. Lecture sessions will be shortened those weeks that recitations are held. \n\n", "semester": "2011C", "name": "East & West: A Hitchhiker's Guide to the Cultural History of the Mdrn World", "reviews": {"path": "/courses/25092/reviews", "values": [{"ratings": {"rAmountLearned": "2.86", "rDifficulty": "2.36", "rStimulateInterest": "3.12", "rRecommendMajor": "3.38", "rCourseQuality": "3.09", "rWorkRequired": "2.79", "rInstructorAccess": "3.45", "rReadingsValue": "2.56", "rRecommendNonMajor": "3.07", "rCommAbility": "3.36", "rInstructorQuality": "3.46"}, "section": {"name": "East & West: A Hitchhiker's Guide to the Cultural History of the Mdrn World", "sectionnum": "401", "primary_alias": "SAST-063-401", "path": "/courses/25092/sections/401", "id": "25092-401", "aliases": ["SAST-063-401", "HIST-087-401", "ANTH-063-401"]}, "comments": "", "num_students": 96, "path": "/courses/25092/sections/401/reviews/4096-LISA-MITCHELL", "instructor": {"path": "/instructors/4096-LISA-MITCHELL", "first_name": "LISA", "last_name": "MITCHELL", "id": "4096-LISA-MITCHELL", "name": "LISA MITCHELL"}, "num_reviewers": 86, "id": "25092-401-4096-LISA-MITCHELL"}]}, "credits": null, "primary_alias": "SAST-063", "path": "/courses/25092", "sections": {"path": "/courses/25092/sections", "values": [{"name": "East & West: A Hitchhiker's Guide to the Cultural History of the Mdrn World", "sectionnum": "401", "primary_alias": "SAST-063-401", "path": "/courses/25092/sections/401", "id": "25092-401", "aliases": ["SAST-063-401", "HIST-087-401", "ANTH-063-401"]}]}, "id": 25092, "aliases": ["SAST-063", "HIST-087", "ANTH-063"]}