{"coursehistories": {"path": "/coursehistories/2906"}, "description": "What infants and young children come to know about the world, and how they learn it. Topics will include changes in children's thinking, perceptual development, language acquisition, and current theories of cognitive development \n\n", "semester": "2008A", "name": "COGNITIVE DEVELOPMENT", "reviews": {"path": "/courses/20757/reviews", "values": [{"ratings": {"rAmountLearned": "3.35", "rDifficulty": "2.51", "rStimulateInterest": "3.60", "rRecommendMajor": "3.71", "rCourseQuality": "3.49", "rWorkRequired": "2.25", "rInstructorAccess": "3.37", "rReadingsValue": "2.94", "rRecommendNonMajor": "2.89", "rCommAbility": "3.78", "rInstructorQuality": "3.78"}, "section": {"name": "COGNITIVE DEVELOPMENT", "sectionnum": "001", "primary_alias": "PSYC-181-001", "path": "/courses/20757/sections/001", "id": "20757-001", "aliases": ["PSYC-181-001"]}, "comments": "Cognitive Development teaches students about what infants and young children come to know about the world, and how they learn it. Topics included changes in children\\'s thinking, perceptual development, language acquisition, and some current theories of how cognitive development occurs.\r\n\r\nThe course was described as “very worthwhile,” and as containing “very useful and practical info.” “The things I learned in this class will no doubt help me for the rest of my life,” one student wrote. Another said, it “sparked my interest in this area of psychology.”\r\n\r\nStudent responders unanimously agreed that Professor Swingley was an “amazing,” “fantastic,” “enthusiastic” professor. “The best psych professor at Penn!” several said. “Great personality, presence, presentation” one student summarized. Students also enjoyed the way he constructed his lectures and the slides: “I loved the way he presented research findings in every class rather than simply spewing unfounded fact.” They appreciated his use of videos to explain concepts and research techniques. Professor Swingley was also described as unusually accessible, taking time to thoroughly answer students’ questions and “grant generous extensions” on assignments when students needed them.\r\n\r\nA few students complained that the midterms did not contain enough questions to assess their knowledge of material. Optional written assignments were viewed as “very helpful,” however.", "num_students": 85, "path": "/courses/20757/sections/001/reviews/2667-DANIEL-SWINGLEY", "instructor": {"path": "/instructors/2667-DANIEL-SWINGLEY", "first_name": "DANIEL", "last_name": "SWINGLEY", "id": "2667-DANIEL-SWINGLEY", "name": "DANIEL SWINGLEY"}, "num_reviewers": 64, "id": "20757-001-2667-DANIEL-SWINGLEY"}]}, "credits": null, "primary_alias": "PSYC-181", "path": "/courses/20757", "sections": {"path": "/courses/20757/sections", "values": [{"name": "COGNITIVE DEVELOPMENT", "sectionnum": "001", "primary_alias": "PSYC-181-001", "path": "/courses/20757/sections/001", "id": "20757-001", "aliases": ["PSYC-181-001"]}]}, "id": 20757, "aliases": ["PSYC-181"]}