[{"ratings": {"rAmountLearned": "1.98", "rDifficulty": "2.06", "rStimulateInterest": "2.09", "rRecommendMajor": "2.70", "rCourseQuality": "1.78", "rWorkRequired": "2.64", "rInstructorAccess": "3.08", "rReadingsValue": "2.06", "rRecommendNonMajor": "1.12", "rCommAbility": "2.29", "rInstructorQuality": "2.84"}, "section": {"name": "SYS METHODOLOGY", "sectionnum": "001", "primary_alias": "ESE-204-001", "path": "/courses/25981/sections/001", "id": "25981-001", "aliases": ["ESE-204-001"]}, "comments": "This course introduces the integrative methodology that engineers use to solve complex problems. We emphasize the process of problem conception, engineering design, project implementation, and long-term operation as essential components of what we as engineers do. The course also focuses on the life-cycle approach to large-scale complex systems design, and will incorporate case studies, group projects, and technical communications.\r\n\r\nOverall, many students enjoyed this course. Many thought the course served as a “really good foundation for systems engineering”. Many praised it as a “great introductory course” to “explore what systems engineering is all about.” Underclassmen reported learning a lot from this course. However, students with more experience in the major found this course to be often repetitive, becoming “too easy.\"\r\n\r\nProfessor Keenan was praised as a “great professor.” However, many students wished that he had provided more guidance on course assignments, in particular more feedback on homework and more detailed instructions on the final paper.\r\n\r\nMany students were concerned with the lack of clear guidelines in reference to paper and presentation requirements. In addition, many students did not know where they stood in the class or how to improve. The class is targeted towards freshman and sophomores to be an introductory survey of systems engineering, however, one junior in the course noted that it provided a “great background for Senior Design.” ", "num_students": 80, "path": "/courses/25981/sections/001/reviews/1167-JOHN-D-KEENAN", "instructor": {"path": "/instructors/1167-JOHN-D-KEENAN", "first_name": "JOHN D", "last_name": "KEENAN", "id": "1167-JOHN-D-KEENAN", "name": "JOHN D KEENAN"}, "num_reviewers": 79, "id": "25981-001-1167-JOHN-D-KEENAN"}]