[{"ratings": {"rAmountLearned": "2.20", "rDifficulty": "2.21", "rStimulateInterest": "2.10", "rRecommendMajor": "2.45", "rCourseQuality": "2.36", "rWorkRequired": "2.93", "rInstructorAccess": "2.15", "rReadingsValue": "1.97", "rRecommendNonMajor": "1.90", "rCommAbility": "2.63", "rInstructorQuality": "2.38"}, "section": {"name": "GLOBAL ECONOMIC HISTORY: Global Economic History: Structure and Change", "sectionnum": "301", "primary_alias": "INTS-732-301", "path": "/courses/27620/sections/301", "id": "27620-301", "aliases": ["INTS-732-301"]}, "comments": "This course provides students with a brief introduction to global economic history since the early fifteenth century. The emphasis is on making students aware of the main features of the economic history of the world and how they interact with the political, social, and cultural dimensions of human activity. The subtitle, “structure and change,” highlights the double theme of continuity and change, of an evolving landscape of economic life where economic agents must negotiate with trends and shocks. The course mixes narrative, analytic, and quantitative approaches to address such questions as: Why are some countries rich, and why are others not? Why did Western Europe take off in the late seventeenth century? Why did China and India lag behind? What was the role of international trade in these developments? How was the economy shaped by wars? What is the role of technological change in history? How has nature (climate change, epidemics, movements of animals and plants) interacted with the economy over the centuries? \r\n\r\nWhile a couple students said they enjoyed the content of the course and learned a lot from it, most students presented only criticisms and suggestions for improvement of the course. One of the main complaints was that the readings were not necessarily related to the topics of class discussion. Another criticism mentioned by several students was that in attempting to cover such a broad subject—500 years of Global Economic History—“the course covered too much breadth without sufficient depth on any single topic or geography.” \r\n\r\nProfessor Fernandez-Villaverde received mixed reviews. While some students praised Professor Fernandez-Villverde for being “an incredibly smart professor who is a clear expert on this matter,” others criticized Professor Fernandez-Villaverde’s attitude as being somewhat “arrogant.” In the frame of this course in particular, one student enjoyed the stories and anecdotes he recounted during class, as they made the subject matter more interesting. However, a few other students disliked Professor Fernandez-Villaverde’s class participation policy, in which Professor Fernandez-Villaverde cold-called each student once or twice throughout the semester and assigned them a zero if they happened not to be present that particular day. Students felt this encouraged neither attendance nor class participation. \r\n\r\nThough none of the reviewers of this course commented on its difficulty, several did express that the readings were “excessively long” and one even went so far as to call the reading “ridiculous,” citing the 900-page PDF for the semester. According to the course description, no previous knowledge of economic history is required to take this course. ", "num_students": 64, "path": "/courses/27620/sections/301/reviews/326-JESUS-FERNANDEZ-VILLAVERDE", "instructor": {"path": "/instructors/326-JESUS-FERNANDEZ-VILLAVERDE", "first_name": "JESUS", "last_name": "FERNANDEZ-VILLAVERDE", "id": "326-JESUS-FERNANDEZ-VILLAVERDE", "name": "JESUS FERNANDEZ-VILLAVERDE"}, "num_reviewers": 49, "id": "27620-301-326-JESUS-FERNANDEZ-VILLAVERDE"}]