{"coursehistories": {"path": "/coursehistories/756"}, "description": "This course offers students a unique opportunity to develop consulting skills and entrepreneurial expertise by working as consultants to thriving entrepreneurial ventures in the Philadelphia area. This capstone course combines both fieldwork and class work and allows students to apply knowledge and skills acquired through other course work to real world issues that must be addressed by operating companies. An understanding of characteristics producing rapid entrepreneurial growth and skills related to effective communications and management of a business relationship are emphasized. \n\n", "semester": "2010C", "name": "CONSULT TO GROWTH CO", "reviews": {"path": "/courses/23410/reviews", "values": [{"ratings": {"rAmountLearned": "2.95", "rDifficulty": "2.57", "rStimulateInterest": "2.86", "rRecommendMajor": "3.05", "rCourseQuality": "2.76", "rWorkRequired": "3.38", "rInstructorAccess": "3.05", "rReadingsValue": "2.16", "rRecommendNonMajor": "2.81", "rCommAbility": "2.71", "rInstructorQuality": "2.64"}, "section": {"name": "CONSULT TO GROWTH CO", "sectionnum": "001", "primary_alias": "MGMT-251-001", "path": "/courses/23410/sections/001", "id": "23410-001", "aliases": ["MGMT-251-001"]}, "comments": "MGMT 251, or Consulting with Growth Companies, consists of lectures, case analyses, discussion groups and actual consulting engagements with local growth companies. It is in a sense a capstone course since it asks students to apply knowledge and modes of analysis acquired in other courses to issues confronting actual businesses. Issues addressed span a range of functional areas including strategic planning, financial analysis, marketing strategy, competitive analysis, organizational structure, and capital raising.\r\n\r\nSeveral students said this class was the best they have taken at Penn. Since the class required engaging with real companies in Philadelphia, students said they derived a lot of real-world experience. One student said it was “extremely practical,” and another student said it was a “great opportunity to try consulting.”\r\n\r\nProfessor Siegal was described as “extremely engaging.” However, one student commented that he was sometimes “unclear” with his expectations on assignments.\r\n\r\nNearly all students commented that the workload for this class was very high. “Definitely the best course I’ve taken at Penn, also the course with the most amount of work,” one student said. Others described work done outside of class as “challenging” and “time-consuming.” Prerequisites for this course are MGMT 100 and MGMT 101, and this course is recommended for juniors and seniors. This review is based on the 8 student comments that were submitted.\r\n", "num_students": 28, "path": "/courses/23410/sections/001/reviews/808-ERIC-S-SIEGEL", "instructor": {"path": "/instructors/808-ERIC-S-SIEGEL", "first_name": "ERIC S", "last_name": "SIEGEL", "id": "808-ERIC-S-SIEGEL", "name": "ERIC S SIEGEL"}, "num_reviewers": 25, "id": "23410-001-808-ERIC-S-SIEGEL"}]}, "credits": null, "primary_alias": "MGMT-251", "path": "/courses/23410", "sections": {"path": "/courses/23410/sections", "values": [{"name": "CONSULT TO GROWTH CO", "sectionnum": "001", "primary_alias": "MGMT-251-001", "path": "/courses/23410/sections/001", "id": "23410-001", "aliases": ["MGMT-251-001"]}]}, "id": 23410, "aliases": ["MGMT-251"]}