[{"ratings": {"rAmountLearned": "2.22", "rDifficulty": "1.73", "rStimulateInterest": "2.53", "rRecommendMajor": "3.06", "rCourseQuality": "2.57", "rWorkRequired": "1.94", "rInstructorAccess": "2.76", "rReadingsValue": "1.92", "rRecommendNonMajor": "2.88", "rCommAbility": "2.55", "rInstructorQuality": "2.60"}, "section": {"name": "PRODUCT DESIGN", "sectionnum": "401", "primary_alias": "OPIM-415-401", "path": "/courses/23597/sections/401", "id": "23597-401", "aliases": ["OPIM-415-401", "MEAM-515-401", "IPD-515-401"]}, "comments": "Intended for students with a strong career interest in new product development, entrepreneurship, and technology development, the course provides methods and tools for creating new products. The course places emphasis on an overall product design methodology, such as the identification of customer needs, generation of product concepts, prototyping, and design-for-manufacturing. Similar to many of the design courses, there are weekly assignments, focusing on the design of a new product, which ultimately culminate in the creation of a prototype. \r\n\r\nOverall, a majority of the students thought the class was a good introductory course for product design. However, some students commented they wished the class had been more hands-on, focusing on the prototyping in the second half of the course. Students complained there was too much emphasis on theoretical analysis instead of an opportunity to build and create. Furthermore, some students said the class was geared too much towards the engineering aspect. Professor Burns often discussed complex engineering-orientated subjects that demanded an extensive background in engineering. \r\n\r\nMany students praised Professor Burns for his knowledge in the field. In fact, one student commented he or she wished “more time was spent learning from the professor since his experience is so paramount in the industry.” Overall, students referred to him as “incredibly friendly and easy-going,” However, some students hesitated on his quality of lecturing, stating that he could set a faster pace and be more exciting. \r\n\r\nThis course is only open to junior and seniors in SEAS or Wharton. Many students said that the workload and material that is covered is not 500-level material, and that non-majors or anyone without any knowledge in the area of design could enroll in the class. However, as mentioned above, a background in engineering is recommended.\r\n", "num_students": 63, "path": "/courses/23597/sections/401/reviews/5664-CLAY-BURNS", "instructor": {"path": "/instructors/5664-CLAY-BURNS", "first_name": "CLAY", "last_name": "BURNS", "id": "5664-CLAY-BURNS", "name": "CLAY BURNS"}, "num_reviewers": 61, "id": "23597-401-5664-CLAY-BURNS"}]