[{"ratings": {"rAmountLearned": "3.07", "rDifficulty": "2.74", "rStimulateInterest": "2.84", "rRecommendMajor": "3.40", "rCourseQuality": "2.83", "rWorkRequired": "2.84", "rInstructorAccess": "2.98", "rReadingsValue": "2.67", "rRecommendNonMajor": "2.56", "rCommAbility": "3.09", "rInstructorQuality": "2.92"}, "section": {"name": "HEALTH SERVICES SYS", "sectionnum": "001", "primary_alias": "HCMG-841-001", "path": "/courses/24516/sections/001", "id": "24516-001", "aliases": ["HCMG-841-001"]}, "comments": "Health Care Management 841 provides an overview of the evolution, structure and current issues in the health care system. It examines the unique features of health care as a product, and the changing relationships between patients, physicians, hospitals, insurers, employers, communities, and government. The course examines three broad segments of the health care industry: payors, providers, and suppliers. Within the payor segment, the course examines the sources and destinations of spending, managed care (HMOs, PPOs), employer based health insurance, technology assessment, payor strategy, and efforts to pay for the elderly, the poor, and the medically indigent. Within the provider segment, the course examines the impact of cost containment and competition on hospitals and integrated delivery systems, long term care and disease management, and the important role of epidemiology in assessing population health needs and risks. Within the supplier segment, the course will examine developments in the biotechnology, pharmaceutical, medical devices, genomics and IT industries.  The format of the class involves lectures and cases along with weekly reading assignments.  \r\n\r\nA majority of students considered this “a great course” with content that is “extremely interesting and relevant for healthcare management majors.”  Another student noted that the “content covered in this course was incredible,” and a third notes that the course provided a “very helpful overview of the health care environment in the US.”  Students noted that the class attempts to cover a lot of content, and one student mentioned that they “were expected to know each given topic in great detail” by the first midterm. A few students felt the class involved a lot of reading, and students wished it was more clear which readings were actually “necessary to read before class.”\r\n\r\nProfessor Burns received overall positive feedback.  Quite a few described him as “an excellent instructor” whose “passion for the subject and investment in this course is obvious.” One student stated that Professor Burns is “very open to feedback” and another appreciated that Professor Burns “came in with a point of view.” A few students wished that Professor Burns gave more lectures rather than having as many guest speakers, stating that “Professor Burns’ knowledge and expertise on the subject was only touched lightly.” One student mentioned there was sometimes a “lack of interaction” between the professor and the class.  A student expressed some difficulty connecting with the professor but goes on to describe him as “a great leader in a subject that is incredibly complex.”\r\n\r\nThis course is required for Wharton Graduate Health Care Management majors and counts as an elective course for all other Wharton graduate students.  It is also open to Law School and Nursing School students with a joint Wharton program.  The workload is considered manageable, but heavily based on readings.  The grading style of this course was a concern for many. One student noted that what “needs to be reconsidered is the content of case questions and exams.” Questions and expected answers on exams were “really vague.” A prerequisite is HCMG603.\r\n", "num_students": 80, "path": "/courses/24516/sections/001/reviews/3378-LAWTON-R-BURNS", "instructor": {"path": "/instructors/3378-LAWTON-R-BURNS", "first_name": "LAWTON R", "last_name": "BURNS", "id": "3378-LAWTON-R-BURNS", "name": "LAWTON R BURNS"}, "num_reviewers": 50, "id": "24516-001-3378-LAWTON-R-BURNS"}]