{"coursehistories": {"path": "/coursehistories/162"}, "description": "Many people experience the art of our time as bewildering, shocking, too ordinary (my kid could do that), too intellectual (elitist), or simply not as art. Yet what makes this art engaging is that it raises the question of what art is or can be, employs a range of new materials and technologies, and addresses previously excluded audiences. It invades non-art spaces, blurs the boundaries between text and image, document and performance, asks questions about institutional frames (the museum, gallery, and art journal), and generates new forms of criticism. Much of the \"canon\" of what counts as important is still in flux, especially for the last twenty years. And the stage is no longer centered only on the United States and Europe, but is becoming increasingly global. The course will introduce students to the major movements and artists of the post-war period, with emphasis on social and historical context, critical debates, new media, and the changing role of the spectator/participant. \n\n", "semester": "2009A", "name": "20TH C. ART: 1945-NOW", "reviews": {"path": "/courses/15356/reviews", "values": [{"ratings": {"rAmountLearned": "3.23", "rDifficulty": "2.56", "rStimulateInterest": "3.47", "rRecommendMajor": "3.79", "rCourseQuality": "3.38", "rWorkRequired": "2.67", "rInstructorAccess": "2.91", "rReadingsValue": "2.77", "rRecommendNonMajor": "3.16", "rCommAbility": "3.47", "rInstructorQuality": "3.44"}, "section": {"name": "20TH C. ART: 1945-NOW", "sectionnum": "001", "primary_alias": "ARTH-287-001", "path": "/courses/15356/sections/001", "id": "15356-001", "aliases": ["ARTH-287-001", "ARTH-687-001"]}, "comments": "This course offers a survey of 20th century art from 1945 to the present with emphasis on social and historical context, critical debates, new media, and the changing role of the spectator. The course will address many of the common reactions to contemporary art and will explore what makes this type of art revolutionary and engaging.\r\n&#8232;&#8232;Overall this class was very popular. As one student said, “This was one of the best classes I\\'ve taken at Penn. I\\'m an English major and I really learned a lot.” Another student said, “This was a brilliant course that taught me a lot in terms of Contemporary Art, a field that often seems daunting and confusing before one dives in.” Students said that they learned a lot in the class whether they were newcomers to art history or not.\r\nProfessor Shaw received great reviews from her students who described her as “passionate”, “engaging”, “stimulating”, and “interesting”. One student reported that “Professor Shaw is excellent and her passion for art and the course is highly motivating and inspiring.” Several students, however, reported that Professor Shaw’s teaching highlighted important works and general themes, but left out details that would have enhanced the course. Overall, Professor Shaw had favorable ratings and the class was enjoyed by the majority of students..&#8232;\r\n&#8232;Professor Shaw’s layout of the course allowed for “numerous extra credit opportunities encouraged students to explore the art we studied outside of the lecture hall,” but students reported a disconnect between the professor and the TA’s. While some students enjoyed the main project, the Digital Art Gallery, most students said that the instructions were vague and questions about the project were not well answered. The textbook and outside readings were difficult to read, but Professor Shaw’s lectures made up for the confusion.", "num_students": 63, "path": "/courses/15356/sections/001/reviews/2862-GWENDOLYN-D-SHAW", "instructor": {"path": "/instructors/2862-GWENDOLYN-D-SHAW", "first_name": "GWENDOLYN D", "last_name": "SHAW", "id": "2862-GWENDOLYN-D-SHAW", "name": "GWENDOLYN D SHAW"}, "num_reviewers": 62, "id": "15356-001-2862-GWENDOLYN-D-SHAW"}]}, "credits": null, "primary_alias": "ARTH-287", "path": "/courses/15356", "sections": {"path": "/courses/15356/sections", "values": [{"name": "20TH C. ART: 1945-NOW", "sectionnum": "001", "primary_alias": "ARTH-287-001", "path": "/courses/15356/sections/001", "id": "15356-001", "aliases": ["ARTH-287-001", "ARTH-687-001"]}]}, "id": 15356, "aliases": ["ARTH-287", "ARTH-687"]}