[{"ratings": {"rAmountLearned": "2.47", "rDifficulty": "2.63", "rStimulateInterest": "1.70", "rRecommendMajor": "2.91", "rCourseQuality": "1.98", "rWorkRequired": "2.67", "rInstructorAccess": "2.05", "rReadingsValue": "2.63", "rRecommendNonMajor": "1.81", "rCommAbility": "2.13", "rInstructorQuality": "1.77"}, "section": {"name": "COMPARATIVE POLITICS", "sectionnum": "001", "primary_alias": "PSCI-110-001", "path": "/courses/26651/sections/001", "id": "26651-001", "aliases": ["PSCI-110-001"]}, "comments": "This course is designed to introduce students to comparative political analysis. How can the political behavior, circumstances, institutions, and dynamic patterns of change that people experience in very different societies be analyzed using the same set of concepts and theories? Key themes include nationalism, political culture, democratization, authoritarianism, and the nature of protracted conflict.\r\n\r\nStudents had mixed opinions on the content of the course. Some found it “interesting” and “relevant,” and others felt it was “broad and dated.” Many concurred that it was “a good introductory course for political science.”\r\n\r\nMany felt that Professor Lynch “read directly from her slides” and was “unwilling to answer questions.” Some thought Professor Lynch was a “great professor” and “enthusiastic,” but many others commented that she treated students “like children.”\r\n\r\nStudents on the whole did not find this course too challenging. However, many commented that there was not “adequate time for comprehensive essays” on exams, and students often “ran out of time.” Students agreed that material could be “easily understood by a non-major.” This course fulfills the Society sector requirement.", "num_students": 149, "path": "/courses/26651/sections/001/reviews/1009-JULIA-LYNCH", "instructor": {"path": "/instructors/1009-JULIA-LYNCH", "first_name": "JULIA", "last_name": "LYNCH", "id": "1009-JULIA-LYNCH", "name": "JULIA LYNCH"}, "num_reviewers": 135, "id": "26651-001-1009-JULIA-LYNCH"}]