[{"ratings": {"rAmountLearned": "3.10", "rDifficulty": "3.86", "rStimulateInterest": "2.86", "rRecommendMajor": "3.24", "rCourseQuality": "3.05", "rWorkRequired": "3.62", "rInstructorAccess": "3.43", "rReadingsValue": "3.10", "rRecommendNonMajor": "1.40", "rCommAbility": "3.10", "rInstructorQuality": "3.23"}, "section": {"name": "THERMODYN & PHASE TRANSF", "sectionnum": "001", "primary_alias": "MSE-530-001", "path": "/courses/23479/sections/001", "id": "23479-001", "aliases": ["MSE-530-001"]}, "comments": "This course is a review of fundamental thermodynamic laws and criteria for equilibrium. The main topics covered include: reaction equilibria in multicomponent systems; free energies of mixing solutions, liquids, solids, and polymers; binary and ternary phase diagrams; surfaces and interfaces.\r\n\r\nAlthough some students enjoyed the course material, many others questioned its applicability, with one characterizing it as “way off base from a grad level engineering perspective.” The content was “highly theoretical,” strongly emphasizing mathematical arguments and derivations over application. Another student pointed out that the material was above the level of most students.\r\n\r\nMost students regarded Professor Li as a very enthusiastic instructor, and he was also described as “kind and knowledgeable.”\r\n\r\nStudents generally described the course as very difficult and fast-paced. According to most, homework assignments were very time-consuming. This course is a requirement for a graduate level program. Undergraduates wishing to take this class must obtain the permission of the Undergraduate Curriculum Chair and the instructor.\r\n\r\nThis course review is based on the 7 student comments that were submitted.\r\n", "num_students": 30, "path": "/courses/23479/sections/001/reviews/4458-JU-LI", "instructor": {"path": "/instructors/4458-JU-LI", "first_name": "JU", "last_name": "LI", "id": "4458-JU-LI", "name": "JU LI"}, "num_reviewers": 23, "id": "23479-001-4458-JU-LI"}]