[{"ratings": {"rAmountLearned": "3.25", "rDifficulty": "3.01", "rStimulateInterest": "2.79", "rRecommendMajor": "3.27", "rCourseQuality": "3.13", "rWorkRequired": "3.28", "rInstructorAccess": "3.00", "rReadingsValue": "2.84", "rRecommendNonMajor": "2.02", "rCommAbility": "2.98", "rInstructorQuality": "2.98"}, "section": {"name": "NETWORKED SYSTEMS", "sectionnum": "401", "primary_alias": "CIS-553-401", "path": "/courses/27175/sections/401", "id": "27175-401", "aliases": ["CIS-553-401", "TCOM-512-401"]}, "comments": "This course provides an introduction to fundamental concepts in the design and implementation of networked systems, their protocols, and applications. Topics covered include: Internet architecture, network applications, addressing, routing, transport protocols, network security, and peer-to-peer networks. The course involves written assignments, examinations, and programming assignments. Students work in teams to design and implement networked systems in layers, from routing protocols, transport protocols, to peer-to-peer networks.\r\n\r\nStudents reported learning a lot of networking-relating material in this class.  Student stated that this course focused mainly on the “network layer: routing protocol and the overlay network.”\r\n\r\nStudents thought the professor was informative, but he could have made the lectures more engaging. However, the assigned projects were repeatedly stated as “excellent”. Students thought the TAs were helpful in completing projects in this course.\r\n\r\nThis class is intended for upper level undergraduate students and/or graduate students studying computer science. Students reported a high workload for this course. Students stated the final exam was “tedious in terms of the amount of theoretical concepts taught” but that the midterm was more straightforward.  The homework was considered time consuming but rewarding and very informative.\r\n", "num_students": 106, "path": "/courses/27175/sections/401/reviews/3918-BOON-THAU-LOO", "instructor": {"path": "/instructors/3918-BOON-THAU-LOO", "first_name": "BOON THAU", "last_name": "LOO", "id": "3918-BOON-THAU-LOO", "name": "BOON THAU LOO"}, "num_reviewers": 91, "id": "27175-401-3918-BOON-THAU-LOO"}]