{"coursehistories": {"path": "/coursehistories/830"}, "description": "The relationships among nursing theory, research and practice will be examined. An emphasis will be placed on research competencies for advanced practice nurses (APNs), including understanding nursing research methods and strategies in order to evaluate research results for applicability to practice and to design projects for evaluating outcomes of practice. An understanding of statistical techniques will be integrated into the course and build on the required undergraduate statistics course. Published nursing research studies will be evaluated for scientific merit and clinical feasibility, with a focus on evidence-based practice. \n\n", "semester": "2012A", "name": "INTRODUCTION TO RESEARCH METHODS AND DESIGN", "reviews": {"path": "/courses/27909/reviews", "values": [{"ratings": {"rAmountLearned": "1.71", "rDifficulty": "3.24", "rTAQuality": "2.96", "rStimulateInterest": "1.84", "rRecommendMajor": "1.62", "rCourseQuality": "1.37", "rWorkRequired": "2.51", "rInstructorAccess": "2.27", "rReadingsValue": "1.93", "rRecommendNonMajor": "0.38", "rCommAbility": "2.13", "rInstructorQuality": "1.93"}, "section": {"name": "INTRODUCTION TO RESEARCH METHODS AND DESIGN", "sectionnum": "001", "primary_alias": "NURS-637-001", "path": "/courses/27909/sections/001", "id": "27909-001", "aliases": ["NURS-637-001"]}, "comments": "The relationships among nursing theory, research and practice will be examined.  An emphasis will be placed on research competencies for advanced practice nurses (APNs), including understanding nursing research methods and strategies in order toe valuate research results for applicability to practice and to design projects for evaluating outcomes of practice.  An understanding of statistical techniques will be integrated into the course and build on the required undergraduate statistics course.  Published nursing research studies will be evaluated for scientific merit and clinical feasibility, with a focus on evidence-based practice.\r\n\tSeveral elements of this course were seen as valuable and appreciated by students, such as the guest lectures and literature critiques.  However, students viewed the emphasis on rote memorization and unpredictable tests as highly unfavorable.  Despite the interest in course topics, students referred to the material as “dry,” “demanding,” and “difficult,” ultimately leaving the students wishing for more organization and structure in the course throughout the semester. \r\n\tProfessor Spatz and the teaching assistant were seen as supportive, and many students appreciated the positive learning environment they fostered.  Students commented that Spatz “makes a good effort to stimulate students.” \r\n\tTests were described as “nit-picky” and “random,” and left some students discouraged because they were not a “true gauge of knowledge.” Students who did well attributed it to luck, and overall students lamented the absence of a common thread with part one of this class taught in the fall semester. This course requires a prerequisite of NURS 230 or the equivalent.  In addition, students must have completed a semester of Junior Level clinicals. Also offered in 6 week Summer Session I and 12 week Summer Session I & II.\r\n", "num_students": 52, "path": "/courses/27909/sections/001/reviews/873-DIANE-L--SPATZ", "instructor": {"path": "/instructors/873-DIANE-L--SPATZ", "first_name": "DIANE L.", "last_name": "SPATZ", "id": "873-DIANE-L--SPATZ", "name": "DIANE L. SPATZ"}, "num_reviewers": 47, "id": "27909-001-873-DIANE-L--SPATZ"}, {"ratings": {"rAmountLearned": "2.19", "rDifficulty": "2.67", "rTAQuality": "1.96", "rStimulateInterest": "2.15", "rRecommendMajor": "2.00", "rCourseQuality": "2.00", "rWorkRequired": "2.19", "rInstructorAccess": "3.08", "rReadingsValue": "2.07", "rRecommendNonMajor": "1.46", "rCommAbility": "2.19", "rInstructorQuality": "2.37"}, "section": {"name": "INTRODUCTION TO RESEARCH METHODS AND DESIGN", "sectionnum": "002", "primary_alias": "NURS-637-002", "path": "/courses/27909/sections/002", "id": "27909-002", "aliases": ["NURS-637-002"]}, "comments": "", "num_students": 28, "path": "/courses/27909/sections/002/reviews/4922-LINDA-A--HATFIELD", "instructor": {"path": "/instructors/4922-LINDA-A--HATFIELD", "first_name": "LINDA A.", "last_name": "HATFIELD", "id": "4922-LINDA-A--HATFIELD", "name": "LINDA A. HATFIELD"}, "num_reviewers": 27, "id": "27909-002-4922-LINDA-A--HATFIELD"}, {"ratings": {"rAmountLearned": "2.27", "rDifficulty": "2.63", "rTAQuality": "2.26", "rStimulateInterest": "3.30", "rRecommendMajor": "2.37", "rCourseQuality": "2.16", "rWorkRequired": "2.40", "rInstructorAccess": "3.78", "rReadingsValue": "2.13", "rRecommendNonMajor": "1.35", "rCommAbility": "3.37", "rInstructorQuality": "3.48"}, "section": {"name": "INTRODUCTION TO RESEARCH METHODS AND DESIGN", "sectionnum": "003", "primary_alias": "NURS-637-003", "path": "/courses/27909/sections/003", "id": "27909-003", "aliases": ["NURS-637-003"]}, "comments": "The relationships among nursing theory, research and practice will be examined.  An emphasis will be placed on research competencies for advanced practice nurses (APNs), including understanding nursing research methods and strategies in order to evaluate research results for applicability to practice and to design projects for evaluating outcomes of practice.  An understanding of statistical techniques will be integrated into the course and build on the required undergraduate statistics course.  Published nursing research studies will be evaluated for scientific merit and clinical feasibility, with a focus on evidence-based practice.\r\nStudents who take pleasure in research generally enjoyed this class more than those who do not.  Most students would have preferred a more interactive class, but acknowledged that the research skills learned in this class are valuable.  Students favored the classes that were taught by guest speakers.  The Power Points in lectures seemed outdated as did the textbook, but the methods of researching were still valid.\r\nProfessor Abbott used Power Point slides that seemed to have been created by another teacher, but managed to communicate the subject matter well when she “talked about her own experiences. ”  \r\nA few students felt that the vast amount of information presented in this class made the final exam unfair in that the questions seemed foreign.  Prerequisite: NURS 230 or equivalent.  In addition, students must have completed a semester of Junior Level clinicals.  Also offered in 6 week Summer Session I and 12 week Summer Session I & II.\r\n", "num_students": 46, "path": "/courses/27909/sections/003/reviews/5830-KATHERINE-ABBOTT", "instructor": {"path": "/instructors/5830-KATHERINE-ABBOTT", "first_name": "KATHERINE", "last_name": "ABBOTT", "id": "5830-KATHERINE-ABBOTT", "name": "KATHERINE ABBOTT"}, "num_reviewers": 43, "id": "27909-003-5830-KATHERINE-ABBOTT"}]}, "credits": null, "primary_alias": "NURS-637", "path": "/courses/27909", "sections": {"path": "/courses/27909/sections", "values": [{"name": "INTRODUCTION TO RESEARCH METHODS AND DESIGN", "sectionnum": "001", "primary_alias": "NURS-637-001", "path": "/courses/27909/sections/001", "id": "27909-001", "aliases": ["NURS-637-001"]}, {"name": "INTRODUCTION TO RESEARCH METHODS AND DESIGN", "sectionnum": "002", "primary_alias": "NURS-637-002", "path": "/courses/27909/sections/002", "id": "27909-002", "aliases": ["NURS-637-002"]}, {"name": "INTRODUCTION TO RESEARCH METHODS AND DESIGN", "sectionnum": "003", "primary_alias": "NURS-637-003", "path": "/courses/27909/sections/003", "id": "27909-003", "aliases": ["NURS-637-003"]}]}, "id": 27909, "aliases": ["NURS-637"]}