{"coursehistories": {"path": "/coursehistories/1292"}, "description": "Numerical modeling using effective algorithms with applications to problems in engineering, science, and mathematics, and is intended for graduate and advanced undergraduate students in these areas. Interpolation and curve fitting, numerical integration, solution of ordinary and partial differential equations by finite difference, and finite element methods. Includes use of representative numerical software packages such as MATLAB PDE Toolbox. \n\n", "semester": "2012A", "name": "NUMERICAL MTHDS & MODLNG", "reviews": {"path": "/courses/27344/reviews", "values": [{"ratings": {"rAmountLearned": "2.93", "rDifficulty": "3.56", "rStimulateInterest": "2.40", "rRecommendMajor": "2.95", "rCourseQuality": "2.78", "rWorkRequired": "3.71", "rInstructorAccess": "2.49", "rReadingsValue": "2.09", "rRecommendNonMajor": "2.05", "rCommAbility": "2.93", "rInstructorQuality": "2.80"}, "section": {"name": "NUMERICAL MTHDS & MODLNG", "sectionnum": "001", "primary_alias": "ENM-502-001", "path": "/courses/27344/sections/001", "id": "27344-001", "aliases": ["ENM-502-001"]}, "comments": "This course covers numerical modeling using effective algorithms with applications to problems in engineering, science, and mathematics.  Interpolation and curve fitting, numerical integration, solution of ordinary and partial differential equations by finite difference, and finite element methods are taught.\r\n\r\nMany students enjoyed the class, with one writing that it was “well-executed.” However, one student expressed skepticism regarding the relevance of the course, as it involved programming models that were already well-implemented in Matlab. Another student wished that programming for the assignments would have “at least minor importance” towards evaluation, as it was by far the most time-consuming portion.\r\n\r\nOne student praised the TA Ian as a great and accessible instructor.\r\n\r\nMany students commented that the assignments were very difficult. A student noted that the course required “significant prior experience with Matlab,” as well 30 to 40 hours of work outside of class each week.\r\nThis course review was written based on the seven student comments submitted.\r\n", "num_students": 53, "path": "/courses/27344/sections/001/reviews/217-TALID-R--SINNO", "instructor": {"path": "/instructors/217-TALID-R--SINNO", "first_name": "TALID R.", "last_name": "SINNO", "id": "217-TALID-R--SINNO", "name": "TALID R. SINNO"}, "num_reviewers": 45, "id": "27344-001-217-TALID-R--SINNO"}]}, "credits": null, "primary_alias": "ENM-502", "path": "/courses/27344", "sections": {"path": "/courses/27344/sections", "values": [{"name": "NUMERICAL MTHDS & MODLNG", "sectionnum": "001", "primary_alias": "ENM-502-001", "path": "/courses/27344/sections/001", "id": "27344-001", "aliases": ["ENM-502-001"]}]}, "id": 27344, "aliases": ["ENM-502"]}