[{"ratings": {"rAmountLearned": "3.30", "rDifficulty": "2.15", "rStimulateInterest": "3.74", "rRecommendMajor": "3.78", "rCourseQuality": "3.59", "rWorkRequired": "2.44", "rInstructorAccess": "3.85", "rReadingsValue": "3.67", "rRecommendNonMajor": "3.11", "rCommAbility": "3.81", "rInstructorQuality": "3.79"}, "section": {"name": "19TH-CENT BRITISH LIT: BRITISH NOVEL OF DEVELOP", "sectionnum": "401", "primary_alias": "ENGL-051-401", "path": "/courses/15609/sections/401", "id": "15609-401", "aliases": ["ENGL-051-401", "GSOC-051-401"]}, "comments": "In 1815 in the wake of the battle of Waterloo, Great Britain controlled a staggering quarter of the world\\'s landmass and half of its gross national product. This course will begin with the Napoleonic Wars and this Regency aftermath to survey a century of British literature -- from Romanticism through the revolutions of 1848 and the Victorian and Edwardian periods to the beginning of the First World War. Most versions of this course will read novels and poetry, often focusing on the relation between the two and their function within nineteenth century culture, while other versions may incorporate drama and non-fiction prose.\r\nThe course quality was very highly rated and students did not consider it that difficult. Students enjoyed the assigned books but commented that the intense literature made the class “definitely very English ‘Major-y.’” These books were described as having provided students with a wealth of information and a greater appreciation of British literature.\r\n\r\nStudents had high praise for Professor Burnham. “Her ability to keep you interested, keep you talking, and keep you learning is amazing!” Students especially appreciated the efforts she made to keep lectures interesting with lively class discussions and the inclusion of films and other sources. Professor Burnham was described as “extremely engaging” and was often thought to have “brought life” to the texts.\r\n\r\nThere were several assigned books and students felt that the class was “always behind in the readings.” However, they believed the material covered to be very valuable and highly recommended the course to both majors and non-majors.", "num_students": 29, "path": "/courses/15609/sections/401/reviews/437-DEBORAH-S-BURNHAM", "instructor": {"path": "/instructors/437-DEBORAH-S-BURNHAM", "first_name": "DEBORAH S", "last_name": "BURNHAM", "id": "437-DEBORAH-S-BURNHAM", "name": "DEBORAH S BURNHAM"}, "num_reviewers": 29, "id": "15609-401-437-DEBORAH-S-BURNHAM"}]