{"coursehistories": {"path": "/coursehistories/2034"}, "description": "This participatory interdisciplinary seminar course examines contemporary issues in public health policy and global health. The organizing framework is social determinants of health. We consider evidence that inequalities in education, income, and occupation influence health status, and the policy dilemma that broad interventions to improve population health may increase health disparities. We critically examine whether prevention is always better than cure, and what modern medicine has to offer in terms of health. We explore the public policy process in health using the \"tobacco wars\" as a case example, of how politics, policy, law, commercial interests, and research intersect to affect the public's health. We examine whether global health is in a state of decline, and the extent to which failures in public health, public policy, and foreign policy have contributed to increasing threats to world health. Likewise we will examine the potential for greater integration of health into foreign policy to create global infrastructure upon which to advance health. We will examine the global health workforce and the impact of widespread global migration of health professionals on receiving and sending countries. \n\nThere are no prerequisites. The course is designed for graduate students in the social and behavioral sciences, health professions, public health, business and law. Advanced undergraduate students will be admitted with permission. \n\n", "semester": "2002C", "name": "HEALTH CARE & SOCIAL POLICY", "reviews": {"path": "/courses/3319/reviews", "values": [{"ratings": {"rAmountLearned": "3.56", "rDifficulty": "3.11", "rStimulateInterest": "2.89", "rRecommendMajor": "2.78", "rCourseQuality": "3.22", "rWorkRequired": "3.33", "rInstructorAccess": "2.89", "rReadingsValue": "3.33", "rRecommendNonMajor": "2.89", "rCommAbility": "3.33", "rInstructorQuality": "3.11"}, "section": {"name": "HEALTH CARE & SOCIAL POLICY", "sectionnum": "401", "primary_alias": "NURS-640-401", "path": "/courses/3319/sections/401", "id": "3319-401", "aliases": ["NURS-640-401", "SOCI-640-401"]}, "comments": "", "num_students": 9, "path": "/courses/3319/sections/401/reviews/1649-LINDA-H--AIKEN", "instructor": {"path": "/instructors/1649-LINDA-H--AIKEN", "first_name": "LINDA H.", "last_name": "AIKEN", "id": "1649-LINDA-H--AIKEN", "name": "LINDA H. AIKEN"}, "num_reviewers": 9, "id": "3319-401-1649-LINDA-H--AIKEN"}]}, "credits": null, "primary_alias": "NURS-640", "path": "/courses/3319", "sections": {"path": "/courses/3319/sections", "values": [{"name": "HEALTH CARE & SOCIAL POLICY", "sectionnum": "401", "primary_alias": "NURS-640-401", "path": "/courses/3319/sections/401", "id": "3319-401", "aliases": ["NURS-640-401", "SOCI-640-401"]}]}, "id": 3319, "aliases": ["NURS-640", "SOCI-640"]}