{"coursehistories": {"path": "/coursehistories/5734"}, "description": "Over fifty percent of the worlds population now lives in cities. Neoliberlism-the ideology and accompanying policies and practices that champion the shifting of political decision making from the public sector to the private sector - has been widely recognized as having shown dramatic growth worldwide since the 1970s. It has also been widely regarded as a product of globalization. This course traces the history of neo-liberalism in global context with particular attention to neoliberalism's relationship to cities, and exam the role that urban growth has played in spurring neoliberal policies and practices. It asks how policy makers, voters, and private interest worldwide have responded to the growth of urban poverty and slums, challenges withing urban public education, unequal resource distribution, environmental pressures experienced within urban sanitation and waste disposal systems, and increased demands for municipal services like water, electricity, and transport infrastructers, and examined the rise of public-private partnerships, gated communities, initiatives to privatized education and municipal services, and efforts to relocate slum-dwellers and beautify cities as explicit strategies for attracting \"global capital\". \n\nThe course also asks how the recent rise of neoliberal policies and practices differs from earlier market-driven and private sector led forms of political governance. The British and Dutch East India Companies are two famous examples of joint stock companies that assumed administrative and political roles over their colonies. How did the rise of these colonial relationships differ from current neoliberal shifts. Readings will draw heavily from ethnographic and urban studies, scholarship on South Asia, as well as Latin America, South Africa, the Middle East, Europe, and North America, exploring what each of these specific contexts has to teach us more generally about the relationship between urbanization, global capitalism, public and private sectors, and political processes and decision making. \n\n", "semester": "2013A", "name": "NEOLIBERALISM & THE CITY", "reviews": {"path": "/courses/30992/reviews", "values": [{"ratings": {"rDifficulty": "3.27", "rStimulateInterest": "3.17", "rCourseQuality": "3.00", "rWorkRequired": "3.58", "rInstructorQuality": "3.15", "rCommAbility": "3.08", "rInstructorAccess": "3.75"}, "section": {"name": "NEOLIBERALISM & THE CITY", "sectionnum": "401", "primary_alias": "SAST-504-401", "path": "/courses/30992/sections/401", "id": "30992-401", "aliases": ["SAST-504-401", "ANTH-503-401", "URBS-504-401"]}, "comments": "", "num_students": 21, "path": "/courses/30992/sections/401/reviews/4096-LISA-MITCHELL", "instructor": {"path": "/instructors/4096-LISA-MITCHELL", "first_name": "LISA", "last_name": "MITCHELL", "id": "4096-LISA-MITCHELL", "name": "LISA MITCHELL"}, "num_reviewers": 13, "id": "30992-401-4096-LISA-MITCHELL"}]}, "credits": null, "primary_alias": "SAST-504", "path": "/courses/30992", "sections": {"path": "/courses/30992/sections", "values": [{"name": "NEOLIBERALISM & THE CITY", "sectionnum": "401", "primary_alias": "SAST-504-401", "path": "/courses/30992/sections/401", "id": "30992-401", "aliases": ["SAST-504-401", "ANTH-503-401", "URBS-504-401"]}]}, "id": 30992, "aliases": ["SAST-504", "ANTH-503", "URBS-504"]}