{"coursehistories": {"path": "/coursehistories/3167"}, "description": "This course is designed to equip students with the concepts, techniques, and latest thinking on pricing issues, with an emphasis on ways in which to help a firm improve its pricing. The orientation of the course is about practice of pricing, not theory. We will focus on how firms can improve profitability through pricing, look at how firms set their prices and how to improve current practices to increase profitability. The first part of the course focuses on how to analyze costs, customers, and competitors in order to formulate proactive pricing strategies. The second part focuses on price promotions, price bundling, price discrimination, versioning, nonlinear pricing, pricing through a distribution channel, dynamic pricing, etc. \n\n", "semester": "2010A", "name": "PRICING STRATEGIES", "reviews": {"path": "/courses/26419/reviews", "values": [{"ratings": {"rAmountLearned": "3.16", "rDifficulty": "1.79", "rStimulateInterest": "3.30", "rRecommendMajor": "3.75", "rCourseQuality": "3.28", "rWorkRequired": "1.82", "rInstructorAccess": "3.09", "rReadingsValue": "2.27", "rRecommendNonMajor": "3.30", "rCommAbility": "3.52", "rInstructorQuality": "3.49"}, "section": {"name": "PRICING STRATEGIES", "sectionnum": "001", "primary_alias": "MKTG-288-001", "path": "/courses/26419/sections/001", "id": "26419-001", "aliases": ["MKTG-288-001"]}, "comments": "This course is designed to equip students with the concepts, techniques, and latest thinking on pricing issues, with an emphasis on ways in which firms can improve their pricing. The orientation of the course is about the practice of pricing, rather than theory. The course focuses mainly on how firms can improve profitability through pricing, how they set prices, and how to improve current pricing practices. In the first part of the course, students learn how to analyze costs, customers, and competitors in order to formulate proactive pricing strategies. In the second part, students learn about price promotions, price bundling, price discrimination, versioning, nonlinear pricing, pricing through a distribution channel, and dynamic pricing, among other topics. \r\n\r\nStudents noted that this class had “very interesting course content, but it was hard to see how it would be relevant in the workplace.” One student also mentioned that it would have been “helpful to discuss the readings a bit more, or somehow motivate students to read them.” \r\n\r\nStudents praised the professor saying it is “rare to find professors as knowledgeable, friendly, and dedicated as Professor Zhang.” Another student expressed that Professor Zhang is “one of the most brilliant and funny people at this University.”\r\n", "num_students": 39, "path": "/courses/26419/sections/001/reviews/1614-Z--JOHN-ZHANG", "instructor": {"path": "/instructors/1614-Z--JOHN-ZHANG", "first_name": "Z. JOHN", "last_name": "ZHANG", "id": "1614-Z--JOHN-ZHANG", "name": "Z. JOHN ZHANG"}, "num_reviewers": 37, "id": "26419-001-1614-Z--JOHN-ZHANG"}]}, "credits": null, "primary_alias": "MKTG-288", "path": "/courses/26419", "sections": {"path": "/courses/26419/sections", "values": [{"name": "PRICING STRATEGIES", "sectionnum": "001", "primary_alias": "MKTG-288-001", "path": "/courses/26419/sections/001", "id": "26419-001", "aliases": ["MKTG-288-001"]}]}, "id": 26419, "aliases": ["MKTG-288"]}