[{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "2.00", "rStimulateInterest": "3.11", "rRecommendMajor": "3.50", "rCourseQuality": "3.15", "rWorkRequired": "2.17", "rInstructorAccess": "3.28", "rReadingsValue": "3.12", "rRecommendNonMajor": "3.00", "rCommAbility": "3.44", "rInstructorQuality": "3.55"}, "section": {"name": "SOC DETERMINANTS HLTH", "sectionnum": "401", "primary_alias": "HSOC-260-401", "path": "/courses/23251/sections/401", "id": "23251-401", "aliases": ["HSOC-260-401"]}, "comments": "This course focused on the striking social and historical patterning to so many of the health problems and diseases that account for the morbidity and mortality in our own and other societies. What accounts for these patterns? What can be done about them? Students sought answers to these questions by comparing theoretical and empiric investigations of health from different disciplines, levels of description (individuals, neighborhoods, populations), societies and historical periods. The goal of this course was to introduce students to the study of the multiple determinants of the health of individuals and societies. &#8232;&#8232;\r\n\r\nStudents enjoyed the “entertaining,” “informative,” and “very interesting” material of the course. The students also appreciated the usefulness of the information taught as “essential concepts needed in any public health career.”&#8232;&#8232;\r\n\r\nThe students all enjoyed Professor Aronowitz’s teaching “because he's very fair and always makes [students] think outside of the box.” Students described him as “passionate,” both about the subject matter and about teaching his students. Students also called him “stimulating,” “engaging,” and “awesome.”&#8232;&#8232;\r\n\r\nNon-majors and majors took this class, and both groups of students enjoyed it. One student recommended students just starting their major should take the class, “since a lot of the material gets covered more in-depth in later courses in the major.” Students enjoyed the “discussion oriented” aspect of the class, but would have liked more guidance on their final project, a research grant proposal. Students also felt that the course “lacked structure as we would jump from topic to topic in an almost incoherent fashion.” Students, though, appreciated the guest lecturers who came to speak to the class.\r\n", "num_students": 24, "path": "/courses/23251/sections/401/reviews/1872-ROBERT-A--ARONOWITZ", "instructor": {"path": "/instructors/1872-ROBERT-A--ARONOWITZ", "first_name": "ROBERT A.", "last_name": "ARONOWITZ", "id": "1872-ROBERT-A--ARONOWITZ", "name": "ROBERT A. ARONOWITZ"}, "num_reviewers": 21, "id": "23251-401-1872-ROBERT-A--ARONOWITZ"}]