[{"ratings": {"rAmountLearned": "2.87", "rDifficulty": "1.87", "rStimulateInterest": "3.24", "rRecommendMajor": "3.50", "rCourseQuality": "3.10", "rWorkRequired": "2.18", "rInstructorAccess": "3.29", "rReadingsValue": "2.16", "rRecommendNonMajor": "2.95", "rCommAbility": "3.35", "rInstructorQuality": "3.38"}, "section": {"name": "TECHNOLOGY & SOCIETY", "sectionnum": "401", "primary_alias": "STSC-003-401", "path": "/courses/16511/sections/401", "id": "16511-401", "aliases": ["STSC-003-401", "HSOC-003-401"]}, "comments": "&#8232;This course surveys the ways technology has shaped our societies and our relations with the natural world. It examines the origins and impacts of technical developments throughout human history and across the globe, paying attention to the aesthetic, religious and mythical dimensions of technological change as well as the circumstances in which innovations emerge and their effects on social order, the environment, and how humans understand themselves. &#8232;&#8232;\r\nWith “stimulating lectures and wonderful content,” this course received top reviews across the board. Students felt they learned a lot and appreciated the breadth of the course, such as its spanning of eastern as well as western history. However, a handful mentioned that too much of the course focused on ancient history; they would have liked to spend more time on the modern era and current ideas. &#8232;\r\n&#8232;Professor Tresch is an “amazing professor” and “sweet guy” whose enthusiasm keeps students engaged. He is “excited about the material he’s teaching, which is refreshing to see,” and he tries hard to make this large lecture as participatory as possible. &#8232;&#8232;\r\nStudents are graded on three quizzes, four written responses, a group project, and a final exam. ", "num_students": 73, "path": "/courses/16511/sections/401/reviews/4131-JOHN-TRESCH", "instructor": {"path": "/instructors/4131-JOHN-TRESCH", "first_name": "JOHN", "last_name": "TRESCH", "id": "4131-JOHN-TRESCH", "name": "JOHN TRESCH"}, "num_reviewers": 72, "id": "16511-401-4131-JOHN-TRESCH"}]