[{"ratings": {"rAmountLearned": "3.04", "rDifficulty": "2.46", "rStimulateInterest": "2.80", "rRecommendMajor": "3.58", "rCourseQuality": "3.11", "rWorkRequired": "2.80", "rInstructorAccess": "3.52", "rReadingsValue": "2.76", "rRecommendNonMajor": "2.61", "rCommAbility": "3.56", "rInstructorQuality": "3.22"}, "section": {"name": "ARCHAEOLOGY OF THE INCA", "sectionnum": "401", "primary_alias": "ANTH-254-401", "path": "/courses/21266/sections/401", "id": "21266-401", "aliases": ["ANTH-254-401", "LALS-254-401"]}, "comments": "This course looks at the archaeology of the Inca. The Inca created a vast and powerful South American empire in the high Andes Mountains that was finally conquered by Spain. Using Penn's impressive Museum collections and other archaeological, linguistic, and historical sources, this course will examine Inca religion and worldview, architecture, sacred temples, the capital of Cuzco, ritual calendar, ceque system, textiles, metalworking, economic policies and expansionist politics from the dual perspectives of Inca rulers and their subjects. The class’ task is to explain the rise, dominance, and fall of the Incas as a major South American civilization.&#8232;&#8232;&#8232;Students raved about this course, placing it amongst their favorite courses at Penn. As one student wrote: “The readings were valuable, the guest lectures were impressive, trips to the museum artifacts were great, and each lecture was clear and informational.” &#8232;&#8232;&#8232;Professor Erickson was noted as a “dedicated” and “knowledgeable” teacher who made an interesting topic even more interesting and understandable. One student recommended that he be nominated for an undergraduate education award due to his dedication to his students.&#8232;&#8232;&#8232;This course fulfills the History & Tradition sector requirement. It should be noted that this review was summarized from less than 8 student comments.", "num_students": 31, "path": "/courses/21266/sections/401/reviews/102-CLARK-LOWDEN-ERICKSON", "instructor": {"path": "/instructors/102-CLARK-LOWDEN-ERICKSON", "first_name": "CLARK LOWDEN", "last_name": "ERICKSON", "id": "102-CLARK-LOWDEN-ERICKSON", "name": "CLARK LOWDEN ERICKSON"}, "num_reviewers": 27, "id": "21266-401-102-CLARK-LOWDEN-ERICKSON"}]