[{"ratings": {"rAmountLearned": "2.41", "rDifficulty": "1.50", "rStimulateInterest": "2.89", "rRecommendMajor": "2.69", "rCourseQuality": "2.47", "rWorkRequired": "1.57", "rInstructorAccess": "2.66", "rReadingsValue": "2.21", "rRecommendNonMajor": "2.41", "rCommAbility": "2.93", "rInstructorQuality": "2.81"}, "section": {"name": "INTRO TO MUS LIFE-AMER", "sectionnum": "001", "primary_alias": "MUSC-140-001", "path": "/courses/16157/sections/001", "id": "16157-001", "aliases": ["MUSC-140-001"]}, "comments": "This course surveys American musical life from the colonial period to the present. Beginning with the music of Native Americans, the European legacy, and the African Diaspora, the first part of the course treats the social and political milieu that shaped America\\'s musical landscape. Working from this foundation, the course moves to 19th-century figures in musical composition, education, performance, and promotion. The establishment of a popular sphere, the development of concert music, and the subsequent cultural hierarchies that resulted from each realm form important threads of investigation. The course concludes with 20th-century topics, including the appearance of jazz, the trajectory of western art music in the United States, and the eventual dominance of American popular music. &#8232;\r\n\r\nThis class has been described as “relaxed.” Students felt it was disorganized, lacked structure and direction, that the syllabus was not followed, and that there was seldom work assigned. “The class was really just an opportunity to sit around and talk.” Though some students felt the class was applicable to their musical inclinations, some felt that they left the class without an understanding of American Musical History. &#8232;&#8232;\r\n\r\nStudents had mixed reviews about Professor Ramsey. Some felt that he often “became distracted by unrelated asides, personal anecdotes, or repeated in-class rehearsals” and that his lectures were “vague and unorganized.” Yet, other students noted that the professor’s lectures generated good discussion and applied the material to real life. Every student did note that Professor Ramsey was frequently absent from class, often without warning. &#8232;\r\n\r\nThis course fulfills the requirements of the Music Major and the Arts & Letters Sector. Prerequisite: Music 070. ", "num_students": 35, "path": "/courses/16157/sections/001/reviews/1900-GUTHRIE-P--RAMSEY", "instructor": {"path": "/instructors/1900-GUTHRIE-P--RAMSEY", "first_name": "GUTHRIE P.", "last_name": "RAMSEY", "id": "1900-GUTHRIE-P--RAMSEY", "name": "GUTHRIE P. RAMSEY"}, "num_reviewers": 33, "id": "16157-001-1900-GUTHRIE-P--RAMSEY"}]