{"coursehistories": {"path": "/coursehistories/5000"}, "description": "This course provides an interdisciplinary overview of the retailing industry. Primary focus will be on the customer facing activities of retailers, including assortment planning, private-label development and the management of in-store operations, and the back-door activities (forecasting and supply chain management) that support customer interaction. In addition, current issues facing retailers, such as customer relationship management, industry consolidation and supplier relations, will be explored. The course will also survey topics in finance, operations, information technology and real estate as they relate to retail. \n\nThe principal objectives of this course are to provide opportunities for undertaking an in-depth study of a marketing problem and to develop the students' skills in evaluating research and designing marketing strategies for a variety of management situations. Selected projects can touch on any aspect of marketing as long as this entails the elements of problem structuring, data collection, data analysis, and report preparation. The course entails a considerable amount of independent work. (Strict library-type research is not appropriate) Class sessions are used to monitor progress on the project and provide suggestions for the research design and data analysis. The last portion of the course often includes an oral presentation by each group to the rest of the class and project sponsors. Along with marketing, the projects integrate other elements of management such as finance, production, research and development, and human resources. \n\n", "semester": "2012C", "name": "RETAILING", "reviews": {"path": "/courses/29323/reviews", "values": [{"ratings": {"rAmountLearned": "1.07", "rDifficulty": "1.43", "rStimulateInterest": "0.79", "rRecommendMajor": "1.64", "rCourseQuality": "1.32", "rWorkRequired": "1.86", "rInstructorAccess": "1.92", "rReadingsValue": "1.50", "rRecommendNonMajor": "0.93", "rCommAbility": "1.21", "rInstructorQuality": "1.32"}, "section": {"name": "RETAILING", "sectionnum": "002", "primary_alias": "MKTG-793-002", "path": "/courses/29323/sections/002", "id": "29323-002", "aliases": ["MKTG-793-002"]}, "comments": "", "num_students": 37, "path": "/courses/29323/sections/002/reviews/5061-STEPHEN-J-HOCH", "instructor": {"path": "/instructors/5061-STEPHEN-J-HOCH", "first_name": "STEPHEN J", "last_name": "HOCH", "id": "5061-STEPHEN-J-HOCH", "name": "STEPHEN J HOCH"}, "num_reviewers": 19, "id": "29323-002-5061-STEPHEN-J-HOCH"}]}, "credits": null, "primary_alias": "MKTG-793", "path": "/courses/29323", "sections": {"path": "/courses/29323/sections", "values": [{"name": "RETAILING", "sectionnum": "002", "primary_alias": "MKTG-793-002", "path": "/courses/29323/sections/002", "id": "29323-002", "aliases": ["MKTG-793-002"]}]}, "id": 29323, "aliases": ["MKTG-793"]}