{"coursehistories": {"path": "/coursehistories/162"}, "description": "Many people experience the art of our time as bewildering, shocking, too ordinary (my kid could do that), too intellectual (elitist), or simply not as art. Yet what makes this art engaging is that it raises the question of what art is or can be, employs a range of new materials and technologies, and addresses previously excluded audiences. It invades non-art spaces, blurs the boundaries between text and image, document and performance, asks questions about institutional frames (the museum, gallery, and art journal), and generates new forms of criticism. Much of the \"canon\" of what counts as important is still in flux, especially for the last twenty years. And the stage is no longer centered only on the United States and Europe, but is becoming increasingly global. The course will introduce students to the major movements and artists of the post-war period, with emphasis on social and historical context, critical debates, new media, and the changing role of the spectator/participant. \n\n", "semester": "2010A", "name": "CONTEMP ART:1945-PRESENT", "reviews": {"path": "/courses/25633/reviews", "values": [{"ratings": {"rAmountLearned": "2.99", "rDifficulty": "2.55", "rStimulateInterest": "3.23", "rRecommendMajor": "3.52", "rCourseQuality": "3.13", "rWorkRequired": "2.55", "rInstructorAccess": "2.87", "rReadingsValue": "2.73", "rRecommendNonMajor": "3.00", "rCommAbility": "3.20", "rInstructorQuality": "3.31"}, "section": {"name": "CONTEMP ART:1945-PRESENT", "sectionnum": "401", "primary_alias": "ARTH-287-401", "path": "/courses/25633/sections/401", "id": "25633-401", "aliases": ["ARTH-287-401", "ARTH-687-401"]}, "comments": "This course discussed what art is or can be, given the range of new materials and technologies available in the twentieth century, as well as the effect of globalizing audiences and institutions. The course covered the major movements and artists of the early twentieth century, with emphasis on social and historical context, critical debates, new media, and the changing role of the spectator/participant. \r\n\r\nStudents enjoyed this course and thought the material was interesting and “relevant to the current art world.” Lectures were described as being “insightful and informative” and many felt they learned a lot from both assigned readings and class discussions. \r\n\r\nStudents praised Professor Shaw and many commented that she was a “dynamic lecturer” who was “truly passionate about the subject material.” The majority of students found Professor Shaw engaging and thought-provoking, and they appreciated her “inspiring ability” to discuss the works of art.\r\n\r\nMost students reported that the class can be demanding and does require a lot of reading, writing and memorization of art works. However, this class is highly recommended to both majors and non-majors.", "num_students": 88, "path": "/courses/25633/sections/401/reviews/2862-GWENDOLYN-D-SHAW", "instructor": {"path": "/instructors/2862-GWENDOLYN-D-SHAW", "first_name": "GWENDOLYN D", "last_name": "SHAW", "id": "2862-GWENDOLYN-D-SHAW", "name": "GWENDOLYN D SHAW"}, "num_reviewers": 79, "id": "25633-401-2862-GWENDOLYN-D-SHAW"}]}, "credits": null, "primary_alias": "ARTH-287", "path": "/courses/25633", "sections": {"path": "/courses/25633/sections", "values": [{"name": "CONTEMP ART:1945-PRESENT", "sectionnum": "401", "primary_alias": "ARTH-287-401", "path": "/courses/25633/sections/401", "id": "25633-401", "aliases": ["ARTH-287-401", "ARTH-687-401"]}]}, "id": 25633, "aliases": ["ARTH-287", "ARTH-687"]}