{"coursehistories": {"path": "/coursehistories/730"}, "description": "This course teaches the fundamental concepts underlying the dynamics of vibrations for single-degree of freedom, multi-degree and infinite-degree of freedom mechanical systems. The course will focus on Newton's Force Methods, Virtual-Work Methods, and Lagrange's Variation Methods for analyzing problems in vibrations. Students will learn how to analyze transient, steady state and forced motion of single and multi-degree of freedom linear and non-linear systems. The course teaches analytical solution techniques for linear systems and practical numerical and simulation methods for analysis and design of nonlinear systems. \n\n", "semester": "2010C", "name": "VIBRATION MECH SYSTEMS", "reviews": {"path": "/courses/23388/reviews", "values": [{"ratings": {"rAmountLearned": "2.64", "rDifficulty": "3.45", "rStimulateInterest": "2.16", "rRecommendMajor": "3.34", "rCourseQuality": "2.38", "rWorkRequired": "3.40", "rInstructorAccess": "3.42", "rReadingsValue": "2.90", "rRecommendNonMajor": "0.60", "rCommAbility": "2.80", "rInstructorQuality": "2.75"}, "section": {"name": "VIBRATION MECH SYSTEMS", "sectionnum": "001", "primary_alias": "MEAM-321-001", "path": "/courses/23388/sections/001", "id": "23388-001", "aliases": ["MEAM-321-001"]}, "comments": "This course teaches the fundamental concepts underlying the dynamics of vibrations for single-degree of freedom and multi-degree of freedom mechanical systems. It focuses on Newton's Force Methods, Virtual-Work Methods, and Lagrange's Variation Methods for analyzing problems in vibrations. Students learn how to analyze transient, steady state and forced motion of single and multi-degree of freedom linear and non-linear systems. The course teaches analytical solution techniques for linear systems and practical numerical and simulation methods for analysis and design of nonlinear systems. There is no required textbook; the material needed for this course is posted on Blackboard.\r\n\r\nStudents generally found the material to be very dull and the lectures to be boring. As one student remarked, “it was very math-based and had little to do with real-world application[s].” However, many found the course to be extremely useful in building “quantitative analytical problem solving skills” and helping them “see mechanical systems in a whole new sense.” Most students reported feeling a sense of accomplishment after completing the difficult problem sets and generally found the course to be very rewarding.\r\n\r\nWhile many admitted that he could not make a dry topic interesting, many students felt that Professor Carchidi was very “involved,” “accessible,” and “down to earth.” His class notes, which were posted on Blackboard, received varying critiques from the students. Most found them to be “extensive and extremely useful,” while others wished that they were more concise and easier to understand. Many found the professor’s lecture style to be “tedious and boring,” noting that it was “simply a stream of equations thrown at the class.”\r\n\r\nMany students felt that the problem sets were “challenging but fair” and that there was a wide array of office hours available to obtain help. One student reported that there was cheating on the homework, as there were a “very large number of students who rely … on other students tell[ing] them how to do the problem, or [who] just copy the answer.” \r\n\r\nThis course is generally taken by juniors. MATH 241 or ENM 251 and MEAM 211 are prerequisites.\r\n", "num_students": 62, "path": "/courses/23388/sections/001/reviews/774-MICHAEL-A--CARCHIDI", "instructor": {"path": "/instructors/774-MICHAEL-A--CARCHIDI", "first_name": "MICHAEL A.", "last_name": "CARCHIDI", "id": "774-MICHAEL-A--CARCHIDI", "name": "MICHAEL A. CARCHIDI"}, "num_reviewers": 56, "id": "23388-001-774-MICHAEL-A--CARCHIDI"}]}, "credits": null, "primary_alias": "MEAM-321", "path": "/courses/23388", "sections": {"path": "/courses/23388/sections", "values": [{"name": "VIBRATION MECH SYSTEMS", "sectionnum": "001", "primary_alias": "MEAM-321-001", "path": "/courses/23388/sections/001", "id": "23388-001", "aliases": ["MEAM-321-001"]}]}, "id": 23388, "aliases": ["MEAM-321"]}