[{"ratings": {"rAmountLearned": "2.70", "rDifficulty": "2.47", "rStimulateInterest": "1.99", "rRecommendMajor": "3.18", "rCourseQuality": "2.35", "rWorkRequired": "1.89", "rInstructorAccess": "2.20", "rReadingsValue": "1.88", "rRecommendNonMajor": "2.42", "rCommAbility": "2.27", "rInstructorQuality": "2.23"}, "section": {"name": "HEALTH CARE SYSTEMS", "sectionnum": "001", "primary_alias": "HCMG-101-001", "path": "/courses/17464/sections/001", "id": "17464-001", "aliases": ["HCMG-101-001"]}, "comments": "HCMG 101 introduces and examines the various components of the U.S. health care system. It will cover both private and public financing mechanisms, the forces of market competition and government regulation, and the impact of health policy on key stakeholders. While developing an understanding of the various parts of the U.S. health care system, students will also learn how to apply simple economic reasoning to examine health policy issues. \r\n\r\nOverall, students found the course content to be “inherently interesting” and reported learning a “a great deal about our Health Care system.” However, the course structure was criticized by many. In particular, some students felt there was “a general lack of direction and focus” in the class. Particularly in the second half of the course, students felt there was a lack of cohesion between the information presented by the many guest lecturers.\r\n\r\nWhile most students agreed that “Professor Polsky is very knowledgeable in healthcare,” they also thought that his lectures were “relatively boring,” and he “tended to rely on his slides.”\r\n\r\nWhile there was “not much work to be handed in,” students found both exams to be “challenging.” One student felt that they were “poorly designed” and “essentially tested random facts out of about 500 or more slides that needed to be studied per exam.” Students reported difficulty studying for the second exam in due to the number of guest speakers and “disconnect between professor and students.” \r\n", "num_students": 132, "path": "/courses/17464/sections/001/reviews/2994-DANIEL-E--POLSKY", "instructor": {"path": "/instructors/2994-DANIEL-E--POLSKY", "first_name": "DANIEL E.", "last_name": "POLSKY", "id": "2994-DANIEL-E--POLSKY", "name": "DANIEL E. POLSKY"}, "num_reviewers": 124, "id": "17464-001-2994-DANIEL-E--POLSKY"}]