{"coursehistories": {"path": "/coursehistories/1395"}, "description": "Brief review of High School calculus, applications of integrals, transcendental functions, methods of integration, infinite series, Taylor's theorem. Use of symbolic manipulation and graphics software in calculus. \n\n", "semester": "2011A", "name": "CALCULUS I", "reviews": {"path": "/courses/21988/reviews", "values": [{"ratings": {"rAmountLearned": "2.07", "rDifficulty": "3.37", "rStimulateInterest": "1.70", "rRecommendMajor": "2.96", "rCourseQuality": "1.91", "rWorkRequired": "3.24", "rInstructorAccess": "2.59", "rReadingsValue": "2.02", "rRecommendNonMajor": "1.13", "rCommAbility": "2.00", "rInstructorQuality": "2.18"}, "section": {"name": "CALCULUS I", "sectionnum": "001", "primary_alias": "MATH-104-001", "path": "/courses/21988/sections/001", "id": "21988-001", "aliases": ["MATH-104-001"]}, "comments": "Brief review of High School calculus, applications of integrals, transcendental functions, methods of integration, infinite series, Taylor's theorem. Use of symbolic manipulation and graphics software in calculus.\r\n\r\nSome students felt the course material was “challenging,” but most said they learned a lot. Some students felt the amount of material to be learned for each exam was “too expansive.”\r\n\r\nStudents felt that Professor Gressman “explained material very well” by speaking slowly and writing everything on the board. Students felt he was very helpful, and was “always willing to take questions.”\r\n\r\nStudents felt that the class was “fair,” and consisted of mandatory weekly quizzes which forced students to stay on top of material by doing the weekly homework assignments, which were not mandatory. A majority of the class was composed of underclassmen. This course counts as a Formal Reasoning course.\r\n\r\n*8 respondents\r\n", "num_students": 67, "path": "/courses/21988/sections/001/reviews/4410-PHILIP-T--GRESSMAN", "instructor": {"path": "/instructors/4410-PHILIP-T--GRESSMAN", "first_name": "PHILIP T.", "last_name": "GRESSMAN", "id": "4410-PHILIP-T--GRESSMAN", "name": "PHILIP T. GRESSMAN"}, "num_reviewers": 60, "id": "21988-001-4410-PHILIP-T--GRESSMAN"}, {"ratings": {"rAmountLearned": "2.48", "rDifficulty": "3.53", "rStimulateInterest": "2.49", "rRecommendMajor": "3.06", "rCourseQuality": "2.15", "rWorkRequired": "3.76", "rInstructorAccess": "2.94", "rReadingsValue": "2.14", "rRecommendNonMajor": "1.48", "rCommAbility": "2.65", "rInstructorQuality": "2.86"}, "section": {"name": "CALCULUS I", "sectionnum": "002", "primary_alias": "MATH-104-002", "path": "/courses/21988/sections/002", "id": "21988-002", "aliases": ["MATH-104-002"]}, "comments": "This course offers a brief review of high school calculus, applications of integrals, transcendental functions, methods of integration, infinite series, and Taylor's theorem. It is also an introduction to the use of symbolic manipulation and graphics software.\r\n\r\nMost students took this course to fulfill a requirement and found the subject matter itself very difficult or obscure, though Professor Harbater’s “charisma” and “enthusiasm” more than made up for this, according to the overwhelming majority of students.\r\n\r\nStudents virtually unanimously agreed that Professor Harbater was “outstanding,” “fantastic,” and “a wonderful teacher who instilled in us a deeper knowledge of the abstract, deductive reasoning on which mathematics depends.” Students found that his use of clickers was a “good addition to the course and helped gauge where one stood relative to the rest of the class.” Students also felt that Professor Harbater’s examples and teaching styles always helped with understanding the material and even occasionally provided some very interesting insights.\r\n\r\nThe majority of students felt that the course was “work-intensive” and some found the weekly problem sets to be “unnecessarily difficult” and “very long.” Students also said that they would only recommend this course to those who need to take it to fulfill a requirement, but within that set of people they would highly recommend Professor Harbater.\r\n", "num_students": 120, "path": "/courses/21988/sections/002/reviews/3362-DAVID-HARBATER", "instructor": {"path": "/instructors/3362-DAVID-HARBATER", "first_name": "DAVID", "last_name": "HARBATER", "id": "3362-DAVID-HARBATER", "name": "DAVID HARBATER"}, "num_reviewers": 103, "id": "21988-002-3362-DAVID-HARBATER"}, {"ratings": {"rAmountLearned": "1.92", "rDifficulty": "3.51", "rStimulateInterest": "1.39", "rRecommendMajor": "2.41", "rCourseQuality": "1.25", "rWorkRequired": "3.26", "rInstructorAccess": "2.57", "rReadingsValue": "1.89", "rRecommendNonMajor": "1.14", "rCommAbility": "1.08", "rInstructorQuality": "1.42"}, "section": {"name": "CALCULUS I", "sectionnum": "003", "primary_alias": "MATH-104-003", "path": "/courses/21988/sections/003", "id": "21988-003", "aliases": ["MATH-104-003"]}, "comments": "This course includes a brief review of High School calculus, applications of integrals, transcendental functions, methods of integration, infinite series, and Taylor's theorem. It will discuss the use of symbolic manipulation and graphics software in calculus.\r\n\r\nMath 104 was a “very interesting course” but “moved very quickly.” “There wasn't sufficient time for the ideas to settle.” \r\n\r\nProfessor Pop “is too smart to teach this class” and does not simplify the material enough for students. He “has issues expressing what he wants to teach and often does not follow the syllabus.” He “had a nice personality and seemed sweet,” but was “bland and difficult to follow” during lecture, especially given his poor handwriting. “He just kept writing and writing and was completely out of touch of the needs of the students.” One student did not like how Professor Pop calls on students randomly to answer questions.\r\n\r\nMany students had difficulty with the course. One student wrote that Math 104 “is one of the hardest classes I ever expect to take here at Penn” due to the difficult exams and harsh curve.\r\n", "num_students": 78, "path": "/courses/21988/sections/003/reviews/3666-FLORIAN-POP", "instructor": {"path": "/instructors/3666-FLORIAN-POP", "first_name": "FLORIAN", "last_name": "POP", "id": "3666-FLORIAN-POP", "name": "FLORIAN POP"}, "num_reviewers": 65, "id": "21988-003-3666-FLORIAN-POP"}, {"ratings": {"rAmountLearned": "0.90", "rDifficulty": "3.60", "rStimulateInterest": "0.39", "rRecommendMajor": "1.68", "rCourseQuality": "0.81", "rWorkRequired": "3.45", "rInstructorAccess": "1.03", "rReadingsValue": "1.00", "rRecommendNonMajor": "0.71", "rCommAbility": "0.43", "rInstructorQuality": "0.49"}, "section": {"name": "CALCULUS I", "sectionnum": "004", "primary_alias": "MATH-104-004", "path": "/courses/21988/sections/004", "id": "21988-004", "aliases": ["MATH-104-004"]}, "comments": "This class is a brief review of high school calculus, applications of integrals, transcendental functions, methods of integration, infinite series, and Taylor's theorem. Symbolic manipulation and graphics software in calculus are used.\r\n\r\nStudents overall did not think favorably of the course. Many students also thought the class only reiterated the textbook. \r\n\r\nStudents commented that Professor Zhu went through material \"way too fast\" without much explanation. Because of this, students were too overwhelmed to ask questions. When students did ask questions, she had trouble answering them satisfactorily. Students complained that the material was not taught at a basic level; instead, Zhu “jump[ed] right into examples” which were so difficult that students could not follow along. \r\n\r\nStudents had 3 quizzes a week during the last third of the semester and felt the exams were \"very difficult\" even if they had completed \"the majority of problems in the book\" when studying. Also, they were only given notification of the last midterm three weeks prior to the exam. This class is a requirement for Wharton.\r\n", "num_students": 46, "path": "/courses/21988/sections/004/reviews/5402-KEYA-ZHU", "instructor": {"path": "/instructors/5402-KEYA-ZHU", "first_name": "KEYA", "last_name": "ZHU", "id": "5402-KEYA-ZHU", "name": "KEYA ZHU"}, "num_reviewers": 38, "id": "21988-004-5402-KEYA-ZHU"}, {"ratings": {"rAmountLearned": "2.95", "rDifficulty": "2.89", "rStimulateInterest": "3.37", "rRecommendMajor": "3.11", "rCourseQuality": "2.95", "rWorkRequired": "2.79", "rInstructorAccess": "3.32", "rReadingsValue": "2.89", "rRecommendNonMajor": "2.32", "rCommAbility": "3.16", "rInstructorQuality": "3.25"}, "section": {"name": "CALCULUS I", "sectionnum": "601", "primary_alias": "MATH-104-601", "path": "/courses/21988/sections/601", "id": "21988-601", "aliases": ["MATH-104-601"]}, "comments": "Officially called Calculus I, Math 104 is a brief review of high school calculus, applications of integrals, transcendental functions, methods of integration, infinite series, and Taylor’s theorem. The course involves use of symbolic manipulation and graphics software. Math 104 expects that students have taken AB calculus or equivalent. Students who have not had AB Calculus or did poorly in AB Calculus should opt for Math 103 instead. \r\n\r\nOverall, students seemed to enjoy the course and felt they “got a lot out of it.” Though some described the class as a “struggle”, they felt the concepts learned are crucial for understanding calculus and its applications in other fields.\r\n\r\nProfessor Barr was acclaimed by all of his students. One student described Professor Barr as “one of the best at relating math to an understandable level.” Another student remarked, “he has an uncanny ability to relate to students and often intersperses jokes into the lesson in order to stimulate student interest.”\r\n\r\nThe majority of students taking the course were freshmen who have taken AB Calculus in high school. The class is quite difficult and requires consistent practice in order to fully master concepts. Calculus I is a pre-requisite to most science, engineering and business majors, and the course was highly recommended to both majors and non-majors.\r\n", "num_students": 24, "path": "/courses/21988/sections/601/reviews/739-AVI-BARR", "instructor": {"path": "/instructors/739-AVI-BARR", "first_name": "AVI", "last_name": "BARR", "id": "739-AVI-BARR", "name": "AVI BARR"}, "num_reviewers": 20, "id": "21988-601-739-AVI-BARR"}]}, "credits": null, "primary_alias": "MATH-104", "path": "/courses/21988", "sections": {"path": "/courses/21988/sections", "values": [{"name": "CALCULUS I", "sectionnum": "001", "primary_alias": "MATH-104-001", "path": "/courses/21988/sections/001", "id": "21988-001", "aliases": ["MATH-104-001"]}, {"name": "CALCULUS I", "sectionnum": "002", "primary_alias": "MATH-104-002", "path": "/courses/21988/sections/002", "id": "21988-002", "aliases": ["MATH-104-002"]}, {"name": "CALCULUS I", "sectionnum": "003", "primary_alias": "MATH-104-003", "path": "/courses/21988/sections/003", "id": "21988-003", "aliases": ["MATH-104-003"]}, {"name": "CALCULUS I", "sectionnum": "004", "primary_alias": "MATH-104-004", "path": "/courses/21988/sections/004", "id": "21988-004", "aliases": ["MATH-104-004"]}, {"name": "CALCULUS I", "sectionnum": "601", "primary_alias": "MATH-104-601", "path": "/courses/21988/sections/601", "id": "21988-601", "aliases": ["MATH-104-601"]}]}, "id": 21988, "aliases": ["MATH-104"]}