{"coursehistories": {"path": "/coursehistories/3057"}, "description": "This course will use basic microeconomic tools to understand how the law often, but not always, promotes economic efficiency. Among the areas to be discussed will be tort law, property law, intellectual property, antitrust regulation. The distinction between common law and legislative law will be drawn. \n\n", "semester": "2012A", "name": "LAW AND ECONOMICS", "reviews": {"path": "/courses/27271/reviews", "values": [{"ratings": {"rAmountLearned": "2.40", "rDifficulty": "2.81", "rStimulateInterest": "1.90", "rRecommendMajor": "2.76", "rCourseQuality": "1.87", "rWorkRequired": "2.86", "rInstructorAccess": "2.29", "rReadingsValue": "1.86", "rRecommendNonMajor": "1.43", "rCommAbility": "2.38", "rInstructorQuality": "2.29"}, "section": {"name": "LAW AND ECONOMICS", "sectionnum": "001", "primary_alias": "ECON-234-001", "path": "/courses/27271/sections/001", "id": "27271-001", "aliases": ["ECON-234-001"]}, "comments": "Prerequisite(s): ECON 101; MATH 104 and MATH 114 or MATH 115. Credit cannot be received for both ECON 036 and 234.  In addition, the LPS course, when offered, MAY NOT count for Economics Majors, unless you are officially registered as an LPS student. This course will use basic microeconomic tools to understand how the law often, but not always, promotes economic efficiency. Among the areas to be discussed will be tort law, property law, intellectual property, antitrust regulation.  The distinction between common law and legislative law will be drawn. \r\n\r\nMost students believe that while the course material was “relatively interesting,” the structure of the course was “slapdash” and “extremely disorganized.” Lectures relied too heavily on PowerPoints that weren’t very clear. Furthermore, the assignments and problems sets didn’t accurately represent the material learned in class. Students felt that the course could use some restructuring.\r\n\r\nWhile most students agreed that Professor Garcia-Jimeno was “nice” they almost remarked that it was “overwhelmingly obvious that this was the first course he taught.” His grading policies weren’t as clear as they should have been and many students called him “abrasive.” It was often said that he read directly off the slides and was “unwilling to help students.”\r\n\r\nStudents said that the material for this course was interesting, but could have been presented in a different manner. It was often stated that a lot of calculus was necessary to do the problem sets, and that wasn’t a prerequisite for the course. Students would not suggest this course for non Econ/PPE majors.", "num_students": 35, "path": "/courses/27271/sections/001/reviews/6084-CAMILO-GARCIA-JIMENO", "instructor": {"path": "/instructors/6084-CAMILO-GARCIA-JIMENO", "first_name": "CAMILO", "last_name": "GARCIA-JIMENO", "id": "6084-CAMILO-GARCIA-JIMENO", "name": "CAMILO GARCIA-JIMENO"}, "num_reviewers": 32, "id": "27271-001-6084-CAMILO-GARCIA-JIMENO"}]}, "credits": null, "primary_alias": "ECON-234", "path": "/courses/27271", "sections": {"path": "/courses/27271/sections", "values": [{"name": "LAW AND ECONOMICS", "sectionnum": "001", "primary_alias": "ECON-234-001", "path": "/courses/27271/sections/001", "id": "27271-001", "aliases": ["ECON-234-001"]}]}, "id": 27271, "aliases": ["ECON-234"]}