{"coursehistories": {"path": "/coursehistories/4905"}, "description": "An advanced course for students who have had very strong background in Chem- istry in High School (AP, IB, or equivalent). Advanced material from the general chemistry curriculum will be covered in the context topics selected from current research areas. A continuation of CHEM115, CHEM116 will focus on topics in biochemistry and biophysical chemistry relating to thermodynamics,equilibrium, kinetics, and electrochemistry. \n\n", "semester": "2012A", "name": "HONORS CHEMISTRY II", "reviews": {"path": "/courses/27096/reviews", "values": [{"ratings": {"rAmountLearned": "2.28", "rDifficulty": "3.39", "rStimulateInterest": "1.79", "rRecommendMajor": "2.59", "rCourseQuality": "1.81", "rWorkRequired": "2.90", "rInstructorAccess": "2.74", "rReadingsValue": "2.26", "rRecommendNonMajor": "0.82", "rCommAbility": "1.49", "rInstructorQuality": "1.83"}, "section": {"name": "HONORS CHEMISTRY II", "sectionnum": "001", "primary_alias": "CHEM-116-001", "path": "/courses/27096/sections/001", "id": "27096-001", "aliases": ["CHEM-116-001"]}, "comments": "An advanced course for students who have had very strong background in Chemistry in High School (AP, IB, or equivalent).  Advanced material from the general chemistry curriculum will be covered in the context topics selected from current research areas.  A continuation of CHEM115, CHEM116 will focus on topics in biochemistry and biophysical chemistry relating to thermodynamics, equilibrium, kinetics, and electrochemistry.\r\n\r\nOverall, students found this course to be difficult, but also interesting and a good course. The course was described as “a good challenge.” It was highly based in mathematics, emphasizing derivations and the understanding of chemical formulas.\r\n\t\r\n\tThe majority of students found Professor Subotnik to be struggling with communication at the beginning of the semester, but many found that this improved as the semester progressed. Many students praised Professor Subotnik for “always seeking feedback” about his teaching, saying that Professor Subotnik was “extremely open to listening” and “willing to clarify any confusion.” Students called Professor Subotnik “knowledgeable,” “enthusiastic,” and “sincere,” as well as helpful in office hours. However, many felt that he did not plan ahead enough and that he had trouble simplifying the material for the students.\r\n\r\nStudents found this course to be challenging and the exams to be very difficult, even “excessively rigorous.” The students recommended this class only to intended chemistry or biochemistry majors. The prerequisite for this course is Advanced High School Chemistry (AP or equivalent).", "num_students": 47, "path": "/courses/27096/sections/001/reviews/5595-JOSEPH-ELI-SUBOTNIK", "instructor": {"path": "/instructors/5595-JOSEPH-ELI-SUBOTNIK", "first_name": "JOSEPH ELI", "last_name": "SUBOTNIK", "id": "5595-JOSEPH-ELI-SUBOTNIK", "name": "JOSEPH ELI SUBOTNIK"}, "num_reviewers": 42, "id": "27096-001-5595-JOSEPH-ELI-SUBOTNIK"}]}, "credits": null, "primary_alias": "CHEM-116", "path": "/courses/27096", "sections": {"path": "/courses/27096/sections", "values": [{"name": "HONORS CHEMISTRY II", "sectionnum": "001", "primary_alias": "CHEM-116-001", "path": "/courses/27096/sections/001", "id": "27096-001", "aliases": ["CHEM-116-001"]}]}, "id": 27096, "aliases": ["CHEM-116"]}