{"coursehistories": {"path": "/coursehistories/4288"}, "description": "Illness,crime,and other instances of socical dysfunction do not happen in a vacuum, nor ar ethey distributed randomly throughout society. The field of social epidemiology examines the finluence of workplace, neighborhood,social relationships, and other nonbiological factors on health outcomes. This course gives students the skills to explore and assess complex health challenges that are seen in popular media and public discourse by examining such factors as healthcare access,social inequality,racism and discrimination,and trust and social captal. Using readings, videos and interactive discussions with a focus on emergent health issues, this course equips students to diagnose and interpret underlying reasons for poor health using social epidemiological tools,and to consider practical inverventions to address those fundamental causes of illness. \n\n", "semester": "2009A", "name": "SOCIAL EPIDEMIOLOGY", "reviews": {"path": "/courses/15928/reviews", "values": [{"ratings": {"rAmountLearned": "3.09", "rDifficulty": "2.23", "rStimulateInterest": "3.45", "rRecommendMajor": "3.50", "rCourseQuality": "3.23", "rWorkRequired": "2.82", "rInstructorAccess": "3.73", "rReadingsValue": "2.36", "rRecommendNonMajor": "2.55", "rCommAbility": "3.32", "rInstructorQuality": "3.52"}, "section": {"name": "SOCIAL EPIDEMIOLOGY", "sectionnum": "301", "primary_alias": "HSOC-232-301", "path": "/courses/15928/sections/301", "id": "15928-301", "aliases": ["HSOC-232-301"]}, "comments": "This course combines an in depth study of epidemiological theory with social thinking.\r\n“The course was structured differently than other courses at Penn and was more of a lab environment, which turned out to be a great experience,” said one student. Others appreciated the theory and practical skills presented and said that they learned a lot through creating and completely their own research project. However, some students did criticize the lack of organization and said that the class often felt “very ad hoc.” One summed up the difficulty by saying, “Professor Cannuscio believes in allowing students to decide how to structure their assignments and how to present them. This \\'openness\\' often conflicted with many students\\' desire for structure and guidelines, often creating confusion within us as to what the instructor was exactly asking of us to do.\r\n\r\nStudents raved about Professor Cannuscio who they described as “supportive” and “the most enthusiastic and genuinely caring professor.” She is lauded for her approachability and commitment.\r\nSome students though the workload seemed a bit heavy at first, but the syllabus was not strictly followed, providing more flexibility. Assignments are criticized for being a bit vague and disconnected from the class, and two assigned books were never discussed.", "num_students": 22, "path": "/courses/15928/sections/301/reviews/4378-CAROLYN-C--CANNUSCIO", "instructor": {"path": "/instructors/4378-CAROLYN-C--CANNUSCIO", "first_name": "CAROLYN C.", "last_name": "CANNUSCIO", "id": "4378-CAROLYN-C--CANNUSCIO", "name": "CAROLYN C. CANNUSCIO"}, "num_reviewers": 22, "id": "15928-301-4378-CAROLYN-C--CANNUSCIO"}]}, "credits": null, "primary_alias": "HSOC-232", "path": "/courses/15928", "sections": {"path": "/courses/15928/sections", "values": [{"name": "SOCIAL EPIDEMIOLOGY", "sectionnum": "301", "primary_alias": "HSOC-232-301", "path": "/courses/15928/sections/301", "id": "15928-301", "aliases": ["HSOC-232-301"]}]}, "id": 15928, "aliases": ["HSOC-232"]}