[{"ratings": {"rAmountLearned": "3.42", "rDifficulty": "3.00", "rStimulateInterest": "3.67", "rRecommendMajor": "3.76", "rCourseQuality": "3.54", "rWorkRequired": "2.58", "rInstructorAccess": "3.24", "rReadingsValue": "2.45", "rRecommendNonMajor": "2.75", "rCommAbility": "3.82", "rInstructorQuality": "3.83"}, "section": {"name": "VENT CAP & FNCE INNOVAT", "sectionnum": "001", "primary_alias": "FNCE-250-001", "path": "/courses/23094/sections/001", "id": "23094-001", "aliases": ["FNCE-250-001"]}, "comments": "Finance 250 studies the finance of technological innovation, with an emphasis on the valuation in the venture capital industry. The course looks at valuation methods such as the “venture capital method,” comparable analysis, discounted cash flow analysis, Monte Carlo simulation, contingent-claims analysis, decision trees, and real options. \r\n\r\nThis class allowed many students to come out with a true understanding on how Venture Capital works and whether it was the right track for students. Taught more conceptually and like a seminar, students commented that the course gave them a “good, in depth knowledge” of the Venture Capital Industry and the content was excellent. Some students wrote that it was the best class ever, and can apply it to the real world very easily. \r\n\r\nMany students believe Professor Wessels is a “funny, lively, and awesome” professor, who enhances the course by applying his experience to the content of the class. Furthermore, he is a good communicator and can make difficult concepts easy to understand. One student even believes he is the best finance lecturer in the finance department. \r\n\r\nFinance students commented that this course is a culmination and conclusion of the entire Wharton finance curriculum, thus is suggested for upper level finance concentration students, who are finishing their finance educations. Furthermore, the course syllabus states that the primary audience for this course is finance majors interested in careers in venture capital or in the R&D-intensive companies. Many students said while the workload is manageable, a lot of effort is needed. Furthermore, the tests are challenging and a student must be well prepared. \r\n", "num_students": 83, "path": "/courses/23094/sections/001/reviews/2764-DAVID-WESSELS", "instructor": {"path": "/instructors/2764-DAVID-WESSELS", "first_name": "DAVID", "last_name": "WESSELS", "id": "2764-DAVID-WESSELS", "name": "DAVID WESSELS"}, "num_reviewers": 81, "id": "23094-001-2764-DAVID-WESSELS"}]