[{"ratings": {"rAmountLearned": "3.40", "rDifficulty": "2.31", "rStimulateInterest": "2.92", "rRecommendMajor": "3.00", "rCourseQuality": "3.00", "rWorkRequired": "2.81", "rInstructorAccess": "3.48", "rReadingsValue": "3.23", "rRecommendNonMajor": "2.40", "rCommAbility": "2.96", "rInstructorQuality": "2.96"}, "section": {"name": "PROG LANG & TECH III", "sectionnum": "001", "primary_alias": "CIT-597-001", "path": "/courses/18462/sections/001", "id": "18462-001", "aliases": ["CIT-597-001"]}, "comments": "CIS 597 covers advanced Java programming and a variety of current and relevant topics in web technology such as HTML, CSS, JavaScript, Ruby, Rails, PHP, SQL, and AJAX. The course is composed of lectures, programming homework assignments, and quizzes. The class uses a textbook called Programming the World Wide Web, but several online resources are also available to students.\r\n\r\nStudents were very happy with the content of the course. Many described it as “very informative” and “excellent.” Almost everyone found the course very practical and useful in today’s web development environment. Some students expressed discontent with the multitude of quizzes, instead hoping for more programming assignments that taught them more.\r\n\r\nProfessor Matuszek was an excellent teacher. Students reported that he was very engaging and interesting, with one student calling him “gifted” and another finding him “awesome as usual.” Almost everyone found him extremely accessible and willing to discuss problems with the course. Many students found the grading in the class to be very slow, however, but some attributed it to the TA.\r\n\r\nThis course is designed for students with proficient experience in Java programming and is not intended for beginners. CIT 591 or an equivalent course is required to take the class. Students found the workload to be moderate, but not terribly challenging.", "num_students": 27, "path": "/courses/18462/sections/001/reviews/250-DAVID-LEE-MATUSZEK", "instructor": {"path": "/instructors/250-DAVID-LEE-MATUSZEK", "first_name": "DAVID LEE", "last_name": "MATUSZEK", "id": "250-DAVID-LEE-MATUSZEK", "name": "DAVID LEE MATUSZEK"}, "num_reviewers": 26, "id": "18462-001-250-DAVID-LEE-MATUSZEK"}]