{"coursehistories": {"path": "/coursehistories/4998"}, "description": "Which brands make you happy? Apple? Starbucks? The Daily Show? Google? What draws you into these brands? How do companies create compelling brand experiences? How could you cultivate a brand that makes consumers happy? well-loved brand? This course explores such questions with the goal of identifying the ingredients for building an inspired brand, where brand is defined as \"a sensibility \" - departing from traditional perspectives of brand. The course is created for students interested in building their own brands and/or immersing themselves in the enhancement of an existing brand, and it is comprised of lectures, cases, guest speakers, discussions, in and out of class exercises, all of which culminate in a brand audit group project that students will present in the final class session. Broadly, the course will be divided into four parts: 1) Understanding Brand, 2) Crafting Brand, 3) Measuring Brand, and 4) Managing Brand. The course will provide students with an appreciation of the role of branding and (taking a consumer-centric approach) will augment students' ability to think creatively and critically about the strategies and tactics involved in building, leveraging, defending, and sustaining inspired brands. \n\n", "semester": "2012A", "name": "STRATEGIC BRAND MGMT", "reviews": {"path": "/courses/27806/reviews", "values": [{"ratings": {"rAmountLearned": "2.69", "rDifficulty": "1.67", "rStimulateInterest": "3.27", "rRecommendMajor": "3.13", "rCourseQuality": "3.00", "rWorkRequired": "2.23", "rInstructorAccess": "3.18", "rReadingsValue": "2.45", "rRecommendNonMajor": "2.50", "rCommAbility": "3.27", "rInstructorQuality": "3.18"}, "section": {"name": "STRATEGIC BRAND MGMT", "sectionnum": "001", "primary_alias": "MKTG-778-001", "path": "/courses/27806/sections/001", "id": "27806-001", "aliases": ["MKTG-778-001"]}, "comments": "MKTG 778 explores brand questions with the goal of identifying the ingredients for building an inspired brand, where brand is defined as \"a sensibility\" - departing from traditional perspectives of brand. This class is created for students interested in building their own brands and/or immersing themselves in the enhancement of an existing brand, and it is comprised of lectures, cases, guest speakers, discussions, in and out of class exercises, all of which culminate in a brand audit group project that students will present in the final class session. Broadly, the course will be divided into four parts: 1) Understanding Brand, 2) Crafting Brand, 3) Measuring Brand, and 4) Managing Brand. The course will provide students with an appreciation of the role of branding and (taking a consumer-centric approach) will augment students' ability to think creatively and critically about the strategies and tactics involved in building, leveraging, defending, and sustaining inspired brands. The format of this class includes lectures, cases, discussions, exercises, and a group project\r\n\tMany students in this graduate level class felt that they were treated like undergraduates with weekly pop quizzes. Students also described the course material as introductory, wishing there was “a deeper dive into specific topics.” However, many students enjoyed the speakers and guest lecturers, commenting that they brought “a lot of value to the discussion.” Overall, most students enjoyed the class, portraying it as an interesting and enjoyable class.\r\n\tStudents felt that Professor Mogilner needed to adapt the class to be more interesting and challenging on the MBA level. While Professor Mogilner was illustrated as a “knowledgeable, enthusiastic, and friendly” teacher, many also felt that she was a young teacher who ran the course at an undergraduate level. Professors Mogilner’s weekly pop quizzes made students feel like they were “treated like undergrads with [her] absorption checking quizzes.”\r\n\tThe class was an elective geared towards MBA graduate marketing students. As a graduate class, many students felt that the course needed to be more in depth. There was a “fair amount of work for a second semester, qualitative marketing elective, but it was interesting and not too difficult.” Prerequisites include: MKTG 611 or 621 and MKTG 612, 613 or 622.\r\n", "num_students": 40, "path": "/courses/27806/sections/001/reviews/5434-CASSIE-MOGILNER", "instructor": {"path": "/instructors/5434-CASSIE-MOGILNER", "first_name": "CASSIE", "last_name": "MOGILNER", "id": "5434-CASSIE-MOGILNER", "name": "CASSIE MOGILNER"}, "num_reviewers": 35, "id": "27806-001-5434-CASSIE-MOGILNER"}]}, "credits": null, "primary_alias": "MKTG-778", "path": "/courses/27806", "sections": {"path": "/courses/27806/sections", "values": [{"name": "STRATEGIC BRAND MGMT", "sectionnum": "001", "primary_alias": "MKTG-778-001", "path": "/courses/27806/sections/001", "id": "27806-001", "aliases": ["MKTG-778-001"]}]}, "id": 27806, "aliases": ["MKTG-778"]}