{"coursehistories": {"path": "/coursehistories/1033"}, "description": "Sociology provides a unique way to look at human behavior and social interaction. Sociology is the systematic study of the groups and societies in which people live. In this introductory course, we analyze how social structures and cultures are created, maintained, and changed, and how they affect lives of individuals. In this course, we will reconsider our taken for granted world and examine what theory and research can tell us about our social world. \n\n", "semester": "2012A", "name": "INTRO TO SOCIOLOGY", "reviews": {"path": "/courses/28140/reviews", "values": [{"ratings": {"rAmountLearned": "2.23", "rDifficulty": "1.64", "rStimulateInterest": "2.05", "rRecommendMajor": "3.20", "rCourseQuality": "2.23", "rWorkRequired": "1.84", "rInstructorAccess": "2.54", "rReadingsValue": "2.09", "rRecommendNonMajor": "2.29", "rCommAbility": "2.69", "rInstructorQuality": "2.52"}, "section": {"name": "INTRO TO SOCIOLOGY", "sectionnum": "001", "primary_alias": "SOCI-001-001", "path": "/courses/28140/sections/001", "id": "28140-001", "aliases": ["SOCI-001-001"]}, "comments": "This class is an introduction to sociology and examines human behavior and social interactions. In the class, social structures are examined as well as the creation, maintenance and changes of culture and how they affect individuals. \r\nStudents felt that material in this class was very “interesting” and “eye opening.”  A few students even said that it made them “consider sociology as a potential major.”  However, students commented that the professor had taught the material for a different class (SOCI-002) making the recitations pointless. \r\nThe students felt that Professor Jacobs was an “awesome professor” and that he “is quite good at lecturing.”  However, students commented that the instructions of the papers “were unclear, especially for students who have never written sociology paper before.”\r\nThis class is an introductory class, taken mostly by underclassman.  This was also taken by some students looking to fill sector requirements.\r\n", "num_students": 144, "path": "/courses/28140/sections/001/reviews/1092-JERRY-A-JACOBS", "instructor": {"path": "/instructors/1092-JERRY-A-JACOBS", "first_name": "JERRY A", "last_name": "JACOBS", "id": "1092-JERRY-A-JACOBS", "name": "JERRY A JACOBS"}, "num_reviewers": 130, "id": "28140-001-1092-JERRY-A-JACOBS"}]}, "credits": null, "primary_alias": "SOCI-001", "path": "/courses/28140", "sections": {"path": "/courses/28140/sections", "values": [{"name": "INTRO TO SOCIOLOGY", "sectionnum": "001", "primary_alias": "SOCI-001-001", "path": "/courses/28140/sections/001", "id": "28140-001", "aliases": ["SOCI-001-001"]}]}, "id": 28140, "aliases": ["SOCI-001"]}