[{"ratings": {"rAmountLearned": "3.33", "rDifficulty": "3.39", "rStimulateInterest": "3.44", "rRecommendMajor": "3.61", "rCourseQuality": "3.39", "rWorkRequired": "3.83", "rInstructorAccess": "3.17", "rReadingsValue": "3.11", "rRecommendNonMajor": "2.28", "rCommAbility": "3.39", "rInstructorQuality": "3.28"}, "section": {"name": "THE AMERICAN PRESIDENCY", "sectionnum": "001", "primary_alias": "PSCI-237-001", "path": "/courses/28052/sections/001", "id": "28052-001", "aliases": ["PSCI-237-001"]}, "comments": "This course surveys the institutional development of the American presidency from the Constitutional convention through the current administration.  It examines the politics of presidential leadership, and how the executive branch functions.  An underlying theme of the course is the tensions between the presidency, leadership, and democracy.\r\n\r\nAlmost every student agreed that this course required “more work than any of their other classes at Penn” but that it was by far the “most enjoyable and most rewarding.” Students seemed to understand that they would be required to work hard before coming into the class, but definitely felt that this was “one of the best courses they’ve taken at Penn.” The required readings and papers take up a lot of time, but a majority of students said that the time spent was “almost always pleasant.”\r\n\r\nProfessor Gottschalk was said to “command attention” in her classroom. A vast majority of students felt that she “had very high expectations” but was very knowledgeable and accessible to her students. She “stimulated student interest” and “challenged previously held viewpoints.” Almost all of the reviews of Professor Gottschalk were resoundingly positive.\r\n\r\nAlthough this course requires a lot of work, many students felt it was worthwhile to take, even if you aren’t a Poli-sci major. Professor Gottschalk doesn’t allow electronics in her classroom and students felt that this policy helped the class interact with each other more.", "num_students": 28, "path": "/courses/28052/sections/001/reviews/1938-MARIE-GOTTSCHALK", "instructor": {"path": "/instructors/1938-MARIE-GOTTSCHALK", "first_name": "MARIE", "last_name": "GOTTSCHALK", "id": "1938-MARIE-GOTTSCHALK", "name": "MARIE GOTTSCHALK"}, "num_reviewers": 19, "id": "28052-001-1938-MARIE-GOTTSCHALK"}]