{"coursehistories": {"path": "/coursehistories/5121"}, "description": "This course provides an overview of the evolution, structure and current issues in the health care system. It examines the unique features of health care as a product, and the changing relationships between patients, physicians, hospitals, insurers, employers, communities, and government. The course examines three broad segments of the health care industry: payors, providers and suppliers. Within the payor segment, the course examines the sources and destinations of spending, managed care (HMOs, PPOs),employer based health insurance, technology assessment, payor strategy, and efforts to pay for the elderly, the poor & the medically indigent. Within the provider segment, the course examines the impact of cost containment and competition on hospitals and integrated delivery systems, long term care and disease management, and the important role of epedemiology in assessing population health needs and risks. Within the supplier segment, the course will examine developments in the biotechnology, pharmaceutical, medical devices, genomics and IT industries. NOTE: This is a required course for Wharton Graduate Health Care Management majors; it counts as an elective course for all other Wharton Graduate students. It is also open to Law School and Nursing School students with a joint Wharton Program. \n\nPlease note that during the Wharton Pre-term program, there are three additional sessions that serve as important background material for this course. The instructor presumes you know this material when the regular course begins. \n\n", "semester": "2010C", "name": "HEALTH SERVICES SYS", "reviews": {"path": "/courses/23179/reviews", "values": [{"ratings": {"rAmountLearned": "2.49", "rDifficulty": "2.41", "rStimulateInterest": "2.29", "rRecommendMajor": "3.08", "rCourseQuality": "2.51", "rWorkRequired": "2.51", "rInstructorAccess": "2.27", "rReadingsValue": "1.68", "rRecommendNonMajor": "2.12", "rCommAbility": "2.59", "rInstructorQuality": "2.38"}, "section": {"name": "HEALTH SERVICES SYS", "sectionnum": "001", "primary_alias": "HCMG-841-001", "path": "/courses/23179/sections/001", "id": "23179-001", "aliases": ["HCMG-841-001"]}, "comments": "", "num_students": 81, "path": "/courses/23179/sections/001/reviews/3378-LAWTON-R-BURNS", "instructor": {"path": "/instructors/3378-LAWTON-R-BURNS", "first_name": "LAWTON R", "last_name": "BURNS", "id": "3378-LAWTON-R-BURNS", "name": "LAWTON R BURNS"}, "num_reviewers": 55, "id": "23179-001-3378-LAWTON-R-BURNS"}]}, "credits": null, "primary_alias": "HCMG-841", "path": "/courses/23179", "sections": {"path": "/courses/23179/sections", "values": [{"name": "HEALTH SERVICES SYS", "sectionnum": "001", "primary_alias": "HCMG-841-001", "path": "/courses/23179/sections/001", "id": "23179-001", "aliases": ["HCMG-841-001"]}]}, "id": 23179, "aliases": ["HCMG-841"]}