[{"ratings": {"rAmountLearned": "2.51", "rDifficulty": "3.22", "rStimulateInterest": "1.91", "rRecommendMajor": "2.77", "rCourseQuality": "1.93", "rWorkRequired": "2.90", "rInstructorAccess": "2.43", "rReadingsValue": "2.28", "rRecommendNonMajor": "1.43", "rCommAbility": "1.75", "rInstructorQuality": "2.03"}, "section": {"name": "STRATEGIC REASONING", "sectionnum": "401", "primary_alias": "PPE-201-401", "path": "/courses/17938/sections/401", "id": "17938-401", "aliases": ["PPE-201-401", "ECON-013-401"]}, "comments": "This course is about strategically interdependent decisions. It will introduce and develop some basic ideas from game theory, using illustrations, applications, and cases drawn from business, economics, politics, sports, and even fiction and movies. Some interactive games will be played in class. There will be little formal theory, and the only prerequisites are some high-school algebra and ECON 001. However, general numeracy (facility interpreting and doing numerical graphs, tables, and arithmetic calculations) is very important. This course can be counted toward the Economics minor or as an Econ elective.\r\n\r\nMany students found that this course “has the potential to be interesting” because of the subject matter on “strategic reasoning skills applicable to life”. However, students reported that “this was not an easy class” and warned that both the course material and the difficulty of exams made PPE 201 challenging for those with only a light understanding of Economics. The math required was reported to be “extremely heavy”. Students hope that the material will be covered “at a more meticulous pace” if the course is to remain a requirement for PPE majors.\r\n\r\nWhile many students found Professor Dillenberger to be “enthusiastic about the subject material,” and “well-intentioned” others reported that he was often difficult to hear and understand. Questions could be addressed in office hours, where students said he was “very approachable”. Office hours are the students’ main source for assistance, as the course does not include recitations.\r\n\r\nGrading in this class was reported to be “extremely harsh”. Additionally, the difficulty level for the final exam was reported to be “exponentially more difficult than anything else in the class, and Professor Dillenberger failed to prepare the students to be in a position where they could do well”. The final was, however, curved to provide students with more acceptable grades. There were many complaints about coordination between the grader of the course and the professor for students felt that there was a “lack of communication”. Some students complained that the system of re-grading is not generous for the four problem sets that are required throughout the course of the semester. Although the class is required for the PPE major, students warn that “the course overall will significantly hurt our GPAs”.", "num_students": 122, "path": "/courses/17938/sections/401/reviews/4533-DAVID-DILLENBERGER", "instructor": {"path": "/instructors/4533-DAVID-DILLENBERGER", "first_name": "DAVID", "last_name": "DILLENBERGER", "id": "4533-DAVID-DILLENBERGER", "name": "DAVID DILLENBERGER"}, "num_reviewers": 103, "id": "17938-401-4533-DAVID-DILLENBERGER"}]