[{"ratings": {"rAmountLearned": "2.46", "rDifficulty": "1.35", "rStimulateInterest": "2.78", "rRecommendMajor": "3.00", "rCourseQuality": "2.37", "rWorkRequired": "1.24", "rInstructorAccess": "3.02", "rReadingsValue": "2.15", "rRecommendNonMajor": "1.76", "rCommAbility": "2.89", "rInstructorQuality": "2.72"}, "section": {"name": "THEORETICAL FOUNDATIONS OF HEALTH CARE ETHICS", "sectionnum": "001", "primary_alias": "NURS-330-001", "path": "/courses/23532/sections/001", "id": "23532-001", "aliases": ["NURS-330-001"]}, "comments": "The theoretical foundations of health care ethics including definitions of ethics, history of bioethics and nursing ethics, and the influence of religion, psychology of moral development and philosophy in the development of ethical theory. Nursing code of ethics, changing ideas in ethics, and discussion of the developing profession of nursing are included. Podcasts must be listened to prior to ech class for discussion.\r\n\r\nMost students felt that this class was extremely enjoyable and refreshing. One student described the course as “simply the best course of my semester!” Students generally appreciated studying a different case each week and thought that they learned quite a bit. Many students described this as a very interactive course; however, some students felt that using technology within the course was sometimes ineffective. The main complaint of the course was that three hours was a bit unnecessary because sometimes the course seemed to drag on.\r\n\r\nOverall, students had very positive comments regarding Professor Perlman. Students “appreciated the experience that Dr. Perlman brought to the course.” However, some believed that he did not “challenge” students sufficiently on the ethics issue and could sometimes be “repetitive.”\r\n\r\nThis course was recommended for both nursing and non-nursing students. It satisfies the Society & Social Structures Sector for Nursing Class of 2012 and Beyond.\r\n\r\n", "num_students": 58, "path": "/courses/23532/sections/001/reviews/3117-DAVID-PERLMAN", "instructor": {"path": "/instructors/3117-DAVID-PERLMAN", "first_name": "DAVID", "last_name": "PERLMAN", "id": "3117-DAVID-PERLMAN", "name": "DAVID PERLMAN"}, "num_reviewers": 54, "id": "23532-001-3117-DAVID-PERLMAN"}]