[{"ratings": {"rAmountLearned": "2.76", "rDifficulty": "3.07", "rStimulateInterest": "2.42", "rRecommendMajor": "3.51", "rCourseQuality": "2.63", "rWorkRequired": "2.71", "rInstructorAccess": "3.03", "rReadingsValue": "2.30", "rRecommendNonMajor": "1.63", "rCommAbility": "2.63", "rInstructorQuality": "2.72"}, "section": {"name": "MOLEC. BIOL. & GENETICS", "sectionnum": "401", "primary_alias": "BIOL-221-401", "path": "/courses/17029/sections/401", "id": "17029-401", "aliases": ["BIOL-221-401", "BIOL-527-401"]}, "comments": "This course surveys the discipline of molecular genetics. The two broad areas included are Molecular Biology (DNA replication, transcription, translation, regulation of gene expression in both prokaryotic and eukaryotic systems, and genomics) and Genetics (basic Mendelian & molecular genetics). Grades for the class are determined from four problem sets, three midterms, and a final exam.\r\n\r\nOverall, students described the course as “enjoyable.” However, some students complained that “the readings in the book don't always seem to correspond to the class and it's hard to make the link between the two.”\r\n\r\nStudents thought Professor Guild was “passionate,” “enthusiastic,” and very receptive to his students. One student described him as “fun, dedicated, extremely well-prepared, and effective in his teaching style.” He was easily accessible to students, as were the TAs for the class, which many found very helpful.\r\n\r\nA majority of the students thought the exams were easy, though a small minority found them to be “extremely difficult.” With class averages on tests ranging in the 80s, some students felt that the exams put too much weight on a student’s ability not to make careless mistakes. Overall, the common ground among students was that the class was generally well organized, with exams intended to help the students succeed.", "num_students": 127, "path": "/courses/17029/sections/401/reviews/1285-GREGORY-M-GUILD", "instructor": {"path": "/instructors/1285-GREGORY-M-GUILD", "first_name": "GREGORY M", "last_name": "GUILD", "id": "1285-GREGORY-M-GUILD", "name": "GREGORY M GUILD"}, "num_reviewers": 109, "id": "17029-401-1285-GREGORY-M-GUILD"}, {"ratings": {"rAmountLearned": "2.00", "rDifficulty": "2.91", "rStimulateInterest": "1.39", "rRecommendMajor": "2.00", "rCourseQuality": "1.75", "rWorkRequired": "2.83", "rInstructorAccess": "2.00", "rReadingsValue": "2.30", "rRecommendNonMajor": "1.00", "rCommAbility": "1.35", "rInstructorQuality": "1.52"}, "section": {"name": "MOLEC. BIOL. & GENETICS", "sectionnum": "601", "primary_alias": "BIOL-221-601", "path": "/courses/17029/sections/601", "id": "17029-601", "aliases": ["BIOL-221-601", "BIOL-527-601"]}, "comments": "This course surveys the discipline of molecular genetics. The two broad areas included are Molecular Biology (DNA replication, transcription, translation, regulation of gene expression in both prokaryotic and eukaryotic systems, and genomics) and Genetics (basic Mendelian & molecular genetics). Grades for the class were determined from three midterm exams and a final.\r\n\r\nStudents described this course as “difficult” and “challenging.” One recommended that students “don’t get behind or [they’ll] find [themselves] in a downward spiral.”\r\n\r\nAs for Professor Parisi, students noted that he “knows the material and is interested in it.” However, it was also mentioned that he was sometimes difficult to understand clearly and was “unorganized” in his lectures.\r\n\r\nAs for the exams, they were often “poorly written and not necessarily relevant to the major topics learned in class and the readings.” Another problem that students had with the exams was that they were “focused on rote memorization of the slides and not at all on the ability to understand or synthesize the material.” Overall, the course was difficult but interesting, especially “towards the end.”", "num_students": 47, "path": "/courses/17029/sections/601/reviews/3229-MICHAEL-PARISI", "instructor": {"path": "/instructors/3229-MICHAEL-PARISI", "first_name": "MICHAEL", "last_name": "PARISI", "id": "3229-MICHAEL-PARISI", "name": "MICHAEL PARISI"}, "num_reviewers": 26, "id": "17029-601-3229-MICHAEL-PARISI"}]