{"coursehistories": {"path": "/coursehistories/4478"}, "description": "Engineers and scientists create and lead great companies, hiring managers when and where needed to help execute their vision. Designed expressly for students having a keen interest in technological innovation, this course investigates the roles of inventors and founders in successful technology ventures. Through case studies and guest speakers, we introduce the knowledge and skills needed to recognize and seize a high-tech entrepreneurial opportunity - be it a product or service - and then successfully launch a startup or spin-off company. The course studies key areas of intellectual property, its protection and strategic value; opportunity analysis and concept testing; shaping technology driven inventions into customer-driven products; constructing defensible competitive strategies; acquiring resources in the form of capital, people and strategic partners; and the founder's leadership role in an emerging high-tech company. Throughout the course emphasis is placed on decisions faced by founders, and on the sequential risks and determinants of success in the early growth phase of a technology venture. The course is designed for, but not restricted to, students of engineering and applied science and assumes no prior business education. \n\n", "semester": "2011A", "name": "ENG ENTREPRENEURSHIP I", "reviews": {"path": "/courses/21544/reviews", "values": [{"ratings": {"rAmountLearned": "3.49", "rDifficulty": "2.85", "rStimulateInterest": "3.53", "rRecommendMajor": "3.54", "rCourseQuality": "3.40", "rWorkRequired": "3.56", "rInstructorAccess": "3.15", "rReadingsValue": "3.38", "rRecommendNonMajor": "3.41", "rCommAbility": "3.39", "rInstructorQuality": "3.40"}, "section": {"name": "ENG ENTREPRENEURSHIP I", "sectionnum": "001", "primary_alias": "EAS-545-001", "path": "/courses/21544/sections/001", "id": "21544-001", "aliases": ["EAS-545-001"]}, "comments": "", "num_students": 45, "path": "/courses/21544/sections/001/reviews/1595-JEFFREY-A--BABIN", "instructor": {"path": "/instructors/1595-JEFFREY-A--BABIN", "first_name": "JEFFREY A.", "last_name": "BABIN", "id": "1595-JEFFREY-A--BABIN", "name": "JEFFREY A. BABIN"}, "num_reviewers": 43, "id": "21544-001-1595-JEFFREY-A--BABIN"}, {"ratings": {"rAmountLearned": "3.70", "rDifficulty": "2.80", "rStimulateInterest": "3.69", "rRecommendMajor": "3.76", "rCourseQuality": "3.82", "rWorkRequired": "3.76", "rInstructorAccess": "3.57", "rReadingsValue": "3.67", "rRecommendNonMajor": "3.61", "rCommAbility": "3.83", "rInstructorQuality": "3.88"}, "section": {"name": "ENG ENTREPRENEURSHIP I", "sectionnum": "002", "primary_alias": "EAS-545-002", "path": "/courses/21544/sections/002", "id": "21544-002", "aliases": ["EAS-545-002"]}, "comments": "This course is designed expressly for students having a keen interest in technological innovation. This course investigates the roles of inventors and founders in successful technology ventures. Through case studies and guest speakers, the course introduces the knowledge and skills needed to recognize and seize a high-tech entrepreneurial opportunity - be it a product or service - and then successfully launch a startup or spin-off company. The course studies key areas of intellectual property, its protection and strategic value; opportunity analysis and concept testing; shaping technology driven inventions into customer-driven products; constructing defensible competitive strategies; acquiring resources in the form of capital, people and strategic partners; and the founder's leadership role in an emerging high-tech company. Throughout the course emphasis is placed on decisions faced by founders, and on the sequential risks and determinants of success in the early growth phase of a technology venture. The course is designed for, but not restricted to, students of engineering and applied science and assumes no prior business education.&#8232;&#8232;Overwhelmingly, students found the course to be “exceptional.” Some students even said that it was “one of the best courses at Penn.” Most students described the course as “well organized.” &#8232;&#8232;Almost all students complimented Professor Cassel on his teaching ability. He was not only “great,” but also “engaging, knowledgeable, and helpful both inside and outside of class.” He was able to “make all the course material interesting.” Students also said that the professor was “great at choosing guest lecturers.”&#8232;&#8232;While the class involved “a lot of work,” students generally felt that the workload was manageable and well worth it. Students who took the course came from “many different engineering backgrounds and [range] from [zero] to [an] extensive business background.” This course is recommended for both majors and non-majors.", "num_students": 49, "path": "/courses/21544/sections/002/reviews/317-THOMAS-A--CASSEL", "instructor": {"path": "/instructors/317-THOMAS-A--CASSEL", "first_name": "THOMAS A.", "last_name": "CASSEL", "id": "317-THOMAS-A--CASSEL", "name": "THOMAS A. CASSEL"}, "num_reviewers": 49, "id": "21544-002-317-THOMAS-A--CASSEL"}]}, "credits": null, "primary_alias": "EAS-545", "path": "/courses/21544", "sections": {"path": "/courses/21544/sections", "values": [{"name": "ENG ENTREPRENEURSHIP I", "sectionnum": "001", "primary_alias": "EAS-545-001", "path": "/courses/21544/sections/001", "id": "21544-001", "aliases": ["EAS-545-001"]}, {"name": "ENG ENTREPRENEURSHIP I", "sectionnum": "002", "primary_alias": "EAS-545-002", "path": "/courses/21544/sections/002", "id": "21544-002", "aliases": ["EAS-545-002"]}]}, "id": 21544, "aliases": ["EAS-545"]}