{"coursehistories": {"path": "/coursehistories/3980"}, "description": "Certain new technologies are greeted with claims that, for good or ill, they must transform our society. The two most recent: the computer and the Internet. But the series of social, economic, and technological developments that underlie what is often called the \"Information Revolution\" include much more than just the computer. In this course, we explore the history of informtion technology and its role in contemporary society. We will explore both the technologies themselves--from telephones to computers to video games--as well as their larger social, economic and political context. To understand the roots of these ideas we look at the pre-history of the comptuer, at the idea of the \"post industrial\" or \"information society,\" at parallels with earlier technolgies and at broad currents in the development of American society. \n\n", "semester": "2009C", "name": "THE INFORMATION AGE", "reviews": {"path": "/courses/18132/reviews", "values": [{"ratings": {"rAmountLearned": "2.59", "rDifficulty": "1.97", "rStimulateInterest": "2.98", "rRecommendMajor": "3.42", "rCourseQuality": "2.88", "rWorkRequired": "2.10", "rInstructorAccess": "2.99", "rReadingsValue": "2.33", "rRecommendNonMajor": "3.01", "rCommAbility": "3.33", "rInstructorQuality": "3.27"}, "section": {"name": "THE INFORMATION AGE", "sectionnum": "401", "primary_alias": "STSC-160-401", "path": "/courses/18132/sections/401", "id": "18132-401", "aliases": ["STSC-160-401", "SOCI-161-401"]}, "comments": "This course explores the history of information technology and its role in contemporary society. Studies will be focused on the technologies themselves—from telephones to computers to video games—as well as their larger social, economic, and political context. The pre-history of the computer, the idea of the \"post industrial\" or \"information' society,\" and parallels with earlier technologies and broad currents in the development of American society are also explored.&#8232;\r\nOverall, students said this was a “great” and “interesting” class.” One student reported that “each lecture was a joy to attend.” Students liked how the class focused on many topics that are “relevant to our lives.” However, some students felt that the large class size was not conducive to in-class participation, and wished it was a smaller class. &#8232;&#8232;\r\nStudents almost unanimously heaped praise on Professor Ensmenger, many calling him “entertaining” and “energetic.” One student commended “his willingness to work with his students and make them happy.” Several students called him their “favorite professor at Penn,” and noted his passion for both the subject and his students.\r\n&#8232;&#8232;Students reported that this course has “a lot of reading” that tended to be “overwhelming.” Several students were also concerned about the fairness of the final exam; students were given the option to take the final either in-class or at home, and some felt this was conducive to cheating. This course fulfills the General Requirement in the Humanities and Social Sciences.\r\n", "num_students": 229, "path": "/courses/18132/sections/401/reviews/664-NATHAN-ENSMENGER", "instructor": {"path": "/instructors/664-NATHAN-ENSMENGER", "first_name": "NATHAN", "last_name": "ENSMENGER", "id": "664-NATHAN-ENSMENGER", "name": "NATHAN ENSMENGER"}, "num_reviewers": 204, "id": "18132-401-664-NATHAN-ENSMENGER"}]}, "credits": null, "primary_alias": "STSC-160", "path": "/courses/18132", "sections": {"path": "/courses/18132/sections", "values": [{"name": "THE INFORMATION AGE", "sectionnum": "401", "primary_alias": "STSC-160-401", "path": "/courses/18132/sections/401", "id": "18132-401", "aliases": ["STSC-160-401", "SOCI-161-401"]}]}, "id": 18132, "aliases": ["STSC-160", "SOCI-161"]}