{"coursehistories": {"path": "/coursehistories/3850"}, "description": "Modern AI uses a collection of techniques from a number of fields in the design intelligent systems:probability, statistics, logic, operations research, optim and economics, to name a few. This course covers basic modeling and algorithms from these fields underlying current research and highlights their application computer vision, robotics, and natural language processing. \n\n", "semester": "2011A", "name": "FUNDAMENTALS OF AI", "reviews": {"path": "/courses/21465/reviews", "values": [{"ratings": {"rAmountLearned": "2.69", "rDifficulty": "2.63", "rStimulateInterest": "2.86", "rRecommendMajor": "3.00", "rCourseQuality": "2.72", "rWorkRequired": "2.69", "rInstructorAccess": "3.12", "rReadingsValue": "2.56", "rRecommendNonMajor": "1.94", "rCommAbility": "2.60", "rInstructorQuality": "2.92"}, "section": {"name": "FUNDAMENTALS OF AI", "sectionnum": "001", "primary_alias": "CIS-521-001", "path": "/courses/21465/sections/001", "id": "21465-001", "aliases": ["CIS-521-001"]}, "comments": "Modern AI uses a collection of techniques from a number of fields in the design intelligent systems: probability, statistics, logic, operations research, optimal controls, and economics, to name a few. This course covers basic modeling and algorithmic tools from these fields underlying current research and highlights their application computer vision, robotics, and natural language processing.&#8232;&#8232;Students all agreed that the course was very interesting, but felt that occasionally not enough examples were worked out in class or were worked through too quickly. &#8232;&#8232;Many students felt that Dr. Ungar was “good at communicating and making subject matter interesting” and extremely enthusiastic about the field of study. His lectures were given in a “thinking-encouraging and exciting way,” but some students felt that his love for the subject slowed him down a little in his lectures and resulted in a rushed last two weeks of class. &#8232;&#8232;It was agreed that this class was cumulative in the sense that if you missed one chapter, you were less likely to understand the next. Many students felt that workload was heavy and the textbook did not help much. The class was highly recommended to MEAM majors.", "num_students": 46, "path": "/courses/21465/sections/001/reviews/2085-LYLE-H-UNGAR", "instructor": {"path": "/instructors/2085-LYLE-H-UNGAR", "first_name": "LYLE H", "last_name": "UNGAR", "id": "2085-LYLE-H-UNGAR", "name": "LYLE H UNGAR"}, "num_reviewers": 37, "id": "21465-001-2085-LYLE-H-UNGAR"}]}, "credits": null, "primary_alias": "CIS-521", "path": "/courses/21465", "sections": {"path": "/courses/21465/sections", "values": [{"name": "FUNDAMENTALS OF AI", "sectionnum": "001", "primary_alias": "CIS-521-001", "path": "/courses/21465/sections/001", "id": "21465-001", "aliases": ["CIS-521-001"]}]}, "id": 21465, "aliases": ["CIS-521"]}