{"coursehistories": {"path": "/coursehistories/927"}, "description": "This course is an introduction to the most prominent historical, cultural, institutional, and ideological features of Middle Eastern politics. Typical of the questions we shall address are why processes of modernization and economic change have not produced liberal democracies, why Islamic movements have gained enormous strength in some countries and not others, why conflicts in the region--between Israel and the Arabs, Iran and Iraq, or inside of Lebanon--have been so bitter and protracted; why the era of military coups was brought to an end but transitions to democracy have been difficult to achieve; why Arab unity has been so elusive and yet so insistent a theme; and why oil wealth in the Gulf, in the Arabian Peninsula, and in North Africa, has not produced industrialized or self-sustaining economic growth. \n\n", "semester": "2011A", "name": "POL IN COMTEMP MID EAST", "reviews": {"path": "/courses/22327/reviews", "values": [{"ratings": {"rAmountLearned": "3.23", "rDifficulty": "3.30", "rStimulateInterest": "3.10", "rRecommendMajor": "3.18", "rCourseQuality": "3.02", "rWorkRequired": "3.36", "rInstructorAccess": "3.00", "rReadingsValue": "3.00", "rRecommendNonMajor": "2.27", "rCommAbility": "2.80", "rInstructorQuality": "3.14"}, "section": {"name": "POL IN COMTEMP MID EAST", "sectionnum": "401", "primary_alias": "PSCI-211-401", "path": "/courses/22327/sections/401", "id": "22327-401", "aliases": ["PSCI-211-401", "JWST-211-401"]}, "comments": "This course is an introduction to the most prominent historical, cultural, institutional, and ideological features of Middle Eastern politics. Typical questions addressed are, amongst others, why processes of modernization and economic change have not produced liberal democracies and why Islamic movements have gained enormous strength in some countries and not others. &#8232;&#8232;Materials in class were learned through independent reading rather than lectures. Students are expected to read 200 pages of history independently while working on the research paper. &#8232;&#8232;&#8232;&#8232;Professor Lustick has high expectations for his students. Students gained a lot from this class and thought Professor Lustick is “excellent” and “enthusiastic”. Even though the readings are very extensive, students felt that they learned a lot from the readings though the Professor was sometimes unclear which readings corresponded to which lecture. &#8232;&#8232;&#8232;&#8232;Some students thought that the work-load was too extensive and the class seem to be geared toward upperclassmen with more experience.", "num_students": 64, "path": "/courses/22327/sections/401/reviews/1679-IAN-STEVEN-LUSTICK", "instructor": {"path": "/instructors/1679-IAN-STEVEN-LUSTICK", "first_name": "IAN STEVEN", "last_name": "LUSTICK", "id": "1679-IAN-STEVEN-LUSTICK", "name": "IAN STEVEN LUSTICK"}, "num_reviewers": 57, "id": "22327-401-1679-IAN-STEVEN-LUSTICK"}]}, "credits": null, "primary_alias": "PSCI-211", "path": "/courses/22327", "sections": {"path": "/courses/22327/sections", "values": [{"name": "POL IN COMTEMP MID EAST", "sectionnum": "401", "primary_alias": "PSCI-211-401", "path": "/courses/22327/sections/401", "id": "22327-401", "aliases": ["PSCI-211-401", "JWST-211-401"]}]}, "id": 22327, "aliases": ["PSCI-211", "JWST-211"]}