[{"ratings": {"rAmountLearned": "3.08", "rDifficulty": "2.54", "rStimulateInterest": "2.67", "rRecommendMajor": "3.62", "rCourseQuality": "2.91", "rWorkRequired": "2.98", "rInstructorAccess": "2.85", "rReadingsValue": "3.08", "rRecommendNonMajor": "2.48", "rCommAbility": "3.03", "rInstructorQuality": "3.09"}, "section": {"name": "COMPARATIVE MEDICINE", "sectionnum": "401", "primary_alias": "HSOC-145-401", "path": "/courses/17538/sections/401", "id": "17538-401", "aliases": ["HSOC-145-401", "HIST-146-401"]}, "comments": "This course explores the medical consequences of the interaction between Europe and the “non-West” It focuses on three parts of the world Europeans colonized: Africa, South Asia, and Latin America. What was the history of therapeutic practices that originated in Africa or South Asia? How did European medical practices change in the colonies? How did practitioners of “non-Western” medicine carve out places for themselves? How do today’s medical problems grow out of this history? This is a fascinating history of race and gender, of pathogens and conquerors, of science and the body. It tells about the historical and regional roots of today’s problems in international medicine.&#8232;&#8232;\r\n\r\nOverall, students gave Professor Feierman’s course very positive feedback, appreciating especially the wealth of knowledge Professor Feierman provided. One student stated that the course “touched on a huge amount of issues.” Another student called it “one of my favorite courses I’ve taken in 6 semesters at Penn.” However, while students found the readings incredibly relevant and applicable, they also said that the workload could have probably been trimmed down.&#8232;&#8232;\r\n\r\nOnce again, students greatly appreciated the great deal of knowledge Professor Feierman presented to the class based upon his own experiences. Despite this, students also acknowledged that because of all of the information pertaining to the subject matter, sometimes lectures were too long for the course time allocated each session. Several students also made specific note to thank the TA’s, who were “incredibly valuable.”&#8232;&#8232;\r\n\r\nThe one consistent complaint students had about this course was the amount of required readings that were critical to doing well in the class. Students stated they felt “rushed to finish all readings,” and that some were “too long and repetitive,” despite the general interest they rendered. \r\n", "num_students": 75, "path": "/courses/17538/sections/401/reviews/666-STEVEN-FEIERMAN", "instructor": {"path": "/instructors/666-STEVEN-FEIERMAN", "first_name": "STEVEN", "last_name": "FEIERMAN", "id": "666-STEVEN-FEIERMAN", "name": "STEVEN FEIERMAN"}, "num_reviewers": 68, "id": "17538-401-666-STEVEN-FEIERMAN"}]