{"coursehistories": {"path": "/coursehistories/4075"}, "description": "This course is aimed at providing current and future product design/development engineers, manufacturing engineers, and product development managers with an applied understanding of Design for Manufacturability (DFM) concepts and methods. The course content includes materials from multiple disciplines including: engineering design, manufacturing, marketing, finance, project management, and quality systems. \n\n", "semester": "2010A", "name": "DESIGN FOR MANUF", "reviews": {"path": "/courses/26363/reviews", "values": [{"ratings": {"rAmountLearned": "2.92", "rDifficulty": "2.85", "rStimulateInterest": "2.23", "rRecommendMajor": "2.96", "rCourseQuality": "2.46", "rWorkRequired": "3.54", "rInstructorAccess": "2.76", "rReadingsValue": "2.69", "rRecommendNonMajor": "1.88", "rCommAbility": "2.65", "rInstructorQuality": "2.64"}, "section": {"name": "DESIGN FOR MANUF", "sectionnum": "401", "primary_alias": "MEAM-514-401", "path": "/courses/26363/sections/401", "id": "26363-401", "aliases": ["MEAM-514-401", "IPD-514-401"]}, "comments": "This course is aimed at providing current and future product design/development engineers, manufacturing engineers, and product development managers with an applied understanding of Design for Manufacturability (DFM) concepts and methods. The course content includes materials from multiple disciplines including engineering design, manufacturing, marketing, finance, project management, and quality systems.\r\n\r\nOverall, many students thought that this was a “great course” and that they “enjoyed this class very much.” Many students also commented that the course provided a “good run through of the Design for Manufacturability process.” Students reported learning a lot from this class. Many lamented however, that the “readings were useless” as some were from “guidebooks and manuals which were impossibly mundane to read.”\r\n\r\nProfessor Yim was generally well liked by the class, although students had difficulty with his lack of preparation for class and his “very monotonous” teaching style with “no stimulation of student interest.”\r\n\r\nStudents generally agreed that “the sheer amount of information and work [required] was quite difficult to handle.” Some students attributed this to the extreme overlap with the course lectures. Many students had a difficult time with the length and timing of the course. Students also agreed that the grading scheme was extremely challenging and the course would have been much more enjoyable had students not been worried about their grades.\r\n\r\nThis review is based on the 8 student comments which were submitted. ", "num_students": 31, "path": "/courses/26363/sections/401/reviews/3053-MARK-YIM", "instructor": {"path": "/instructors/3053-MARK-YIM", "first_name": "MARK", "last_name": "YIM", "id": "3053-MARK-YIM", "name": "MARK YIM"}, "num_reviewers": 28, "id": "26363-401-3053-MARK-YIM"}, {"ratings": {"rAmountLearned": "2.92", "rDifficulty": "2.85", "rStimulateInterest": "2.35", "rRecommendMajor": "2.96", "rCourseQuality": "2.46", "rWorkRequired": "3.54", "rInstructorAccess": "2.08", "rReadingsValue": "2.69", "rRecommendNonMajor": "1.88", "rCommAbility": "2.62", "rInstructorQuality": "2.64"}, "section": {"name": "DESIGN FOR MANUF", "sectionnum": "401", "primary_alias": "MEAM-514-401", "path": "/courses/26363/sections/401", "id": "26363-401", "aliases": ["MEAM-514-401", "IPD-514-401"]}, "comments": "This course is aimed at providing current and future product design/development engineers, manufacturing engineers, and product development managers with an applied understanding of Design for Manufacturability (DFM) concepts and methods. The course content includes materials from multiple disciplines including: engineering design, manufacturing, marketing, finance, project management, and quality systems.\r\n\r\nMost students complained about the course schedule, and would have preferred “two one-and-a-half hour classes instead of a single three hour class.” In addition, many students felt that the material was “very dry” and that there were some guidebooks and manuals which were “impossibly mundane to read.” In general, although students felt like they “learned a lot,” the general feeling was that there was simply “too much information on the slides in class” to follow.\r\n\r\nSome students felt that the Professor was “unorganized” and “boring” at times. As well, sometimes it seemed as if the lecturer was just reading off the slides. He did, however, provide “some real world perspective on manufacturing and design problems that was really interesting to hear about.”\r\n\r\nOverall, many students felt that although there were a lot of readings assigned, they weren’t necessarily the most useful. The grading scale was also heavily dependant on the groups one was placed in, which made some students feel “worried about their grades because of their group.” This course was only recommended for Majors. ", "num_students": 31, "path": "/courses/26363/sections/401/reviews/4192-SHAWN-D--SARBACKER", "instructor": {"path": "/instructors/4192-SHAWN-D--SARBACKER", "first_name": "SHAWN D.", "last_name": "SARBACKER", "id": "4192-SHAWN-D--SARBACKER", "name": "SHAWN D. SARBACKER"}, "num_reviewers": 28, "id": "26363-401-4192-SHAWN-D--SARBACKER"}]}, "credits": null, "primary_alias": "MEAM-514", "path": "/courses/26363", "sections": {"path": "/courses/26363/sections", "values": [{"name": "DESIGN FOR MANUF", "sectionnum": "401", "primary_alias": "MEAM-514-401", "path": "/courses/26363/sections/401", "id": "26363-401", "aliases": ["MEAM-514-401", "IPD-514-401"]}]}, "id": 26363, "aliases": ["MEAM-514", "IPD-514"]}