{"coursehistories": {"path": "/coursehistories/4321"}, "description": "", "semester": "2012A", "name": "FORMATION & IMPLEMENT", "reviews": {"path": "/courses/27754/reviews", "values": [{"ratings": {"rAmountLearned": "2.92", "rDifficulty": "2.69", "rStimulateInterest": "3.38", "rRecommendMajor": "3.31", "rCourseQuality": "3.17", "rWorkRequired": "2.77", "rInstructorAccess": "3.31", "rReadingsValue": "3.08", "rRecommendNonMajor": "3.15", "rCommAbility": "3.23", "rInstructorQuality": "3.38"}, "section": {"name": "FORMATION & IMPLEMENT", "sectionnum": "001", "primary_alias": "MGMT-406-001", "path": "/courses/27754/sections/001", "id": "27754-001", "aliases": ["MGMT-406-001"]}, "comments": "This advanced course in entrepreneurship centers on writing a comprehensive business plan and implementation plan for a venture of the student’s choice. The course examines ways to profitably launch and exploit business opportunities (as opposed to what opportunity to explore). It will allow students to acquire the skill set necessary for crafting a winning business model for his/her venture — developing and writing a coherent and effective plan to start a business, in either an independent or a corporate setting. Prerequisites include MGMT 411, MKTG 411, FNCE 412; and ACCT 411 or ACCT 412. This class is no longer offered.\r\nStudents found this to be an “excellent course with extremely relevant and helpful articles/readings,” that “provide case studies of successes, failures, pitfalls and best practices.” Students found this course to be “critical towards the implementation of their future businesses.” The completion of an actual business plan made students feel “less of a barrier to research and able to pursue viable ventures into the future.” \r\nProfessor Gelburd was “engaging, energetic and genuinely passionate about the subject matter.” He “did a great job in stimulating student interest.” However, some students would have preferred more small group discussion and less lecture from Professor Gelburd.\r\nStudents found the quizzes to be “challenging” and required a “thorough reading” of the articles. \r\n", "num_students": 16, "path": "/courses/27754/sections/001/reviews/3064-LAWRENCE-GELBURD", "instructor": {"path": "/instructors/3064-LAWRENCE-GELBURD", "first_name": "LAWRENCE", "last_name": "GELBURD", "id": "3064-LAWRENCE-GELBURD", "name": "LAWRENCE GELBURD"}, "num_reviewers": 13, "id": "27754-001-3064-LAWRENCE-GELBURD"}]}, "credits": null, "primary_alias": "MGMT-406", "path": "/courses/27754", "sections": {"path": "/courses/27754/sections", "values": [{"name": "FORMATION & IMPLEMENT", "sectionnum": "001", "primary_alias": "MGMT-406-001", "path": "/courses/27754/sections/001", "id": "27754-001", "aliases": ["MGMT-406-001"]}]}, "id": 27754, "aliases": ["MGMT-406"]}