[{"ratings": {"rAmountLearned": "2.62", "rDifficulty": "2.77", "rStimulateInterest": "2.12", "rRecommendMajor": "3.11", "rCourseQuality": "2.51", "rWorkRequired": "2.98", "rInstructorAccess": "2.34", "rReadingsValue": "2.33", "rRecommendNonMajor": "1.71", "rCommAbility": "2.51", "rInstructorQuality": "2.51"}, "section": {"name": "PERSUASION & COMM", "sectionnum": "001", "primary_alias": "COMM-275-001", "path": "/courses/15537/sections/001", "id": "15537-001", "aliases": ["COMM-275-001"]}, "comments": "This course explores the theory, research and application of the persuasive effects of communication in social and mass contexts. The primary focus is on the effects of messages on attitudes, opinions, values, and behaviors. Applications of theories learned in the course include political, commercial, and public service advertising; propaganda; and communication campaigns (e.g. anti-smoking).&#8232;&#8232;\r\nThe students reported a “cohesive and engaging curriculum” that showed a “different way to view mass communication”. The course also “offered a strong theory base but also had assignments that used the theory in a practical way”. Students seemed to enjoy the link that the class had to current events, which were highlighted both before and during lectures. &#8232;&#8232;\r\nMost students liked Professor Cappella and his teaching style. “Dr. Cappella is a great professor. I enjoyed the class very much. He is very up to date in terms of technology, news, and material presented in class,” said one student. Other students reported that Professor Cappella is knowledgeable about the subject matter and has a good working relationship with the TAs in the course. Some students, however, felt that Professor Cappella sped through class slides, glossed over material, and was somewhat boring during lectures. In general, however, both the professor and the TAs were accessible throughout the semester, and they complemented each other and the lectures well.&#8232;&#8232;\r\nThe course consists of readings, exams, and a final “Public Service Announcement” project. The workload is significant, and the exams were reportedly difficult. The major PSA assignment had mostly positive reviews. One student describe it as “challenging but very helpful in terms of knowledge gained.” The project consists of two sections due at different times during the semester and was “very time consuming and overwhelming.”", "num_students": 73, "path": "/courses/15537/sections/001/reviews/289-JOSEPH-N--CAPPELLA", "instructor": {"path": "/instructors/289-JOSEPH-N--CAPPELLA", "first_name": "JOSEPH N.", "last_name": "CAPPELLA", "id": "289-JOSEPH-N--CAPPELLA", "name": "JOSEPH N. CAPPELLA"}, "num_reviewers": 72, "id": "15537-001-289-JOSEPH-N--CAPPELLA"}]