[{"ratings": {"rAmountLearned": "3.21", "rDifficulty": "3.19", "rStimulateInterest": "3.32", "rRecommendMajor": "3.61", "rCourseQuality": "3.24", "rWorkRequired": "3.41", "rInstructorAccess": "3.54", "rReadingsValue": "3.29", "rRecommendNonMajor": "1.75", "rCommAbility": "3.18", "rInstructorQuality": "3.41"}, "section": {"name": "PHYS BASED ANIMATION", "sectionnum": "001", "primary_alias": "CIS-563-001", "path": "/courses/21470/sections/001", "id": "21470-001", "aliases": ["CIS-563-001"]}, "comments": "This course introduces students to simulation techniques for animation of fluids and gases, rigid and deformable solids, cloth, explosions, fire, smoke, virtual characters, and other systems. To gain hands-on experience, students will implement basic simulators for several systems. The topics will include: Particle Systems, Mass spring systems, Deformable Solids & Fracture, Cloth, Explosions & Fire, Smoke, Fluids, Deformable active characters, Simulation and control of rigid bodies, Rigid body dynamics, Collision detection and handling, Simulation of articulated characters, Simulated characters in games. &#8232;&#8232;Students had rave reviews for both the course content and the instructor. They described the course material as “interesting,” “excellent,” and “fun.” As one student put it, “this class really made me love coding.” &#8232;&#8232;In addition, students had nothing but positive things to say about Professor Kider. He was described as “great” “knowledgeable” and “very personable.” Professor Kider “inspired students to produce good work” and “feel good about it.” &#8232;&#8232;Students described the assignments as “difficult,” but many reported appreciating their value and relevance. Although this is a graduate level class, it is open to undergraduate students as well.", "num_students": 35, "path": "/courses/21470/sections/001/reviews/5321-JOSEPH-THEODORE-KIDER", "instructor": {"path": "/instructors/5321-JOSEPH-THEODORE-KIDER", "first_name": "JOSEPH THEODORE", "last_name": "KIDER", "id": "5321-JOSEPH-THEODORE-KIDER", "name": "JOSEPH THEODORE KIDER"}, "num_reviewers": 29, "id": "21470-001-5321-JOSEPH-THEODORE-KIDER"}]