[{"ratings": {"rAmountLearned": "2.97", "rDifficulty": "2.88", "rStimulateInterest": "3.27", "rRecommendMajor": "3.48", "rCourseQuality": "3.22", "rWorkRequired": "3.00", "rInstructorAccess": "2.67", "rReadingsValue": "3.39", "rRecommendNonMajor": "2.84", "rCommAbility": "3.58", "rInstructorQuality": "3.59"}, "section": {"name": "STUDY OF A PERIOD: THE TWENTIETH CENTURY", "sectionnum": "401", "primary_alias": "ENGL-104-401", "path": "/courses/25919/sections/401", "id": "25919-401", "aliases": ["ENGL-104-401", "COML-104-401"]}, "comments": "This course is an introduction to literary study through a survey of works from a specific historical period. Some versions will begin with traditional stories or poems, including a sampling of works in translation. Others will focus exclusively on modern and contemporary American short fiction or poetry.\r\n\r\nMost students commented that this course was interesting and engaging. One student also mentioned that lecture was interesting and engaging. A couple of students also mentioned that they enjoyed the novels that were read in the course. One student also said that they learned a lot from this course.\r\n\r\nProfessor Conn received very favorable reviews from students, who thought that he was “amazing” and “phenomenal” and his lectures “engaging.” Students thought that Professor Conn’s “knowledge of the books, authors, and time periods was unparalleled” and that he “was an excellent teacher.”\r\nMany students were unhappy with the structure of the class, noting that “the scheduling of the papers and midterms made it difficult to do well in the class” because they were assigned too closely. In addition, students thought that the midterm and final included many questions about material that was never covered in class. Still, students thought that the readings were “fascinating” and enjoyed “getting to read some of the classics of Western literature.\" One student also felt that the grading was strict. Another mentioned that the paper was due two days before the exam. This course is designed or the General Requirement, and is ideal for student wishing to take an English course but not necessarily intending to major. This course fulfills the Arts and Letters Sector.", "num_students": 39, "path": "/courses/25919/sections/401/reviews/1409-PETER-CONN", "instructor": {"path": "/instructors/1409-PETER-CONN", "first_name": "PETER", "last_name": "CONN", "id": "1409-PETER-CONN", "name": "PETER CONN"}, "num_reviewers": 37, "id": "25919-401-1409-PETER-CONN"}, {"ratings": {"rAmountLearned": "2.75", "rDifficulty": "2.83", "rStimulateInterest": "2.83", "rRecommendMajor": "2.50", "rCourseQuality": "2.71", "rWorkRequired": "2.67", "rInstructorAccess": "3.67", "rReadingsValue": "3.25", "rRecommendNonMajor": "2.25", "rCommAbility": "3.08", "rInstructorQuality": "3.14"}, "section": {"name": "STUDY OF A PERIOD: ROMANTICISM", "sectionnum": "601", "primary_alias": "ENGL-104-601", "path": "/courses/25919/sections/601", "id": "25919-601", "aliases": ["ENGL-104-601", "COML-104-601"]}, "comments": "", "num_students": 17, "path": "/courses/25919/sections/601/reviews/2100-MYRA-LOTTO", "instructor": {"path": "/instructors/2100-MYRA-LOTTO", "first_name": "MYRA", "last_name": "LOTTO", "id": "2100-MYRA-LOTTO", "name": "MYRA LOTTO"}, "num_reviewers": 14, "id": "25919-601-2100-MYRA-LOTTO"}]