[{"ratings": {"rAmountLearned": "2.19", "rDifficulty": "1.81", "rStimulateInterest": "2.26", "rRecommendMajor": "2.95", "rCourseQuality": "2.32", "rWorkRequired": "1.74", "rInstructorAccess": "3.10", "rReadingsValue": "1.93", "rRecommendNonMajor": "2.12", "rCommAbility": "2.93", "rInstructorQuality": "2.81"}, "section": {"name": "BECOMING HUMAN", "sectionnum": "001", "primary_alias": "ANTH-122-001", "path": "/courses/26944/sections/001", "id": "26944-001", "aliases": ["ANTH-122-001"]}, "comments": "Human evolutionary studies is a composite product of the fieldwork of both Paleolithic archaeology and human paleontology (or what we refer to as \"stones and bones\").  This marriage of two subdisciplines of anthropology produces a unique set of data that is intellectually managed and driven by theories within anthropology as a whole and even beyond -- to fields such as biology, psychology, and primate ethology, as we try to understand the origins of language, culture, and our unique physical characteristics.  In this course, two archaeologists and one physical anthropologist will jointly discuss and debate the actual evidence of human evolution, describing what the actual evidence is and exploring how far can we take these interpretations.\r\n\r\nStudents described this as a rather “basic requirement-fulfilling course” that had a lot of material to cover. Although the subject matter could be considered “dry” at times, almost all of the students said that the course was made “interesting by the professor.” Mostly, the students agreed that the course content was manageable.\r\n\r\nProfessor Olszewski was the reason many students enjoyed this course. Her “eclectic” nature and “extreme enthusiasm” about the subject material made a potentially boring class very exciting. She was described as “extremely kind and approachable” and her grading policies to be “very fair.” Her “great attitude” made the course worthwhile. \r\n\r\nStudents agreed that anthropology majors would get more out of this course than non-majors, but that it was a good course to fulfill the Humanities and Natural Sciences sector. Students felt that they left the course with at least a basic understanding of prehistory and human evolution.", "num_students": 56, "path": "/courses/26944/sections/001/reviews/86-DEBORAH-IRENE-OLSZEWSKI", "instructor": {"path": "/instructors/86-DEBORAH-IRENE-OLSZEWSKI", "first_name": "DEBORAH IRENE", "last_name": "OLSZEWSKI", "id": "86-DEBORAH-IRENE-OLSZEWSKI", "name": "DEBORAH IRENE OLSZEWSKI"}, "num_reviewers": 53, "id": "26944-001-86-DEBORAH-IRENE-OLSZEWSKI"}]