[{"ratings": {"rAmountLearned": "2.13", "rDifficulty": "2.66", "rStimulateInterest": "1.61", "rRecommendMajor": "2.21", "rCourseQuality": "1.82", "rWorkRequired": "2.48", "rInstructorAccess": "2.82", "rReadingsValue": "2.20", "rRecommendNonMajor": "1.07", "rCommAbility": "1.55", "rInstructorQuality": "1.77"}, "section": {"name": "LAW AND ECONOMICS", "sectionnum": "001", "primary_alias": "ECON-234-001", "path": "/courses/20026/sections/001", "id": "20026-001", "aliases": ["ECON-234-001"]}, "comments": "This course covers the relationship of economic principles to law and the use of economic analysis to study legal problems. Topics included: property rights and intellectual property; analysis of antitrust and economic analysis of legal decision making.\r\n\r\nStudents in general felt that the class covered “too much game theory and not enough legal theory.” Many students complained of a lack of structure in the course, and often felt unsure of what was covered on exams. Students felt that the course suffered from “switching between a variety of readings” that, while “helpful and engaging”, often resulted in a haphazard covering of the material. Most students enjoyed the guest speakers brought in, and some did feel that it was a “great academic/intellectual course.”\r\n\r\nMost students felt that Professor Scachmurove was “passionate and engaged”, “tried very hard to connect with his students” and was “very willing to help”. However, many said that he was “difficult to understand” and was “unable to communicate with students”. Overall, most students agreed that Professor Scachmurove had “good intentions”, but his teaching style needed work, in the words of one student, “speak loudly and have enthusiasm, you have great things to say.”\r\n\r\nStudents felt that this course would really only be suitable for an economics major.", "num_students": 96, "path": "/courses/20026/sections/001/reviews/339-YOCHANAN-SHACHMUROVE", "instructor": {"path": "/instructors/339-YOCHANAN-SHACHMUROVE", "first_name": "YOCHANAN", "last_name": "SHACHMUROVE", "id": "339-YOCHANAN-SHACHMUROVE", "name": "YOCHANAN SHACHMUROVE"}, "num_reviewers": 56, "id": "20026-001-339-YOCHANAN-SHACHMUROVE"}]