{"coursehistories": {"path": "/coursehistories/3161"}, "description": "This is a junior level laboratory course. The course teaches the principles of design and measurement systems including basic electromechanical systems. It follows MEAM 302 and MEAM 321 including experiments in fluid mechanics, and vibration in the design of mechanical systems. \n\n", "semester": "2011C", "name": "LECTURE", "reviews": {"path": "/courses/24722/reviews", "values": [{"ratings": {"rAmountLearned": "2.18", "rDifficulty": "3.42", "rStimulateInterest": "1.78", "rRecommendMajor": "2.52", "rCourseQuality": "1.89", "rWorkRequired": "3.84", "rInstructorAccess": "2.18", "rReadingsValue": "1.45", "rRecommendNonMajor": "0.60", "rCommAbility": "1.84", "rInstructorQuality": "2.09"}, "section": {"name": "LECTURE", "sectionnum": "001", "primary_alias": "MEAM-347-001", "path": "/courses/24722/sections/001", "id": "24722-001", "aliases": ["MEAM-347-001"]}, "comments": "MEAM 347 is a junior level laboratory course that teaches the principles of\r\ndesign and measurement systems including basic electromechanical systems. It follows\r\nMEAM 302 and MEAM 321 including experiments in fluid mechanics, and vibration in\r\nthe design of mechanical systems.\r\nGenerally, students found the course to be time-consuming and poorly organized.\r\nMany complained that the unclear expectations and the disorganized lecture material.\r\nSome indicated “lectures crammed way too much information into way too little time”\r\nand that there was “a disconnection” between the corresponding classes and the labs.\r\nHowever, students still felt that this course was “interesting and informative” in that it\r\nmade them apply theoretical knowledge, though it was “too open-ended with little\r\nguidance.”\r\nProfessor Yim was described as a great instructor who covered many topics that\r\nwere “very useful to know.” Nevertheless, students generally found Professor Yim and\r\nhis TAs did not give clear announcements regarding the deadlines of the assignments.\r\nAlso, students hoped that Professor Yim could give more detailed help and feedbacks\r\nwith their labs.\r\nThe workload for this course was widely regarded as heavy. More than one\r\nstudent reported that they needed to spend more than 20 hours a week doing the\r\nassignments. Trying to adjust to the changing deadlines is one common problem\r\nindicated by the students. Given the large amounts of time required, this course is only\r\nrecommended for majors. The prerequisite is junior standing in engineering.", "num_students": 59, "path": "/courses/24722/sections/001/reviews/3053-MARK-YIM", "instructor": {"path": "/instructors/3053-MARK-YIM", "first_name": "MARK", "last_name": "YIM", "id": "3053-MARK-YIM", "name": "MARK YIM"}, "num_reviewers": 54, "id": "24722-001-3053-MARK-YIM"}, {"ratings": {"rAmountLearned": "2.18", "rDifficulty": "3.42", "rStimulateInterest": "2.52", "rRecommendMajor": "2.52", "rCourseQuality": "1.89", "rWorkRequired": "3.84", "rInstructorAccess": "2.88", "rReadingsValue": "1.45", "rRecommendNonMajor": "0.60", "rCommAbility": "2.20", "rInstructorQuality": "2.65"}, "section": {"name": "LECTURE", "sectionnum": "001", "primary_alias": "MEAM-347-001", "path": "/courses/24722/sections/001", "id": "24722-001", "aliases": ["MEAM-347-001"]}, "comments": "This is a junior level laboratory course. The course teaches the principles of\r\ndesign and measurement systems including basic electromechanical systems. It follows\r\nMEAM 302 and MEAM 321 including experiments in fluid mechanics, and vibration in\r\nthe design of mechanical systems.\r\nSome students thought that the class was “interesting and informative,” offering a\r\nchance to “apply what [they have] learned in theoretical classes.” However, almost\r\neveryone agreed that the course was “very disorganized,” which was not “very conducive\r\nto learning the concepts.” One student commented on the “overall shoddiness” of the\r\nmechanical design lab used for the class.\r\nStudents were critical of the professors’ approach to the course, which involved\r\nhaving the class “[guess] what the professor wants instead of [focusing] on the material\r\nitself.” Although several students wrote that this may have been intentional to encourage\r\n“independent problem [solving],” they felt that the professors did not provide an\r\ninstruction at all for the labs. One student surmised that this and other administrative\r\nproblems arose because “neither [professor] took full ownership of the class.”\r\nThis course was described as “stressful, unfulfilling, and not enjoyable.” At one\r\npoint, there were “three ongoing lab assignments” that overlapped, making it difficult to\r\nmeet with team members. Conversely, there was “nothing to do” on some weeks.\r\nDeadlines and assignment criteria were often changed at the last minute, encouraging\r\nstudents to leave things “until the last minute.” There were also daily quizzes, further\r\nadding to the extreme difficulty of the class.", "num_students": 59, "path": "/courses/24722/sections/001/reviews/3294-BRUCE-D--KOTHMANN", "instructor": {"path": "/instructors/3294-BRUCE-D--KOTHMANN", "first_name": "BRUCE D.", "last_name": "KOTHMANN", "id": "3294-BRUCE-D--KOTHMANN", "name": "BRUCE D. KOTHMANN"}, "num_reviewers": 54, "id": "24722-001-3294-BRUCE-D--KOTHMANN"}]}, "credits": null, "primary_alias": "MEAM-347", "path": "/courses/24722", "sections": {"path": "/courses/24722/sections", "values": [{"name": "LECTURE", "sectionnum": "001", "primary_alias": "MEAM-347-001", "path": "/courses/24722/sections/001", "id": "24722-001", "aliases": ["MEAM-347-001"]}]}, "id": 24722, "aliases": ["MEAM-347"]}