{"coursehistories": {"path": "/coursehistories/5091"}, "description": "This course is focused on cyber physical systems with emphasis on real-time issues. Cyber physical systems are integrations of computation and communication with physical processes. Embedded computers monitor and control physical processes in real-time. As these embedded computer transformed from word processors to global communications devices for information gathering and sharing, embedded computers will change from small self-contained systems to cyber-physical systems by sensing, \n\nThe course is to study principles, methods, and techniques for building high-assurance cyber-physical systems. Topics will include requirements capture and modeling, mental models, assurance cases, hazard analysis, real-time programming and communication, real-time scheduling and virtual machines, feedback control in computer systems, verification and validseries of projects that will implement safety-critical embedded systems (e.g., pacemaker, infusion pump). \n\n", "semester": "2010C", "name": "EMBEDDED SOFTWARE", "reviews": {"path": "/courses/22834/reviews", "values": [{"ratings": {"rAmountLearned": "2.04", "rDifficulty": "2.50", "rStimulateInterest": "1.77", "rRecommendMajor": "2.23", "rCourseQuality": "1.83", "rWorkRequired": "2.19", "rInstructorAccess": "2.35", "rReadingsValue": "2.23", "rRecommendNonMajor": "1.08", "rCommAbility": "1.96", "rInstructorQuality": "2.07"}, "section": {"name": "EMBEDDED SOFTWARE", "sectionnum": "401", "primary_alias": "CIS-441-401", "path": "/courses/22834/sections/401", "id": "22834-401", "aliases": ["CIS-441-401", "CIS-541-401"]}, "comments": "The goal of this course is to give students greater design and implementation experience in embedded software development and to teach them how to model, design, verify, and validate safety critical systems in a principled manner. Students learn the principles, methods, and techniques for building life-critical embedded systems, ranging from requirements and models to design, analysis, optimization, implementation, and validation. Topics include modeling and analysis methods and tools, real-time programming paradigms and languages, distributed real-time systems, global time, time-triggered communications, assurance case, software architecture, evidence-based certification, testing, verification, and validation. The course includes a series of projects that implements life-critical embedded systems (e.g. pacemaker, infusion pumps, closed-loop medical devices).\r\n\r\nStudents generally were very pleased with their experience in this class. They seemed to agree that the most “valuable” parts of the course were the assigned projects. Some students also expressed that the “scope of the course was appropriately broad.” According to most, the readings that Professor Lee assigned were clear and very useful. \r\n\r\nMany of the students that took this class felt that Professor Lee was often “unorganized.” They also felt that sometimes his lecture slides were “overly verbose” and unclear. However, most agreed that the Professor’s readings compensated for this confusion. \r\n\r\nOverall, students felt that the organization of this class was very different from that of other undergraduate courses. Only one exam was given, and students felt that it was difficult because they were forced to suddenly condense everything that they had learned throughout the semester.\r\n", "num_students": 32, "path": "/courses/22834/sections/401/reviews/1821-INSUP-LEE", "instructor": {"path": "/instructors/1821-INSUP-LEE", "first_name": "INSUP", "last_name": "LEE", "id": "1821-INSUP-LEE", "name": "INSUP LEE"}, "num_reviewers": 29, "id": "22834-401-1821-INSUP-LEE"}]}, "credits": null, "primary_alias": "CIS-441", "path": "/courses/22834", "sections": {"path": "/courses/22834/sections", "values": [{"name": "EMBEDDED SOFTWARE", "sectionnum": "401", "primary_alias": "CIS-441-401", "path": "/courses/22834/sections/401", "id": "22834-401", "aliases": ["CIS-441-401", "CIS-541-401"]}]}, "id": 22834, "aliases": ["CIS-441", "CIS-541"]}