[{"ratings": {"rAmountLearned": "2.64", "rDifficulty": "2.43", "rStimulateInterest": "2.50", "rRecommendMajor": "2.71", "rCourseQuality": "2.25", "rWorkRequired": "2.93", "rInstructorAccess": "3.36", "rReadingsValue": "2.43", "rRecommendNonMajor": "1.69", "rCommAbility": "3.14", "rInstructorQuality": "2.75"}, "section": {"name": "COMM & DEMOCRATIZATION:  Communication and Democratization", "sectionnum": "401", "primary_alias": "COMM-433-401", "path": "/courses/27218/sections/401", "id": "27218-401", "aliases": ["COMM-433-401", "PSCI-415-401"]}, "comments": "This course explores the role of communication in theories of political change and democratic development.  It addresses the questions: What are the major hypotheses about the relationship between communication and regime type?  How have our hypotheses about communication evolved over time in response to changes in prominent development theories, policy trends, technical developments, and empirical evidence? \r\n\r\nOverall, this course was described as being interesting and insightful to an extent. Students said the topics discussed in the course were “valuable and interesting overall but a little onerous.” Many students remarked that the final project was “annoying,” but that it was a “great learning curve.” Some also stated that the readings were very relevant to the topics they were studying in the class, but that they tended to become repetitive as the class developed. Overall, most of the students enjoyed the readings and the class discussions.\r\n\r\nThe majority of students in the class felt that Professor Moehler could do a better job of teaching in class. One student mentioned that she “was good one on one, especially in office hours.” However, some students stated that “in class she wasn’t very engaging,” and “needs to do a better job of facilitating discussion,” because they could often go off-topic, which would waste valuable class time. One student also mentioned that she was very micromanaging on the research paper.\r\n\r\nThe course is composed of a lot of reading and a final research paper. There are frequent class discussions meant to involve participation. One student mentioned that the course was “a fantastic introduction to the study of democracy within the purview of Comparative Politics.” This course is designed for Benjamin Franklin Scholars. There are no other prerequisites for this course.", "num_students": 16, "path": "/courses/27218/sections/401/reviews/5325-DEVRA-C--MOEHLER", "instructor": {"path": "/instructors/5325-DEVRA-C--MOEHLER", "first_name": "DEVRA C.", "last_name": "MOEHLER", "id": "5325-DEVRA-C--MOEHLER", "name": "DEVRA C. MOEHLER"}, "num_reviewers": 16, "id": "27218-401-5325-DEVRA-C--MOEHLER"}]