[{"ratings": {"rAmountLearned": "3.50", "rDifficulty": "2.19", "rStimulateInterest": "3.56", "rRecommendMajor": "3.81", "rCourseQuality": "3.63", "rWorkRequired": "2.94", "rInstructorAccess": "3.73", "rReadingsValue": "3.50", "rRecommendNonMajor": "3.31", "rCommAbility": "3.75", "rInstructorQuality": "3.75"}, "section": {"name": "INTL CRISIS DIPLOMACY", "sectionnum": "301", "primary_alias": "PSCI-498-301", "path": "/courses/28060/sections/301", "id": "28060-301", "aliases": ["PSCI-498-301"]}, "comments": "Consult department for detailed descriptions.  Recent topics include: Globalization; Race & Criminal Justice; Democracy & Markets in Post-Communist Europe.\r\n\r\nStudents mentioned that “the material was very interesting and thought provoking.” It was an “awesome class” and “genuinely enjoyable.” However, one student mentioned that the “use of computer simulations has not been productive.” Overall, the course received positive comments, and was described as “intellectually rewarding.”\r\n\r\nProfessor Narang received very positive comments. He was described as “an amazing professor” and he “really moved discussions and got the entire class critiquing, questioning, and defending the readings.” He was also “very knowledgeable” and “qualified.”\r\n\r\nThis course is described as having a very specific focus and one student expressed that “one possible concern in this class was that it was too easy for a 498 PSCI seminar.” There is a “journal club” component which involves two people leading class discussions. There are some readings that are assigned. There are no prerequisites for this course.", "num_students": 18, "path": "/courses/28060/sections/301/reviews/6168-NEIL-NARANG", "instructor": {"path": "/instructors/6168-NEIL-NARANG", "first_name": "NEIL", "last_name": "NARANG", "id": "6168-NEIL-NARANG", "name": "NEIL NARANG"}, "num_reviewers": 16, "id": "28060-301-6168-NEIL-NARANG"}]