[{"ratings": {"rAmountLearned": "3.43", "rDifficulty": "2.93", "rStimulateInterest": "3.50", "rRecommendMajor": "3.75", "rCourseQuality": "3.38", "rWorkRequired": "3.86", "rInstructorAccess": "3.54", "rReadingsValue": "3.11", "rRecommendNonMajor": "2.89", "rCommAbility": "3.57", "rInstructorQuality": "3.69"}, "section": {"name": "INTRO TO QUR'AN", "sectionnum": "401", "primary_alias": "NELC-130-401", "path": "/courses/16168/sections/401", "id": "16168-401", "aliases": ["NELC-130-401", "RELS-140-401"]}, "comments": "The goal of this course is to provide students with a general introduction to the holy scripture of the religion of Islam, the Qur\\'an. In particular, students will become familiar with various aspects of Qur\\'anic content and style, the significance of the Qur\\'an in Islamic tradition and religious practice, scholarly debates about the history of its text, and contemporary interpretations of it. Through close readings of a wide range of passages and short research assignments, students will gain first-hand knowledge of the Qur\\'an\\'s treatment of prophecy, law, the Biblical tradition, and many other topics.\r\nThis “enlightening” course is taught in an intellectual environment and provides “multiple perspectives when appropriate.” It is described by one student as the “best course I have ever taken.”&#8232;\r\nProfessor Lowry is praised for “stimulating critical thinking” and “facilitating interesting class discussions.” He is “able to accommodate an extremely diverse set of students” and “knows everything.”&#8232;&#8232;\r\nNo previous background in Islamic studies or Arabic language is required for this course. The course has a very heavy load of homework that is “lengthy” but effective for learning material. Lectures build on homework, so it is important to complete assignments. Feelings were mixed about the final paper which was a ten page book report.", "num_students": 34, "path": "/courses/16168/sections/401/reviews/2044-JOSEPH-E--LOWRY", "instructor": {"path": "/instructors/2044-JOSEPH-E--LOWRY", "first_name": "JOSEPH E.", "last_name": "LOWRY", "id": "2044-JOSEPH-E--LOWRY", "name": "JOSEPH E. LOWRY"}, "num_reviewers": 30, "id": "16168-401-2044-JOSEPH-E--LOWRY"}]