[{"ratings": {"rAmountLearned": "2.84", "rDifficulty": "2.39", "rStimulateInterest": "2.73", "rRecommendMajor": "3.54", "rCourseQuality": "2.71", "rWorkRequired": "2.04", "rInstructorAccess": "3.01", "rReadingsValue": "2.41", "rRecommendNonMajor": "2.73", "rCommAbility": "3.19", "rInstructorQuality": "2.97"}, "section": {"name": "SOCIAL PSYCHOLOGY", "sectionnum": "001", "primary_alias": "PSYC-170-001", "path": "/courses/16381/sections/001", "id": "16381-001", "aliases": ["PSYC-170-001"]}, "comments": "This class provides an overview of theories and research across the range of social behavior from intra-individual to the group level including the effects of culture, social environment, and groups on social interaction. &#8232;&#8232;\r\n\r\nStudents stated that they enjoyed this “stimulating” and “awesome” course. Some students complained of the superfluous readings, as one student was disappointed that “the textbook readings did not add anything outside &#8232;of the lecture”. However, the majority of students claimed that they had learned a considerable amount from the course and from Professor Goodwin’s “superb” lecture slides. &#8232;&#8232;\r\n\r\nStudents for the most part praised Professor Goodwin for his “interesting, engaging, and insightful” lectures. One student declared that “the room was always filled at 9AM”. Although some students critiqued the Professor for a lack of organization, the majority of students lauded the Professor for his lecture slides, for his accessibility and for his ability to “present the material in a clear, succinct, and very engaging manner”. &#8232;\r\n\r\n&#8232;Many of the students in this course stated that although the exams were “pretty hard,” they would recommend this course to all students, especially psychology majors. One student stated that “as a major, I would have wanted to have more research articles as readings”. A fellow psychology major said that “I would recommend the class for psychology majors looking for a low-workload class” that is “relatively amusing”. Many students stated that the textbook was “unnecessary and repetitive”. Overall, this course was highly recommended to both majors and non-majors. Prerequisite is PSYC 001.", "num_students": 173, "path": "/courses/16381/sections/001/reviews/4544-GEOFFREY-P--GOODWIN", "instructor": {"path": "/instructors/4544-GEOFFREY-P--GOODWIN", "first_name": "GEOFFREY P.", "last_name": "GOODWIN", "id": "4544-GEOFFREY-P--GOODWIN", "name": "GEOFFREY P. GOODWIN"}, "num_reviewers": 167, "id": "16381-001-4544-GEOFFREY-P--GOODWIN"}]