[{"ratings": {"rAmountLearned": "3.30", "rDifficulty": "3.16", "rStimulateInterest": "3.53", "rRecommendMajor": "3.65", "rCourseQuality": "3.42", "rWorkRequired": "3.74", "rInstructorAccess": "3.50", "rReadingsValue": "2.84", "rRecommendNonMajor": "2.42", "rCommAbility": "3.67", "rInstructorQuality": "3.61"}, "section": {"name": "WAR STRATEGY & POLITICS", "sectionnum": "001", "primary_alias": "PSCI-252-001", "path": "/courses/17963/sections/001", "id": "17963-001", "aliases": ["PSCI-252-001"]}, "comments": "The course evaluates the strategy and politics of warfare, focusing on the way actors plan military campaigns and the factors that are likely to lead to victory and defeat. The course readings center in particular on the factors driving changes in warfare and civil-military relations. Specifically, the course attempts to use theories of warfare drawn from political science to shed light on key battles, campaigns, and military outcomes. There is a good deal of reading for the course and the lectures will make a lot more sense if you keep up with the reading for each week. Readings include Clausewitz, Carl von, On War, Counterinsurgency Warfare: Theory and Practice, The First World War, The Second World War, and Eagle Against the Sun: The American War With Japan The Art of War\r\n\r\nMost students found this course to be “absolutely fascinating” and thought the lectures went by very quickly. They found that they learned a lot and gained a unique perspective on the subject matter.\r\n\r\nStudents really enjoyed having Professor Horowitz as their lecturer. One student said, “I am incredibly impressed, lecture after lecture by how much information Professor Horowitz is able to clearly communicate to us in so short a period [of time].” Another student claimed that Professor Horowitz was “both funny and engaging in the way he talked about the material.” Students found Professor Horowitz to be very accessible as well. \r\n\r\nThis course presumes that you have a general knowledge of modern European history, but there are no formal course prerequisites. Most students found the course to be very challenging and thought that the lectures were fast-paced. Students complained about the abundance of reading, which averaged 350 pages a week and sometimes peaked at 750 pages. However, students found the exam format to be fair and believed that it was helpful to have a list of IDs covered on the exams. \r\n", "num_students": 51, "path": "/courses/17963/sections/001/reviews/4083-MICHAEL-HOROWITZ", "instructor": {"path": "/instructors/4083-MICHAEL-HOROWITZ", "first_name": "MICHAEL", "last_name": "HOROWITZ", "id": "4083-MICHAEL-HOROWITZ", "name": "MICHAEL HOROWITZ"}, "num_reviewers": 43, "id": "17963-001-4083-MICHAEL-HOROWITZ"}]