[{"ratings": {"rAmountLearned": "2.34", "rDifficulty": "1.97", "rStimulateInterest": "2.61", "rRecommendMajor": "2.93", "rCourseQuality": "2.63", "rWorkRequired": "2.21", "rInstructorAccess": "2.90", "rReadingsValue": "2.34", "rRecommendNonMajor": "2.24", "rCommAbility": "2.48", "rInstructorQuality": "2.77"}, "section": {"name": "WORLD FILM HIST '45-PRES", "sectionnum": "601", "primary_alias": "CINE-102-601", "path": "/courses/25783/sections/601", "id": "25783-601", "aliases": ["CINE-102-601", "ENGL-092-601", "ARTH-109-601"]}, "comments": "Focusing on movies made after 1945, this course focused on the critical analysis of film from across the world. Precise attention was paid to formal and stylistic techniques in editing, mise-en-scene, and sound, as well as to the narrative, non-narrative, and generic organizations of film. Requirements included readings in film history and film analysis, an analytical essay, a research paper, a final exam, and active participation.\r\n\r\nStudents had mixed reviews for this course. Some thought it was “very interesting” and a “great introductory course.” However, several students had negative comments about the material. One student did not enjoy the movies selected and said they “take away from the class,” citing <Daisies> and <Shadows> as examples. Another student said the course reading was too reliant on prior knowledge. \r\n\r\nSeveral students said they were “disappointed” in Professor Gaffney’s lack of knowledge in some areas of course content. However, one student commented that he “really changed the way I watch movies.”\r\n\r\nNon-majors felt that the course “was a little too hard,” while one major said it was “too basic.” This review is based on the 7 student comments which were submitted. There are no prerequisites to this course, and it fulfills the Arts and Letters requirement.", "num_students": 36, "path": "/courses/25783/sections/601/reviews/2148-PETER-GAFFNEY", "instructor": {"path": "/instructors/2148-PETER-GAFFNEY", "first_name": "PETER", "last_name": "GAFFNEY", "id": "2148-PETER-GAFFNEY", "name": "PETER GAFFNEY"}, "num_reviewers": 32, "id": "25783-601-2148-PETER-GAFFNEY"}]