{"coursehistories": {"path": "/coursehistories/4004"}, "description": "Focusing on movies made after 1945, this course allows students to learn and to sharpen methods, terminologies, and tools needed for the critical analysis of film. Beginning with the cinematic revolution signaled by the Italian Neo-Realism (of Rossellini and De Sica), we will follow the evolution of postwar cinema through the French New Wave (of Godard, Resnais, and Varda), American movies of the 1950s and 1960s (including the New Hollywood cinema of Coppola and Scorsese), and the various other new wave movements of the 1960s, 1970s and 1980s (such as the New German Cinema). We will then selectively examine some of the most important films of the last two decades, including those of U.S. independent film movement and movies from Iran, China, and elsewhere in an expanding global cinema culture. There will be precise attention paid to formal and stylistic techniques in editing, mise-en-scene, and sound, as well as to the narrative, non-narrative, and generic organizations of film. \n\nAt the same time, those formal features will be closely linked to historical and cultural distinctions and changes, ranging from the Paramount Decision of 1948 to the digital convergences that are defining screen culture today. There are no perquisites. Requirements will include readings in film history and film analysis, an analytical essay, a research paper, a final exam, and active participation. Fulfills the Arts and Letters Sector (All Classes). \n\n", "semester": "2010A", "name": "WORLD FILM HIST '45-PRES", "reviews": {"path": "/courses/25783/reviews", "values": [{"ratings": {"rAmountLearned": "2.34", "rDifficulty": "1.97", "rStimulateInterest": "2.61", "rRecommendMajor": "2.93", "rCourseQuality": "2.63", "rWorkRequired": "2.21", "rInstructorAccess": "2.90", "rReadingsValue": "2.34", "rRecommendNonMajor": "2.24", "rCommAbility": "2.48", "rInstructorQuality": "2.77"}, "section": {"name": "WORLD FILM HIST '45-PRES", "sectionnum": "601", "primary_alias": "CINE-102-601", "path": "/courses/25783/sections/601", "id": "25783-601", "aliases": ["CINE-102-601", "ENGL-092-601", "ARTH-109-601"]}, "comments": "Focusing on movies made after 1945, this course focused on the critical analysis of film from across the world. Precise attention was paid to formal and stylistic techniques in editing, mise-en-scene, and sound, as well as to the narrative, non-narrative, and generic organizations of film. Requirements included readings in film history and film analysis, an analytical essay, a research paper, a final exam, and active participation.\r\n\r\nStudents had mixed reviews for this course. Some thought it was “very interesting” and a “great introductory course.” However, several students had negative comments about the material. One student did not enjoy the movies selected and said they “take away from the class,” citing <Daisies> and <Shadows> as examples. Another student said the course reading was too reliant on prior knowledge. \r\n\r\nSeveral students said they were “disappointed” in Professor Gaffney’s lack of knowledge in some areas of course content. However, one student commented that he “really changed the way I watch movies.”\r\n\r\nNon-majors felt that the course “was a little too hard,” while one major said it was “too basic.” This review is based on the 7 student comments which were submitted. There are no prerequisites to this course, and it fulfills the Arts and Letters requirement.", "num_students": 36, "path": "/courses/25783/sections/601/reviews/2148-PETER-GAFFNEY", "instructor": {"path": "/instructors/2148-PETER-GAFFNEY", "first_name": "PETER", "last_name": "GAFFNEY", "id": "2148-PETER-GAFFNEY", "name": "PETER GAFFNEY"}, "num_reviewers": 32, "id": "25783-601-2148-PETER-GAFFNEY"}]}, "credits": null, "primary_alias": "CINE-102", "path": "/courses/25783", "sections": {"path": "/courses/25783/sections", "values": [{"name": "WORLD FILM HIST '45-PRES", "sectionnum": "601", "primary_alias": "CINE-102-601", "path": "/courses/25783/sections/601", "id": "25783-601", "aliases": ["CINE-102-601", "ENGL-092-601", "ARTH-109-601"]}]}, "id": 25783, "aliases": ["CINE-102", "ENGL-092", "ARTH-109"]}