{"coursehistories": {"path": "/coursehistories/1591"}, "description": "This course draws on fictional, cinematic and mass-media representation of terrorism based on Russian as well as Western examples. We study how the magnitude of the political impact of terrorism relates to the historically changing means of production of its striking iconology. The course exposes students to major modes of imagining, narrating, showing, reenacting terrorism and forging its mystique. We examine the emergence of organized terrorism in nineteenth-century Russia as an original political-cultural phenomenon. We trace its rapid expansion and influence on the public life in the West, and on the Balkans. \n\nHistorical, political, and aesthetic approaches converge in a discussion of several case studies related to intellectual and spiritual movements such as nihilism, anarchism, populism, religious fundamentalism, and others. The public appearance of the terrorist activism and its major attributes are viewed as powerful intensifiers of its political effect: self-denial, ascetic aura, and stratagem of mystification, underground mentality, and martyrdom. The pedagogical goal of this course is to promote and cultivate critical view and analytical skills that will enable students to deal with different historical as well as cultural modes of (self-)representation of terrorism. Students are expected to learn and be able to deal with a large body of historical-factual and creative-interpreted information. \n\n", "semester": "2008B", "name": "MEDIA AND TERRORISM", "reviews": {"path": "/courses/19665/reviews", "values": [{"ratings": {"rAmountLearned": "2.69", "rDifficulty": "1.62", "rStimulateInterest": "2.69", "rRecommendMajor": "2.69", "rCourseQuality": "3.00", "rWorkRequired": "1.92", "rInstructorAccess": "2.85", "rReadingsValue": "2.31", "rRecommendNonMajor": "3.00", "rCommAbility": "3.00", "rInstructorQuality": "3.38"}, "section": {"name": "MEDIA AND TERRORISM", "sectionnum": "920", "primary_alias": "RUSS-434-920", "path": "/courses/19665/sections/920", "id": "19665-920", "aliases": ["RUSS-434-920"]}, "comments": "", "num_students": 13, "path": "/courses/19665/sections/920/reviews/1066-VLADISLAV-T--TODOROV", "instructor": {"path": "/instructors/1066-VLADISLAV-T--TODOROV", "first_name": "VLADISLAV T.", "last_name": "TODOROV", "id": "1066-VLADISLAV-T--TODOROV", "name": "VLADISLAV T. TODOROV"}, "num_reviewers": 13, "id": "19665-920-1066-VLADISLAV-T--TODOROV"}]}, "credits": null, "primary_alias": "RUSS-434", "path": "/courses/19665", "sections": {"path": "/courses/19665/sections", "values": [{"name": "MEDIA AND TERRORISM", "sectionnum": "920", "primary_alias": "RUSS-434-920", "path": "/courses/19665/sections/920", "id": "19665-920", "aliases": ["RUSS-434-920"]}]}, "id": 19665, "aliases": ["RUSS-434"]}