{"coursehistories": {"path": "/coursehistories/3021"}, "description": "The history of modern medicine as we know it in the West is remarkbly recent; until the nineteenth century prevailing theories of the body and mind, and many therapeutic methods to combat disease, were largely informed by an elaborate system developed centuries earlier in ancient Greece, at a period when the lines between philosophy, medicine, and what we might consider magic, were much less clearly defined than they are today. This course will examine the ways in which the Greeks conceptualized the body, disease, and healing, and will compare these to medical culture of our time. We will consider sources from Hippocrates, Plato, and Aristotle to Galen and Soranus, and whenever possible we will juxtapose these writings with modern discourse about similar topics. Several visitors from the Medical School are expected to participate on a regular basis. All readings will be in English and no previous background in Classical Studies is required. \n\n", "semester": "2009A", "name": "GREEK & ROMAN MEDICINE", "reviews": {"path": "/courses/15526/reviews", "values": [{"ratings": {"rAmountLearned": "2.89", "rDifficulty": "2.43", "rStimulateInterest": "3.22", "rRecommendMajor": "3.32", "rCourseQuality": "3.14", "rWorkRequired": "2.61", "rInstructorAccess": "3.46", "rReadingsValue": "3.04", "rRecommendNonMajor": "2.57", "rCommAbility": "3.54", "rInstructorQuality": "3.57"}, "section": {"name": "GREEK & ROMAN MEDICINE", "sectionnum": "401", "primary_alias": "CLST-371-401", "path": "/courses/15526/sections/401", "id": "15526-401", "aliases": ["CLST-371-401", "HSOC-353-401"]}, "comments": "In recent years Greek and Roman medicine has become increasingly central to the study of Greco-Roman culture and intellectual history. The medical writers are, for example, profoundly important for the study of ancient conceptions of the body and gender, semiotics and hermeneutics, psychology and the \\\"care of the self,\\\" not to mention the history of biology, pharmacology, and nutrition. In this seminar we will survey the major writers of the Greco-Roman medical tradition, including Hippocrates and the Hippocratic treatises, various Hellenistic medical writers, and those of later periods such as Rufus, Celsus, Soranus and Galen. Among the topics addressed throughout the semester are ancient debates about theory and practice, intersections between philosophy and medicine, sectarian rivalries, the social status of physicians, and the complex cultural interaction between Greece and Rome as reflected in the context of ancient medicine.\r\n\r\nStudents found the material to be “interesting.” One former student declared “the biggest take away…was not just learning that these texts are relevant, but learning how to examine and tease out the relevance of ancient texts to contemporary society, how to notice and articulate those connections.” Some complained about the course readings, as one wrote that “[t]he readings [were] sometimes onerous and not helpful” and another said that it was difficult “to keep on top of the readings because we would often just brush by some of them.” The overall value of the readings and the amount learned were still rated relatively highly.\r\n\r\nStudents were very impressed with Professor Rosen and many described him as “excellent.” One wrote, “[h]e is incredibly intelligent, interested in the opinions of his students, and also quite funny.” Another wrote that he is “one of the most engaging, enthusiastic professors I\\'ve had at Penn.” A few complained that “the professor [lectured] a large amount for what he claimed to be a class based on student discussion,” but other students wrote that the course was “heavily discussion based.” Overall, opinions of Professor Rosen were quite favorable.\r\n\r\nThe difficulty and amount of work required by this course were moderate. The amount of reading was “high but manageable,” according to one student. Grades consisted of short papers and exams. One student complained that “[i]t is stressful to have a multiple choice exam in a class with so much reading. I\\'m not sure if it is really a fair assessment of knowledge.” This course was fairly strongly recommended to majors and moderately to non-majors.", "num_students": 30, "path": "/courses/15526/sections/401/reviews/262-RALPH-M--ROSEN", "instructor": {"path": "/instructors/262-RALPH-M--ROSEN", "first_name": "RALPH M.", "last_name": "ROSEN", "id": "262-RALPH-M--ROSEN", "name": "RALPH M. ROSEN"}, "num_reviewers": 30, "id": "15526-401-262-RALPH-M--ROSEN"}]}, "credits": null, "primary_alias": "CLST-371", "path": "/courses/15526", "sections": {"path": "/courses/15526/sections", "values": [{"name": "GREEK & ROMAN MEDICINE", "sectionnum": "401", "primary_alias": "CLST-371-401", "path": "/courses/15526/sections/401", "id": "15526-401", "aliases": ["CLST-371-401", "HSOC-353-401"]}]}, "id": 15526, "aliases": ["CLST-371", "HSOC-353"]}