[{"ratings": {"rAmountLearned": "2.65", "rDifficulty": "3.25", "rStimulateInterest": "2.64", "rRecommendMajor": "3.31", "rCourseQuality": "2.51", "rWorkRequired": "2.93", "rInstructorAccess": "3.27", "rReadingsValue": "1.81", "rRecommendNonMajor": "1.80", "rCommAbility": "3.04", "rInstructorQuality": "3.13"}, "section": {"name": "INTRO TO COMPUTER", "sectionnum": "001", "primary_alias": "OPIM-101-001", "path": "/courses/23591/sections/001", "id": "23591-001", "aliases": ["OPIM-101-001"]}, "comments": "Computers have become an essential tool in nearly all organizations; no management student's education is complete without acquiring knowledge about using computers to solve management problems. OPIM 101 provides a solid foundation in both computers and modeling for use in subsequent courses at Wharton as well as for the student’s professional career. The course is intended to build student skill and comfort using the computer to solve problems, teach management software tools for course work and professional life, and provide an understanding of the role of computers in modern organizations. Topics include budgeting, analytical modeling, sensitivity analysis, database management, inventory control analysis, decision analysis, optimization, neural networks, genetic algorithms, and simulation. The new course format incorporates all previous recitation material into lectures. The recitation or lab section has been replaced with an open laboratory policy that allows students to complete labs at their convenience. The open computing lab is staffed by OPIM 101 consultants during the day. Three weekly one-hour lectures provide conceptual and analytical material as well as demonstrate skills using a computer that helps students to learn to solve problems with Microsoft Excel. Students complete six realistic cases playing the role of solving a problem for a client. Cases require model solutions using Microsoft Excel and an executive slide presentation of results and management recommendations using Microsoft Excel or Powerpoint. No prior background in either computers or operations and information management is expected.\r\n\r\nOverall, students found this course to be “informative,” “interesting,” and “valuable,” while also “challenging”. Students complimented the sense of community in the classroom, and felt that the information they learned would be applicable and useful in later courses and “in a future job setting.”\r\n\r\nStudents praised Professor Hitt as being an “excellent” and “engaging” lecturer. Students further emphasized his dedication to the class, availability, and willingness to “spend the time and the effort to help students” and answer any questions. Students agreed that Professor Hitt “worked hard to make the material interesting and accessible” and clearly explained lecture material. Students overwhelmingly complimented Professor Hitt’s enthusiasm for the course material, approachability, and eagerness to help resolve any confusion. One student commented that Professor Hitt’s lectures were “by far the highlight of the course.”\r\n\r\nStudents agreed that the problem sets were difficult, challenging, and time-consuming, though “fair and representative of what we learned in class.” Students commented that the material on the exams was fair, though the exams were very difficult due to “time constraints”. Grading is based on a number of individual and group exercises: problem sets (30%), midterm exam (30%), final exam (30%), and class participation/preparation (10%). \r\n", "num_students": 107, "path": "/courses/23591/sections/001/reviews/938-LORIN-M--HITT", "instructor": {"path": "/instructors/938-LORIN-M--HITT", "first_name": "LORIN M.", "last_name": "HITT", "id": "938-LORIN-M--HITT", "name": "LORIN M. HITT"}, "num_reviewers": 100, "id": "23591-001-938-LORIN-M--HITT"}, {"ratings": {"rAmountLearned": "2.65", "rDifficulty": "3.25", "rStimulateInterest": "3.00", "rRecommendMajor": "3.31", "rCourseQuality": "2.51", "rWorkRequired": "2.93", "rInstructorAccess": "2.99", "rReadingsValue": "1.81", "rRecommendNonMajor": "1.80", "rCommAbility": "2.23", "rInstructorQuality": "2.66"}, "section": {"name": "INTRO TO COMPUTER", "sectionnum": "001", "primary_alias": "OPIM-101-001", "path": "/courses/23591/sections/001", "id": "23591-001", "aliases": ["OPIM-101-001"]}, "comments": "", "num_students": 107, "path": "/courses/23591/sections/001/reviews/4075-ERIC-K-CLEMONS", "instructor": {"path": "/instructors/4075-ERIC-K-CLEMONS", "first_name": "ERIC K", "last_name": "CLEMONS", "id": "4075-ERIC-K-CLEMONS", "name": "ERIC K CLEMONS"}, "num_reviewers": 100, "id": "23591-001-4075-ERIC-K-CLEMONS"}]