{"coursehistories": {"path": "/coursehistories/2037"}, "description": "The dramatic rise in the use of complementary and alternative medicine (CAM) by the American public requires that the contemporary health care practitioner have an awareness of CAM therapies and modalities currently available. The end result of this is course will not be proficiency in the practice of any of these modalities in particular, but rather a basic understanding of each approach to common conditions and their potential contribution to health and well being. The focus of the CAM modalities discussed in this course will center on their use in women's health care provision. \n\n", "semester": "2010C", "name": "COMPLEMENTARY/ALTERNATIVE THERAPIES IN WOMEN'S HEALTH", "reviews": {"path": "/courses/23567/reviews", "values": [{"ratings": {"rAmountLearned": "2.97", "rDifficulty": "1.90", "rStimulateInterest": "3.42", "rRecommendMajor": "3.52", "rCourseQuality": "3.13", "rWorkRequired": "2.27", "rInstructorAccess": "3.32", "rReadingsValue": "2.77", "rRecommendNonMajor": "3.19", "rCommAbility": "3.20", "rInstructorQuality": "3.22"}, "section": {"name": "COMPLEMENTARY/ALTERNATIVE THERAPIES IN WOMEN'S HEALTH", "sectionnum": "001", "primary_alias": "NURS-688-001", "path": "/courses/23567/sections/001", "id": "23567-001", "aliases": ["NURS-688-001"]}, "comments": "Nursing 688 focuses on complementary and alternative therapies in women’s health. The dramatic rise in the use of complementary and alternative medicine (CAM) by the American public requires that the contemporary health care practitioner have an awareness of CAM therapies and modalities currently available. The end result of this is course is not proficiency in the practice of any of these modalities in particular, but rather a basic understanding of each approach to common conditions and their potential contribution to health and well-being. The focus of the CAM modalities in this course centers on their use in women's health care provision.\r\n\r\nThis class was very popular. Many students believed that it should be required for all nursing students. Many reported that the CAM modalities were extremely interesting and also very useful for future reference. Others noted that each lecture was an in-depth account of the topic and was explained very well. According to many, the class was informative and interactive so there was much to learn and gain from each class. Students believed that the lessons learned would greatly aid them in their further clinical work and then career. There were many positive reviews including one student that said, “ This is one of my favorite nursing courses I've taken at Penn.” However, students also commented that they were “unsure” what to gather due to the inconsistency of some lectures. \r\n\r\nThere were no comments specific to Professor Grube. Students mentioned that the lecturers presented lots of interesting topics and the students \"love[d] all of the different lectures and modalities.\" The professor included lots of \"real-life examples, samples and demonstration\" in class. There were also lots of \"excellent speakers.\" One student commented that they would have like more \"consistency in the [professor's] lectures,\" as they were all \"very different in terms of substance.\" Another student would have liked to get \"feedback with each project or paper before the next project was due.\" One student noted that the professor took them on a trip to the Morris Arboretum.\r\n\r\nStudents generally recommended that \"everyone, even non-nursing, should take\" this class. Many students felt that \"it will be very useful in clinical practice\" and is \"extremely relevant to health care,\" insisting that it \"should be required for all nursing students.\" The class seemed to be difficult in the sense that lectures varied in structure and \"content material was in-depth,\" as well as the fact that they were not given \"feedback with each project or paper before the new next project was due.\"\r\n", "num_students": 33, "path": "/courses/23567/sections/001/reviews/1651-WENDY-D--GRUBE", "instructor": {"path": "/instructors/1651-WENDY-D--GRUBE", "first_name": "WENDY D.", "last_name": "GRUBE", "id": "1651-WENDY-D--GRUBE", "name": "WENDY D. GRUBE"}, "num_reviewers": 32, "id": "23567-001-1651-WENDY-D--GRUBE"}, {"ratings": {"rAmountLearned": "2.97", "rDifficulty": "1.90", "rStimulateInterest": "1.96", "rRecommendMajor": "3.52", "rCourseQuality": "3.13", "rWorkRequired": "2.27", "rInstructorAccess": "2.04", "rReadingsValue": "2.77", "rRecommendNonMajor": "3.19", "rCommAbility": "2.00", "rInstructorQuality": "2.04"}, "section": {"name": "COMPLEMENTARY/ALTERNATIVE THERAPIES IN WOMEN'S HEALTH", "sectionnum": "001", "primary_alias": "NURS-688-001", "path": "/courses/23567/sections/001", "id": "23567-001", "aliases": ["NURS-688-001"]}, "comments": "", "num_students": 33, "path": "/courses/23567/sections/001/reviews/2248-ALLISON-JURGAITIS", "instructor": {"path": "/instructors/2248-ALLISON-JURGAITIS", "first_name": "ALLISON", "last_name": "JURGAITIS", "id": "2248-ALLISON-JURGAITIS", "name": "ALLISON JURGAITIS"}, "num_reviewers": 32, "id": "23567-001-2248-ALLISON-JURGAITIS"}]}, "credits": null, "primary_alias": "NURS-688", "path": "/courses/23567", "sections": {"path": "/courses/23567/sections", "values": [{"name": "COMPLEMENTARY/ALTERNATIVE THERAPIES IN WOMEN'S HEALTH", "sectionnum": "001", "primary_alias": "NURS-688-001", "path": "/courses/23567/sections/001", "id": "23567-001", "aliases": ["NURS-688-001"]}]}, "id": 23567, "aliases": ["NURS-688"]}