[{"ratings": {"rAmountLearned": "2.78", "rDifficulty": "2.09", "rStimulateInterest": "3.16", "rRecommendMajor": "3.56", "rCourseQuality": "3.03", "rWorkRequired": "2.09", "rInstructorAccess": "3.13", "rReadingsValue": "2.94", "rRecommendNonMajor": "2.84", "rCommAbility": "3.16", "rInstructorQuality": "3.21"}, "section": {"name": "LATIN AMER 1791-PRES", "sectionnum": "401", "primary_alias": "HIST-071-401", "path": "/courses/27555/sections/401", "id": "27555-401", "aliases": ["HIST-071-401", "LALS-071-401"]}, "comments": "This course surveys Latin American and Caribbean history from the Haitian Revolution of 1791 to the present. It is designed to examine the legacy of Spanish colonialism and slavery, movements for national and cultural independence, twentieth-century radicalism, and the politics of race in contemporary Latin America. Readings include fictional as well as analytical representations, and a film series will accompany the course.\r\n\r\nAll students surveyed reported learning a lot from this course while enjoying the semester. Many students even felt that the course sparked an interest in the subject material. Many students describe the course as “great” and enjoyed how much they learned, which one student described as an “amazing” amount of information. A few students, however, agreed that they would have preferred covering the material at a slower rate so that they could go into more depth on each subject. \r\n\r\nAccording to student reviews, Professor Farnsworth-Alvear is enthusiastic, energetic, and interesting. Students appreciated how Professor Farnsworth-Alvear made every lecture engaging. “Professor Farnsworth-Alvear’s obvious enthusiasm keeps students engaged in what is already very interesting material,” one student wrote. Another student described her as “fun, brilliant, passionate, and accessible.” One student found Professor Farnsworth-Alvear to be a bit difficult to follow at times, but added that this may just be a result of her enthusiasm about presenting what she knows to the class.\r\n\r\nBecause all lectures were posted online as audio files, a couple of students felt that the pressure to go to class was very low. A few describe the class as “easy” noting that “[t]here isn’t too much extra work required.” The course allows students to select four essays to write throughout the semester, which students found helpful because they could select essays that fit into their schedules and particular interests. Students would recommend this course regardless of history background; as one student wrote, “With completely no experience taking history classes, I found this class informative, engaging, and accessible.” This course satisfies the History & Tradition Sector and Cross Cultural Analysis requirement.\r\n", "num_students": 50, "path": "/courses/27555/sections/401/reviews/1511-ANN-C--FARNSWORTH-ALVEAR", "instructor": {"path": "/instructors/1511-ANN-C--FARNSWORTH-ALVEAR", "first_name": "ANN C.", "last_name": "FARNSWORTH-ALVEAR", "id": "1511-ANN-C--FARNSWORTH-ALVEAR", "name": "ANN C. FARNSWORTH-ALVEAR"}, "num_reviewers": 41, "id": "27555-401-1511-ANN-C--FARNSWORTH-ALVEAR"}]