[{"ratings": {"rAmountLearned": "3.36", "rDifficulty": "2.58", "rStimulateInterest": "3.54", "rRecommendMajor": "3.80", "rCourseQuality": "3.56", "rWorkRequired": "3.10", "rInstructorAccess": "3.61", "rReadingsValue": "3.46", "rRecommendNonMajor": "3.40", "rCommAbility": "3.57", "rInstructorQuality": "3.65"}, "section": {"name": "NAPOLEONIC ERA & TOLSTOY", "sectionnum": "401", "primary_alias": "HIST-333-401", "path": "/courses/27584/sections/401", "id": "27584-401", "aliases": ["HIST-333-401", "COML-236-401", "RUSS-240-401"]}, "comments": "In this course students read what many consider to be the greatest book in world literature.  This work, Tolstoy’s War and Peace, is devoted to one of the most momentous periods in world history, the Napoleonic Era (1789-1815).  Students study both the novel and the era of the Napoleonic Wars: the military campaigns of Napoleon and his opponents, the grand strategies of the age, political intrigues and diplomatic betrayals, the ideologies and human dramas, the relationship between art and history.  How does literature help us to understand this era?  How does history help us to understand this great novel? \r\n\r\nStudents absolutely raved about the course material and format.  One student mentioned that if they were to begin mentioning all the good things about the course, the student “would be writing an evaluation whose length would rival War and Peace itself.”  The class integrated both a literary analysis component and a historical component, making it “innovative.”  \r\n\r\nStudents raved about the dynamic between the two professors.  One student lauded the department for having both a literature and history professor, which “provided for a more comprehensive, interdisciplinary understanding of War and Peace, which added substantial value to the class.”  The professors “were constantly engaging with one another, always open to students' questions, and genuinely wanted students to immerse themselves in the Tolstoyan experience.”  Professor Vinitsky was described not only as brilliant, but able to stimulate interest in the material and engage with students during lectures.  \r\n\r\nCoursework included two major written assignments and a handful of quizzes.  The course required weekly reading of between 150-300 pages per week, and students warned that if reading large amounts was difficult for a particular student, he or she may think twice before enrolling in this course.  Overall, students highly recommended this course, in many of their words, “one of the best at Penn.”  One student elaborated, “I recommend this course to anyone, but particularly to freshmen, because it serves as a great inspiration for further courses of a similar nature.”  Another student recommended this course to history and English majors in particular, “if only to meet the professors,” as well as to non-majors looking to expand their breadth of knowledge.  ", "num_students": 65, "path": "/courses/27584/sections/401/reviews/2325-ILYA-VINITSKY", "instructor": {"path": "/instructors/2325-ILYA-VINITSKY", "first_name": "ILYA", "last_name": "VINITSKY", "id": "2325-ILYA-VINITSKY", "name": "ILYA VINITSKY"}, "num_reviewers": 58, "id": "27584-401-2325-ILYA-VINITSKY"}, {"ratings": {"rAmountLearned": "3.36", "rDifficulty": "2.58", "rStimulateInterest": "3.74", "rRecommendMajor": "3.80", "rCourseQuality": "3.56", "rWorkRequired": "3.10", "rInstructorAccess": "3.67", "rReadingsValue": "3.46", "rRecommendNonMajor": "3.40", "rCommAbility": "3.82", "rInstructorQuality": "3.76"}, "section": {"name": "NAPOLEONIC ERA & TOLSTOY", "sectionnum": "401", "primary_alias": "HIST-333-401", "path": "/courses/27584/sections/401", "id": "27584-401", "aliases": ["HIST-333-401", "COML-236-401", "RUSS-240-401"]}, "comments": "", "num_students": 65, "path": "/courses/27584/sections/401/reviews/3325-PETER-HOLQUIST", "instructor": {"path": "/instructors/3325-PETER-HOLQUIST", "first_name": "PETER", "last_name": "HOLQUIST", "id": "3325-PETER-HOLQUIST", "name": "PETER HOLQUIST"}, "num_reviewers": 58, "id": "27584-401-3325-PETER-HOLQUIST"}]