{"coursehistories": {"path": "/coursehistories/675"}, "description": "The Internet has become central to business and daily life. This course looks at how courts, legislatures, and regulators confront the major legal issues that the Internet poses. The fundamental challenge is that law comes from governments and other institutions in specific places, but the Internet is global and virtual. Conflicts such as the shutdown of the Napster peer-to-peer file-sharing service and the debate over \"network neutrality\" regulations for broadband access illustrate the challenge. How does the legal system think about Google, Skype, Twitter, and Facebook? How should it? \n\nThe material in the course ranges from the foundations of cyberlaw, developed during the e-commerce boom of the 1990s, to current leading-edge questions around social networks, user-generated content, location-based services, cloud computing, and broadband platforms. Major topics include: how legally-enforceable contracts are made online; how courts determine jurisdiction over online transactions; intellectual property rules around digital assets such as music, video, and online texts; control over Internet domain names; liability of intermediaries such as Internet Service Providers and search engines; and online privacy protections. No pre-existing legal or legal or technical knowledge is required. \n\n", "semester": "2011C", "name": "INTERNET LAW & POLICY", "reviews": {"path": "/courses/24646/reviews", "values": [{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "2.20", "rStimulateInterest": "3.12", "rRecommendMajor": "3.28", "rCourseQuality": "3.00", "rWorkRequired": "2.08", "rInstructorAccess": "3.04", "rReadingsValue": "3.00", "rRecommendNonMajor": "2.56", "rCommAbility": "3.38", "rInstructorQuality": "3.29"}, "section": {"name": "INTERNET LAW & POLICY", "sectionnum": "001", "primary_alias": "LGST-222-001", "path": "/courses/24646/sections/001", "id": "24646-001", "aliases": ["LGST-222-001", "OPIM-222-001"]}, "comments": "*Legal Studies 222 looks at how courts, legislatures, and regulators confront the major legal issues that the Internet poses.  The fundamental challenge is that law comes from governments and other institutions in specific places, but the Internet is global and virtual.  Conflicts such as the shutdown of the Napster peer-to-peer file-sharing service and the debate over \"network neutrality\" regulations for broadband access illustrate the challenge.  How does the legal system think about Google, Skype, Twitter, and Facebook?  How should it? The material in the course ranges from the foundations of cyberlaw, developed during the e-commerce boom of the 1990s, to current leading-edge questions around social networks, user-generated content, location-based services, cloud computing, and broadband platforms.  Major topics include: how legally-enforceable contracts are made online; how courts determine jurisdiction over online transactions; intellectual property rules around digital assets such as music, video, and online texts; control over Internet domain names; liability of intermediaries such as Internet Service Providers and search engines; and online privacy protections.  No pre-existing legal or technical knowledge is required. This course is cross-listed with OPIM 222.\r\n\r\nMost students said the course was “very interesting.”  One said it was the best course they had ever taken at Penn.  Students generally agreed that the class was excellent and “useful if one were to establish a tech start-up.” One student mentioned that the class is “discussion and seminar based.”\r\n\r\nStudents said Professor Werbach “has unbelievable knowledge and experience to teach the class.”  He was “an engaging lecturer” and his “personal experiences with the subject made the course that much more enjoyable.”  He did a good job fostering discussion and teaching concepts.  He taught with a “law school-style by using Socratic methods.”  One or two felt that he could have had more balance, in that he spent too much time on some topics and breezed through others.\r\n\r\nStudents didn’t mention the difficulty of the course.  The class was more of a seminar than a lecture style, because the professor actively encouraged student comments. This class is not required of Wharton students and can be used to satisfy Concentration requirements.\r\n\r\n*This review was based on 7 student comments. \r\n", "num_students": 33, "path": "/courses/24646/sections/001/reviews/2536-KEVIN-WERBACH", "instructor": {"path": "/instructors/2536-KEVIN-WERBACH", "first_name": "KEVIN", "last_name": "WERBACH", "id": "2536-KEVIN-WERBACH", "name": "KEVIN WERBACH"}, "num_reviewers": 29, "id": "24646-001-2536-KEVIN-WERBACH"}]}, "credits": null, "primary_alias": "LGST-222", "path": "/courses/24646", "sections": {"path": "/courses/24646/sections", "values": [{"name": "INTERNET LAW & POLICY", "sectionnum": "001", "primary_alias": "LGST-222-001", "path": "/courses/24646/sections/001", "id": "24646-001", "aliases": ["LGST-222-001", "OPIM-222-001"]}]}, "id": 24646, "aliases": ["LGST-222", "OPIM-222"]}