{"coursehistories": {"path": "/coursehistories/2875"}, "description": "Few businesses experience as dramatic a paradigm shift as the one currently facing the media and entertainment industries. As entertainment and technology converge in interactive offerings, not only are media and entertainment being redefined, but also the underpinnings and business models on which those industries are based. \n\nThis rapidly changing marketplace is also impacting those businesses traditionally dependent upon media for advertising and brand building. As the locus of control shifts from providers to consumers, it is imperative to understand the marketing implications of this shift as well as its impact on other industries. Although media and entertainment are not traditional consumer products, they nonetheless face the same marketing mix issues of product, price, distribution, and promotion, and the need to understand the marketplace, their consumers, the decision making process, and behavioral drivers. In the midst of change, these questions become more vexing and of paramount importance for business survival. \n\nThis course will examine the marketing implications of the media and entertainment industries evolution from its original one-to-many model, to its present transition into a more customized, individualized approach. The course will begin by looking at the industries overall and the forces creating change. The second section considers emerging media, the future of the media and entertainment industries and consumer experience moving forward. This class is unique in that the instructor specializes in entertainment and marketing research; the class will draw upon practical experience and feature guest lectures from other industry experts. Because the industry changes are happening real time, the class will focus heavily on current events rather than theory or academic research. \n\n", "semester": "2009C", "name": "INTERACTIVE MEDIA MKTG", "reviews": {"path": "/courses/17725/reviews", "values": [{"ratings": {"rAmountLearned": "3.07", "rDifficulty": "1.77", "rStimulateInterest": "3.37", "rRecommendMajor": "3.74", "rCourseQuality": "3.22", "rWorkRequired": "1.81", "rInstructorAccess": "3.22", "rReadingsValue": "2.52", "rRecommendNonMajor": "3.19", "rCommAbility": "3.59", "rInstructorQuality": "3.48"}, "section": {"name": "INTERACTIVE MEDIA MKTG", "sectionnum": "301", "primary_alias": "MKTG-394-301", "path": "/courses/17725/sections/301", "id": "17725-301", "aliases": ["MKTG-394-301"]}, "comments": "", "num_students": 27, "path": "/courses/17725/sections/301/reviews/3086-SUZANNE-E-DIAMOND", "instructor": {"path": "/instructors/3086-SUZANNE-E-DIAMOND", "first_name": "SUZANNE E", "last_name": "DIAMOND", "id": "3086-SUZANNE-E-DIAMOND", "name": "SUZANNE E DIAMOND"}, "num_reviewers": 27, "id": "17725-301-3086-SUZANNE-E-DIAMOND"}]}, "credits": null, "primary_alias": "MKTG-394", "path": "/courses/17725", "sections": {"path": "/courses/17725/sections", "values": [{"name": "INTERACTIVE MEDIA MKTG", "sectionnum": "301", "primary_alias": "MKTG-394-301", "path": "/courses/17725/sections/301", "id": "17725-301", "aliases": ["MKTG-394-301"]}]}, "id": 17725, "aliases": ["MKTG-394"]}