[{"ratings": {"rAmountLearned": "1.94", "rDifficulty": "3.30", "rStimulateInterest": "1.54", "rRecommendMajor": "3.20", "rCourseQuality": "1.38", "rWorkRequired": "2.54", "rInstructorAccess": "1.32", "rReadingsValue": "2.30", "rRecommendNonMajor": "0.92", "rCommAbility": "1.52", "rInstructorQuality": "1.49"}, "section": {"name": "INTERMED MICROECONOMICS", "sectionnum": "001", "primary_alias": "ECON-101-001", "path": "/courses/24266/sections/001", "id": "24266-001", "aliases": ["ECON-101-001"]}, "comments": "Economics 101 covers many topics such as theories of consumer behavior, demand, production, costs, the firm in various market contexts, factor employment, factor incomes, elementary general equilibrium, and welfare. There is a very heavy dependence on the textbook readings and less on real world applications.\r\n\r\nThe general consensus of this class was that the material was interesting, but it was not as well taught as it could have been. Many of the students complained about the tests and their lack of coherence with the rest of the class. Many students found it “frustrating” that they did not know what was going to appear on the tests, and much of what did appear was not emphasized in class. Students agreed that the take home tests and the communication between TA, Professor and student needed to be a bit more organized. Overall, the main complaint about the course was its lack of structure, not the material or the difficulty level. Some students found that the material overlapped heavily with ECON 001, one of the prerequisites of the class.\r\n\r\nStudents complimented Professor Burdett for being a “respected economist.” However, they did not necessarily see him as highly engaging, available or a helpful professor. Though he was reported to often go off on witty, yet irrelevant, tangents, Professor Burdett often received a lackluster review. He did not respond promptly to emails and often mumbled so students had trouble hearing. In addition, the tests were graded slowly. Professor Burdett didn’t often use slides, which contributed to the feel of disorganization. On the other hand, it is clear to students that Professor Burdett is incredibly intelligent and “clearly passionate about economics.”   \r\n \r\nThis class is a “toolkit course.” It is mainly recommended for Economics majors or minors and provides a great deal of theory that can be useful later in studies. The workload consisted of five exams, both in class and take home. The prerequisites are ECON 001, ECON 002 and MATH 114.\r\n", "num_students": 156, "path": "/courses/24266/sections/001/reviews/1365-KENNETH-BURDETT", "instructor": {"path": "/instructors/1365-KENNETH-BURDETT", "first_name": "KENNETH", "last_name": "BURDETT", "id": "1365-KENNETH-BURDETT", "name": "KENNETH BURDETT"}, "num_reviewers": 132, "id": "24266-001-1365-KENNETH-BURDETT"}, {"ratings": {"rAmountLearned": "2.57", "rDifficulty": "3.36", "rStimulateInterest": "1.21", "rRecommendMajor": "3.29", "rCourseQuality": "2.07", "rWorkRequired": "2.79", "rInstructorAccess": "3.36", "rReadingsValue": "1.57", "rRecommendNonMajor": "1.29", "rCommAbility": "1.43", "rInstructorQuality": "2.07"}, "section": {"name": "INTERMED MICROECONOMICS", "sectionnum": "601", "primary_alias": "ECON-101-601", "path": "/courses/24266/sections/601", "id": "24266-601", "aliases": ["ECON-101-601"]}, "comments": "Economics 101 takes an in-depth look at microeconomic concepts. Students will learn theories of consumer behavior, demand, production, costs, factor unemployment, factor incomes, elementary general equilibrium, welfare, and the firm in various market contexts. \r\n\r\nThe content of this course was described as challenging. Many students found the material “difficult to understand.” Several others noted that the course was “math intensive” and “focused far too heavily on mathematical formulas.” Several students found the textbook used for the course unhelpful for the exams and assignments.\r\n\r\nStudents were split on their opinion of Professor Hanley. Some students suggested “it was fun to be in class every day” and described Professor Hanley as having “incredible depth of knowledge in economics.” Others, in contrast, found that Professor Hanley did “not attempt to explain concepts or engage the class.”\r\n\r\nStudents found exam preparation difficult and exams themselves very challenging. Several students noted that class attendance seemed low, due to lectures failing to clarify material. Multiple students expressed concern for being unprepared for problem sets and exams. The prerequisites are ECON 001, ECON 002, and MATH 114 ", "num_students": 23, "path": "/courses/24266/sections/601/reviews/5606-DOUGLAS-B-HANLEY", "instructor": {"path": "/instructors/5606-DOUGLAS-B-HANLEY", "first_name": "DOUGLAS B", "last_name": "HANLEY", "id": "5606-DOUGLAS-B-HANLEY", "name": "DOUGLAS B HANLEY"}, "num_reviewers": 17, "id": "24266-601-5606-DOUGLAS-B-HANLEY"}]