{"coursehistories": {"path": "/coursehistories/3980"}, "description": "Certain new technologies are greeted with claims that, for good or ill, they must transform our society. The two most recent: the computer and the Internet. But the series of social, economic, and technological developments that underlie what is often called the \"Information Revolution\" include much more than just the computer. In this course, we explore the history of informtion technology and its role in contemporary society. We will explore both the technologies themselves--from telephones to computers to video games--as well as their larger social, economic and political context. To understand the roots of these ideas we look at the pre-history of the comptuer, at the idea of the \"post industrial\" or \"information society,\" at parallels with earlier technolgies and at broad currents in the development of American society. \n\n", "semester": "2010C", "name": "THE INFORMATION AGE", "reviews": {"path": "/courses/23850/reviews", "values": [{"ratings": {"rAmountLearned": "2.70", "rDifficulty": "2.46", "rStimulateInterest": "3.16", "rRecommendMajor": "3.33", "rCourseQuality": "2.83", "rWorkRequired": "2.32", "rInstructorAccess": "2.80", "rReadingsValue": "2.40", "rRecommendNonMajor": "2.82", "rCommAbility": "3.40", "rInstructorQuality": "3.41"}, "section": {"name": "THE INFORMATION AGE", "sectionnum": "401", "primary_alias": "STSC-160-401", "path": "/courses/23850/sections/401", "id": "23850-401", "aliases": ["STSC-160-401", "SOCI-161-401"]}, "comments": "“The Information Age,” examines what made the series of social, economic, and technological developments that underlie what is often called the \"Information Revolution\" seem so revolutionary, who said what about them, and why. It charts changing perceptions of information technologies as people begin to experience them as a part of everyday life and work. It explores both the technologies themselves as well as their larger social, economic, and political context. These perspectives will inform our discussion of current issues such as life and censor- ship in 'cyberspace.' &#8232;&#8232;\r\n\r\nWhile the “organization of course content seemed jumbled,” students generally seemed of the opinion that this is “one of the most unique courses at Penn.” Overall, students “learned a lot from this course,” and noted that, “anyone interested in social science/history/technology will be intrigued from academic points of view.” Some felt that aside from the last few weeks of class, which consists of more modern history, the “history class…was rather dry.” Others found this an “amazing class: very interesting and fun.” Many recommended it to others simply because of the interesting nature of the material. &#8232;&#8232;\r\n\r\nStudents generally found it was “a pleasure to be in Professor Ensmenger’s class.” He “was able to engage an audience of 250 students” especially because he was so “quirky and innovative” and was able to present the subject in an “exciting and interesting” way and “not just [as] a boring PowerPoint of just words.” They appreciated that Professor Ensmenger “made the material interesting, entertaining and relevant” and also noted his “great sense of humor.” It was apparent to his former students that “he is clearly an expert in information technology.” They also mentioned how “he tried to stimulate our interest with little activities and fun videos and website.” He is commended as an “articulate leader” for “craft[ing] brilliant and engaging lectures that make a complicated topic accessible.” Students also thought it was “easy to meet with [him] and discuss course issues.”&#8232;\r\n\r\n&#8232;The “class did require a good of amount of reading,” and “readings were dense.” “The exams were very hard” in that “too specific details from readings [were] asked on exams.” One student felt that they “test more one’s ability to write fast than retain the information.” This class includes a bulk pack of required readings and is broken down by developments per era. “The Information Age” is graded on class participation, three short assignments, a mid-term exam, and a final.\r\n", "num_students": 244, "path": "/courses/23850/sections/401/reviews/664-NATHAN-ENSMENGER", "instructor": {"path": "/instructors/664-NATHAN-ENSMENGER", "first_name": "NATHAN", "last_name": "ENSMENGER", "id": "664-NATHAN-ENSMENGER", "name": "NATHAN ENSMENGER"}, "num_reviewers": 220, "id": "23850-401-664-NATHAN-ENSMENGER"}]}, "credits": null, "primary_alias": "STSC-160", "path": "/courses/23850", "sections": {"path": "/courses/23850/sections", "values": [{"name": "THE INFORMATION AGE", "sectionnum": "401", "primary_alias": "STSC-160-401", "path": "/courses/23850/sections/401", "id": "23850-401", "aliases": ["STSC-160-401", "SOCI-161-401"]}]}, "id": 23850, "aliases": ["STSC-160", "SOCI-161"]}