{"coursehistories": {"path": "/coursehistories/221"}, "description": "Early development of microbiology, pathology, and immunobiology; molecular and cellular bases of immune phenomena including: immunity to pathogens, immune diseases, autoimmunity, and hypersensitivity. \n\n", "semester": "2011A", "name": "IMMUNOBIOLOGY", "reviews": {"path": "/courses/21356/reviews", "values": [{"ratings": {"rAmountLearned": "3.34", "rDifficulty": "3.20", "rStimulateInterest": "3.40", "rRecommendMajor": "3.59", "rCourseQuality": "3.26", "rWorkRequired": "3.38", "rInstructorAccess": "2.77", "rReadingsValue": "2.63", "rRecommendNonMajor": "2.04", "rCommAbility": "3.23", "rInstructorQuality": "3.40"}, "section": {"name": "IMMUNOBIOLOGY", "sectionnum": "601", "primary_alias": "BIOL-404-601", "path": "/courses/21356/sections/601", "id": "21356-601", "aliases": ["BIOL-404-601"]}, "comments": "Biol404 focuses on early development of microbiology, pathology, and immunobiology, and it focuses on molecular and cellular bases of immune phenomena including: immunity to pathogens, immune diseases, autoimmunity, and hypersensitivity.\r\n\r\nStudents regarded this course as “tough” but ultimately an “interesting” and “excellent” course. Students praised the high “information density” of the lectures, feeling that they learned more in a shorter amount of time than they did in a lot of other classes. Another common praise is that the course made students apply their knowledge critically rather than just require rote memorization.\r\n\r\nProfessor Cancro was highly praised as “approachable” and “down to earth.” Students commented that he made the information relatable and truly strived to make sure every student understood the material.\r\n\r\nBiol 202 and 221 are both prerequisites for this course. Students commented that the workload was extremely tough and slightly overwhelming, especially with both take home and in class exams. The only part of the class that students overall felt was truly unnecessary and sometimes harmful was the required discussion threads. Additionally, the points method of grading was extremely strict and made the course more difficult.\r\n", "num_students": 74, "path": "/courses/21356/sections/601/reviews/202-MICHAEL-P-CANCRO", "instructor": {"path": "/instructors/202-MICHAEL-P-CANCRO", "first_name": "MICHAEL P", "last_name": "CANCRO", "id": "202-MICHAEL-P-CANCRO", "name": "MICHAEL P CANCRO"}, "num_reviewers": 50, "id": "21356-601-202-MICHAEL-P-CANCRO"}]}, "credits": null, "primary_alias": "BIOL-404", "path": "/courses/21356", "sections": {"path": "/courses/21356/sections", "values": [{"name": "IMMUNOBIOLOGY", "sectionnum": "601", "primary_alias": "BIOL-404-601", "path": "/courses/21356/sections/601", "id": "21356-601", "aliases": ["BIOL-404-601"]}]}, "id": 21356, "aliases": ["BIOL-404"]}