[{"ratings": {"rAmountLearned": "2.49", "rDifficulty": "1.90", "rStimulateInterest": "2.24", "rRecommendMajor": "3.16", "rCourseQuality": "2.40", "rWorkRequired": "2.04", "rInstructorAccess": "3.31", "rReadingsValue": "2.18", "rRecommendNonMajor": "2.59", "rCommAbility": "2.45", "rInstructorQuality": "2.55"}, "section": {"name": "RELIGIONS OF THE WEST", "sectionnum": "401", "primary_alias": "RELS-002-401", "path": "/courses/28097/sections/401", "id": "28097-401", "aliases": ["RELS-002-401", "JWST-122-401"]}, "comments": "This course surveys some of the core beliefs and practices within Judaism, Christianity, and Islam. To do so, we will focus on history and memory, exploring how key figures and formative events from the past have been made present, from generation to generation, through scripture, ritual, liturgy, and remembrance. Special attention will be given to points of interaction between Jews, Christians, and Muslims, as well as to the impact of their intertwined histories on the formation and development of Western cultures. Fulfills History & Tradition Sector.\r\n\r\nStudents expressed great satisfaction with this course.  One participant noted, “the course achieved all its goals.”  Students generally considered the class, “a worthwhile introduction to the three dominant religions in Western culture.”  The lectures and readings alike were described as “interesting” and “thought-provoking.”\r\n\r\nProfessor Reed was praised as “extremely knowledgeable” and “an exceptionally kind woman.”  Students found her lectures “stimulating,” and appreciated “Professor Reed’s investment in students’ progress.”  Moreover, Professor Reed was reviewed as accessible outside the classroom as well.\r\n\r\nStudents found the workload and assignments “reasonable.”  One student, described the readings as “excessively long,” but most considered them appropriate given the breadth of the course.  Students described the in-class assessments as “straight-forward.”  A few students expressed a wish for “more feedback during the semester” to better gauge their standing in the course.  As the course is introductory, a few students found the material to be “a review,” but most appreciated the level of the course.  Students took the course for an assortment of reasons, ranging from general requirement to major requirement to elective.  Regardless of motivation, nearly all students stated they would recommend the course to others.", "num_students": 71, "path": "/courses/28097/sections/401/reviews/4554-ANNETTE-YOSHIKO-REED", "instructor": {"path": "/instructors/4554-ANNETTE-YOSHIKO-REED", "first_name": "ANNETTE YOSHIKO", "last_name": "REED", "id": "4554-ANNETTE-YOSHIKO-REED", "name": "ANNETTE YOSHIKO REED"}, "num_reviewers": 63, "id": "28097-401-4554-ANNETTE-YOSHIKO-REED"}]