{"coursehistories": {"path": "/coursehistories/3291"}, "description": "This course will provide a comprehensive survey of modern medical imaging modalities with an emphasis on the emerging field of molecular imaging. The basic principles of X-ray, computed tomography, nuclear imaging, magnetic resonance imaging, and optical tomography will be reviewed. The emphasis of the course, however, will focus on the concept of contrast media and targeted molecular imaging. Topics to be covered include the chemistry and mechanisms of various contrast agents, approaches to identifying molecular markers of disease, ligand screening strategies, and the basic principles of toxicology and pharmacology relevant to imaging agents. \n\n", "semester": "2009C", "name": "MOLECULAR IMAGING", "reviews": {"path": "/courses/17000/reviews", "values": [{"ratings": {"rAmountLearned": "2.87", "rDifficulty": "2.78", "rStimulateInterest": "2.72", "rRecommendMajor": "3.24", "rCourseQuality": "2.78", "rWorkRequired": "2.53", "rInstructorAccess": "3.18", "rReadingsValue": "2.56", "rRecommendNonMajor": "1.96", "rCommAbility": "3.00", "rInstructorQuality": "3.10"}, "section": {"name": "MOLECULAR IMAGING", "sectionnum": "401", "primary_alias": "BE-483-401", "path": "/courses/17000/sections/401", "id": "17000-401", "aliases": ["BE-483-401", "BE-583-401"]}, "comments": "This course provides a survey of modern medical imaging methods with an emphasis on molecular imaging. The basic principles of X-ray, computed tomography, nuclear imaging, and magnetic resonance imaging, are reviewed, but the emphasis is on topics such as the chemistry and mechanisms of various contrast agents, approaches to identifying molecular markers of disease, ligand screening strategies, and the basic principles of toxicology and pharmacology relevant to imaging agents.\r\n\r\nStudents were pleased with the course content, with one student stating “this felt like one of the first BE classes that taught applicable and useful information.” Students felt that they learned each imaging modality well, although at times, it seemed as if depth was lacking.\r\n\r\nStudents liked Professor Tsourkas, and wished “that Dr. Tsourkas taught more of the lectures.” Though students appreciated hearing directly from experts in the field, students had a hard time adjusting to the different teaching styles of the various guest lecturers.\r\n\r\nStudents thought grading was very fair and the tests were reasonably challenging. This is an advanced course in imaging, with prerequisites of BIOL 215 or BE 305. \r\n", "num_students": 58, "path": "/courses/17000/sections/401/reviews/2869-ANDREW-TSOURKAS", "instructor": {"path": "/instructors/2869-ANDREW-TSOURKAS", "first_name": "ANDREW", "last_name": "TSOURKAS", "id": "2869-ANDREW-TSOURKAS", "name": "ANDREW TSOURKAS"}, "num_reviewers": 50, "id": "17000-401-2869-ANDREW-TSOURKAS"}]}, "credits": null, "primary_alias": "BE-483", "path": "/courses/17000", "sections": {"path": "/courses/17000/sections", "values": [{"name": "MOLECULAR IMAGING", "sectionnum": "401", "primary_alias": "BE-483-401", "path": "/courses/17000/sections/401", "id": "17000-401", "aliases": ["BE-483-401", "BE-583-401"]}]}, "id": 17000, "aliases": ["BE-483", "BE-583"]}