{"coursehistories": {"path": "/coursehistories/273"}, "description": "How has the experience of being in prison changed from ancient to modern times? As in modernity, so in earlier periods there were many reasons for imprisonment: charges of treason, political or religious dissent, crime and war. How do prison narratives from various historical periods reflect differences in the way that people have experienced imprisonment? Did prisoners in the past personalize their suffering in the way that modern prisoners often do? How do prison writings establish an idea of community with other prisoners and with a public outside the prison? And how have prison writers managed to transform their individual expereinces into the broad social, political, or historical statements? \n\nWe will begin the course with writings by two well known modern prison writers:Nelson Mandela (South Africa) and Leonard Peltier (USA). We'll then turn to writings from the past, including: Plato's account of Socrates' imprisonment, trial, and execution; narratives and transcripts of Joan of Arc's imprisonment and trial; and Oscar Wilde's \"Ballad of Reading Gaol.\" We will end with further selections from modern prison writing, including fictional and real-life narratives. Over the semester we will also read some historical and theoretical studies of imprisonment, including Foucault's Discipline and Punish: the Birth of the Prison and some focused studies of ancient, medieval, and early modern prison systems. Your work for the class, in addition to the readings, will be to write two medium-sized papers (6-7 pages) about works read for class, and prepare and present one report on a text of your choice that we are not reading for class. You will also be asked, from time to time, to do small research exercises on modern or historical topics related to our reading; these research assignments may involve work on the World Wide Web. \n\n", "semester": "2002A", "name": "ANC/MOD PRISON NARRATIVE", "reviews": {"path": "/courses/273/reviews", "values": [{"ratings": {"rAmountLearned": "2.89", "rDifficulty": "1.89", "rStimulateInterest": "3.11", "rRecommendMajor": "3.00", "rCourseQuality": "3.22", "rWorkRequired": "2.33", "rInstructorAccess": "3.89", "rReadingsValue": "3.22", "rRecommendNonMajor": "3.33", "rCommAbility": "3.44", "rInstructorQuality": "3.63"}, "section": {"name": "ANC/MOD PRISON NARRATIVE", "sectionnum": "301", "primary_alias": "CLST-130-301", "path": "/courses/273/sections/301", "id": "273-301", "aliases": ["CLST-130-301"]}, "comments": "", "num_students": 9, "path": "/courses/273/sections/301/reviews/256-RITA-COPELAND", "instructor": {"path": "/instructors/256-RITA-COPELAND", "first_name": "RITA", "last_name": "COPELAND", "id": "256-RITA-COPELAND", "name": "RITA COPELAND"}, "num_reviewers": 9, "id": "273-301-256-RITA-COPELAND"}]}, "credits": null, "primary_alias": "CLST-130", "path": "/courses/273", "sections": {"path": "/courses/273/sections", "values": [{"name": "ANC/MOD PRISON NARRATIVE", "sectionnum": "301", "primary_alias": "CLST-130-301", "path": "/courses/273/sections/301", "id": "273-301", "aliases": ["CLST-130-301"]}]}, "id": 273, "aliases": ["CLST-130"]}