{"coursehistories": {"path": "/coursehistories/2559"}, "description": "The course emphasizes a systems engineering approach to project management including the cycle costing and analysis, project scheduling, project organization and control, contract management, project monitoring and negotiations. In addition, the coure will also examine management issues in large infrastructure projects like non-recourse or limited recourse project financing. Examples from the logistics planning process and global software project management will be used to highlight the course topics. \n\n", "semester": "2011C", "name": "PROJECT MANAGEMENT", "reviews": {"path": "/courses/24371/reviews", "values": [{"ratings": {"rAmountLearned": "2.14", "rDifficulty": "1.97", "rStimulateInterest": "2.05", "rRecommendMajor": "2.43", "rCourseQuality": "2.13", "rWorkRequired": "2.89", "rInstructorAccess": "2.49", "rReadingsValue": "1.98", "rRecommendNonMajor": "1.95", "rCommAbility": "2.19", "rInstructorQuality": "2.43"}, "section": {"name": "PROJECT MANAGEMENT", "sectionnum": "401", "primary_alias": "ESE-444-401", "path": "/courses/24371/sections/401", "id": "24371-401", "aliases": ["ESE-444-401", "ESE-544-401"]}, "comments": "The course emphasizes a systems engineering approach to project management\r\nincluding the cycle costing and analysis, project scheduling, project organization and\r\ncontrol, contract management, project monitoring and negotiations. In addition, the\r\ncourse also examines management issues in large infrastructure projects like nonrecourse\r\nor limited recourse project financing. Examples from the logistics planning\r\nprocess and global software project management are used to highlight the course topics.\r\nOverall, students criticized this class, describing it as “poorly organized” and\r\n“boring.” Many felt that there was too much busywork and that the assignment\r\ninstructions were extremely vague. They spent time writing reports for a fictional project,\r\nbut commented that executing an actual project would have been more useful.\r\nStudents felt that Professor Pourdehnad should have given more directions on the\r\nassignments. They also felt that the exams were confusing and that the questions should\r\nbe worded more clearly.\r\nStudents found this to be a relatively easy class. However, opinion regarding the\r\nworkload was mixed. While some thought that there was too much work, others felt that\r\nthere was only busywork involved.", "num_students": 94, "path": "/courses/24371/sections/401/reviews/2369-JAHANGIR-POURDEHNAD", "instructor": {"path": "/instructors/2369-JAHANGIR-POURDEHNAD", "first_name": "JAHANGIR", "last_name": "POURDEHNAD", "id": "2369-JAHANGIR-POURDEHNAD", "name": "JAHANGIR POURDEHNAD"}, "num_reviewers": 77, "id": "24371-401-2369-JAHANGIR-POURDEHNAD"}]}, "credits": null, "primary_alias": "ESE-444", "path": "/courses/24371", "sections": {"path": "/courses/24371/sections", "values": [{"name": "PROJECT MANAGEMENT", "sectionnum": "401", "primary_alias": "ESE-444-401", "path": "/courses/24371/sections/401", "id": "24371-401", "aliases": ["ESE-444-401", "ESE-544-401"]}]}, "id": 24371, "aliases": ["ESE-444", "ESE-544"]}