[{"ratings": {"rAmountLearned": "3.01", "rDifficulty": "2.38", "rStimulateInterest": "3.19", "rRecommendMajor": "3.51", "rCourseQuality": "2.97", "rWorkRequired": "2.07", "rInstructorAccess": "2.75", "rReadingsValue": "2.20", "rRecommendNonMajor": "2.57", "rCommAbility": "3.37", "rInstructorQuality": "3.33"}, "section": {"name": "ECON & FIN HLTH CARE DEL", "sectionnum": "401", "primary_alias": "HCMG-302-401", "path": "/courses/27532/sections/401", "id": "27532-401", "aliases": ["HCMG-302-401", "ECON-236-401"]}, "comments": "HCMG 302 (cross listed as ECON 236) provides an application of economic principles to the health care sector. By recognizing the importance of scarcity and incentives this course focuses on the critical economic issues in producing, delivering and financing health care. In particular, the course analyzes determinants of demand for medical care, such as health status, insurance coverage, and income; the unique role of physicians in guiding and shaping the allocation of resources in medical care markets; and competition in medical care markets, especially among hospitals. Special emphasis is placed on the evaluation of policy instruments such as government regulation, antitrust laws, 'sin taxes' on cigarettes and alcohol, and public health programs. The course uses more advanced quantitative methods and formal economic theory.\r\n\r\nStudents thought the course was “very interesting,” and a few even described it as one of the best courses they had taken.  Several students noted that they “learned a great deal about all aspects of healthcare.” A few particularly liked the “structure of the class [which] allowed [them] to focus on learning the information” without being “bogged down” in work.  While a couple students enjoyed the guest lecturers, others noted that the professor was a superior lecturer.\r\n\r\nStudents universally praised the “fantastic” Professor David.  They felt he was a “great lecturer” and particularly appreciated his “great sense of humor” and “ability to stimulate interest in students.”  They felt that he was both “incredibly approachable” and “a leader in the field of health economics.”\r\n\r\nA few students noted that the course required “minimal work” outside of class as there was not any required reading.  However, there were three homework assignments that “took around 4 hours each to complete” and one that “took around 10 hours” according to one student. A couple students mentioned that the homework was either “confusing” or “poorly structured.”  A few others noted that the class required “straight memorization of the slides,” but one noted appreciatively that the midterm “can only help [a student’s] final grade.”  ECON 1 & ECON 2 OR BPUB 250 is required as a prerequisite, and it is recommended that students have knowledge of calculus and basic microeconomics.  Students who take this course cannot also take HCMG 202 (ECON 039) for further credit.\r\n", "num_students": 104, "path": "/courses/27532/sections/401/reviews/2995-GUY-DAVID", "instructor": {"path": "/instructors/2995-GUY-DAVID", "first_name": "GUY", "last_name": "DAVID", "id": "2995-GUY-DAVID", "name": "GUY DAVID"}, "num_reviewers": 99, "id": "27532-401-2995-GUY-DAVID"}]