[{"ratings": {"rAmountLearned": "2.03", "rDifficulty": "2.31", "rStimulateInterest": "2.34", "rRecommendMajor": "2.21", "rCourseQuality": "2.22", "rWorkRequired": "2.69", "rInstructorAccess": "2.86", "rReadingsValue": "1.55", "rRecommendNonMajor": "2.14", "rCommAbility": "2.59", "rInstructorQuality": "2.33"}, "section": {"name": "ANTHROPOLOGY AND CINEMA", "sectionnum": "401", "primary_alias": "ANTH-231-401", "path": "/courses/21262/sections/401", "id": "21262-401", "aliases": ["ANTH-231-401", "CINE-231-401"]}, "comments": "This course analyzes mass-market American films using traditional anthropological theories about symbolism, ritual, mythology, language, metaphor, narrative and discourse. The goal is to think of the movies as significant cultural artifacts that we use to make sense of the world rather than as just forms of entertainment or art. Through a study of popular American films and their related merchandise and cultural influences, we will also see how anthropology can be used to study contemporary cultures.&#8232;&#8232;&#8232;&#8232;Many students thoroughly enjoyed this course. While the class was “easy” at times, it was also very time consuming. One student described the course content as being “40% general anthropology and cultural learning, 40% case study, and 20% technology”. Even though it was sometimes difficult to grasp the connection between Walt Disney and anthropology, many students thought the class was “interesting” and “enjoyable”.&#8232;&#8232;&#8232;&#8232;Dr. Krasniewicz received mixed reviews from students. Though she was described as “compelling” during class, she moved through her powerpoints too quickly for some students. Her syllabus is extremely lengthy (about 15 pages), and she has many requirements for projects, which frustrated students. However, students said she is very “helpful” and willing to discuss outside of class.&#8232;&#8232;&#8232;&#8232;Many students thought the workload was heavy and too technologically based. One student wrote that the “class description is misleading”. There is a lot of animation required for an anthropology class and there are many guidelines for the final projects. The final includes a movie with a three page paper in addition to a final take home paper.", "num_students": 39, "path": "/courses/21262/sections/401/reviews/2851-LOUISE-KRASNIEWICZ", "instructor": {"path": "/instructors/2851-LOUISE-KRASNIEWICZ", "first_name": "LOUISE", "last_name": "KRASNIEWICZ", "id": "2851-LOUISE-KRASNIEWICZ", "name": "LOUISE KRASNIEWICZ"}, "num_reviewers": 36, "id": "21262-401-2851-LOUISE-KRASNIEWICZ"}]