[{"ratings": {"rAmountLearned": "2.95", "rDifficulty": "2.30", "rStimulateInterest": "2.58", "rRecommendMajor": "2.95", "rCourseQuality": "2.49", "rWorkRequired": "2.52", "rInstructorAccess": "2.61", "rReadingsValue": "2.34", "rRecommendNonMajor": "2.28", "rCommAbility": "2.95", "rInstructorQuality": "2.98"}, "section": {"name": "POLITICAL PSYCHOLOGY", "sectionnum": "001", "primary_alias": "PSYC-275-001", "path": "/courses/28076/sections/001", "id": "28076-001", "aliases": ["PSYC-275-001"]}, "comments": "This course will explore psychological approaches to understanding political beliefs, attitudes, and actions at the levels of both individual citizens and national leaders.  It will also explore the possibility that psychological science itself is not immune to the political debates swirling around it. Specific topics will include: the workings of belief systems (and their power to shape what we \"see\"), cognitive biases (and their power to cause miscalculations), sacred values and their role in stabilizing belief systems and social interaction, personality and ideology (the linkages between the personal and the political), and clashing conceptions of morality and distributive and corrective justice (striking variations among people in what they consider to be fair). \r\n\r\nThis course was described as “excellent” and “fantastic.” Students expressed the informative nature of the course, and that it was “complex.” One student “enjoyed the simulative nature of the discussion in class.” Sometimes the homework could be “ambiguous and confusing.” There are also “pop” debates in the class.\r\n\r\nDr. Tetlock is described as “very knowledgeable and intelligent individual” and students “really enjoyed the themes and overarching lessons that Professor Tetlock tried to instill within his students.” He is also “extremely dedicated and conscientious” and described as “approachable.\r\n\r\nWith regards to the course load, there were comments regarding “useless assignments,” such as the pop debates and class surveys. There is also a class participation component to the course. Much of the course work will be done outside of class. The prerequisite to this course is PSYC 001.", "num_students": 61, "path": "/courses/28076/sections/001/reviews/5521-PHILIP-E--TETLOCK", "instructor": {"path": "/instructors/5521-PHILIP-E--TETLOCK", "first_name": "PHILIP E.", "last_name": "TETLOCK", "id": "5521-PHILIP-E--TETLOCK", "name": "PHILIP E. TETLOCK"}, "num_reviewers": 48, "id": "28076-001-5521-PHILIP-E--TETLOCK"}]