[{"ratings": {"rAmountLearned": "3.11", "rDifficulty": "2.17", "rStimulateInterest": "2.89", "rRecommendMajor": "3.21", "rCourseQuality": "3.05", "rWorkRequired": "2.24", "rInstructorAccess": "2.50", "rReadingsValue": "2.90", "rRecommendNonMajor": "2.90", "rCommAbility": "2.93", "rInstructorQuality": "2.92"}, "section": {"name": "ENVT'L MGMT LAW & POL", "sectionnum": "401", "primary_alias": "LGST-815-401", "path": "/courses/27675/sections/401", "id": "27675-401", "aliases": ["LGST-815-401", "LGST-215-401"]}, "comments": "LGST 815 provides an introduction to environmental management with a focus on law and policy as a basic framework. The primary aim of the course is to give students a deeper practical sense of the important relationship between business and the natural environment and to think critically about how best to manage this relationship.\r\n\tMost students enjoyed the class and described it as “very informative.” One student felt he learned a great deal of environmental issues and structures as businesses and its role in the green movement. However, many students felt there were no incentives to read the papers, as there were only three major assignments. The majority of class was spent with guest lecturers, which most students thought were interesting and relevant to the topics covered.\r\n\tProfessor Orts was depicted as an “extremely knowledgeable and successful man” who was passionate about the class and was dedicated to helping students understand concepts. One student noted that Professor Orts was very approachable and was willing to meet whenever he could. He would also dedicate a portion of every class to questions.\r\n\tLGST815 is a Wharton course open to all students. One non-Wharton found the class to “provide valuable insight on environmental issues.” There are no prerequisites for this course.\r\n", "num_students": 38, "path": "/courses/27675/sections/401/reviews/717-ERIC-WILLS-ORTS", "instructor": {"path": "/instructors/717-ERIC-WILLS-ORTS", "first_name": "ERIC WILLS", "last_name": "ORTS", "id": "717-ERIC-WILLS-ORTS", "name": "ERIC WILLS ORTS"}, "num_reviewers": 37, "id": "27675-401-717-ERIC-WILLS-ORTS"}]