[{"ratings": {"rAmountLearned": "3.14", "rDifficulty": "3.54", "rStimulateInterest": "2.57", "rRecommendMajor": "3.41", "rCourseQuality": "2.95", "rWorkRequired": "3.24", "rInstructorAccess": "2.46", "rReadingsValue": "2.46", "rRecommendNonMajor": "1.86", "rCommAbility": "2.69", "rInstructorQuality": "2.90"}, "section": {"name": "FINANCIAL DERIVATIVES", "sectionnum": "001", "primary_alias": "FNCE-206-001", "path": "/courses/26061/sections/001", "id": "26061-001", "aliases": ["FNCE-206-001"]}, "comments": "The purpose of FNCE206 is to provide the student with the necessary skills to value and to employ options, futures, and related financial contracts. In order to provide a useful treatment of these topics in an environment that is changing rather rapidly, it is necessary to stress the fundamentals and to explore the topics at a technical level. The topics that will be covered include the valuation of futures contracts on stock indices, on commodities and Treasury instruments; the valuation of options; empirical evidence; strategies with respect to these assets; dynamic asset allocation strategies, of which portfolio insurance is an example; swaps; and the use (and misuse) of derivatives in the context of corporate applications. One-third of the course will be devoted to futures, a third to options, and a third to their applications. Many of the applications will be sprinkled along with the coverage of futures and options. The prerequisites are FNCE100 and STAT101. FNCE101 and STAT102 are recommended and can be taken concurrently.\r\n\r\nMany students reported that Financial Derivatives was an “extremely valuable class” and that it emphasizes fundamental understandings of the concepts extremely well. One student explained that “a lot of concepts were introduced in one short semester.”\r\n\r\nMany reported that Professor Ramaswamy was a “very approachable, experienced instructor” and had an impressive command of the subject material. Several students warned that he could be “verbose,” sometimes failing to stress the main teaching points. Some students also reported that Professor Ramaswamy tended to “talk faster and quieter” than other professors do during lecture. \r\n\r\nStudents recommend taking careful notes in this class to supplement the readings.", "num_students": 67, "path": "/courses/26061/sections/001/reviews/1854-KRISHNA-RAMASWAMY", "instructor": {"path": "/instructors/1854-KRISHNA-RAMASWAMY", "first_name": "KRISHNA", "last_name": "RAMASWAMY", "id": "1854-KRISHNA-RAMASWAMY", "name": "KRISHNA RAMASWAMY"}, "num_reviewers": 64, "id": "26061-001-1854-KRISHNA-RAMASWAMY"}]