{"coursehistories": {"path": "/coursehistories/5441"}, "description": "The success of entrepreneurial endeavors depends, even more so than in larger more bureaucratic organizations, on the ability to locate and manage talent effectively. Specifically, on the need to find the right people and keep them engaged in working on the organization's goals. We focus in this course on leading, building, and maintaining human assets in start-up and small, growing operations. The course is designed with several key components, these are: conceptual and practical readings relevant to the topic; case studies illustratng key concepts and issues; lecture on practical application and examples; and lastly every class will also feature a presentation by and conversation with an outside expert whose work is relevant to guiding or advising start-ups and fast-growing small firms. We will focus on the following objectives: identifying the talent needed to initiate and sustain an entrepreneurial endeavor; structuring human resource policies and corporate culture to prepare for and facilitate firm growth; assessing the human aspects of valuing entrepreneurial companies; and responding to conflict and organizational threats within nascent firms. \n\nThis course will apply recent research from strategic human resource management, personnel economics and organizational behavior to the practical issues of building and managing human assets in new ventures. \n\nFormat: Case discussion, guest speakers and lectures, active class participation, final project \n\n", "semester": "2013A", "name": "BLDG. HUM ASSETS: Building Human Assets", "reviews": {"path": "/courses/30644/reviews", "values": [{"ratings": {"rAmountLearned": "1.59", "rDifficulty": "1.14", "rTAQuality": "1.90", "rStimulateInterest": "1.50", "rRecommendMajor": "1.50", "rCourseQuality": "1.40", "rWorkRequired": "1.77", "rInstructorAccess": "2.68", "rReadingsValue": "1.82", "rRecommendNonMajor": "1.00", "rCommAbility": "2.05", "rInstructorQuality": "1.60"}, "section": {"name": "BLDG. HUM ASSETS: Building Human Assets", "sectionnum": "001", "primary_alias": "MGMT-816-001", "path": "/courses/30644/sections/001", "id": "30644-001", "aliases": ["MGMT-816-001"]}, "comments": "", "num_students": 45, "path": "/courses/30644/sections/001/reviews/6126-ERIC-J--NEWMAN", "instructor": {"path": "/instructors/6126-ERIC-J--NEWMAN", "first_name": "ERIC J.", "last_name": "NEWMAN", "id": "6126-ERIC-J--NEWMAN", "name": "ERIC J. NEWMAN"}, "num_reviewers": 25, "id": "30644-001-6126-ERIC-J--NEWMAN"}]}, "credits": null, "primary_alias": "MGMT-816", "path": "/courses/30644", "sections": {"path": "/courses/30644/sections", "values": [{"name": "BLDG. HUM ASSETS: Building Human Assets", "sectionnum": "001", "primary_alias": "MGMT-816-001", "path": "/courses/30644/sections/001", "id": "30644-001", "aliases": ["MGMT-816-001"]}]}, "id": 30644, "aliases": ["MGMT-816"]}