{"coursehistories": {"path": "/coursehistories/5229"}, "description": "For many people, the term \"bioethics\" denotes abstract philosophical questions about human cloning or the limits of genetic engineering technologies. Yet issues of bioethics and medical ethics arise everyday in the common situations of our lives, affecting our immediate health and well being and eventually that of the society around us. This seminar will examine this everyday bio/medical ethics from an ethnographic point of view. Topics include medical error, birth, death, population control, poverty, race global medical experimentation and corporate responsibility. We will read works by social scientists of medicine that chronicle ordinary people's struggles and the bioethics quandaries that accompany them, and in doing so will distinguish between the everyday moral experiences of people all over the world faced with difficult choices, and the ethical ideals to which they aspire. We will then ask: how can these perspectives be reconciled? When trying to reconcile these perspectives, how can we account for powerful dynamics of race, gender, class religion, and cultural difference that infuse everyday medical decision-making? And finally, how can we develop a code of ethics that takes these issues into account and is also fundamentally connected to the moral lives of the particular individuals who are affected? Is this even possible? \n\n", "semester": "2012C", "name": "ANTH & EVERYDAY BIOETHI", "reviews": {"path": "/courses/29112/reviews", "values": [{"ratings": {"rDifficulty": "2.38", "rStimulateInterest": "3.63", "rCourseQuality": "3.39", "rWorkRequired": "2.81", "rInstructorQuality": "3.44", "rCommAbility": "3.67", "rInstructorAccess": "3.56"}, "section": {"name": "ANTH & EVERYDAY BIOETHI", "sectionnum": "401", "primary_alias": "HSOC-249-401", "path": "/courses/29112/sections/401", "id": "29112-401", "aliases": ["HSOC-249-401", "ANTH-209-401"]}, "comments": "", "num_students": 18, "path": "/courses/29112/sections/401/reviews/5766-KATHERINE-MASON", "instructor": {"path": "/instructors/5766-KATHERINE-MASON", "first_name": "KATHERINE", "last_name": "MASON", "id": "5766-KATHERINE-MASON", "name": "KATHERINE MASON"}, "num_reviewers": 18, "id": "29112-401-5766-KATHERINE-MASON"}]}, "credits": null, "primary_alias": "HSOC-249", "path": "/courses/29112", "sections": {"path": "/courses/29112/sections", "values": [{"name": "ANTH & EVERYDAY BIOETHI", "sectionnum": "401", "primary_alias": "HSOC-249-401", "path": "/courses/29112/sections/401", "id": "29112-401", "aliases": ["HSOC-249-401", "ANTH-209-401"]}]}, "id": 29112, "aliases": ["HSOC-249", "ANTH-209"]}