{"coursehistories": {"path": "/coursehistories/5132"}, "description": "Most of the languages now spoken in Europe, along with some languages of Iran, India and central Asia, are thought to be descended from a single language known as Proto-Indo-European, spoken at least six thousand years ago, probably in a region extending from north of the Black Sea in modern Ukraine east through southern Russia. Speakers of Proto-Indo-European eventually populated Europe in the Bronze Age, and their societies formed the basis of the classical civilizations of Greece and Rome, as well as of the Celtic, Germanic and Slavic speaking peoples. What were the Proto-Indo-Europeans like? What did they believe about the world and their gods? How do we know? Reconstruction of the Proto-Indo-European language, one of the triumphs of comparative and historical linguistics in the 19th and 20th centuries, allows us a glimpse into the society of this prehistoric people. \n\nIn this seminar students will, through comparison of modern and ancient languages, learn the basis of this reconstruction -- the comparative method of historical linguistics -- as well as explore the culture and society of the Proto-Indo-Europeans and their immediate descendants. In addition, we will examine the pseudo-scientific basis of the myth of Aryan supremacy, and study the contributions of archaeological findings in determining the \"homeland\" of the Indo-Europeans. No prior knowledge of any particular language is necessary. This seminar should be of interest to students considering a major in linguistics, anthropology and archaeology, ancient history or comparative religion. (Also fulfills Cross-Cultural Analysis.) \n\n", "semester": "2010C", "name": "PROTO-INDO-EUROPEAN LANG: Proto-Indo-European Language and Society", "reviews": {"path": "/courses/23323/reviews", "values": [{"ratings": {"rAmountLearned": "2.20", "rDifficulty": "2.20", "rStimulateInterest": "1.60", "rRecommendMajor": "2.80", "rCourseQuality": "1.81", "rWorkRequired": "1.67", "rInstructorAccess": "2.87", "rReadingsValue": "1.33", "rRecommendNonMajor": "1.00", "rCommAbility": "2.47", "rInstructorQuality": "2.56"}, "section": {"name": "PROTO-INDO-EUROPEAN LANG: Proto-Indo-European Language and Society", "sectionnum": "301", "primary_alias": "LING-051-301", "path": "/courses/23323/sections/301", "id": "23323-301", "aliases": ["LING-051-301"]}, "comments": "", "num_students": 17, "path": "/courses/23323/sections/301/reviews/735-ROLF-NOYER", "instructor": {"path": "/instructors/735-ROLF-NOYER", "first_name": "ROLF", "last_name": "NOYER", "id": "735-ROLF-NOYER", "name": "ROLF NOYER"}, "num_reviewers": 16, "id": "23323-301-735-ROLF-NOYER"}]}, "credits": null, "primary_alias": "LING-051", "path": "/courses/23323", "sections": {"path": "/courses/23323/sections", "values": [{"name": "PROTO-INDO-EUROPEAN LANG: Proto-Indo-European Language and Society", "sectionnum": "301", "primary_alias": "LING-051-301", "path": "/courses/23323/sections/301", "id": "23323-301", "aliases": ["LING-051-301"]}]}, "id": 23323, "aliases": ["LING-051"]}