[{"ratings": {"rAmountLearned": "2.82", "rDifficulty": "1.96", "rStimulateInterest": "2.57", "rRecommendMajor": "3.33", "rCourseQuality": "2.87", "rWorkRequired": "1.98", "rInstructorAccess": "3.10", "rReadingsValue": "2.76", "rRecommendNonMajor": "2.86", "rCommAbility": "3.25", "rInstructorQuality": "3.15"}, "section": {"name": "EUROPE: 1890-1945", "sectionnum": "001", "primary_alias": "HIST-127-001", "path": "/courses/15896/sections/001", "id": "15896-001", "aliases": ["HIST-127-001"]}, "comments": "This course, designed for first and second year students, continues the history of modern Europe from the high point of Empire and world domination at the end of the nineteenth century to collapse and ruin in 1945. The grand societies and rich states which composed the European state system in 1890 destroyed themselves in these fifty-five years. As many as eighty million Russians, Germans, Poles, Yugoslavs, Greeks, Italians and other Europeans died in slave- labor camps, and six million Jews were systematically murdered. Europe\\'s flourishing Jewish community east of the Rhine was wiped out. On the 9th of May 1945, the day Nazi Germany surrendered, the once prosperous continent was a smoking ruin, covered by rubble, pock-marked by craters and full of miserable starving people. This course will try to explain how and why Europe committed suicide in such a horrific way. It will cover Fascism, Nazism, Stalinism, the two world wars, the great economic depression, and the Holocaust.\r\n\r\nStudents found the course material “straight-forward, yet still quite interesting.” They also appreciated the “fantastic primary readings” which “did a lot to deepen… understanding of the issues discussed during lecture.” The amount learned from this course was above average.\r\n\r\nStudents found Professor Mercer to be a “great professor” and a “top-tier lecturer,” able to communicate “a tremendous amount of course material in a short bi-weekly lecture class.” One student appreciated that he took the time to write extensive comments on essays and found him to be very accessible.\r\n\r\nThe difficulty of this course was relatively low. The work consisted of readings and essays. This course was recommended fairly strongly to majors and recommended, but less strongly, to non-majors.", "num_students": 59, "path": "/courses/15896/sections/001/reviews/4182-BEN-MERCER", "instructor": {"path": "/instructors/4182-BEN-MERCER", "first_name": "BEN", "last_name": "MERCER", "id": "4182-BEN-MERCER", "name": "BEN MERCER"}, "num_reviewers": 56, "id": "15896-001-4182-BEN-MERCER"}]