{"coursehistories": {"path": "/coursehistories/718"}, "description": "Method of separation of variables will be applied to solve the wave, heat, and Laplace equations. In addition, one or more of the following topics will be covered: qualitative properties of solutions of various equations (characteristics, maximum principles, uniqueness theorems), Laplace and Fourier transform methods, and approximation techniques. \n\n", "semester": "2010A", "name": "PARTIAL DIFFER EQUATIONS", "reviews": {"path": "/courses/26342/reviews", "values": [{"ratings": {"rAmountLearned": "2.85", "rDifficulty": "2.97", "rStimulateInterest": "3.24", "rRecommendMajor": "3.55", "rCourseQuality": "3.14", "rWorkRequired": "2.79", "rInstructorAccess": "3.76", "rReadingsValue": "2.12", "rRecommendNonMajor": "1.64", "rCommAbility": "3.36", "rInstructorQuality": "3.57"}, "section": {"name": "PARTIAL DIFFER EQUATIONS", "sectionnum": "001", "primary_alias": "MATH-425-001", "path": "/courses/26342/sections/001", "id": "26342-001", "aliases": ["MATH-425-001", "AMCS-525-001"]}, "comments": "In this class, the method of separation of variables is applied to solve the wave, heat, and Laplace equations. In addition, one or more of the following topics will be covered: qualitative properties of solutions of various equations (characteristics, maximum principles, uniqueness theorems), Laplace and Fourier transform methods, and approximation techniques. Prerequisite: MATH 241 or permission of instructor. Knowledge of PHYS 150-151 is helpful.\r\n\r\nMany students stated that they enjoyed this course. One student commented that “[this was] the best math course I’ve taken.” Other students thought it was “interesting,” “excellent, and “great.” One student commented that this course taught some “nice analysis tricks,” while another student stated that this course improved overall confidence as a mathematician for future studies. However, one student wrote that the “book is complex, and not very helpful.”\r\n\r\nStudents lauded Professor DeTurck’s teaching abilities. Students agreed “Dr. DeTurck's ability to make math logical and understandable is unparalleled,” leading one student to comment that Professor DeTurck was “unbelievably engaging” and makes mathematical concepts “clearer than any other instructor.” Another student explained that Professor DeTurck “is a fantastic lecturer, and he is optimistic and supportive of his students across the board,” which made the course easier and more enjoyable. \r\n\r\nOne student complained that the course was difficult for non-math majors because of the required competency in math. Another student wrote that this class is recommended for all science and engineering majors. One student explained that the midterms are roughly half theoretical and half computational and that they are “difficult, but fair.” One student mentioned that it is important to attend office hours if students wish to do well.", "num_students": 41, "path": "/courses/26342/sections/001/reviews/1555-DENNIS-M--DETURCK", "instructor": {"path": "/instructors/1555-DENNIS-M--DETURCK", "first_name": "DENNIS M.", "last_name": "DETURCK", "id": "1555-DENNIS-M--DETURCK", "name": "DENNIS M. DETURCK"}, "num_reviewers": 38, "id": "26342-001-1555-DENNIS-M--DETURCK"}]}, "credits": null, "primary_alias": "MATH-425", "path": "/courses/26342", "sections": {"path": "/courses/26342/sections", "values": [{"name": "PARTIAL DIFFER EQUATIONS", "sectionnum": "001", "primary_alias": "MATH-425-001", "path": "/courses/26342/sections/001", "id": "26342-001", "aliases": ["MATH-425-001", "AMCS-525-001"]}]}, "id": 26342, "aliases": ["MATH-425", "AMCS-525"]}