[{"ratings": {"rAmountLearned": "3.19", "rDifficulty": "3.19", "rStimulateInterest": "3.52", "rRecommendMajor": "3.78", "rCourseQuality": "3.27", "rWorkRequired": "3.41", "rInstructorAccess": "3.37", "rReadingsValue": "3.07", "rRecommendNonMajor": "2.70", "rCommAbility": "3.74", "rInstructorQuality": "3.57"}, "section": {"name": "RISE & FALL OF RUSS EMP", "sectionnum": "401", "primary_alias": "HIST-048-401", "path": "/courses/23201/sections/401", "id": "23201-401", "aliases": ["HIST-048-401", "RUSS-048-401"]}, "comments": "How and why did Russia become the center of the world's largest empire, a single state encompassing eleven time zones and over a hundred ethnic groups? To answer this question, this course explores the rise of a distinct political culture, beginning in medieval Muscovy, to its transformation under the impact of a prolonged encounter with European civilization, and the various attempts to re-form Russia from above and below prior to the Revolution of 1917. Main themes include the facade vs. the reality of central authority, the intersection of foreign and domestic issues, the development of a radical intelligentsia, and the tension between empire and nation. \r\n\r\n&#8232;Students thought that this class was very enjoyable. They found the assigned readings, although plentiful, to be interesting. Students especially liked the literary pieces by authors like Tolstoy, Chekhov, and Dostoevsky that were included. Students felt that they learned a lot from this class and several students even claimed that it was one of the best courses that they have taken at Penn. &#8232;\r\n\r\nStudents found Professor Holquist to be “enthusiastic,” “passionate,” and “talented.” Several students even called Professor Holquist “one of the best professors” that they have had at Penn. Students also praised Professor Holquist for being “knowledgeable and genuinely interested” and “effective.” Students enjoyed his integration of Russian artistic and literary works, and one student commented, “the professor's incorporation of literature and culture beyond just historical events made this class one of the most well rounded and extensive history course I have ever taken.” Another student praised that Professor Holquist, “lectures tell a story of Russian government, culture, industry, war, etc... in a truly artistic and impressive manner.” As far as teaching style, one student expressed, “Professor Holquist slides were never exhausting, which kept me interested and on my toes to pay attention in order not to miss anything important.” Although he refused to give out his slides, Professor Holquist “provided an outline before each lecture, which helped facilitate note taking.” According to the students, Professor Holquist was very accessible. One student wrote, “I have to credit him for always being available to talk, either after class or during office hours. If there was ever a time I was unsure of anything, no matter how trivial, I knew I could ask him without being patronized.” Another student praised Professor Holquist for “a concerted effort to get every member of the class to participate, which lends the course a comfortable, seminar aura.” The students admired Professor Holquist’s dedication to feedback. One student mentioned the fact that Professor Holquist takes the time to make well-thought comments on every student’s paper. &#8232;&#8232;This course has no prerequisites and is open to Freshmen and Upperclassmen. Several students noted that the workload, especially the amount of reading material, is a bit challenging. One student estimated, “about 60 pages per lecture,” and then explained that Professor Holquist randomly selects students to answer these questions as a part of the 20% participation grade. Students praised Professor Holquist for his fairness in grading. In a particular, a student wrote “Prof. Holquist has reasonably high expectations for the memorization, understanding, and synthesis of course material but recognizes the difficulty of memorizing the majority of the material.” The course fulfills the History & Tradition requirement. The course is highly recommended to majors and non-majors.\r\n", "num_students": 37, "path": "/courses/23201/sections/401/reviews/3325-PETER-HOLQUIST", "instructor": {"path": "/instructors/3325-PETER-HOLQUIST", "first_name": "PETER", "last_name": "HOLQUIST", "id": "3325-PETER-HOLQUIST", "name": "PETER HOLQUIST"}, "num_reviewers": 31, "id": "23201-401-3325-PETER-HOLQUIST"}]