{"coursehistories": {"path": "/coursehistories/2555"}, "description": "This course investigates methods of economic analysis for decision making among alternative courses of action in engineering applications. Topics include: cost-driven design economics, break-even anlaysis, money-time relationships, rates of return, cost estimation, depreciation and taxes, foreign exchange rates, life cycle analysis, benefit-cost ratios, risk analysis, capital financing and allocation, and financial statement analysis. Case studies apply these topics to actual engineering problems. \n\n", "semester": "2012A", "name": "ENGINEERING ECONOMICS", "reviews": {"path": "/courses/27368/reviews", "values": [{"ratings": {"rAmountLearned": "3.53", "rDifficulty": "3.00", "rStimulateInterest": "3.19", "rRecommendMajor": "3.39", "rCourseQuality": "3.35", "rWorkRequired": "3.71", "rInstructorAccess": "2.98", "rReadingsValue": "3.08", "rRecommendNonMajor": "3.06", "rCommAbility": "3.43", "rInstructorQuality": "3.58"}, "section": {"name": "ENGINEERING ECONOMICS", "sectionnum": "401", "primary_alias": "ESE-400-401", "path": "/courses/27368/sections/401", "id": "27368-401", "aliases": ["ESE-400-401", "ESE-540-401"]}, "comments": "This course investigates methods of economic analysis for decision making among alternative courses of action in engineering applications.  Topics include: cost-driven design economics, break-even analysis, money-time relationships, rates of return, cost estimation, depreciation and taxes, foreign exchange rates, life cycle analysis, benefit-cost ratios, risk analysis, capital financing and allocation, and financial statement analysis. Case studies apply these topics to actual engineering problems.\r\n\r\nStudents found this class a demanding course that covered a lot of material very quickly, but also found that \"the information was useful and enabled engineers to engage in a low-level conversation of business dynamics.\" Students noted that there was high volume of work that included case studies, homework assignment, and weekly quizzes that increased the difficulty of the course. But overall, students enjoyed this class and found it very informative.\r\n\r\nStudents found Prof. Cassel \"highly organized\" and noted that the professor \"communicates material in an extraordinary way.\" Students also noted that Prof. Cassel is able to \"make the class interesting for the entire three hours.\"  Prof. Cassel was also willing to print out the lecture slides for students who would want them.\r\n\r\nSome students the class difficult because they \"found the case studies to be challenging at times\" and coupling them with the weekly quizzes and homework and made it more difficult to understanding the material in depth. There are no prerequisites but it is required of students to know differential calculus.\r\n", "num_students": 102, "path": "/courses/27368/sections/401/reviews/317-THOMAS-A--CASSEL", "instructor": {"path": "/instructors/317-THOMAS-A--CASSEL", "first_name": "THOMAS A.", "last_name": "CASSEL", "id": "317-THOMAS-A--CASSEL", "name": "THOMAS A. CASSEL"}, "num_reviewers": 102, "id": "27368-401-317-THOMAS-A--CASSEL"}]}, "credits": null, "primary_alias": "ESE-400", "path": "/courses/27368", "sections": {"path": "/courses/27368/sections", "values": [{"name": "ENGINEERING ECONOMICS", "sectionnum": "401", "primary_alias": "ESE-400-401", "path": "/courses/27368/sections/401", "id": "27368-401", "aliases": ["ESE-400-401", "ESE-540-401"]}]}, "id": 27368, "aliases": ["ESE-400", "ESE-540"]}