[{"ratings": {"rAmountLearned": "3.10", "rDifficulty": "2.49", "rStimulateInterest": "3.20", "rRecommendMajor": "3.76", "rCourseQuality": "3.26", "rWorkRequired": "2.42", "rInstructorAccess": "3.61", "rReadingsValue": "2.74", "rRecommendNonMajor": "2.71", "rCommAbility": "3.60", "rInstructorQuality": "3.48"}, "section": {"name": "ABNORMAL PSYCHOLOGY", "sectionnum": "001", "primary_alias": "PSYC-162-001", "path": "/courses/25033/sections/001", "id": "25033-001", "aliases": ["PSYC-162-001"]}, "comments": "Psychology 162 explores the concepts of normality, abnormality, and psychopathology. There are three main areas in which different psychological disorders are studied: symptom syndromes, theory, and research in psychopathology and psychotherapy. The different psychological theory approaches are used to look at disorders in a comprehensive way and various treatment suggestions for each type of disorder is given. \r\n\r\nStudents agreed that this course was well organized and stimulating. Many thought the class was informative and superior to many other classes because the concepts learned could actually be used in a clinical psychology context, both in diagnosis and treatment. The material is sometimes difficult to master because of the sheer amount of information, but students on the whole reported that the class was highly engaging and it was not difficult to study the material. The only consistent complaint about this course was that the exams were quite difficult. Another student mentioned that they would have liked more time dedicated to discussion as well. \r\n\r\nProfessor Ruscio was unanimously liked. She was praised for being extremely interesting to listen to and students loved her use of different media clips to demonstrate what she was discussing. In addition, she was referred to as kind, brilliant, and intelligent, and “able to articulate complex and lengthy material.” Professor Ruscio cares a lot about her students and was very available outside of class. Many students commented that her office hours were very worthwhile. \r\n\r\nThe workload for this class is a bit heavy, as there is intense studying from the textbook and notes required to do well on exams. Many students found it generous and helpful that Professor Ruscio provided extremely detailed study guides for each exam. The exams can be a bit tricky so studying hard is essential. However, there was agreement that the class was well worth the work because many students claim it to be “one of the best classes” at Penn. The class is recommended for anyone with an interest in abnormal psychology, majors or non-majors alike. The only prerequisite is PSYC 001. \r\n", "num_students": 85, "path": "/courses/25033/sections/001/reviews/4208-AYELET-MERON-RUSCIO", "instructor": {"path": "/instructors/4208-AYELET-MERON-RUSCIO", "first_name": "AYELET MERON", "last_name": "RUSCIO", "id": "4208-AYELET-MERON-RUSCIO", "name": "AYELET MERON RUSCIO"}, "num_reviewers": 75, "id": "25033-001-4208-AYELET-MERON-RUSCIO"}, {"ratings": {"rAmountLearned": "2.55", "rDifficulty": "2.48", "rStimulateInterest": "2.00", "rRecommendMajor": "2.90", "rCourseQuality": "2.32", "rWorkRequired": "2.24", "rInstructorAccess": "2.33", "rReadingsValue": "2.65", "rRecommendNonMajor": "2.19", "rCommAbility": "2.24", "rInstructorQuality": "2.14"}, "section": {"name": "ABNORMAL PSYCHOLOGY", "sectionnum": "601", "primary_alias": "PSYC-162-601", "path": "/courses/25033/sections/601", "id": "25033-601", "aliases": ["PSYC-162-601"]}, "comments": "Psychology 162 explores the concepts of normality, abnormality, and psychopathology. There are three main areas in which different psychological disorders are studied: symptom syndromes, theory, and research in psychopathology and psychotherapy. The different psychological theory approaches are used to look at disorders in a comprehensive way and various treatment suggestions for each type of disorder is given. \r\n\r\nStudents were in agreement that the course was interesting and the material stimulating. The course relied heavily on the textbook and did not really expand further from what was presented in readings, though this did help focus studying. The lectures and the readings were organized in a clear manner according to the syllabus so students “found it easy to organize study materials.” The course was overall thought to be “well taught” and enjoyable.\r\n\r\nProfessor Boyd received mixed reviews. Overall, she was thought to know the material very well and was able to communicate it clearly. However, she was also said to be not as engaging as students would have liked. The lecture slides are taken straight out of the text, so there is not much expansion off of the book. Professor Boyd also stuck to a strict grading scale that arguably did not take into account “progress or effort.” \r\n\r\nAbnormal psychology comes recommended to anyone with an interest. There is a large amount of studying of the text required for exams and a couple short writing assignments. The class moves quite fast, but contains such interesting subject matter that students enjoyed taking it. The only prerequisite is PSYC 001. \r\n", "num_students": 25, "path": "/courses/25033/sections/601/reviews/5864-RHONDA-C--BOYD", "instructor": {"path": "/instructors/5864-RHONDA-C--BOYD", "first_name": "RHONDA C.", "last_name": "BOYD", "id": "5864-RHONDA-C--BOYD", "name": "RHONDA C. BOYD"}, "num_reviewers": 22, "id": "25033-601-5864-RHONDA-C--BOYD"}]