[{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "2.73", "rStimulateInterest": "3.32", "rRecommendMajor": "3.68", "rCourseQuality": "3.44", "rWorkRequired": "1.95", "rInstructorAccess": "3.73", "rReadingsValue": "2.64", "rRecommendNonMajor": "1.64", "rCommAbility": "3.59", "rInstructorQuality": "3.63"}, "section": {"name": "ACTUARIAL STATISTICS", "sectionnum": "401", "primary_alias": "INSR-253-401", "path": "/courses/24598/sections/401", "id": "24598-401", "aliases": ["INSR-253-401", "STAT-453-401", "STAT-853-401", "INSR-833-401"]}, "comments": "*Insurance 253 covers models for insurer’s losses and applications of Markov chains, Poisson processes, including extensions such as non-homogeneous, compound, and mixed Poisson processes are studied in detail. The compound model is then used to establish the distribution of losses. An extensive section on Markov chains provides the theory to forecast future states of the process, as well as numerous applications of Markov chains to insurance, finance, and genetics. The course is abundantly illustrated by examples from the insurance and finance literature. \r\n\r\nSome students described the concepts in this course as complicated, yet they claimed that the superb teaching style of Professor Lemaire made them manageable.  The material covered is crucially relevant to a major and one student describes the content as a  “good complement” to the other statistics classes taken in the past.  The second half of the course, according to another student, “brought better variety” as far as content and research topics are concerned.\r\n\r\nA majority of students praised Professor Lemaire and his teaching style.  One student even claimed “Professor Lemaire is by far the best statistics professor at Penn,” noting that “his ability to communicate complicated concepts is excellent.”  Another commended Professor Lemaire on his ability to incorporate his “wealth of personal experience” into presenting relevant material for the course.  A third mentioned that Professor Lemaire “really does care about all of the students in his class and his actuarial program,” attesting to the fact that he is the “main reason why the actuarial program at Penn is great.”  Some students did note that there was sometimes a “lack of interaction with the class,” but others lauded Professor Lemaire’s ability to “communicate complicated concepts.”\r\n\r\nWhile most of the students taking the course are future actuaries, other students interested in applications of statistics may discover many fascinating applications of stochastic processes and Markov chains in class.  It is highly recommended for those studying Insurance and Risk Management, which was recently merged with Business and Public Policy under the new department, Business Economics and Public Policy. Students believed that the course may be of interest to non-majors as well.  Students found the workload reasonable, and one student noted that the exams did require active studying but the “exams themselves were not very tricky if effort was placed into learning the material.” Pre-requisites include Math 104, Math 114, Stat 430, and Stat 431.\r\n\r\n\r\n*This review is based on only 4 student comments\r\n", "num_students": 30, "path": "/courses/24598/sections/401/reviews/675-JEAN-H--LEMAIRE", "instructor": {"path": "/instructors/675-JEAN-H--LEMAIRE", "first_name": "JEAN H.", "last_name": "LEMAIRE", "id": "675-JEAN-H--LEMAIRE", "name": "JEAN H. LEMAIRE"}, "num_reviewers": 29, "id": "24598-401-675-JEAN-H--LEMAIRE"}]