[{"ratings": {"rAmountLearned": "2.24", "rDifficulty": "2.50", "rStimulateInterest": "1.62", "rRecommendMajor": "2.24", "rCourseQuality": "2.13", "rWorkRequired": "2.79", "rInstructorAccess": "2.17", "rReadingsValue": "1.54", "rRecommendNonMajor": "2.03", "rCommAbility": "2.21", "rInstructorQuality": "2.09"}, "section": {"name": "RENEW ENERGY&IT'S IMPACT", "sectionnum": "401", "primary_alias": "EAS-402-401", "path": "/courses/25876/sections/401", "id": "25876-401", "aliases": ["EAS-402-401", "EAS-502-401"]}, "comments": "\r\nThis course introduces students to the major aspects of renewable energy, with its foundations in technology, association to economics, and impacts on ecology and society. This introduction is intended both for general education and awareness and for preparation for careers related to this field. The course spans from basic principles to applications. A review of solar, wind, biomass, hydroelectric, geothermal energy, and prospects for future energy systems such as renewable power generation in space.\r\n\r\nStudents found the course to be a good overview of all the major types of renewable energy sources. However, they expressed concerns about the lack of scientific and quantitative content in the course. Some students did find the lecture style a bit dull.\r\n\r\nStudents found Professor Lior to be very knowledgeable in his field, but wished for more enthusiasm.\r\n\r\nStudents found the assignments for this course to be extremely excessive, especially in the second half. Students also found the homework assignments to be incredibly frustrating, since “they have very little connection to the lecture materials and they are too difficult for the course”. This course is targeted toward any undergraduate and graduate university student interested in renewable energy and its impact, preferably at the upper level undergraduate and non-engineering graduate level of maturity. ", "num_students": 40, "path": "/courses/25876/sections/401/reviews/776-NOAM-LIOR", "instructor": {"path": "/instructors/776-NOAM-LIOR", "first_name": "NOAM", "last_name": "LIOR", "id": "776-NOAM-LIOR", "name": "NOAM LIOR"}, "num_reviewers": 34, "id": "25876-401-776-NOAM-LIOR"}]