[{"ratings": {"rAmountLearned": "2.74", "rDifficulty": "3.43", "rStimulateInterest": "2.87", "rRecommendMajor": "3.15", "rCourseQuality": "2.57", "rWorkRequired": "3.12", "rInstructorAccess": "2.83", "rReadingsValue": "2.63", "rRecommendNonMajor": "1.34", "rCommAbility": "2.69", "rInstructorQuality": "2.96"}, "section": {"name": "MATH FOUND COMP SCI", "sectionnum": "001", "primary_alias": "CIS-160-001", "path": "/courses/24165/sections/001", "id": "24165-001", "aliases": ["CIS-160-001"]}, "comments": "This course introduces proof principles and logics, functions and relations,\r\ninduction principles, combinatorics and graph theory, as well as a rigorous grounding in\r\nwriting and reading mathematical proofs.\r\nStudents stated that they learned “interesting and thought-provoking topics” in\r\nthis course. Students stated that this was “overall, this is a math course with computer\r\nscience applicability” that teach you to “think about things in different ways.” One\r\nstudent stated, “this is a great course for anyone who wants to learn about proofs and\r\nlogic.” Students complained that this “course needs a textbook” and that “the course\r\nneeds a reference written from a perspective that is not the professor's.” Students also\r\ncomplained about Professor Mintz's handouts of paper copies of homework since “Handouts and\r\npaper assignments are annoying and can often get lost” and “refusing to post assignments\r\nonline.” Multiple students stated that they desired more online access for this course.\r\nStudents wished TA’s were more accessible.\r\nStudents universally praised Professor Mintz as “brilliant’ and “very eager to teach.”\r\nOne student suggested that “this class could use a recitation with smaller groups” because\r\nalthough Professor “Mintz is an excellent professor, some people are afraid to ask what would\r\nbe considered ‘dumb’ questions in a large lecture.” Professor Mintz did not post office hours on his\r\nwebsite, but students reported that Professor Mintz as extremely willing and flexible to meet if you\r\nemailed him directly. Students complained about the lack of TA office hours, and the\r\nfact that the only way to communicate with them most of the time was through email.\r\nThis class is required for computer science majors and computer science minors.\r\nIt is usually taken freshman or sophomore year for computer science majors, but older\r\nstudents often take this class to gain their computer science minor. Students universally\r\nfound this course to be “extremely fast-paced” and “challenging.” Students mentioned a\r\nhigh workload with “23 difficult problem sets, 3 midterm exams, and 9 quizzes.”\r\nStudents highly recommended attending review sessions for high grades on the quizzes\r\nand the exams. Students said this course was “very difficult” but “very rewarding if you\r\ntake the time.”", "num_students": 118, "path": "/courses/24165/sections/001/reviews/304-MAX-MINTZ", "instructor": {"path": "/instructors/304-MAX-MINTZ", "first_name": "MAX", "last_name": "MINTZ", "id": "304-MAX-MINTZ", "name": "MAX MINTZ"}, "num_reviewers": 106, "id": "24165-001-304-MAX-MINTZ"}]