[{"ratings": {"rAmountLearned": "2.48", "rDifficulty": "3.58", "rStimulateInterest": "2.19", "rRecommendMajor": "2.62", "rCourseQuality": "2.25", "rWorkRequired": "3.19", "rInstructorAccess": "2.16", "rReadingsValue": "2.13", "rRecommendNonMajor": "0.69", "rCommAbility": "2.27", "rInstructorQuality": "2.43"}, "section": {"name": "NUM. METHODS FOR MACRO", "sectionnum": "001", "primary_alias": "ECON-242-001", "path": "/courses/15596/sections/001", "id": "15596-001", "aliases": ["ECON-242-001"]}, "comments": "This course covers topics in macroeconomics. It studies how household decision-making and government politics and interventions determine macroeconomic aggregates. There will be an emphasis on developing and applying economic models. &#8232;Course content was based on popular macroeconomic models and related papers in order to teach students how to use numerical methods to solve macroeconomic problems.\r\nStudents commented that concepts, models, and papers presented in class are “fascinating.” They “learned a lot” in this “great course.” However, the course’s emphasis on Matlab (a programming language that is not taught in the class) made assignments “tough” for those who were unfamiliar with it, because programming comprised much of the exams. Those who did have experience programming found the use of Matlab in an economic context “interesting” and “valuable,” citing assignments as “difficult,” but “rewarding.”&#8232;&#8232;\r\nStudents described Professor Greenwood as “a genius” and “an excellent professor.” He made the content “incredibly interesting” and was “very open to discussing the material both inside and outside of the classroom.” Some felt that he did not present enough specific examples of the material, but rather explained it all in theory. Students were troubled by his refusal to answer questions during the exam period, as well as his failure to return exams or distribute solutions, which made it difficult to learn from past errors and improve.\r\nThis course is recommended to students considering graduate studies in economics, as evidenced from the prerequisites. This course is difficult and “not for the faint of heart.” Exams took many students “over 20 hours each.” The amount of work required and previous knowledge of Matlab were described as “too much,” leading students to claim it “should be a 300-level class or honor’s thesis” rather than 200-level. Matlab programming language created a “considerable obstacle for students with no background in computer programming.” This led to a skewed grade distribution, with a “disparity between grades of those who can program and those who can’t.”", "num_students": 31, "path": "/courses/15596/sections/001/reviews/4300-JEREMY-GREENWOOD", "instructor": {"path": "/instructors/4300-JEREMY-GREENWOOD", "first_name": "JEREMY", "last_name": "GREENWOOD", "id": "4300-JEREMY-GREENWOOD", "name": "JEREMY GREENWOOD"}, "num_reviewers": 29, "id": "15596-001-4300-JEREMY-GREENWOOD"}]