{"coursehistories": {"path": "/coursehistories/1788"}, "description": "This course introduces students to advanced study in econometrics, with an emphasis on methods used in microeconomic applications and in evaluating the effects of social interventions. The course begins with an overview of topics in linear algebra, with a review of important concepts in statistics, and with a review of the assumptions of the classical linear model and of ways of dealing with standard violations of these assumptions. After this review, we cover methods for handling limited dependent variables, which often arise in practical situations such as in forecasting the demand for a new good or modeling labor supply. In addition, we will cover maximum likelihood estimators, and flexible semiparametric and nonparametric estimation methods. \n\nThe second part of the course will focus on applications of econometrics to the field of program evaluation. Students will learn about randomized and nonexperimental methods of estimating treatment effects. These methods are broadly applicable to many fields, such as in economics, biology, medicine, and education. Students will learn to distinguish different kinds of treatment effects, to identify potential sources of biases and to understand the assumptions that underlie different estimation approaches. We will discuss regression-based estimators, matching estimators, model-based estimators, and local treatment effect estimators. We will also cover dummy endogenous variable models and switching regression models. \n\n", "semester": "2004A", "name": "TOPICS IN ECONOMETRICS", "reviews": {"path": "/courses/6382/reviews", "values": [{"ratings": {"rAmountLearned": "3.47", "rDifficulty": "3.00", "rStimulateInterest": "2.74", "rRecommendMajor": "3.42", "rCourseQuality": "3.05", "rWorkRequired": "2.32", "rInstructorAccess": "3.74", "rReadingsValue": "2.00", "rRecommendNonMajor": "1.37", "rCommAbility": "3.16", "rInstructorQuality": "3.47"}, "section": {"name": "TOPICS IN ECONOMETRICS", "sectionnum": "001", "primary_alias": "ECON-115-001", "path": "/courses/6382/sections/001", "id": "6382-001", "aliases": ["ECON-115-001"]}, "comments": "", "num_students": 26, "path": "/courses/6382/sections/001/reviews/345-PETRA-E--TODD", "instructor": {"path": "/instructors/345-PETRA-E--TODD", "first_name": "PETRA E.", "last_name": "TODD", "id": "345-PETRA-E--TODD", "name": "PETRA E. TODD"}, "num_reviewers": 19, "id": "6382-001-345-PETRA-E--TODD"}]}, "credits": null, "primary_alias": "ECON-115", "path": "/courses/6382", "sections": {"path": "/courses/6382/sections", "values": [{"name": "TOPICS IN ECONOMETRICS", "sectionnum": "001", "primary_alias": "ECON-115-001", "path": "/courses/6382/sections/001", "id": "6382-001", "aliases": ["ECON-115-001"]}]}, "id": 6382, "aliases": ["ECON-115"]}