{"coursehistories": {"path": "/coursehistories/570"}, "description": "Out of an obscure, backward empire, the Soviet Union emerged to become the great political laboratory of the twentieth century. This course will trace the roots of the world's first socialist society and its attempts to recast human relations and human nature itself. Topics include the origins of the Revolution of 1917, the role of ideology in state policy and everyday life, the Soviet Union as the center of world communism, the challenge of ethnic diversity, and the reasons for the USSR's sudden implosion at the end of the century.Focusing on politics, society, culture, and their interaction, we will examine the rulers (from Lenin to Gorbachev) as well as the ruled (peasants, workers, and intellectuals; Russians and non-Russians). The course will feature discussions of selected texts, including primary sources in translation. \n\n", "semester": "2011A", "name": "THE SOVIET CENT 1917-91", "reviews": {"path": "/courses/21844/reviews", "values": [{"ratings": {"rAmountLearned": "3.34", "rDifficulty": "2.49", "rStimulateInterest": "3.44", "rRecommendMajor": "3.75", "rCourseQuality": "3.43", "rWorkRequired": "2.77", "rInstructorAccess": "3.46", "rReadingsValue": "3.04", "rRecommendNonMajor": "3.10", "rCommAbility": "3.65", "rInstructorQuality": "3.58"}, "section": {"name": "THE SOVIET CENT 1917-91", "sectionnum": "401", "primary_alias": "HIST-049-401", "path": "/courses/21844/sections/401", "id": "21844-401", "aliases": ["HIST-049-401", "RUSS-049-401"]}, "comments": "Out of an obscure, backward empire, the Soviet Union emerged to become the great political laboratory of the twentieth century. This course traces the roots of the world's first socialist society and its attempts to recast human relations and human nature itself. Topics include the origins of the Revolution of 1917, the role of ideology in state policy and everyday life, the Soviet Union as the center of world communism, the challenge of ethnic diversity, and the reasons for the USSR's sudden implosion at the end of the century. Focusing on politics, society, culture, and their interaction, students examine the rulers (from Lenin to Gorbachev) as well as the ruled (peasants, workers, and intellectuals; Russians and non-Russians). The course also features discussions of selected texts, including primary sources in translation. Students must write a short essay and a long final essay as well as take two exams. &#8232;&#8232;The general response to this course was very positive. Lectures were interesting and very informative and the content was stimulating both for the professor and the students. Despite being an introductory class, students found it to be very informative. &#8232;&#8232;Professor Nathans was praised by students for his knowledge, his enthusiasm, and his ability to inspire interest in others. Students described Professor Nathans as “excellent,” “amazing,” and “talented.” Although it was not necessary to attend all lectures, most students came every day excited for Professor Nathans’ enthusiasm. &#8232;&#8232;Due to the popularity of this course, all students recommend it to anyone that may have an interest in the Soviet Union and its history. This course is not geared towards only history majors. This course was agreed to be one of the best classes that students have taken at Penn and a great history course for anyone interested in the subject.", "num_students": 65, "path": "/courses/21844/sections/401/reviews/1492-BENJAMIN-NATHANS", "instructor": {"path": "/instructors/1492-BENJAMIN-NATHANS", "first_name": "BENJAMIN", "last_name": "NATHANS", "id": "1492-BENJAMIN-NATHANS", "name": "BENJAMIN NATHANS"}, "num_reviewers": 56, "id": "21844-401-1492-BENJAMIN-NATHANS"}]}, "credits": null, "primary_alias": "HIST-049", "path": "/courses/21844", "sections": {"path": "/courses/21844/sections", "values": [{"name": "THE SOVIET CENT 1917-91", "sectionnum": "401", "primary_alias": "HIST-049-401", "path": "/courses/21844/sections/401", "id": "21844-401", "aliases": ["HIST-049-401", "RUSS-049-401"]}]}, "id": 21844, "aliases": ["HIST-049", "RUSS-049"]}