{"coursehistories": {"path": "/coursehistories/4537"}, "description": "This is an introductory course to Computer Vision and Computational Photography. This course will explore three topics: 1) image morphing, 2) image matching and stitching, and 3) image recognition. This course is intended to provide a hands-on experience with interesting things to do on images/videos. The world is becoming image-centric. Cameras are now found everywhere, in our cell phones, automobiles, even in medical surgery tools. Computer vision technology has led to latest innovations in areas such as Hollywood movie production, medical diagnosis, biometrics, and digital library. \n\n", "semester": "2010C", "name": "COMP VISION&CMPTNL PHOTO", "reviews": {"path": "/courses/22847/reviews", "values": [{"ratings": {"rAmountLearned": "2.61", "rDifficulty": "2.51", "rStimulateInterest": "3.03", "rRecommendMajor": "3.00", "rCourseQuality": "2.87", "rWorkRequired": "2.86", "rInstructorAccess": "3.11", "rReadingsValue": "2.28", "rRecommendNonMajor": "2.00", "rCommAbility": "2.84", "rInstructorQuality": "2.92"}, "section": {"name": "COMP VISION&CMPTNL PHOTO", "sectionnum": "001", "primary_alias": "CIS-581-001", "path": "/courses/22847/sections/001", "id": "22847-001", "aliases": ["CIS-581-001"]}, "comments": "This main topics for this course are as follows: robot actuators and sensors; Link and controller models and computer simulations; position and force control principles; multiple-link interactions; system definition, design, and integration; control policies; fine-motion position and force control.\r\n\r\nMany students described the course content as interesting and useful. One student felt that the class felt “like a technician’s course in image processing,” lacking the “necessary mathematical rigor required for a graduate level computer vision course”. However, another pointed out that it accommodated people of different backgrounds and skill levels as best as it could. Some students felt that projects were often confusing, and many felt that there should have been “more of a focus in class” on them.\r\n\r\nStudents were generally pleased with Professor Shi, describing him as “lively” and a “great teacher and person,” though a few did not really understand the concepts he presented in class. Some thought that his slides were disorganized and needed to be updated, causing one student to go “completely in the wrong direction on the final project for several days.” A few students did not like the TAs’ random office hours and suggested that more TAs should have been hired for the course.\r\n\r\nThe course is project-based. One student pointed out that the midterm only “covered a tiny subset of what was taught in class.”\r\n", "num_students": 47, "path": "/courses/22847/sections/001/reviews/2074-JIANBO-SHI", "instructor": {"path": "/instructors/2074-JIANBO-SHI", "first_name": "JIANBO", "last_name": "SHI", "id": "2074-JIANBO-SHI", "name": "JIANBO SHI"}, "num_reviewers": 39, "id": "22847-001-2074-JIANBO-SHI"}]}, "credits": null, "primary_alias": "CIS-581", "path": "/courses/22847", "sections": {"path": "/courses/22847/sections", "values": [{"name": "COMP VISION&CMPTNL PHOTO", "sectionnum": "001", "primary_alias": "CIS-581-001", "path": "/courses/22847/sections/001", "id": "22847-001", "aliases": ["CIS-581-001"]}]}, "id": 22847, "aliases": ["CIS-581"]}