{"coursehistories": {"path": "/coursehistories/924"}, "description": "This lecture course introduces students to the subfield of international security or strategic studies. In order to grasp the usefulness of the theoretical ideas presented in readings and lectures, abstract concepts are linked with a study of the national security policies states have adopted in the decades following World War II. Topics include current debates about nuclear proliferation, terrorism, the Iraq war, Europe's changing international role, the rise of China, Asian \"flashpoints\" (Korea, the Taiwan Strait), and US secruity policy for the 21st century - considering some of the main strategic alternatives to the US as well as their implications for the types of forces deployed (the impact of the \"revolution in military affairs,\" the future of missile defense, and the economic burden to be shouldered). \n\n", "semester": "2008A", "name": "INTERNATIONAL SECURITY", "reviews": {"path": "/courses/20725/reviews", "values": [{"ratings": {"rAmountLearned": "3.41", "rDifficulty": "2.63", "rStimulateInterest": "3.49", "rRecommendMajor": "3.68", "rCourseQuality": "3.46", "rWorkRequired": "2.44", "rInstructorAccess": "3.20", "rReadingsValue": "2.99", "rRecommendNonMajor": "3.15", "rCommAbility": "3.78", "rInstructorQuality": "3.77"}, "section": {"name": "INTERNATIONAL SECURITY", "sectionnum": "001", "primary_alias": "PSCI-151-001", "path": "/courses/20725/sections/001", "id": "20725-001", "aliases": ["PSCI-151-001"]}, "comments": "This lecture course introduces students to the subfield of international security or strategic studies. In order to grasp the usefulness of the theoretical ideas presented in readings and lectures, abstract concepts are linked with a study of the national security policies states have adopted in the decades following World War II. Topics include the fundamental distinctions among the alternative strategies available to states, the various strategies the U.S. and other countries have adopted, the links between military forces and strategy, the lessons one might draw from the history of international security relations during the Cold War, and the new sources of conflict and the prospects for continued international peace in the post-Cold War world.\r\n\r\nStudents thoroughly enjoyed this class and found it highly interesting. Many reported learning a lot and felt that each class covered a significant amount of information. While students appreciated the overall structure of the course, some noted that they “wish there was more integration of current events” and others believed that the material became mildly repetitive at certain points during the semester.  Countless students declared that this was the best class they have taken at Penn.\r\n\r\nStudents regarded Professor Goldstein as being “fantastic, engaging and magical.” They enjoyed his teaching style, organization and communication skills, although a few noted that Professor Goldstein talks too quickly at times. Most agreed that “Professor Goldstein brings an exciting atmosphere to lecture that makes it worthwhile to attend,” and many looked forward to taking another class of his in upcoming semesters. \r\n\r\nSome were overwhelmed by the amount of assigned reading each week and found the midterm to be a bit long. However, the majority believed that it was well worth it to take this course. Students commented that both Political Science majors and non-majors would benefit from taking this class. ", "num_students": 233, "path": "/courses/20725/sections/001/reviews/996-AVERY-M--GOLDSTEIN", "instructor": {"path": "/instructors/996-AVERY-M--GOLDSTEIN", "first_name": "AVERY M.", "last_name": "GOLDSTEIN", "id": "996-AVERY-M--GOLDSTEIN", "name": "AVERY M. GOLDSTEIN"}, "num_reviewers": 113, "id": "20725-001-996-AVERY-M--GOLDSTEIN"}]}, "credits": null, "primary_alias": "PSCI-151", "path": "/courses/20725", "sections": {"path": "/courses/20725/sections", "values": [{"name": "INTERNATIONAL SECURITY", "sectionnum": "001", "primary_alias": "PSCI-151-001", "path": "/courses/20725/sections/001", "id": "20725-001", "aliases": ["PSCI-151-001"]}]}, "id": 20725, "aliases": ["PSCI-151"]}