[{"ratings": {"rAmountLearned": "3.15", "rDifficulty": "3.22", "rStimulateInterest": "3.04", "rRecommendMajor": "3.33", "rCourseQuality": "2.99", "rWorkRequired": "3.08", "rInstructorAccess": "3.41", "rReadingsValue": "2.43", "rRecommendNonMajor": "1.70", "rCommAbility": "2.94", "rInstructorQuality": "3.33"}, "section": {"name": "CONTROL OF SYSTEMS", "sectionnum": "401", "primary_alias": "ESE-406-401", "path": "/courses/27370/sections/401", "id": "27370-401", "aliases": ["ESE-406-401", "MEAM-513-401", "ESE-505-401"]}, "comments": "This course introduces basic methods for analysis and design of feedback control in systems; as well as applications to practical systems. Methods presented include time response analysis, frequency response analysis, root locus, Nyquist and Bode plots, and the state-space approach.\r\n\r\nThis class teaches aspects of systems and control theory that are applicable to many different areas of engineering. Mechanical systems and electrical engineering systems are highly discussed in this course. Many students stated learning a lot from this course.\r\n\r\nStudents called Prof. Kothmann “great” and the class “informative” but a few students stated issues with the structure of the class. Students stated that they wished that the professor provided more examples in class. They also said that office hours were extremely informative and recommended attending them. Students wished that the professor posted solutions to the homework to aid for exam studying.\r\n\r\nThis class is for systems engineers or electrical engineers in their junior or senior year of study. This class is required for systems engineers and is an elective option for electrical engineers. Workload was considered “heavy” especially with the end of the semester project that many students wished was curtailed significantly.\r\n", "num_students": 116, "path": "/courses/27370/sections/401/reviews/3294-BRUCE-D--KOTHMANN", "instructor": {"path": "/instructors/3294-BRUCE-D--KOTHMANN", "first_name": "BRUCE D.", "last_name": "KOTHMANN", "id": "3294-BRUCE-D--KOTHMANN", "name": "BRUCE D. KOTHMANN"}, "num_reviewers": 107, "id": "27370-401-3294-BRUCE-D--KOTHMANN"}]