[{"ratings": {"rAmountLearned": "3.12", "rDifficulty": "1.94", "rStimulateInterest": "3.06", "rRecommendMajor": "3.41", "rCourseQuality": "3.11", "rWorkRequired": "2.24", "rInstructorAccess": "3.65", "rReadingsValue": "3.18", "rRecommendNonMajor": "2.82", "rCommAbility": "3.47", "rInstructorQuality": "3.42"}, "section": {"name": "TOPICS IN FRENCH FILM: FRENCH ROAD MOVIES", "sectionnum": "401", "primary_alias": "FREN-383-401", "path": "/courses/27473/sections/401", "id": "27473-401", "aliases": ["FREN-383-401", "CINE-383-401"]}, "comments": "The French road movie has increasingly becoming a popular mode of expression, offering nuanced perspectives on contemporary French identity as well as on France’s position vis-à-vis its own shifting identity, its former colonies, a new “borderless” Europe, and the rest of the World. The goal of the course is to closely examine a genre often associated with “outsider” and even “outlaw” status and to consider how it is employed within the context of the contemporary French identity debates. Through film students examine postcolonial and post-E.U. expansion identity factors, considering how road films offer compelling transnational counter-narratives to visions of French national identity. Starting with the maligned banlieue and the often-contested cinema linked to it, the course follows filmmakers as they branch out across France, Europe and the Maghreb. In the process students become familiar with the conventions of the French road movie, a genre both engaged with and thoroughly distinct from its North American counterpart. Students examine the genre’s penchant for “border crossing” and the nature of borders crossed in French films, both physical and metaphorical (be they gender-related, sexual, religious or cultural). Of particular interest is the use of music (and its link to identity) in the French road film, from rap to flamenco and beyond. Students complete regular short essay responses (1 page), a presentation and a research paper.\r\n\r\nAll of the reviews of this course were positive. One student even said this was one of their favorite classes at Penn. Other students expressed that the films reviewed in this course were great and thought provoking. \r\n\r\nIt seems as though the positive reviews of this class were due in great part to the quality of Professor Gott’s instruction. Students described Professor Gott as friendly, easily accessible outside of class, and extremely fair. Several students also described Professor Gott as passionate about the subject matter, which made all the difference for the students’ own interest and engagement in the topic. \r\n\r\nComments on the workload in this course indicate that assignments were given out in reasonable amounts, and graded fairly. One student explained, “Professor Gott… [understands] a fair balance in work that allows thoughts and ideas to really sink in and be comprehended without the stress of having to memorize every little detail for the exam.” ", "num_students": 24, "path": "/courses/27473/sections/401/reviews/5753-MICHAEL-GOTT", "instructor": {"path": "/instructors/5753-MICHAEL-GOTT", "first_name": "MICHAEL", "last_name": "GOTT", "id": "5753-MICHAEL-GOTT", "name": "MICHAEL GOTT"}, "num_reviewers": 19, "id": "27473-401-5753-MICHAEL-GOTT"}]