[{"ratings": {"rAmountLearned": "3.31", "rDifficulty": "2.14", "rStimulateInterest": "3.20", "rRecommendMajor": "3.64", "rCourseQuality": "3.35", "rWorkRequired": "2.17", "rInstructorAccess": "3.44", "rReadingsValue": "2.91", "rRecommendNonMajor": "2.33", "rCommAbility": "3.47", "rInstructorQuality": "3.43"}, "section": {"name": "URBAN FISCAL POLICY", "sectionnum": "001", "primary_alias": "ECON-237-001", "path": "/courses/22935/sections/001", "id": "22935-001", "aliases": ["ECON-237-001"]}, "comments": "ECON 237 explores government financing in urban economies. The course covers topics which include the causes and consequences of the urban fiscal crisis, the design of optimal tax and spending policies for local governments, funding of public infrastructures and the workings of the municipal bond market, privatization of government services, and public financial systems for emerging economies. This course also explores real-world applications, such as analysis of recent fiscal crises, local services and taxes as important determinants of real estate prices, the infrastructure crisis, financing and the provision of public education, and fiscal constitutions for new democracies. \r\n\r\nStudents reported that this course was useful in relating economic models to real-world situations. As a result, most found this to be a very interesting course.\r\n\r\nMost students reported that Professor Sieg’s teaching style is interesting and engaging due to his emphasis on real-world economic scenarios. Students described Professor Sieg as “smart” and “very engaging”. However, one student commented that Professor Sieg seemed to be pushing his own economic agenda through his lectures. Additionally, another student wrote that, at times, Professor Sieg was unfriendly and impatient during office hours. Generally, though, students had a positive opinion of the professor.\r\n\r\nStudents reported that grades were distributed fairly. Furthermore, all of the exam topics are posted as slides on Blackboard. Prerequisites for the course are ECON 101, ECON 102, MATH 104, and MATH 114 or 115.\r\n", "num_students": 38, "path": "/courses/22935/sections/001/reviews/5608-HOLGER-SIEG", "instructor": {"path": "/instructors/5608-HOLGER-SIEG", "first_name": "HOLGER", "last_name": "SIEG", "id": "5608-HOLGER-SIEG", "name": "HOLGER SIEG"}, "num_reviewers": 37, "id": "22935-001-5608-HOLGER-SIEG"}]