{"coursehistories": {"path": "/coursehistories/3819"}, "description": "This course will focus upon and examine the ethics of international heritage and the role that Museums play in the preservation of identity and cultural heritage. The mission of this course will be to inform and educate students about the role Museums within the 21st century. What is the role and position of antiquities and important cultural objects in Museums? How should Museums acquire these objects and when should they be returned to countries and cultural groups? Examples from current issues will be included in the reading and discussions along with objects and issues within Penn Museum. \n\n", "semester": "2010C", "name": "POLICY,MUSEUMS&CUL HERIT", "reviews": {"path": "/courses/22617/reviews", "values": [{"ratings": {"rAmountLearned": "2.89", "rDifficulty": "2.14", "rStimulateInterest": "2.69", "rRecommendMajor": "3.42", "rCourseQuality": "2.63", "rWorkRequired": "2.23", "rInstructorAccess": "3.33", "rReadingsValue": "2.09", "rRecommendNonMajor": "2.57", "rCommAbility": "3.19", "rInstructorQuality": "3.00"}, "section": {"name": "POLICY,MUSEUMS&CUL HERIT", "sectionnum": "401", "primary_alias": "ANTH-141-401", "path": "/courses/22617/sections/401", "id": "22617-401", "aliases": ["ANTH-141-401", "COMM-141-401", "ARTH-141-401"]}, "comments": "This course will focus upon and examine the ethics of international heritage, the ethics of international heritage, and the role that museums play in the preservation of identity and cultural heritage. The mission of this course will be to inform and educate students about the role of museums within the 21st century. What is the role and position of antiquities and important cultural objects in museums? How should museums acquire these objects and when should they be returned to countries and cultural groups? Examples from current issues will be included in the reading and discussions along with objects and issues within Penn Museum.\r\n\r\nDespite having a significant amount of work assigned, students seemed to sincerely enjoy the course. One student said, \"The course really opened me up to the variety of topics regarding museums, cultural heritage, and public policy.\" Students used words like \"practical\" and \"interesting\" to describe the course.\r\n\r\nStudents by and large enjoyed having Professor Leventhal. One student said, \"Professor Leventhal is a very cool person with interesting ideas. I like that he was interested in the students' ideas and analysis, not just lecturing [...] I feel lucky to have had the opportunity to take a class with him.\" Other students used words like \"interesting\" and \"interactive\" to describe Professor Leventhal.\r\n\r\nThis class is recommended to both non-majors and majors. There is a lot of reading, but it is said to be manageable. Reportedly, not all of the assigned readings are gone over in lecture. There is a good amount of writing required, but no exams. There are no prerequisites.\r\n\r\n\r\n", "num_students": 42, "path": "/courses/22617/sections/401/reviews/3890-RICHARD-M--LEVENTHAL", "instructor": {"path": "/instructors/3890-RICHARD-M--LEVENTHAL", "first_name": "RICHARD M.", "last_name": "LEVENTHAL", "id": "3890-RICHARD-M--LEVENTHAL", "name": "RICHARD M. LEVENTHAL"}, "num_reviewers": 41, "id": "22617-401-3890-RICHARD-M--LEVENTHAL"}]}, "credits": null, "primary_alias": "ANTH-141", "path": "/courses/22617", "sections": {"path": "/courses/22617/sections", "values": [{"name": "POLICY,MUSEUMS&CUL HERIT", "sectionnum": "401", "primary_alias": "ANTH-141-401", "path": "/courses/22617/sections/401", "id": "22617-401", "aliases": ["ANTH-141-401", "COMM-141-401", "ARTH-141-401"]}]}, "id": 22617, "aliases": ["ANTH-141", "COMM-141", "ARTH-141"]}