{"coursehistories": {"path": "/coursehistories/924"}, "description": "This lecture course introduces students to the subfield of international security or strategic studies. In order to grasp the usefulness of the theoretical ideas presented in readings and lectures, abstract concepts are linked with a study of the national security policies states have adopted in the decades following World War II. Topics include current debates about nuclear proliferation, terrorism, the Iraq war, Europe's changing international role, the rise of China, Asian \"flashpoints\" (Korea, the Taiwan Strait), and US secruity policy for the 21st century - considering some of the main strategic alternatives to the US as well as their implications for the types of forces deployed (the impact of the \"revolution in military affairs,\" the future of missile defense, and the economic burden to be shouldered). \n\n", "semester": "2012A", "name": "INTERNATIONAL SECURITY", "reviews": {"path": "/courses/28040/reviews", "values": [{"ratings": {"rAmountLearned": "3.11", "rDifficulty": "2.70", "rStimulateInterest": "3.15", "rRecommendMajor": "3.66", "rCourseQuality": "3.21", "rWorkRequired": "2.68", "rInstructorAccess": "2.92", "rReadingsValue": "2.92", "rRecommendNonMajor": "2.62", "rCommAbility": "3.48", "rInstructorQuality": "3.36"}, "section": {"name": "INTERNATIONAL SECURITY", "sectionnum": "001", "primary_alias": "PSCI-151-001", "path": "/courses/28040/sections/001", "id": "28040-001", "aliases": ["PSCI-151-001"]}, "comments": "This lecture course introduces students to the subfield of international security or strategic studies.  In order to grasp the usefulness of the theoretical ideas presented in readings and lectures, abstract concepts are linked with a study of the national security policies states have adopted in the decades following World War II.  Topics include current debates about nuclear proliferation, terrorism, the Iraq war and Europe's changing international role.\r\n\r\nAlthough some students mentioned that it was an “excellent course” and “the course taught me a lot about the history and theory of security strategy which will definitely help me going forward in my political science work,” most other students commented that they “disliked this course greatly” and “the course reading for the first half of the course could have been a lot more interesting.” \r\n\r\nThe reviews were generally very positive for Professor Goldstein. Students commented on his exceptional lecturing skills. One student mentioned that “Avery Goldstein is a commendable professor,” and another stated that he is “extremely knowledgeable, communicates material well, [and] facilitates a lecture environment conducive to learning and understanding the material.”\r\n\r\nOne student mentioned, “this course is a must-take for students that want to understand today's globalized political environment.” It is also highly recommended for students wishing to major or minor in international relations or similar majors. The course load consists of lots of readings, and the lectures may move relatively fast to cover all of the material needed. There are no prerequisites for this class.", "num_students": 119, "path": "/courses/28040/sections/001/reviews/996-AVERY-M--GOLDSTEIN", "instructor": {"path": "/instructors/996-AVERY-M--GOLDSTEIN", "first_name": "AVERY M.", "last_name": "GOLDSTEIN", "id": "996-AVERY-M--GOLDSTEIN", "name": "AVERY M. GOLDSTEIN"}, "num_reviewers": 96, "id": "28040-001-996-AVERY-M--GOLDSTEIN"}]}, "credits": null, "primary_alias": "PSCI-151", "path": "/courses/28040", "sections": {"path": "/courses/28040/sections", "values": [{"name": "INTERNATIONAL SECURITY", "sectionnum": "001", "primary_alias": "PSCI-151-001", "path": "/courses/28040/sections/001", "id": "28040-001", "aliases": ["PSCI-151-001"]}]}, "id": 28040, "aliases": ["PSCI-151"]}