[{"ratings": {"rAmountLearned": "2.65", "rDifficulty": "1.82", "rStimulateInterest": "2.77", "rRecommendMajor": "3.06", "rCourseQuality": "2.82", "rWorkRequired": "2.22", "rInstructorAccess": "2.98", "rReadingsValue": "2.67", "rRecommendNonMajor": "2.98", "rCommAbility": "3.25", "rInstructorQuality": "3.16"}, "section": {"name": "STUDY OF A PERIOD: MONSTERS IN FILM & LIT.", "sectionnum": "401", "primary_alias": "ENGL-104-401", "path": "/courses/22969/sections/401", "id": "22969-401", "aliases": ["ENGL-104-401", "CINE-104-401", "COML-104-401"]}, "comments": "This course surveys the popular appeal of monsters in film and literature, from medieval dragons to intergalactic aliens. It explores the fascination with the unknown, the supernatural and the grotesque, scientific experimentation, and the boundaries of what it means to be human. This course studies films featuring a wide assortment of monsters and the literature that inspires and reproduces them across a range of genres, cultures, and time periods.  Films may include: Nosferatu, Frankenstein, The Fly, 28 Weeks Later, The Elephant Man, Godzilla.  Authors may include: Mary Shelley, Robert Louis Stevenson, H.P. Lovecraft, and Octavia Butler.  This course includes an introduction to film analysis and readings in cultural studies and literary theory. There are no prerequisites. Participation is required and includes having your textbook in class.\r\n\r\nStudents found the material “really interesting,” and the course “well thought out and discussed.” Students considered it a good blend of film and literature that was able to show “both parallels and clear distinctions based on context and intended audience.” Students generally felt the course was “great.” One student clarified, “this is the sort of class that I reference all the time to my friends and tell them interesting things that I learned in it. I would recommend it to everyone.”\r\n\r\nStudents found Professor Yang to be rather “eloquent” and “knowledgeable,” and that she “makes the setting comfortable and welcoming.” She was seen as great at “facilitating course discussion,” but “somewhat unapproachable on an individual basis.” Others found this style of discussion-based teaching problematic given the large number of students in lecture and the fact that participation is required, and numerous students expressed that Professor Yang would have done better in a seminar setting. \r\n\r\nStudents tended not to find the work too difficult, but many expressed frustration with “silly” class policies, especially those regarding participation. Students were counted as absent if they forgot their textbooks, and due to the class size “it was really nerve wracking trying to make sure you said something every day.” Some found the weekly film sheets “tedious,” but felt that longer writing assignments allowed for plenty of creativity. Students also felt that there were “lots of ways to make up bad grades,” and that the course was generally “non-stressful.” Overall, students found this class to be a good way to fulfill a requirement or pursue an interest.", "num_students": 58, "path": "/courses/22969/sections/401/reviews/3282-CHI-MING-YANG", "instructor": {"path": "/instructors/3282-CHI-MING-YANG", "first_name": "CHI-MING", "last_name": "YANG", "id": "3282-CHI-MING-YANG", "name": "CHI-MING YANG"}, "num_reviewers": 53, "id": "22969-401-3282-CHI-MING-YANG"}]