[{"ratings": {"rAmountLearned": "3.50", "rDifficulty": "2.69", "rStimulateInterest": "3.07", "rRecommendMajor": "3.43", "rCourseQuality": "3.08", "rWorkRequired": "2.37", "rInstructorAccess": "2.67", "rReadingsValue": "2.69", "rRecommendNonMajor": "2.93", "rCommAbility": "2.97", "rInstructorQuality": "3.17"}, "section": {"name": "NATIONS, POL AND MARKETS", "sectionnum": "001", "primary_alias": "BPUB-289-001", "path": "/courses/22744/sections/001", "id": "22744-001", "aliases": ["BPUB-289-001"]}, "comments": "This course is designed for students who are interested in pursuing an international career and for those who plan to work for industrial and financial corporations that operate in emerging markets. The course will deal with the economic and political problems of macroeconomic adjustment, corruption, the transition economies, and international financial transactions. All of these topics will be illustrated with in-depth studies of economies in Africa, Asia, Latin America, the Middle East, Eastern Europe, and China.\r\n\r\nThis course gave a nice perspective and helped students “understand how the world works.” The second half of the semester was student-taught through group presentations. Many students felt it was difficult and a poor use of time to learn concepts from classmates; they would have preferred to learn directly from Professor Pack via standard lectures.\r\n\r\nStudents were pleased with Professor Pack’s knowledge and ability to communicate the material, but many were dissatisfied with the lack of clarity in which he described assignments and test material. Final questions were not taken from the list of questions as promised by the professor, and the final paper assignment was “unclear,” resulting in some groups writing two papers and others writing only one. Some students thought Professor Pack was misleading in the course expectations and at times “dismissive of student comments.”\r\n\r\nStudents learned a lot from this course in terms of knowledge and thinking ability, and the instructor was able to stimulate student interest in the material.\r\n", "num_students": 40, "path": "/courses/22744/sections/001/reviews/1806-HOWARD-PACK", "instructor": {"path": "/instructors/1806-HOWARD-PACK", "first_name": "HOWARD", "last_name": "PACK", "id": "1806-HOWARD-PACK", "name": "HOWARD PACK"}, "num_reviewers": 36, "id": "22744-001-1806-HOWARD-PACK"}]