[{"ratings": {"rAmountLearned": "2.57", "rDifficulty": "1.86", "rStimulateInterest": "2.32", "rRecommendMajor": "3.14", "rCourseQuality": "2.49", "rWorkRequired": "2.03", "rInstructorAccess": "3.03", "rReadingsValue": "2.08", "rRecommendNonMajor": "2.51", "rCommAbility": "2.59", "rInstructorQuality": "2.71"}, "section": {"name": "NEIGHBRHD DYN. OF CRIME", "sectionnum": "401", "primary_alias": "CRIM-280-401", "path": "/courses/27224/sections/401", "id": "27224-401", "aliases": ["CRIM-280-401", "URBS-280-401", "SOCI-380-401"]}, "comments": "Crime varies in time, space, and populations as it reflects ecological structures and the routine social interactions that occur in daily life. Concentrations of crime can be found among locations, with antisocial activities like assaults and theft occurring at higher rates because of the demographic make-up of people (e.g., adolescents) or conflicts (e.g.,competing gangs), for reasons examined by ecological criminology. Variation in socio-demographic structures (age, education ratios, and the concentration of poverty) and the physical environment (housing segregation, density of bars, street lighting) predicts variations between neighborhoods in the level of crime and disorder. Both ethnographic and quantitative research methods are used to explore the connections between the social and physical environment of areas and antisocial behavior.\r\n\tStudents reported learning a lot from this course and described it as a \"fantastic survey of theory relating to criminal activity.\" Some students complained that the content focused too heavily on theory. \r\n\tMany students described the classroom atmosphere as \"relaxed\" and \"laid-back.\"  Professor Stokes was \"nice\" and \"helpful.\"\r\n\tStudents enjoyed the \"hands-on\" group project that involved researching a particular neighborhood.  Class participation counted for 10% of students' final grades in this course. This review was based on a limited number of student comments. ", "num_students": 47, "path": "/courses/27224/sections/401/reviews/5330-ROBERT-J-STOKES", "instructor": {"path": "/instructors/5330-ROBERT-J-STOKES", "first_name": "ROBERT J", "last_name": "STOKES", "id": "5330-ROBERT-J-STOKES", "name": "ROBERT J STOKES"}, "num_reviewers": 41, "id": "27224-401-5330-ROBERT-J-STOKES"}]