{"coursehistories": {"path": "/coursehistories/731"}, "description": "This course covers fundamentals of heat and mass transfer and applications to practical problems in energy conversion and conservation. Emphasis will be on developing a physical and analytical understanding of conductive, convective, and radiative heat transfer, as well as design of heat exchangers and heat transfer with phase change. Topics covered will include: types of heat transfer processes, their relative importance, and the interactions between them, solutions of steady state and transient state conduction, emission and absorption of radiation by real surfaces and radiative transfer between surfaces, heat transfer by forced and natural convection owing to flow around bodies and through ducts, analytical solutions for some sample cases and applications of correlations for engineering problems. Students will develop an ability to apply governing principles and physical intuition to solve problems. \n\n", "semester": "2010A", "name": "HEAT/MASS TRANSFER", "reviews": {"path": "/courses/26359/reviews", "values": [{"ratings": {"rAmountLearned": "2.17", "rDifficulty": "3.29", "rStimulateInterest": "1.85", "rRecommendMajor": "2.78", "rCourseQuality": "1.89", "rWorkRequired": "3.17", "rInstructorAccess": "2.63", "rReadingsValue": "2.54", "rRecommendNonMajor": "0.49", "rCommAbility": "2.00", "rInstructorQuality": "2.19"}, "section": {"name": "HEAT/MASS TRANSFER", "sectionnum": "001", "primary_alias": "MEAM-333-001", "path": "/courses/26359/sections/001", "id": "26359-001", "aliases": ["MEAM-333-001"]}, "comments": "This course covers fundamentals of heat and mass transfer and applications to practical problems in energy conversion and conservation. Emphasis will be on developing a physical and analytical understanding of conductive, convective, and radiative heat transfer, as well as design of heat exchangers and heat transfer with phase change. Topics covered will include: types of heat transfer processes, their relative importance, and the interactions between them, solutions of steady state and transient state conduction, emission and absorption of radiation by real surfaces and radiative transfer between surfaces, heat transfer by forced and natural convection owing to flow around bodies and through ducts, analytical solutions for some sample cases and applications of correlations for engineering problems.\r\n\r\nSome students felt that the course placed too much emphasis on “underlying theories” rather than “practical examples.” As well, many students felt as if some of the material taught in class was unnecessary, and that it was sometimes better to “just read the textbook.” Furthermore, students felt that although MatLab was “time consuming,” some of the techniques that were taught in this course became useful in future MEAM courses.\r\n\r\nMany students described Professor Lukes as “one of the nicest professors here at Penn.” She was also “approachable” and she “works with the student to try to figure things out.” Although her “enthusiasm for the subject shone through,” her teaching style was a bit “abstract.” Some students had understanding her because she often tried to fit “too much information in a short space of time.”\r\n\r\nThe workload of this course was quite heavy. “There was a lot of material in this course” and it was often “difficult” to absorb everything. The course material was heavily targeted towards Mechanical Engineers, so it is recommended for Majors only. ", "num_students": 52, "path": "/courses/26359/sections/001/reviews/1891-JENNIFER-R--LUKES", "instructor": {"path": "/instructors/1891-JENNIFER-R--LUKES", "first_name": "JENNIFER R.", "last_name": "LUKES", "id": "1891-JENNIFER-R--LUKES", "name": "JENNIFER R. LUKES"}, "num_reviewers": 49, "id": "26359-001-1891-JENNIFER-R--LUKES"}]}, "credits": null, "primary_alias": "MEAM-333", "path": "/courses/26359", "sections": {"path": "/courses/26359/sections", "values": [{"name": "HEAT/MASS TRANSFER", "sectionnum": "001", "primary_alias": "MEAM-333-001", "path": "/courses/26359/sections/001", "id": "26359-001", "aliases": ["MEAM-333-001"]}]}, "id": 26359, "aliases": ["MEAM-333"]}