[{"ratings": {"rAmountLearned": "2.86", "rDifficulty": "3.24", "rStimulateInterest": "1.78", "rRecommendMajor": "3.29", "rCourseQuality": "2.47", "rWorkRequired": "2.71", "rInstructorAccess": "2.64", "rReadingsValue": "2.85", "rRecommendNonMajor": "1.02", "rCommAbility": "2.55", "rInstructorQuality": "2.57"}, "section": {"name": "AUTOMATA,COMPUT.& COMPLX", "sectionnum": "001", "primary_alias": "CIS-262-001", "path": "/courses/24170/sections/001", "id": "24170-001", "aliases": ["CIS-262-001"]}, "comments": "This course explores questions fundamental to computer science such as which\r\nproblems cannot be solved by computers. Questions such as the formalization of\r\ncomputing as a mathematical concept without relying upon the specifics of programming\r\nlanguages and computing platforms, and which problems can be solved efficiently, are\r\nexplored. The topics include finite automata and regular languages, context-free\r\ngrammars and pushdown automata, Turing machines and undecidability, tractability and\r\nNP-completeness. The course emphasizes rigorous mathematical reasoning as well as\r\nconnections to practical computing problems such as test processing, parsing, XML\r\nquery languages, and program verification.\r\nOverall, students found this course “interesting,” and computer science majors\r\nfound the course “useful.” The majority of the material covered is “abstract/theoretical.”\r\nBy working hard in the course, students felt they were able to obtain a “good grasp of the\r\nconcepts.”\r\nAlthough students found Professor Alur willing to answer all questions, they felt\r\nthat he was not very accessible. Students noted that they were unable to attend any of the\r\nprofessor’s posted office hours. Additionally, many found the recitation to be an\r\n“additional lecture,” so they were unable to have their questions answered during\r\nrecitation.\r\nThe majority of students found the course “tough” and “challenging,” especially\r\nnon-math majors and non-computer science majors. Students found the textbook to be\r\nhelpful and the recitations “crucial.” Students found the course difficult due to the\r\nmaterial, rather than the workload. The assignments “enforced” material covered in\r\nclass.", "num_students": 110, "path": "/courses/24170/sections/001/reviews/1358-RAJEEV-S--ALUR", "instructor": {"path": "/instructors/1358-RAJEEV-S--ALUR", "first_name": "RAJEEV S.", "last_name": "ALUR", "id": "1358-RAJEEV-S--ALUR", "name": "RAJEEV S. ALUR"}, "num_reviewers": 101, "id": "24170-001-1358-RAJEEV-S--ALUR"}]