[{"ratings": {"rAmountLearned": "3.15", "rDifficulty": "2.78", "rStimulateInterest": "3.51", "rRecommendMajor": "3.75", "rCourseQuality": "3.33", "rWorkRequired": "2.89", "rInstructorAccess": "3.36", "rReadingsValue": "3.02", "rRecommendNonMajor": "2.97", "rCommAbility": "3.65", "rInstructorQuality": "3.59"}, "section": {"name": "AMERICAN FOREIGN POLICY", "sectionnum": "001", "primary_alias": "PSCI-131-001", "path": "/courses/28037/sections/001", "id": "28037-001", "aliases": ["PSCI-131-001"]}, "comments": "This course analyzes the formation and conduct of foreign policy in the United State. The course combines three elements: a study of the history of American foreign relations; an analysis of the causes of American foreign policy such as the international system, public opinion, and the media; and a discussion of the major policy issues in contemporary U.S. foreign policy, including terrorism, civil wars, and economic policy.\r\n\tThis course was described as “very interesting” by many students, and it seemed that all had a positive opinion of it. Material was interesting and presented in a “compelling way.” Students noted that there was an “enormous amount of reading,” but many also noted that the reading was interesting and helpful. Some students found studying for tests hard, as ID terms were often only mentioned once in class.\r\n\tStudents were enthralled by Professor Horowitz, who was described as an “excellent professor,” a “great guy,” and a “captivating lecturer.” He was praised unanimously as being enthusiastic and passionate about the material. \r\n\tStudents felt very strongly about this course, offering unanimous praise, and noting that they wanted to learn more about the material due to the professor. There was a lot of required reading, but many students found it helpful. ", "num_students": 136, "path": "/courses/28037/sections/001/reviews/4083-MICHAEL-HOROWITZ", "instructor": {"path": "/instructors/4083-MICHAEL-HOROWITZ", "first_name": "MICHAEL", "last_name": "HOROWITZ", "id": "4083-MICHAEL-HOROWITZ", "name": "MICHAEL HOROWITZ"}, "num_reviewers": 118, "id": "28037-001-4083-MICHAEL-HOROWITZ"}]