[{"ratings": {"rAmountLearned": "2.71", "rDifficulty": "2.15", "rStimulateInterest": "2.54", "rRecommendMajor": "3.17", "rCourseQuality": "2.80", "rWorkRequired": "2.24", "rInstructorAccess": "2.78", "rReadingsValue": "2.78", "rRecommendNonMajor": "2.76", "rCommAbility": "2.85", "rInstructorQuality": "2.78"}, "section": {"name": "RACE & ETHNIC RELATIONS", "sectionnum": "401", "primary_alias": "SOCI-006-401", "path": "/courses/25106/sections/401", "id": "25106-401", "aliases": ["SOCI-006-401", "URBS-160-401", "ASAM-006-401", "AFRC-006-401"]}, "comments": "Sociology 006 focuses on the issues surrounding race and ethnicity in the United States. The course will overview racial categorization and immigration to the United States, then move on to topics of identity, friendships and marriage, attitudes, mass media images, segregation, stratification, and employment. \r\n\r\nMost students found the course material “interesting and relevant.” Many students agreed that the material proved engaging, although class discussions often trended towards unproductive. Students were split roughly evenly between those who would prefer more discussion and those who would prefer more emphasis on lecturing. \r\n\r\nStudents spoke favorably of Professor Kao. In particular, many students agreed that Professor Kao “is extremely knowledgeable,” although many also noted that lectures could become unfocused or “boring.”  \r\n\r\nThis course included students taking the course to fulfill requirements, as well as for an elective. Several students indicated that the amount of reading for this course seemed excessive. Students found the assessments to be generally fair.  \r\n", "num_students": 57, "path": "/courses/25106/sections/401/reviews/1715-GRACE-KAO", "instructor": {"path": "/instructors/1715-GRACE-KAO", "first_name": "GRACE", "last_name": "KAO", "id": "1715-GRACE-KAO", "name": "GRACE KAO"}, "num_reviewers": 51, "id": "25106-401-1715-GRACE-KAO"}, {"ratings": {"rAmountLearned": "3.39", "rDifficulty": "2.42", "rStimulateInterest": "3.53", "rRecommendMajor": "3.63", "rCourseQuality": "3.30", "rWorkRequired": "2.53", "rInstructorAccess": "3.28", "rReadingsValue": "3.26", "rRecommendNonMajor": "3.21", "rCommAbility": "3.58", "rInstructorQuality": "3.40"}, "section": {"name": "RACE & ETHNIC RELATIONS", "sectionnum": "601", "primary_alias": "SOCI-006-601", "path": "/courses/25106/sections/601", "id": "25106-601", "aliases": ["SOCI-006-601", "URBS-160-601", "ASAM-006-601", "AFRC-006-601"]}, "comments": "Sociology 006 examines the ideas of racial progress that is at the heart of such questions raised from the election of Barack Obama as the United States’ first Black president about whether we have entered a post-racial society. This course pays close attention to how social scientists have defined and measured racial inequality and progress in the last century. It considers how dramatic demographic shifts, the growing number of interracial families and individuals who identify as mixed-race, trans-racial adoptions, and the increased visibility of people of color in media, positions of influence, and as celebrities, inform scholarly and popular debates about racial progress. Along with some classic works, students will also read literature regarding the class versus race debate and color-blind racism. In the process, students will become familiar with sociological data often drawn from in debates about racial progress and will also develop analytical and critical thinking skills. \r\n\r\nOverall this course was very highly thought of. One student said that taking the class was a “great decision.” The topic was initially what drew many of the students to the course, but the readings and the organization of the class also strengthened its appeal. Students left class feeling like they had learned a lot, as the classroom setting of this course provided a safe environment to talk about complex and personal issues such as race. This class received unanimously positive comments. \r\n\r\nStudents also praised Professor Nopper. She was said to be energetic and able to keep all of her students interested in the class and invested in the material. Other students described her as “an excellent communicator and academic professional.” Though Professor Nopper is a tough grader and has high expectations of students, many students loved her. They could tell she loved her job and really cared about her students. \r\n\r\nThis course was highly recommended by the majority of students to anyone interested in the course material. The course is well taught and the grading is fair. Any student that wants to learn more about racial relations should think about taking the class, regardless of their major. The workload is not too bad, and the quality of the class is “invaluable.” This course fulfills the Cultural Diversity in the US requirement.\r\n", "num_students": 22, "path": "/courses/25106/sections/601/reviews/4248-TAMARA-K--NOPPER", "instructor": {"path": "/instructors/4248-TAMARA-K--NOPPER", "first_name": "TAMARA K.", "last_name": "NOPPER", "id": "4248-TAMARA-K--NOPPER", "name": "TAMARA K. NOPPER"}, "num_reviewers": 21, "id": "25106-601-4248-TAMARA-K--NOPPER"}]