[{"ratings": {"rAmountLearned": "2.35", "rDifficulty": "1.91", "rStimulateInterest": "2.45", "rRecommendMajor": "2.89", "rCourseQuality": "2.29", "rWorkRequired": "2.30", "rInstructorAccess": "3.16", "rReadingsValue": "2.52", "rRecommendNonMajor": "2.45", "rCommAbility": "2.43", "rInstructorQuality": "2.78"}, "section": {"name": "INTRO TO INDIAN PHILOS", "sectionnum": "401", "primary_alias": "SAST-150-401", "path": "/courses/23764/sections/401", "id": "23764-401", "aliases": ["SAST-150-401", "PHIL-050-401"]}, "comments": "This course covers the major topics of Indian philosophy by first introducing the fundamental concepts and terms that are necessary for a deeper understanding of themes that pervade the philosophical literature of India -- arguments for and against the existence of God, for example, the ontological status of external objects, the means of valid knowledge, standards of proof, and the discourse on the aims of life. The readings emphasize classical Hindu, Buddhist, and Jain philosophical articulations (from 700 B.C.E to 16th century CE) but are also supplemented by contemporary or relatively recent philosophical writings in modern India.&#8232;&#8232;The opinions about this course were very mixed. While some students thought that the course exceeded their expectations, many students also thought that the discussions strayed from the readings. Also, students complained that the course could be improved through the use of powerpoints.&#8232;&#8232;Many students praised Professor Patel and said that he was an excellent instructor. Students felt that he listened to his students, answered questions, and cared about his students. However, some students complained that Professor Patel was disorganized and was not able to cover all lectures as presented in the syllabus.&#8232;&#8232;While some students complained that the readings were dense and did not always seem relevant or necessary, they reported that the grading was not too hard.", "num_students": 62, "path": "/courses/23764/sections/401/reviews/4103-DEVEN-M--PATEL", "instructor": {"path": "/instructors/4103-DEVEN-M--PATEL", "first_name": "DEVEN M.", "last_name": "PATEL", "id": "4103-DEVEN-M--PATEL", "name": "DEVEN M. PATEL"}, "num_reviewers": 54, "id": "23764-401-4103-DEVEN-M--PATEL"}]