[{"ratings": {"rAmountLearned": "3.14", "rDifficulty": "3.07", "rStimulateInterest": "3.12", "rRecommendMajor": "3.71", "rCourseQuality": "3.06", "rWorkRequired": "2.57", "rInstructorAccess": "3.11", "rReadingsValue": "2.53", "rRecommendNonMajor": "1.47", "rCommAbility": "3.51", "rInstructorQuality": "3.42"}, "section": {"name": "BASIC CONCEPTS OF PHARMACOLOGY & THERAPEUTICS", "sectionnum": "001", "primary_alias": "NURS-242-001", "path": "/courses/17798/sections/001", "id": "17798-001", "aliases": ["NURS-242-001"]}, "comments": "Essential concepts of pharmacology and pharmacodynamics are reviewed for the major drug classes. The biochemical and physiological effects of drugs are related to their therapeutic and toxicologic effects.\r\n\r\nOverall, students found this class to be “very useful” and applicable to nursing practice. Most students felt there was a lot of information to be covered in only one semester. The content matched the students’ current experience and knowledge level.\r\n\r\nProfessor Boullatta received a variety of praises for his teaching style and accessibility. Many students agreed that Professor Boullatta was “very good”, “excellent”, and able to “stimulate students’ interests.” Some even commented on Professor Boullatta’s humor and how it made a Friday morning class more enjoyable overall.\r\n\r\nStudents felt the quizzes were extremely helpful to keep the drugs fresh in their minds. Some stated that the textbook was not useful. The powerpoint slides were systematically laid out and understandable. The exams were “very fair.” A general comment was that the class should be held twice a week instead of the once weekly, 3-hour class. This course is a requirement for junior nursing students. The prerequisites include N40 (41 or 42), N131, and N132. The focus on nursing application makes this class not very appropriate for non-nursing students.", "num_students": 144, "path": "/courses/17798/sections/001/reviews/3123-JOSEPH-I--BOULLATA", "instructor": {"path": "/instructors/3123-JOSEPH-I--BOULLATA", "first_name": "JOSEPH I.", "last_name": "BOULLATA", "id": "3123-JOSEPH-I--BOULLATA", "name": "JOSEPH I. BOULLATA"}, "num_reviewers": 132, "id": "17798-001-3123-JOSEPH-I--BOULLATA"}]