[{"ratings": {"rAmountLearned": "2.70", "rDifficulty": "1.78", "rStimulateInterest": "2.68", "rRecommendMajor": "3.42", "rCourseQuality": "2.71", "rWorkRequired": "1.70", "rInstructorAccess": "2.92", "rReadingsValue": "2.15", "rRecommendNonMajor": "3.04", "rCommAbility": "3.26", "rInstructorQuality": "3.06"}, "section": {"name": "CRIMINAL JUSTICE", "sectionnum": "401", "primary_alias": "CRIM-200-401", "path": "/courses/25850/sections/401", "id": "25850-401", "aliases": ["CRIM-200-401", "SOCI-200-401"]}, "comments": "This course examines the causes and consequences of the millions of decisions made annually by the legally empowered decision-makers of the criminal justice system. The course places students in the role of one decision-maker after another, emphasizing the decisions they would make with all the scientific research on these decisions at their disposal. Research on 15 different decision-makers is examined, from crime victims to police, prosecutors, jurors, judges, wardens, probation, and parole officers. Using a medical model of evidence-based practice, the course asks students to consider how the results of criminal justice could more effectively reduce the sum of human misery.\r\nStudents could not praise the course enough, describing it as “extremely interesting.” They found that “information and concepts [they] learned in this class apply easily to regular life and enhanced [their] understanding of how society and criminal justice works.”\r\nLikewise, students had only positive things to say about Professor Macdonald. Students felt that he was “enthusiastic,” “engaging” and “charismatic.” They felt that Professor Macdonald “really cares about the subject matter,” and was simultaneously “informative” and “entertaining.”\r\nStudents described the class as not particularly demanding and expressed appreciation for the quiz system. One student, however, felt that the lengthy paper was not given enough attention. Students recommend the course, considering it to be “geared toward anyone interested in the subject matter and not only for pre-law students” ", "num_students": 158, "path": "/courses/25850/sections/401/reviews/4292-JOHN-M--MACDONALD", "instructor": {"path": "/instructors/4292-JOHN-M--MACDONALD", "first_name": "JOHN M.", "last_name": "MACDONALD", "id": "4292-JOHN-M--MACDONALD", "name": "JOHN M. MACDONALD"}, "num_reviewers": 136, "id": "25850-401-4292-JOHN-M--MACDONALD"}]