[{"ratings": {"rAmountLearned": "3.28", "rDifficulty": "2.00", "rStimulateInterest": "3.39", "rRecommendMajor": "3.69", "rCourseQuality": "3.12", "rWorkRequired": "2.34", "rInstructorAccess": "3.50", "rReadingsValue": "3.03", "rRecommendNonMajor": "3.22", "rCommAbility": "3.28", "rInstructorQuality": "3.44"}, "section": {"name": "HIST FOREIGN AID IN AFRC", "sectionnum": "401", "primary_alias": "HIST-372-401", "path": "/courses/21876/sections/401", "id": "21876-401", "aliases": ["HIST-372-401", "AFST-372-401"]}, "comments": "This course examines the history, politics, and significance of foreign aid to Africa from the late 19th century to the present. This course explores how foreign aid in the colonial era introduced ideas and institutions that inform modern policies and practices. Students will examine the objectives and intentions of foreign aid while also surveying the topics of developmental theory, African economics, and international aid organizations. &#8232;&#8232;Students appreciated the course material and assured that it was both fascinating and manageable. Though readings were described as, “interesting,” some students noted that they were, “not critical to performance in the class.” Students were especially appreciative of the variety of sources used to present the class material, ranging from movies to guest speakers.&#8232;&#8232;Professor Cassanelli received high praise from students. Many students described Professor Cassanelli as, “passionate about the subject and about getting students engaged in it.” Students appreciated Professor Cassanelli’s combination of lecture, multimedia, and discussion in classes. Professor Cassanelli was described as, “very accessible during office hours and through student blog entries.”&#8232;Students were required to have some previous experience with studying Africa before &#8232;taking this course. &#8232;&#8232;The workload for this course was described as “manageable” and included several short essays in addition to a final paper. The course is open to both college freshmen and upperclassmen.", "num_students": 42, "path": "/courses/21876/sections/401/reviews/658-LEE-V-CASSANELLI", "instructor": {"path": "/instructors/658-LEE-V-CASSANELLI", "first_name": "LEE V", "last_name": "CASSANELLI", "id": "658-LEE-V-CASSANELLI", "name": "LEE V CASSANELLI"}, "num_reviewers": 35, "id": "21876-401-658-LEE-V-CASSANELLI"}]