{"coursehistories": {"path": "/coursehistories/5301"}, "description": "Topics: spherical astronomy, timekeeping/coordinate systems, astrostatistics, telescopes, CCD's, signal processing, imaging, and data reduction using scientific software, brief introduction to radio astronomy. Three daytime lectures each week plus evening labs in smaller groups. Attendance at one lab session per week is required by each student. Actual observing times may not correspond to the scheduled block due to the uncertainty and unpredictability of weather conditions. Requires substantial out-of-class time dedication and commitment to sharing work in small groups. \n\n", "semester": "2010A", "name": "ASTRONOMICAL TECHNIQUES", "reviews": {"path": "/courses/25647/reviews", "values": [{"ratings": {"rAmountLearned": "2.22", "rDifficulty": "3.00", "rStimulateInterest": "2.33", "rRecommendMajor": "2.38", "rCourseQuality": "1.40", "rWorkRequired": "2.67", "rInstructorAccess": "3.11", "rReadingsValue": "1.43", "rRecommendNonMajor": "1.11", "rCommAbility": "2.44", "rInstructorQuality": "2.30"}, "section": {"name": "ASTRONOMICAL TECHNIQUES", "sectionnum": "001", "primary_alias": "ASTR-250-001", "path": "/courses/25647/sections/001", "id": "25647-001", "aliases": ["ASTR-250-001"]}, "comments": "This course covers the following topics; spherical astronomy, timekeeping and coordinate systems, astrostatistics, telescopes, CCD's, signal processing. Two one-hour daytime lectures each week plus three-hour evening lab in smaller groups. Attendance at one lab session per week is required by each student - multiple times are scheduled due to the uncertainty and unpredictability of weather conditions for observing. This course requires substantial out-of-class time dedication and commitment to sharing work in small groups. \r\n\r\nStudents found this course to be interesting and enjoyable, but \"stressful\" due to lack of organization. Many students wanted strict, early deadlines to motivate them, and wanted more guidance along the way, especially for using the software required for the end-of-semester projects.\r\n\r\nStudents claimed that Professor Aguirre was helpful, but wished he could give more \"unsolicited guidance\" and felt that his attention was a bit divided since this class is shared with ASTR150.\r\n\r\nThis course is intended for science majors. Prerequisites include ASTR 001, or ASTR 007, or ASTR 011, or ASTR 012. If a student has only taken ASTR 001, MATH 240-241 will also be required. This review is based on the four submitted student comments.", "num_students": 11, "path": "/courses/25647/sections/001/reviews/4249-JAMES-ERIK-AGUIRRE", "instructor": {"path": "/instructors/4249-JAMES-ERIK-AGUIRRE", "first_name": "JAMES ERIK", "last_name": "AGUIRRE", "id": "4249-JAMES-ERIK-AGUIRRE", "name": "JAMES ERIK AGUIRRE"}, "num_reviewers": 10, "id": "25647-001-4249-JAMES-ERIK-AGUIRRE"}]}, "credits": null, "primary_alias": "ASTR-250", "path": "/courses/25647", "sections": {"path": "/courses/25647/sections", "values": [{"name": "ASTRONOMICAL TECHNIQUES", "sectionnum": "001", "primary_alias": "ASTR-250-001", "path": "/courses/25647/sections/001", "id": "25647-001", "aliases": ["ASTR-250-001"]}]}, "id": 25647, "aliases": ["ASTR-250"]}