[{"ratings": {"rAmountLearned": "3.19", "rDifficulty": "3.47", "rStimulateInterest": "2.34", "rRecommendMajor": "3.52", "rCourseQuality": "2.78", "rWorkRequired": "3.91", "rInstructorAccess": "2.97", "rReadingsValue": "2.03", "rRecommendNonMajor": "1.47", "rCommAbility": "2.72", "rInstructorQuality": "3.03"}, "section": {"name": "COMPUTER GRAPHICS", "sectionnum": "401", "primary_alias": "CIS-560-401", "path": "/courses/13041/sections/401", "id": "13041-401", "aliases": ["CIS-560-401", "CIS-460-401"]}, "comments": "CIS 560 aims to provide students with a comprehensive introduction to computer graphics to meet the needs of both designers and users of interactive graphics systems. The course should verse students well in contemporary terminology, progress, and issues in this field, as well as cover a variety of topics in graphics techniques. Geometric transformations and algorithms, OpenGL, ray tracing, and 3D object models are only some of the areas covered in the semester. A bulk pack of lecture slides is required for and the Interactive Computer Graphics textbook is recommended to accompany the course.\r\n\r\nStudents generally found the class to be enjoyable and useful. One student remarked it Course topics were well chosen and organized, but many students found that the homework assignments and lectures were “totally different.” Other students noted that some of the algorithms introduced in the course were explained poorly and “difficult to understand.”\r\n\r\nProfessor Badler was generally praised for his teaching abilities, although he could be dull at times. He lectured from his PowerPoint slides, which caused some students to easily lose focus. Many students also explained that the TAs handled many of the issues and questions in the course.\r\n\r\nCIS 560 requires a minimum of one year of programming experience in Java, C, or C++. Knowledge of vector geometry may also be helpful. Because of the prerequisites, fewer freshmen were enrolled in the class. Homework assignments were based on programming and seemed fair.", "num_students": 46, "path": "/courses/13041/sections/401/reviews/1325-NORMAN-I-BADLER", "instructor": {"path": "/instructors/1325-NORMAN-I-BADLER", "first_name": "NORMAN I", "last_name": "BADLER", "id": "1325-NORMAN-I-BADLER", "name": "NORMAN I BADLER"}, "num_reviewers": 32, "id": "13041-401-1325-NORMAN-I-BADLER"}]