{"coursehistories": {"path": "/coursehistories/1038"}, "description": "This course is a comprehensive introduction to the sociological study of urban areas. This includes more general topics as the rise of cities and theories urbanism, as well as more specific areas of inquiry, including American urbanism, segregation, urban poverty, suburbanization and sprawl, neighborhoods and crime, and immigrant ghettos. The course will also devote significant attention to globalization and the process of urbanization in less developed counties. \n\n", "semester": "2010A", "name": "URBAN SOCIOLOGY", "reviews": {"path": "/courses/26765/reviews", "values": [{"ratings": {"rAmountLearned": "2.73", "rDifficulty": "2.29", "rStimulateInterest": "2.16", "rRecommendMajor": "3.48", "rCourseQuality": "2.43", "rWorkRequired": "2.26", "rInstructorAccess": "2.77", "rReadingsValue": "2.58", "rRecommendNonMajor": "2.50", "rCommAbility": "3.06", "rInstructorQuality": "2.81"}, "section": {"name": "URBAN SOCIOLOGY", "sectionnum": "401", "primary_alias": "SOCI-011-401", "path": "/courses/26765/sections/401", "id": "26765-401", "aliases": ["SOCI-011-401", "URBS-112-401"]}, "comments": "This course is a comprehensive introduction to the sociological study of urban areas. This includes more general topics such as the rise of cities and theories of urbanism, as well as more specific areas of inquiry, including American urbanism, segregation, urban poverty, suburbanization and sprawl, neighborhoods and crime, and immigrant ghettos. The course will also devote significant attention to globalization and the process of urbanization in less-developed countries.\r\n\r\nMost students had positive feelings about the course, praising its “real world applications” and “interesting” material. However, others complained about how too much information was jam-packed into each once-a-week class, while another said “it would be better if it was less lecture-based and more interactive.”\r\n\r\nProfessor Flippen seemed to be relatively well-liked; a student commended her for making the material “understandable and coherent.” Students did not have any complaints to register about her or her teaching.\r\n\r\nThe workload and difficulty of the class both appeared reasonable. However, students did seem to think that there was almost too much material delivered in too short of a time. One student reports: “this class requires a considerable amount of reading, about 100 pages a week.” Another student said they enjoyed the course, but went on to recommend that people that don’t have great interest in cities or sociology should avoid the course. This course is open to all class levels and has no prerequisites. This course fulfills the Cultural Diversity in the U.S. requirement. ", "num_students": 34, "path": "/courses/26765/sections/401/reviews/4563-CHENOA-ANNE-FLIPPEN", "instructor": {"path": "/instructors/4563-CHENOA-ANNE-FLIPPEN", "first_name": "CHENOA ANNE", "last_name": "FLIPPEN", "id": "4563-CHENOA-ANNE-FLIPPEN", "name": "CHENOA ANNE FLIPPEN"}, "num_reviewers": 32, "id": "26765-401-4563-CHENOA-ANNE-FLIPPEN"}]}, "credits": null, "primary_alias": "SOCI-011", "path": "/courses/26765", "sections": {"path": "/courses/26765/sections", "values": [{"name": "URBAN SOCIOLOGY", "sectionnum": "401", "primary_alias": "SOCI-011-401", "path": "/courses/26765/sections/401", "id": "26765-401", "aliases": ["SOCI-011-401", "URBS-112-401"]}]}, "id": 26765, "aliases": ["SOCI-011", "URBS-112"]}