[{"ratings": {"rAmountLearned": "3.02", "rDifficulty": "2.92", "rStimulateInterest": "2.91", "rRecommendMajor": "3.38", "rCourseQuality": "2.93", "rWorkRequired": "3.31", "rInstructorAccess": "3.39", "rReadingsValue": "2.92", "rRecommendNonMajor": "2.17", "rCommAbility": "2.94", "rInstructorQuality": "3.14"}, "section": {"name": "COMPARATIVE MEDICINE", "sectionnum": "401", "primary_alias": "HSOC-145-401", "path": "/courses/23248/sections/401", "id": "23248-401", "aliases": ["HSOC-145-401", "HIST-146-401", "STSC-145-401"]}, "comments": "This course focuses on health and healing in the colonial and post-colonial world. The course gives special attention to local healing under condition of domination, to definitions of the body and the person in biomedicine and in non-European healing traditions, and to the political and cultural place of medicine in regions which have experienced colonial rule.&#8232;&#8232;\r\n\r\nStudents agreed that the course was extremely interesting and enlightening. However, the course was packed with information, and some students found the amount they learned to be \"quite overwhelming.\" Because of this, lectures could sometimes be a bit disorganized, and students had difficulty synthesizing all of the material or figuring out the take-away points. Despite this, students agreed that they learned a lot from the course.\r\n\r\nStudents found Professor Petrie to be extremely engaging during his lectures. He was \"approachable and willing to meet students outside of class to discuss anything.\" Students felt he was able to cover a wide range of topics.\r\n&#8232;\r\nThere were a lot of readings and work required for this course, but students said Professor Petrie tried to make it not overly difficult. Students agreed that the readings were interesting and very useful for writing papers. They also commented that it was a great introduction course for health and society majors and recommended this class to incoming students, especially those considering med school after graduation.\r\n", "num_students": 63, "path": "/courses/23248/sections/401/reviews/1486-IAN-C--PETRIE", "instructor": {"path": "/instructors/1486-IAN-C--PETRIE", "first_name": "IAN C.", "last_name": "PETRIE", "id": "1486-IAN-C--PETRIE", "name": "IAN C. PETRIE"}, "num_reviewers": 56, "id": "23248-401-1486-IAN-C--PETRIE"}]