{"coursehistories": {"path": "/coursehistories/2006"}, "description": "Description of Crystal Structure-Symmetry, Point and Space Groups. Structures of different material types-glasses, polymers, semiconductors, ceramics and metals. Relationship between bonding and structural types. Methods of structure determination. Diffraction of x-rays and neutrons--x-ray methods. Microstructures of solids. Topology of granular structures. Grain boundary structures. Fractal description of microstructures. \n\n", "semester": "2012A", "name": "STRUCTURE OF MATLS", "reviews": {"path": "/courses/27823/reviews", "values": [{"ratings": {"rAmountLearned": "3.46", "rDifficulty": "3.75", "rStimulateInterest": "3.08", "rRecommendMajor": "3.61", "rCourseQuality": "3.33", "rWorkRequired": "3.29", "rInstructorAccess": "2.71", "rReadingsValue": "2.83", "rRecommendNonMajor": "2.00", "rCommAbility": "3.33", "rInstructorQuality": "3.54"}, "section": {"name": "STRUCTURE OF MATLS", "sectionnum": "001", "primary_alias": "MSE-520-001", "path": "/courses/27823/sections/001", "id": "27823-001", "aliases": ["MSE-520-001"]}, "comments": "Topics covered in the class include description of crystal structure-symmetry, point and space groups. structures of different material types-glasses, polymers, semiconductors, ceramics and metals. Other topics include relationship between bonding and structural types, methods of structure determination, diffraction of x-rays and neutrons--x-ray methods, microstructures of solids, topology of granular structures, grain boundary structures, and fractal description of microstructures.\r\n\r\nStudents found that the course is \"challenging, but forces the student to really understand the concepts, which is essential\" to understand material science even further. Students also noted that the course \"focuses a lot on the fundamental physics basics of symmetry and diffraction,\" which made the class difficult for some. Even though the course was difficult, students found the class rewarding because they  learned a lot.\r\n\r\nStudents enjoyed having Professor Chen because not only did he \"present clearly and logically and provide course readings that were excellent supplements,\" but made the students \"think in a different way.\"  Students said that \"it had been a pleasure being taught by him.\"\r\n\r\nStudents did point out that it \"might be difficult for those whose background is not in physics\" though not all students had this and still enjoyed the class. The only prerequisite is that students need to get permission from the Undergraduate Curriculum Chair and instructor. The class was mainly comprised of graduate students within the major.\r\n\r\nThis review is based on eight student comments that were submitted.", "num_students": 24, "path": "/courses/27823/sections/001/reviews/1618-I-WEI-CHEN", "instructor": {"path": "/instructors/1618-I-WEI-CHEN", "first_name": "I-WEI", "last_name": "CHEN", "id": "1618-I-WEI-CHEN", "name": "I-WEI CHEN"}, "num_reviewers": 24, "id": "27823-001-1618-I-WEI-CHEN"}]}, "credits": null, "primary_alias": "MSE-520", "path": "/courses/27823", "sections": {"path": "/courses/27823/sections", "values": [{"name": "STRUCTURE OF MATLS", "sectionnum": "001", "primary_alias": "MSE-520-001", "path": "/courses/27823/sections/001", "id": "27823-001", "aliases": ["MSE-520-001"]}]}, "id": 27823, "aliases": ["MSE-520"]}