{"coursehistories": {"path": "/coursehistories/4536"}, "description": "This course is focused on principles underlying design and analysis of computational elements that interact with the physical environment. Increasingly, such embedded computers are everywhere, from smart cameras to medical devices to automobiles. While the classical theory of computation focuses on the function that a program computes, to understand embedded computation, we need to focus on the reactive nature of the interaction of a component with its environment via inputs and outputs, the continuous dynamics of the physical world, different ways of communication among components, and requirements concerning safety, timeliness, stability, and performance. Developing tools for approaching design, analysis, and implementation of embedded systems in a principled manner is an active research area. This course will attempt to give students a coherent introduction to this emerging area. This course is appropriate as an upper-level undergraduate CIS elective. \n\n", "semester": "2009C", "name": "PRIN OF EMBEDDED SYSTEMS", "reviews": {"path": "/courses/17141/reviews", "values": [{"ratings": {"rAmountLearned": "2.71", "rDifficulty": "2.24", "rStimulateInterest": "2.29", "rRecommendMajor": "2.76", "rCourseQuality": "2.59", "rWorkRequired": "2.24", "rInstructorAccess": "3.35", "rReadingsValue": "2.76", "rRecommendNonMajor": "1.38", "rCommAbility": "3.00", "rInstructorQuality": "3.06"}, "section": {"name": "PRIN OF EMBEDDED SYSTEMS", "sectionnum": "001", "primary_alias": "CIS-540-001", "path": "/courses/17141/sections/001", "id": "17141-001", "aliases": ["CIS-540-001"]}, "comments": "This course is focused on principles underlying design and analysis of computational elements that interact with the physical environment. While the classical theory of computation focuses on the function that a program computes, to understand embedded computation, the reactive nature of the interaction of a component with its environment, the continuous dynamics of the physical world, different ways of communication among components, and requirements concerning safety, timeliness, stability, and performance are often overlooked. Developing tools for approaching design, analysis, and implementation of embedded systems in a principled manner is an active research area. This course will attempt to give students a coherent introduction to this emerging area.\r\n\r\nStudents found the material scattered and sometimes hard to follow, and would have preferred prepared presentation and in class demonstrations. Also, there was a lack of paper reviews or reading material for reference. \r\n\r\nStudents liked Professor Alur and found the course to be “comprehensive.” \r\n", "num_students": 19, "path": "/courses/17141/sections/001/reviews/1358-RAJEEV-S--ALUR", "instructor": {"path": "/instructors/1358-RAJEEV-S--ALUR", "first_name": "RAJEEV S.", "last_name": "ALUR", "id": "1358-RAJEEV-S--ALUR", "name": "RAJEEV S. ALUR"}, "num_reviewers": 17, "id": "17141-001-1358-RAJEEV-S--ALUR"}]}, "credits": null, "primary_alias": "CIS-540", "path": "/courses/17141", "sections": {"path": "/courses/17141/sections", "values": [{"name": "PRIN OF EMBEDDED SYSTEMS", "sectionnum": "001", "primary_alias": "CIS-540-001", "path": "/courses/17141/sections/001", "id": "17141-001", "aliases": ["CIS-540-001"]}]}, "id": 17141, "aliases": ["CIS-540"]}