[{"ratings": {"rAmountLearned": "3.04", "rDifficulty": "2.71", "rStimulateInterest": "2.58", "rRecommendMajor": "3.04", "rCourseQuality": "2.85", "rWorkRequired": "3.04", "rInstructorAccess": "3.38", "rReadingsValue": "2.38", "rRecommendNonMajor": "1.71", "rCommAbility": "2.96", "rInstructorQuality": "2.81"}, "section": {"name": "SCALABLE & CLOUD COMP", "sectionnum": "001", "primary_alias": "MKSE-212-001", "path": "/courses/24766/sections/001", "id": "24766-001", "aliases": ["MKSE-212-001"]}, "comments": "What is the \"cloud\"? How are software systems and components that scale to\r\nmillions of users and petabytes of data, and are \"always available\" built? In the modern\r\nInternet, virtually all large Web services run atop multiple geographically distributed data\r\ncenters: Google, Yahoo, Facebook, iTunes, Amazon, eBay, Bing, Services must scale\r\nacross thousands of machines, tolerate faults, and support of concurrent requests.\r\nIncreasingly, the major providers (including Amazon, GoMicrosoft, HP, and IBM) are\r\nlooking at \"hosting\" third-party applications in their data centers - forming so-called\r\n\"cloud computing\" services. A significant number of these services also process\r\n\"streaming\" data: geocoding information from cell phones, tweets, streaming video, etc.\r\nThis course, aimed at a sophomore with exposure to basic programming within the\r\ncontext of a single machine, focuses on the issues and programming models related to\r\nsuch cloud and distributed data processing technologies: data partitioning, storage\r\nschemes, stream processing, and \"mostly shared-nothing\" parallel algorithms.\r\nGenerally, students were pleased with the content of this course, as it covered “the\r\nmore practical aspects of computer science” and an understanding into the structure of\r\nthe internet. Many also appreciated the breadth of the course in covering “the cloud\r\ncomputing world,” but others felt that this was a weakness, limiting the depth of material\r\nlearned. The assignments were a chance to apply new concepts learned, and were “tough”\r\nand “specific.”\r\nOne student praised Professor Haeberlen for being “extremely helpful in resolving\r\n[homework setup] issues.” However, there was “very little communication between [the\r\nTAs] and Professor Haeberlen,” which hindered progress on the assignments and\r\nprojects.\r\nStudents agreed that the course was difficult and rigorous. It was also time\r\nconsuming, particularly because of difficulties encountered with “framework and\r\nconfiguration steps” for the cloud services utilized in the assignments. For the\r\nassignments, one student thought that they were difficult concept-wise, but “not due to\r\nthe programming.” Respondents also warned that those who came “from a very basic\r\nCIS120-level computer science background” were at a disadvantage.", "num_students": 31, "path": "/courses/24766/sections/001/reviews/5319-ANDREAS-HAEBERLEN", "instructor": {"path": "/instructors/5319-ANDREAS-HAEBERLEN", "first_name": "ANDREAS", "last_name": "HAEBERLEN", "id": "5319-ANDREAS-HAEBERLEN", "name": "ANDREAS HAEBERLEN"}, "num_reviewers": 27, "id": "24766-001-5319-ANDREAS-HAEBERLEN"}]