{"coursehistories": {"path": "/coursehistories/572"}, "description": "Surveys Latin American and Caribbean history from the Haitian Revolution of 1791 to the present. We will examine the legacy of Spanish colonialism and slavery, movements for national and cultural independence, twentieth-century radicalism, and the politics of race in contemporary Latin America. Readings include fictional as well as analytical representations, and a film series will accompany the course. \n\n", "semester": "2009A", "name": "LATIN AMER 1791-PRES", "reviews": {"path": "/courses/15889/reviews", "values": [{"ratings": {"rAmountLearned": "2.03", "rDifficulty": "2.59", "rStimulateInterest": "2.38", "rRecommendMajor": "2.49", "rCourseQuality": "1.97", "rWorkRequired": "2.70", "rInstructorAccess": "2.31", "rReadingsValue": "1.87", "rRecommendNonMajor": "1.75", "rCommAbility": "2.18", "rInstructorQuality": "2.34"}, "section": {"name": "LATIN AMER 1791-PRES", "sectionnum": "401", "primary_alias": "HIST-071-401", "path": "/courses/15889/sections/401", "id": "15889-401", "aliases": ["HIST-071-401", "LALS-071-401"]}, "comments": "This course surveys Latin American and Caribbean history from the Haitian Revolution of 1791 to the present. It examines the legacy of Spanish colonialism and slavery, movements for national and cultural independence, twentieth-century radicalism, and the politics of race in contemporary Latin America. Readings include fictional as well as analytical representations, and a film series.\r\n\r\nMost students--many interested in Latin American history--were only moderately satisfied by this course. As one student put it, “It is supposed to do the impossible task of covering 2 centuries of history of an entire region.” Several students mentioned that they left class more confused than when they came in. “I feel like I\\'m well-read on a small handful of events in Latin America,” another student wrote, “But I don\\'t really have a sense of the history of the region holistically.”\r\n\r\nProfessor Farnsworth-Alvear was described as “wonderfully entertaining” and someone who “clearly really knows her Latin American history.” However some said her familiarity with the subject matter was a hindrance to some extent. “It is her brilliance that made it impossible for me and many other students to get anything out of this course,” one student wrote. Her tendency to speak too fast during lecture was also troubling to many students in this course.\r\n\r\nThe class consisted of a mix of history majors as well as other students. One history major was displeased with the construction of assignments, since “they seemed dumbed down.” Other students did appreciate the creativity of their paper topics.", "num_students": 71, "path": "/courses/15889/sections/401/reviews/1511-ANN-C--FARNSWORTH-ALVEAR", "instructor": {"path": "/instructors/1511-ANN-C--FARNSWORTH-ALVEAR", "first_name": "ANN C.", "last_name": "FARNSWORTH-ALVEAR", "id": "1511-ANN-C--FARNSWORTH-ALVEAR", "name": "ANN C. FARNSWORTH-ALVEAR"}, "num_reviewers": 67, "id": "15889-401-1511-ANN-C--FARNSWORTH-ALVEAR"}]}, "credits": null, "primary_alias": "HIST-071", "path": "/courses/15889", "sections": {"path": "/courses/15889/sections", "values": [{"name": "LATIN AMER 1791-PRES", "sectionnum": "401", "primary_alias": "HIST-071-401", "path": "/courses/15889/sections/401", "id": "15889-401", "aliases": ["HIST-071-401", "LALS-071-401"]}]}, "id": 15889, "aliases": ["HIST-071", "LALS-071"]}