[{"ratings": {"rAmountLearned": "3.21", "rDifficulty": "2.11", "rStimulateInterest": "3.00", "rRecommendMajor": "2.89", "rCourseQuality": "3.15", "rWorkRequired": "2.21", "rInstructorAccess": "2.89", "rReadingsValue": "2.63", "rRecommendNonMajor": "2.59", "rCommAbility": "2.72", "rInstructorQuality": "3.14"}, "section": {"name": "INT'L HOUSING COMPARISNS", "sectionnum": "401", "primary_alias": "REAL-236-401", "path": "/courses/28092/sections/401", "id": "28092-401", "aliases": ["REAL-236-401", "BPUB-236-401"]}, "comments": "International Housing Comparisons focuses on international comparisons of housing finance systems and housing market outcomes. This includes comparative analyses of the economic factors that underlay housing market differences and similarities. Changing housing market institutions and policies in previously socialist economies and newly emerging countries are examined. REAL 236 also addresses integration of global financial markets for national housing markets. International speakers present their views on institutional innovations and the policy setting process in their respective markets. Various approaches to understanding these issues will be used, including readings, written assignments, and group projects.\r\n\r\n\tThe majority of students described REAL 236 as “very interesting” and “engaging.” Students enjoyed the course particularly because it covered contemporary topics, such as current real estate trends and the state of the housing market. Furthermore, a number of students reported that the guest lecturers were “highly qualified” and the best part of REAL 236. However, many students wished that the course had been more structured and organized. Multiple students reported that the syllabus and readings often changed, which made it “hard to study for the exams.” Nevertheless, students found this course stimulating.\r\n\r\n\tOverall, students appreciated Professor Watcher for her “authority on the topic,” which they said made the course more interesting. However, the majority of students found significant problems with Professor Watcher’s teaching style, which they described as “confusing” and “unorganized.” Multiple students reported that the PowerPoint slides were “poorly made,” which made it “difficult to follow the subject matter.” Furthermore, one student commented that Professor Watcher “assumed we all understood the subject matter” and “used acronyms and industry specific terms without explaining them properly.” Despite complaints about her teaching style, students agreed that Professor Watcher was “always accessible and happy to discuss course concepts.”\r\n\r\n\tREAL 236 comes highly recommended to Wharton students who are interested in real estate, particularly real estate’s effect on the financial crisis. Multiple students advised that the target audience is students who already have knowledge of or experience in real estate.\t\r\n", "num_students": 33, "path": "/courses/28092/sections/401/reviews/1046-SUSAN-M-WACHTER", "instructor": {"path": "/instructors/1046-SUSAN-M-WACHTER", "first_name": "SUSAN M", "last_name": "WACHTER", "id": "1046-SUSAN-M-WACHTER", "name": "SUSAN M WACHTER"}, "num_reviewers": 30, "id": "28092-401-1046-SUSAN-M-WACHTER"}]