[{"ratings": {"rAmountLearned": "3.01", "rDifficulty": "3.71", "rStimulateInterest": "2.04", "rRecommendMajor": "3.30", "rCourseQuality": "2.44", "rWorkRequired": "3.80", "rInstructorAccess": "3.16", "rReadingsValue": "1.85", "rRecommendNonMajor": "1.73", "rCommAbility": "2.24", "rInstructorQuality": "2.43"}, "section": {"name": "INTRO TO COMP PROG", "sectionnum": "001", "primary_alias": "CIS-110-001", "path": "/courses/27148/sections/001", "id": "27148-001", "aliases": ["CIS-110-001"]}, "comments": "CIS 110 is a \"Java lite\" course that covers the fundamentals of object-oriented programming such as objects, classes, state, methods, loops, arrays, inheritance, and recursion using the Java programming language.\r\n\r\nStudents found that this class was a great introductory course for learning the fundamentals of computer science. Topics were not only covered in Java, but also in machine coding. Though students found the class difficult and highly work-intensive, it was a rewarding one because students felt that they had learn a lot of applicable skills and a new way of organized thinking.\r\n\r\nStudents enjoyed having Dr. Brown as a professor. They found him very engaging and very motivated to help his students learn. One student commented, \"Dr. Brown genuinely cares that his students learn the material and is extremely accessible and helpful. He will stay late during office hours, answer questions on the discussion board, and go out of his way to teach.\" Though his lectures may be dry at times, students claim \"he does his best\" given the topic.\r\n\r\nStudents planning on taking this course should be prepared to spend upwards of twelve hours each week to complete the homework assignments. Students recommend that a good grasp of math and logic is necessary to complete the homeworks in a timely manner. \r\n", "num_students": 161, "path": "/courses/27148/sections/001/reviews/6069-BENEDICT-JULIAN-BROWN", "instructor": {"path": "/instructors/6069-BENEDICT-JULIAN-BROWN", "first_name": "BENEDICT JULIAN", "last_name": "BROWN", "id": "6069-BENEDICT-JULIAN-BROWN", "name": "BENEDICT JULIAN BROWN"}, "num_reviewers": 138, "id": "27148-001-6069-BENEDICT-JULIAN-BROWN"}]