[{"ratings": {"rAmountLearned": "2.96", "rDifficulty": "2.38", "rStimulateInterest": "3.21", "rRecommendMajor": "3.04", "rCourseQuality": "2.93", "rWorkRequired": "2.75", "rInstructorAccess": "3.46", "rReadingsValue": "2.92", "rRecommendNonMajor": "2.71", "rCommAbility": "3.29", "rInstructorQuality": "3.52"}, "section": {"name": "THE BIG BANG AND BEYOND", "sectionnum": "301", "primary_alias": "ASTR-007-301", "path": "/courses/15369/sections/301", "id": "15369-301", "aliases": ["ASTR-007-301"]}, "comments": "This introductory course is for students who do not intend to major in a Physical Science or Engineering, covering theories of the universe ranging from the ancient perspective to the contemporary Big Bang model, including some notions of Einstein's special and general theories of relativity. Topics include the solar system, stars, black holes, galaxies, and the structure, origin and future of the Universe itself. This course fulfills both the Quantitative Data Analysis requirement and the Natural Sciences and Mathematics sector requirement.\r\n\r\nStudents described the course as “very informative.” Several students felt that the topics covered were “broad,” but acknowledged that such extensive exploration was fitting for a big-picture introductory course. Students particularly enjoyed in-class discussions, which were often focused on controversial topics.\r\n\r\nStudents commented that Professor Balasubramanian’s lectures were “always filled with passion” and described Balasubramian as a “star professor” who “communicates the material in a unique way.” Students were also pleased with his accessibility; as one student noted, Balasubramian was “always willing to help.”\r\n\r\nOverall, students had positive experiences when taking this class, though there were some complaints about the workload. Some students felt there should only have been one essay for the midterm, though it was “better than studying for a test.” Others suggested a recitation component be added to the class to provide additional time for asking questions.", "num_students": 29, "path": "/courses/15369/sections/301/reviews/972-VIJAY-BALASUBRAMANIAN", "instructor": {"path": "/instructors/972-VIJAY-BALASUBRAMANIAN", "first_name": "VIJAY", "last_name": "BALASUBRAMANIAN", "id": "972-VIJAY-BALASUBRAMANIAN", "name": "VIJAY BALASUBRAMANIAN"}, "num_reviewers": 27, "id": "15369-301-972-VIJAY-BALASUBRAMANIAN"}]