[{"ratings": {"rAmountLearned": "3.08", "rDifficulty": "2.55", "rStimulateInterest": "3.52", "rRecommendMajor": "3.68", "rCourseQuality": "3.30", "rWorkRequired": "2.86", "rInstructorAccess": "2.96", "rReadingsValue": "2.84", "rRecommendNonMajor": "3.03", "rCommAbility": "3.54", "rInstructorQuality": "3.70"}, "section": {"name": "INTRO TO AMER. POLITICS", "sectionnum": "001", "primary_alias": "PSCI-130-001", "path": "/courses/17949/sections/001", "id": "17949-001", "aliases": ["PSCI-130-001"]}, "comments": "This course is designed to help student learn about constitutional theory, present-day political institutions, and ever evolving federal character, electoral processes, and policy-making dynamics of American government. Some of the fundamental questions that this class grapples with are: what are the historical and philosophical foundations of the American Republic; how does American public policy get made, who makes it, and who benefits; is a constitutional fabric woven in 1787 good enough for today; and what is politics and why bother to study it? Readings include The Federalist Papers, “The Wilson Text,” “The Bose Reader,” Get Out the Vote: How to Increase Voter Turnout, and Politics Lost: How American Democracy was Trivialized by People Who Think You’re Stupid. \r\n\r\nMany students found this class “interesting” and a great introductory class. One student even claimed he/she believed this class should be a college requirement because “though concepts are probably basic from the perspective of a political scientist, it would be a good thing for our country if more people understood even these basic concepts.” \r\n\r\nStudents highly praised Professor DiIulio – they commonly reported he was “engaging,” “had good stories,” and “entertaining;” many students claimed Professor DiIulio was one of the best teachers they have ever had. Students also said that Professor DiIulio was very accessible and able to stimulate interest in the material very well. \r\n\r\nThis course fulfills the Society sector and is highly recommended for freshmen considering a Political Science or another humanities major. Many students complained about the somewhat excessive amounts of reading. While some students found the exams to be challenging and heavily focused on the readings, the majority of students believed that it was a fairly easy introductory class. \r\n", "num_students": 202, "path": "/courses/17949/sections/001/reviews/994-JOHN-J--DIIULIO", "instructor": {"path": "/instructors/994-JOHN-J--DIIULIO", "first_name": "JOHN J.", "last_name": "DIIULIO", "id": "994-JOHN-J--DIIULIO", "name": "JOHN J. DIIULIO"}, "num_reviewers": 181, "id": "17949-001-994-JOHN-J--DIIULIO"}]