{"coursehistories": {"path": "/coursehistories/3643"}, "description": "In this place-based community serivce learning course, we explore the use of traditional verbal arts material practices among immigrant communities seeking to make Philadelphia home. We begin with theories of culture, community, identity, and the production of locality from the social science, and move from there into historic, literary, and ethnographic portrayals of relevance tothe community we will be working with. Students are introduced to the principles of ethnographic fieldwork, including techniques of participant observation, interviewing, community-based research design, interpretation, and presentation, and the ethical dimensions of fieldwork. Applying these methods, students develop a project that serves the needs of a collaborating Philadephia community. Students gain critical thinking and oberservation skills from the readings, discussion, writing assignments, and field trips. The fieldwork component for the Spring 2007 focuses on the verbal arts and material cultural traditions of South Philadelpia's Indonesian community. In partnersip with the Folk Arts and Cultural Treasures School (FACTS),students and faculty will develop an overview of Philadelpia's Indonesian community and its goals for cultural and lingustic maintenance. Students will also work with community members to identify resources on which FACTS can draw in order \n\nto support these goals for the many Indonesian children who have recently enrolled in the school. This one and a half credit course, which fulfils the General Disribution requirement in Society, will be of special value to students interested in anthropology, sociology, folklore and urban studies, linguistics, asian studies, liteerary studies and vernacular arts and culture. \n\n", "semester": "2005A", "name": "EXPLRNG LOCAL MEM & TRAD", "reviews": {"path": "/courses/10442/reviews", "values": [{"ratings": {"rAmountLearned": "4.00", "rDifficulty": "1.67", "rStimulateInterest": "3.33", "rRecommendMajor": "4.00", "rCourseQuality": "2.67", "rWorkRequired": "2.67", "rInstructorAccess": "3.67", "rReadingsValue": "2.33", "rRecommendNonMajor": "3.00", "rCommAbility": "3.67", "rInstructorQuality": "3.33"}, "section": {"name": "EXPLRNG LOCAL MEM & TRAD", "sectionnum": "401", "primary_alias": "FOLK-321-401", "path": "/courses/10442/sections/401", "id": "10442-401", "aliases": ["FOLK-321-401", "URBS-327-401"]}, "comments": "", "num_students": 3, "path": "/courses/10442/sections/401/reviews/523-MELTEM-TURKOZ", "instructor": {"path": "/instructors/523-MELTEM-TURKOZ", "first_name": "MELTEM", "last_name": "TURKOZ", "id": "523-MELTEM-TURKOZ", "name": "MELTEM TURKOZ"}, "num_reviewers": 3, "id": "10442-401-523-MELTEM-TURKOZ"}]}, "credits": null, "primary_alias": "FOLK-321", "path": "/courses/10442", "sections": {"path": "/courses/10442/sections", "values": [{"name": "EXPLRNG LOCAL MEM & TRAD", "sectionnum": "401", "primary_alias": "FOLK-321-401", "path": "/courses/10442/sections/401", "id": "10442-401", "aliases": ["FOLK-321-401", "URBS-327-401"]}]}, "id": 10442, "aliases": ["FOLK-321", "URBS-327"]}