{"coursehistories": {"path": "/coursehistories/947"}, "description": "This course focuses on evaluating the experiments that have sought to establish links between brain structure (the activity of specific brain circuits) and behavioral function (the control of particular motivated and emotional behaviors). Students are exposed to concepts from regulatory physiology, systems neuroscience, pharmacology, and endocrinology and read textbook as well as original source materials. The course focuses on the following behaviors: feeding, sex, fear, anxiety, the appetite for salt, and food aversion. The course also considers the neurochemical control of responses with an eye towards evaluating the development of drug treatments for: obesity, anorexia/cachexia, vomiting, sexual dysfunction, anxiety disorders, and depression. \n\n", "semester": "2010C", "name": "PHYSIOLOGY MOTIVATED BEH", "reviews": {"path": "/courses/23698/reviews", "values": [{"ratings": {"rAmountLearned": "2.69", "rDifficulty": "3.00", "rStimulateInterest": "1.97", "rRecommendMajor": "2.78", "rCourseQuality": "2.22", "rWorkRequired": "2.89", "rInstructorAccess": "1.92", "rReadingsValue": "2.60", "rRecommendNonMajor": "1.42", "rCommAbility": "2.31", "rInstructorQuality": "2.33"}, "section": {"name": "PHYSIOLOGY MOTIVATED BEH", "sectionnum": "401", "primary_alias": "PSYC-127-401", "path": "/courses/23698/sections/401", "id": "23698-401", "aliases": ["PSYC-127-401", "BIBB-227-401"]}, "comments": "This course focuses on evaluating the experiments that have sought to establish links between brain structure and behavioral function. Students are exposed to concepts from regulatory physiology, systems neuroscience, pharmacology, and endocrinology. Students read from the textbook but are also assigned original source materials. The course focuses on the following behaviors: feeding, sex, fear, anxiety, the appetite for salt, and food aversion. The course also considers the neurochemical control of responses with an eye towards evaluating the development of drug treatments for: obesity, anorexia/cachexia, vomiting, sexual dysfunction, anxiety disorders, and depression.\r\n\r\nStudents for the most part found the class somewhat dull.\r\n\r\nStudents generally criticized Professor Grill’s disorganized lectures. Several commented on his inaccessibility to meet outside of class. Despite these comments, other students also mentioned that he was “knowledgeable on the subject matter” and that he was “smart and funny.”\r\n\r\nMany of the students taking this class were taking it for their major or minor, and the majority of students would only recommend taking it for this reason. One student in particular recommended it for those interested in Biological Basis of Behavior. Many students found the subject too challenging for a 100-level course.\r\n", "num_students": 56, "path": "/courses/23698/sections/401/reviews/1021-HARVEY-J-GRILL", "instructor": {"path": "/instructors/1021-HARVEY-J-GRILL", "first_name": "HARVEY J", "last_name": "GRILL", "id": "1021-HARVEY-J-GRILL", "name": "HARVEY J GRILL"}, "num_reviewers": 46, "id": "23698-401-1021-HARVEY-J-GRILL"}]}, "credits": null, "primary_alias": "PSYC-127", "path": "/courses/23698", "sections": {"path": "/courses/23698/sections", "values": [{"name": "PHYSIOLOGY MOTIVATED BEH", "sectionnum": "401", "primary_alias": "PSYC-127-401", "path": "/courses/23698/sections/401", "id": "23698-401", "aliases": ["PSYC-127-401", "BIBB-227-401"]}]}, "id": 23698, "aliases": ["PSYC-127", "BIBB-227"]}