{"coursehistories": {"path": "/coursehistories/1759"}, "description": "This course offers an overview of the ancient, medieval, and early modern rhetorical traditions, and aims to work very broadly across cultural and textual histories. It should be useful for any students working in early and later periods (including post-Renaissance) who want a grounding in the intellectual and institutional history of rhetoric, the \"discourse about discourse\" that was central to curricular formations, aesthetics, politics, ideas of history, and ideas of canons. We will read materials from sophistic rhetoric, from Plato and Aristotle, from Cicero, Quintilian, and rhetorical theorists from late antiquity (including Augustine); we will work through medieval materials from monastic and cathedral schools to the universities, considering how Ciceronian rhetoric carries an overwhelming influence into the Middle Ages; we will consider the professional stratification of various kinds of rhetorical production and theory in the late Middle Ages and look at some crucial literary embodiments of rhetoric's disciplinary force; we will give some attention to the late medieval recovery of Aristotle s Rhetoric and to the continuous tension between rhetoric, philosophy, and theology; and we'll look at early modern recoveries of certain ancient texts and themes (e.g. \n\nQuintilian, the sophists, political education) in terms of new capacities for analysis of stylistics, affect, and deliberative (political) oratory (and we ll give special attention to early modern English rhetorics and poetics and to continental figures such as Erasmus). We will also be reading a number of modern reflections on the theory and historiography of rhetoric, and the class is open to any combination of theoretical and historical interests. All of our readings will be accessible in English. \n\n", "semester": "2002C", "name": "PRE-MODERN RHETORICS", "reviews": {"path": "/courses/2766/reviews", "values": [{"ratings": {"rAmountLearned": "3.40", "rDifficulty": "3.40", "rStimulateInterest": "3.60", "rRecommendMajor": "3.57", "rCourseQuality": "3.33", "rWorkRequired": "3.40", "rInstructorAccess": "3.87", "rReadingsValue": "3.33", "rRecommendNonMajor": "2.93", "rCommAbility": "3.67", "rInstructorQuality": "3.87"}, "section": {"name": "PRE-MODERN RHETORICS", "sectionnum": "401", "primary_alias": "CLST-530-401", "path": "/courses/2766/sections/401", "id": "2766-401", "aliases": ["CLST-530-401", "COML-530-401", "ENGL-707-401"]}, "comments": "", "num_students": 20, "path": "/courses/2766/sections/401/reviews/256-RITA-COPELAND", "instructor": {"path": "/instructors/256-RITA-COPELAND", "first_name": "RITA", "last_name": "COPELAND", "id": "256-RITA-COPELAND", "name": "RITA COPELAND"}, "num_reviewers": 16, "id": "2766-401-256-RITA-COPELAND"}]}, "credits": null, "primary_alias": "CLST-530", "path": "/courses/2766", "sections": {"path": "/courses/2766/sections", "values": [{"name": "PRE-MODERN RHETORICS", "sectionnum": "401", "primary_alias": "CLST-530-401", "path": "/courses/2766/sections/401", "id": "2766-401", "aliases": ["CLST-530-401", "COML-530-401", "ENGL-707-401"]}]}, "id": 2766, "aliases": ["CLST-530", "COML-530", "ENGL-707"]}