{"coursehistories": {"path": "/coursehistories/3457"}, "description": "Course Description(Fall 2012): Title: Echoes of Prophets, Poets, and Princesses in the Arabic Intellectual Tradition.Through the power of their voices, Arab poets made and unmade rulers, mobilized armies, and immortalized the deeds and words of countless individuals. The voice of Aisha, the wife of the Prophet, rang out loudly in the political and military affairs of the nascent Islamic Empire. Early debates about the nature of God's speech led to a violent confrontation between religious and political authorities which shaped their interaction for centuries. In this CWiC critical speaking seminar, we will examine the role of the spoken word in the Arabic intellectual tradition. In particular, we will study its influence on the development of Arabic literature, theories of linguistic signification, the educational system, and identities of different groups. We will study in translation works of poetry, religious textx, speeches, debates, court cases, ccollections of stories, and works of dialectics. Although we will focus on texts that date from 500 C.E. to 1500 C.E., we will also examine contemporary examples of speech in order to better understand the performative context and continuity between pre-modern and modern traditions of speech in Arabic. \n\nStudents will improve their speaking and listening skills through class discussions,debates, storytelling, and other types of presentations. All readings are in English and the course presumes no prior knowledge of the topic. \n\n", "semester": "2012C", "name": "ECHOES OF ARABIC TRADTN: Echoes of Prophets, Poets and Princesses in the Arabic Intellectual Tradtn", "reviews": {"path": "/courses/29362/reviews", "values": [{"ratings": {"rDifficulty": "2.50", "rStimulateInterest": "3.50", "rCourseQuality": "3.25", "rWorkRequired": "2.50", "rInstructorQuality": "3.00", "rCommAbility": "3.50", "rInstructorAccess": "3.50"}, "section": {"name": "ECHOES OF ARABIC TRADTN: Echoes of Prophets, Poets and Princesses in the Arabic Intellectual Tradtn", "sectionnum": "401", "primary_alias": "NELC-008-401", "path": "/courses/29362/sections/401", "id": "29362-401", "aliases": ["NELC-008-401", "COML-008-401"]}, "comments": "", "num_students": 4, "path": "/courses/29362/sections/401/reviews/6348-RYAN-RITTENBERG", "instructor": {"path": "/instructors/6348-RYAN-RITTENBERG", "first_name": "RYAN", "last_name": "RITTENBERG", "id": "6348-RYAN-RITTENBERG", "name": "RYAN RITTENBERG"}, "num_reviewers": 4, "id": "29362-401-6348-RYAN-RITTENBERG"}]}, "credits": null, "primary_alias": "NELC-008", "path": "/courses/29362", "sections": {"path": "/courses/29362/sections", "values": [{"name": "ECHOES OF ARABIC TRADTN: Echoes of Prophets, Poets and Princesses in the Arabic Intellectual Tradtn", "sectionnum": "401", "primary_alias": "NELC-008-401", "path": "/courses/29362/sections/401", "id": "29362-401", "aliases": ["NELC-008-401", "COML-008-401"]}]}, "id": 29362, "aliases": ["NELC-008", "COML-008"]}