[{"ratings": {"rAmountLearned": "2.59", "rDifficulty": "2.19", "rStimulateInterest": "2.20", "rRecommendMajor": "3.07", "rCourseQuality": "2.45", "rWorkRequired": "2.16", "rInstructorAccess": "2.80", "rReadingsValue": "2.39", "rRecommendNonMajor": "1.97", "rCommAbility": "2.80", "rInstructorQuality": "2.67"}, "section": {"name": "THE PUBLIC POL PROCESS: The Public Policy Process", "sectionnum": "401", "primary_alias": "PPE-202-401", "path": "/courses/17939/sections/401", "id": "17939-401", "aliases": ["PPE-202-401", "PSCI-138-401"]}, "comments": "This course is an opportunity for students to combine the major theoretical perspectives on the policy process with practical application to current policy issues. Students will gain the theoretical tools to explain policy change, a comprehensive understanding of the actors that influence policymaking and politics, an overview of the major policy issues being debated, and experience writing policy documents.\r\n\r\nMost students found this course “interesting” and commented that they “learned a lot.” Students especially liked the “practical, real-world applications.” However, many students also felt the material or presentation of it was “dry and boring.”\r\n\r\nStudents differed in their opinion of Professor Gasper. Some stated he was an “okay professor” while others thought that he was “interesting and enthusiastic.” Many students blamed the dryness of the class on the course material and believed Professor Gasper was not to blame for the “mundane subject matter.” Students agreed that Professor Gasper was “clear,” “easily understood,” and conveyed the material well. Students also appreciated Professor Gasper’s accessibility via e-mail and his attempt to start discussion in the 100+ person class.\r\n\r\nMany students took the course because it is a requirement for PPE majors. One student commented that the course was “not a lot of work, but not as easy as it should be.” Most were disappointed with the recitations led by undergrad TAs and thought it was a “waste of time.” \r\n", "num_students": 100, "path": "/courses/17939/sections/401/reviews/4532-JOHN-T-GASPER", "instructor": {"path": "/instructors/4532-JOHN-T-GASPER", "first_name": "JOHN T", "last_name": "GASPER", "id": "4532-JOHN-T-GASPER", "name": "JOHN T GASPER"}, "num_reviewers": 85, "id": "17939-401-4532-JOHN-T-GASPER"}]