{"coursehistories": {"path": "/coursehistories/486"}, "description": "This course examines the available corporate securities that firms can use to finance investment. The course will focus on:(1) the design of these securities (Why do bonds have embedded options? What is the role of preferred stock?); (2) the issuing process for these securities (What do investment banks do? Is the underwriting process important for the cost of capital?); (3) the pricing of these securities (How are credit risk in bonds and loans priced?) The securities covered include corporate and junk bonds, bank loans, common and preferred equity, commercial paper, securitization, as well as some recent innovations. Other topics include: the role of embedded options in corporate bonds; the role of bank and loan covenants; the function of bond rating agencies; exchange offers; prepackaged bankruptcies; bankruptcy in Chapter 11; workouts; debtor-in-possession financing; and pricing credit risk. The course is desgined to be complementary to Advanced Corporate Finance and Fixed Income Securities. \n\n", "semester": "2012A", "name": "CAPITAL MARKETS", "reviews": {"path": "/courses/27431/reviews", "values": [{"ratings": {"rAmountLearned": "3.13", "rDifficulty": "2.34", "rStimulateInterest": "2.66", "rRecommendMajor": "3.26", "rCourseQuality": "3.03", "rWorkRequired": "2.34", "rInstructorAccess": "2.35", "rReadingsValue": "2.62", "rRecommendNonMajor": "2.38", "rCommAbility": "3.02", "rInstructorQuality": "3.04"}, "section": {"name": "CAPITAL MARKETS", "sectionnum": "001", "primary_alias": "FNCE-238-001", "path": "/courses/27431/sections/001", "id": "27431-001", "aliases": ["FNCE-238-001"]}, "comments": "This course examines the available corporate securities that firms can use to\r\nfinance investment. The course focuses on:(1) the design of these securities (Why do\r\nbonds have embedded options? What is the role of preferred stock?); (2) the issuing\r\nprocess for these securities (What do investment banks do? Is the underwriting process\r\nimportant for the cost of capital?); (3) the pricing of these securities (How are credit risk\r\nin bonds and loans priced?) The securities covered include corporate and junk bonds,\r\nbank loans, common and preferred equity, commercial paper, securitization, as well as\r\nsome recent innovations. Other topics include: the role of embedded options in corporate\r\nbonds; the role of bank and loan covenants; the function of bond rating agencies;\r\nexchange offers; prepackaged bankruptcies; bankruptcy in Chapter 11; workouts; debtorin-\r\npossession financing; and pricing credit risk. The course is designed to be\r\ncomplementary to Advanced Corporate Finance and Fixed Income Securities.\r\nThe reviews for this course were overwhelmingly positive. Students described the\r\nclass using words such as “fantastic” and “understandable”. Students thought that the\r\nmaterial was practical and that the information would prove useful to their future careers.\r\nOne student wrote that it was the best class they had taken at Wharton.\r\nThe majority of students seemed to adore Professor Musto. They praised him for\r\nhis “clarity” and his ability to simplify concepts. One student wrote that through his\r\n“calm, collected lectures he conveys the information quite well to his students.” Students\r\nfelt that he was incredibly informative. Several students commented that Professor Musto\r\nwas their favorite professor at Wharton.\r\nIn terms of audience, one student wrote that this is a “great course for students\r\ninterested in Wall Street.” Another student highlighted, however, that this is an overview\r\ncourse, warning that it does not go into much depth. In terms of workload, students felt\r\nthat the structure of quizzes every other week relieved a lot of stress and in general,\r\nstudents felt that the grading was fair. One student mentioned that the cases were dense\r\nwith legal terms, and warned international students to maybe take another class if their\r\nEnglish is not strong. FNCE 100 and FNCE 101 are prerequisites for this course.", "num_students": 74, "path": "/courses/27431/sections/001/reviews/520-DAVID-K--MUSTO", "instructor": {"path": "/instructors/520-DAVID-K--MUSTO", "first_name": "DAVID K.", "last_name": "MUSTO", "id": "520-DAVID-K--MUSTO", "name": "DAVID K. MUSTO"}, "num_reviewers": 73, "id": "27431-001-520-DAVID-K--MUSTO"}]}, "credits": null, "primary_alias": "FNCE-238", "path": "/courses/27431", "sections": {"path": "/courses/27431/sections", "values": [{"name": "CAPITAL MARKETS", "sectionnum": "001", "primary_alias": "FNCE-238-001", "path": "/courses/27431/sections/001", "id": "27431-001", "aliases": ["FNCE-238-001"]}]}, "id": 27431, "aliases": ["FNCE-238"]}