[{"ratings": {"rAmountLearned": "3.45", "rDifficulty": "3.10", "rStimulateInterest": "3.91", "rRecommendMajor": "3.36", "rCourseQuality": "3.25", "rWorkRequired": "2.90", "rInstructorAccess": "4.00", "rReadingsValue": "3.45", "rRecommendNonMajor": "2.00", "rCommAbility": "3.55", "rInstructorQuality": "3.92"}, "section": {"name": "DISCRETE PROB & STAT INF", "sectionnum": "001", "primary_alias": "CIS-261-001", "path": "/courses/22826/sections/001", "id": "22826-001", "aliases": ["CIS-261-001"]}, "comments": "\r\nThis course tightly integrates the theory and applications of discrete probability, discrete stochastic processes, and discrete statistical inference in the study of computer science. The course introduces the Minimum Description Length Paradigm to unite basic ideas about randomness, inference and computation. Students are expected to use the Maple programming environment in homework exercises which will include numerical and symbolic computations, simulations, and graphical displays.\r\n\r\nOne student described the course material as hard and stated that the small class size was necessary for the “professor to have a close contact with students” to explain it clearly. Another student felt that this was one of the few courses in which he had really learned something at Penn.\r\n\r\nAll three students lauded Professor Mintz for his engaging and inspiring instruction, emphasizing the fact that he “aims to educate.” One student pointed out that “many people say that he is the person from the CIS department who influenced them most for their studies” and that he shared this view.\r\n\r\nHomework assignments and quizzes followed the material covered in class. The prerequisite for this course is CIS 160.\r\n\r\nThis course review is based on the 3 student comments that were submitted.\r\n", "num_students": 16, "path": "/courses/22826/sections/001/reviews/304-MAX-MINTZ", "instructor": {"path": "/instructors/304-MAX-MINTZ", "first_name": "MAX", "last_name": "MINTZ", "id": "304-MAX-MINTZ", "name": "MAX MINTZ"}, "num_reviewers": 13, "id": "22826-001-304-MAX-MINTZ"}]