[{"ratings": {"rAmountLearned": "1.88", "rDifficulty": "1.75", "rStimulateInterest": "1.04", "rRecommendMajor": "1.88", "rCourseQuality": "1.64", "rWorkRequired": "2.46", "rInstructorAccess": "2.58", "rReadingsValue": "1.96", "rRecommendNonMajor": "1.17", "rCommAbility": "1.42", "rInstructorQuality": "1.64"}, "section": {"name": "COLONIAL LATIN AMERICA", "sectionnum": "401", "primary_alias": "HIST-070-401", "path": "/courses/17490/sections/401", "id": "17490-401", "aliases": ["HIST-070-401", "LALS-070-401"]}, "comments": "This course will trace the history of the vast region of Latin America—consisting of more than twenty separate nations today—over the course of almost 330 years, beginning around the time of Columbus's first voyage and ending with the era of the \"wars of independence\" in the early 1800s. The class will explore how \"Latin America\" was born during the violent and confusing period of \"discovery\" and conquest; how contact among European settlers, native peoples, and enslaved Africans shaped social and political life in the Spanish and Portuguese colonies; how systems of labor as well as church and political institutions structured the lives of peoples in the region; and how political change and the \"revolutionary moment\" in the late 1700s resulted in the birth of more than twenty independent nations throughout the region by 1830. Students will also explore briefly, at the end of the course, how the colonial legacy continues to haunt Latin America even in the 21st century.\r\n\r\nStudents had mixed reviews to the course. Several reported that the class was \"incredibly dull\" and said they \"wouldn't recommend this course to anyone else.\" Others, however, said that they \"certainly learned a lot from this course\" and that the lectures were very \"informative.\" In addition, some students said that it was very difficult to have class discussions in a class of that size.\r\n\r\nMany students found Professor Walker to be uninspiring, unable to stimulate student interest. Another student said that the \"Instructor basically goes over the course readings in class in a monotone voice with a PowerPoint.\" However, other students did remark that Professor Walker \"did improve over the course of the semester.”\r\n\r\nMost students thought that this was a very easy class. Several students said that, while there was a lot of reading, it was not necessary to complete the reading in order to do well on the midterm. In addition, students remarked that the course paper was only 2-3 pages long and \"didn't require any analysis.\" However, students did say that there were pop quizzes on some of the readings.\r\n", "num_students": 34, "path": "/courses/17490/sections/401/reviews/3987-TAMARA-J--WALKER", "instructor": {"path": "/instructors/3987-TAMARA-J--WALKER", "first_name": "TAMARA J.", "last_name": "WALKER", "id": "3987-TAMARA-J--WALKER", "name": "TAMARA J. WALKER"}, "num_reviewers": 25, "id": "17490-401-3987-TAMARA-J--WALKER"}]