[{"ratings": {"rAmountLearned": "3.19", "rDifficulty": "2.88", "rStimulateInterest": "3.60", "rRecommendMajor": "3.76", "rCourseQuality": "3.22", "rWorkRequired": "2.98", "rInstructorAccess": "3.79", "rReadingsValue": "2.88", "rRecommendNonMajor": "2.40", "rCommAbility": "3.51", "rInstructorQuality": "3.63"}, "section": {"name": "PRINCIPLES I", "sectionnum": "001", "primary_alias": "PHYS-150-001", "path": "/courses/22289/sections/001", "id": "22289-001", "aliases": ["PHYS-150-001"]}, "comments": "This course covers the classical laws of motion; interactions between particles; conservation laws and symmetry principles; particle and rigid body motion; gravitation, harmonic motion.\r\n\r\nStudents noted that Professor Johnson made physics as fun as it could be. He gave entertaining and relevant demos. Students found that he really cared about his students and made himself available for help at all times. Students said that Professor Johnson made a strong effort to get to know his students. Dr. Johnson was really encouraging and willing to help. In addition, Professor Johnson’s notes were always uploaded and available, which many students enjoyed. Many of his students even described him as the best science teacher they have had while at Penn.\r\n\r\nThis course fulfills the Physical World Sector requirement. Co-requisites for this course include MATH 104 and PHYS 150 LAB. This course is recommended for science majors and engineering students. Students say that this course is hard for students who have never taken physics in high school. However, students said they always left class feeling like their time was well spent no matter their prior physics experience.\r\n", "num_students": 52, "path": "/courses/22289/sections/001/reviews/5510-ROBERT-R-JOHNSON", "instructor": {"path": "/instructors/5510-ROBERT-R-JOHNSON", "first_name": "ROBERT R", "last_name": "JOHNSON", "id": "5510-ROBERT-R-JOHNSON", "name": "ROBERT R JOHNSON"}, "num_reviewers": 52, "id": "22289-001-5510-ROBERT-R-JOHNSON"}]