[{"ratings": {"rAmountLearned": "3.43", "rDifficulty": "3.02", "rStimulateInterest": "2.99", "rRecommendMajor": "3.25", "rCourseQuality": "3.27", "rWorkRequired": "3.82", "rInstructorAccess": "3.12", "rReadingsValue": "3.08", "rRecommendNonMajor": "2.93", "rCommAbility": "3.35", "rInstructorQuality": "3.28"}, "section": {"name": "ENGINEERING ECONOMICS", "sectionnum": "401", "primary_alias": "ESE-400-401", "path": "/courses/24366/sections/401", "id": "24366-401", "aliases": ["ESE-400-401", "ESE-540-401"]}, "comments": "This course investigates methods of economic analysis for decision-making\r\namong alternative courses of action in engineering applications. The topics covered\r\ninclude cost-driven design economics, break-even analysis, money-time relationships,\r\nrates of return, cost estimation, depreciation, taxes, foreign exchange rates, life cycle\r\nanalysis, benefit-cost ratios, risk analysis, capital financing and allocation, and financial\r\nstatement analysis. Case studies apply these topics to actual engineering problems.\r\nStudents for the most part found this “interesting” course to be “worthwhile.”\r\nStudents felt that they learned a lot throughout the semester and the knowledge they\r\ngained was very applicable to real world situations.\r\nStudents that took this course felt that Professor Cassel was a great professor that\r\nexplained concepts well. They also felt that he organized the course very well.\r\nThis course required a lot of work and covers a lot of material in a short period of\r\ntime. The case studies, in addition the weekly homework assignments, necessitated a\r\nlarge time commitment. Students felt that Professor Cassel had “no mercy” in the amount\r\nof work that he assigned. The only prerequisite for this course is knowledge of\r\ndifferential calculus.", "num_students": 97, "path": "/courses/24366/sections/401/reviews/317-THOMAS-A--CASSEL", "instructor": {"path": "/instructors/317-THOMAS-A--CASSEL", "first_name": "THOMAS A.", "last_name": "CASSEL", "id": "317-THOMAS-A--CASSEL", "name": "THOMAS A. CASSEL"}, "num_reviewers": 91, "id": "24366-401-317-THOMAS-A--CASSEL"}]