[{"ratings": {"rAmountLearned": "2.73", "rDifficulty": "2.38", "rStimulateInterest": "2.92", "rRecommendMajor": "3.56", "rCourseQuality": "2.84", "rWorkRequired": "1.87", "rInstructorAccess": "2.75", "rReadingsValue": "1.76", "rRecommendNonMajor": "2.28", "rCommAbility": "3.08", "rInstructorQuality": "3.13"}, "section": {"name": "ECON & FIN HLTH CARE DEL", "sectionnum": "401", "primary_alias": "HCMG-302-401", "path": "/courses/15862/sections/401", "id": "15862-401", "aliases": ["HCMG-302-401", "ECON-236-401"]}, "comments": "This course provides an application of economic principles to the health care sector. In particular, the course will analyze determinants of demand for medical care, such as health status, insurance coverage, and income; the unique role of physicians in guiding and shaping the allocation of resources in medical care markets; and competition in medical care markets, especially among hospitals.\r\n\r\nStudents agreed that the “material is incredibly diverse and interesting.” However, some students wrote that they “would have rather learned less material and gone more in depth.” Also, some found the textbook unhelpful. Despite these concerns, many students wrote that this is “one of the best” classes at Penn.\r\n\r\nMany students complimented Professor David as an “excellent professor,” “a great lecturer,” and “knowledgeable.” Students also found his slides “helpful” as they were “clear and concise.” In fact, students would have preferred not having guest lectures.\r\n\r\nOne student expressed concern that what was covered in class had little to do with problem sets and exams. Another student recommends this class primarily to those interested in “medicine or health care management.” Nevertheless, most students recommend the class to others and feel that it is easy to do well “if you at least put in the effort.”", "num_students": 122, "path": "/courses/15862/sections/401/reviews/2995-GUY-DAVID", "instructor": {"path": "/instructors/2995-GUY-DAVID", "first_name": "GUY", "last_name": "DAVID", "id": "2995-GUY-DAVID", "name": "GUY DAVID"}, "num_reviewers": 118, "id": "15862-401-2995-GUY-DAVID"}]