[{"ratings": {"rAmountLearned": "2.89", "rDifficulty": "3.00", "rStimulateInterest": "2.43", "rRecommendMajor": "3.14", "rCourseQuality": "2.76", "rWorkRequired": "2.68", "rInstructorAccess": "3.32", "rReadingsValue": "2.43", "rRecommendNonMajor": "2.50", "rCommAbility": "2.29", "rInstructorQuality": "2.90"}, "section": {"name": "ADVANCED STATISTICS", "sectionnum": "001", "primary_alias": "BIOL-556-001", "path": "/courses/21370/sections/001", "id": "21370-001", "aliases": ["BIOL-556-001"]}, "comments": "Advanced Statistics has a prerequisite of BIOL 446 or equivalent, and permission of the instructor. The course covers advanced statistical methods, including multivariate techniques (in particular discriminant functions, principal components, multiple correlation, and regression) and the design and analysis of experiments.\r\n\r\nStudents found this course to be very interesting and “practical.” They felt they learned about a range of “useful and valuable” topics. Several students commented on how what they learned will be useful for future research. The course is, however, at a “high difficulty level” and is very fast paced. Students recommended taking a beginner’s course before this one.\r\n\r\nProfessor Petraitis was described as “great” and “very smart.” Students remarked that he was excellent at explaining complicated concepts and going into the history and background of them. One student even said that Professor Petraitis made him realize that “statistics is an art.” However, students were concerned that the class moves too quickly, and felt that Professor Petraitis needed to write more on the board and use more explicit examples, as lectures were often “unclear.”\r\n\r\nOne student was concerned that the homework and exam questions were worded vaguely, and felt that the grading was “subjective.” The recitations were described as very helpful for students since it is easy to get lost in the fast-paced lectures.\r\n", "num_students": 34, "path": "/courses/21370/sections/001/reviews/197-PETER-S-PETRAITIS", "instructor": {"path": "/instructors/197-PETER-S-PETRAITIS", "first_name": "PETER S", "last_name": "PETRAITIS", "id": "197-PETER-S-PETRAITIS", "name": "PETER S PETRAITIS"}, "num_reviewers": 30, "id": "21370-001-197-PETER-S-PETRAITIS"}]