[{"ratings": {"rAmountLearned": "2.65", "rDifficulty": "2.64", "rStimulateInterest": "2.14", "rRecommendMajor": "3.15", "rCourseQuality": "2.44", "rWorkRequired": "2.15", "rInstructorAccess": "2.88", "rReadingsValue": "2.29", "rRecommendNonMajor": "1.75", "rCommAbility": "2.77", "rInstructorQuality": "2.80"}, "section": {"name": "COGNITIVE PSYCHOLOGY", "sectionnum": "001", "primary_alias": "PSYC-151-001", "path": "/courses/22345/sections/001", "id": "22345-001", "aliases": ["PSYC-151-001"]}, "comments": "This class focuses on the analysis of many mental processes in adult humans such as attention, pattern recognition, imagery, memory, action, and mental architecture. Although it is not required at registration, a recitation is required for the class and several choices of days/times is announced on the first day of class. This class reviews the current scientific understanding of human cognition. Cognition refers to the mental activities that support knowing about the world, including perception, memory, reasoning, decision-making and language. Scientific theories of human cognition are based primarily on the results of experimental investigations into human behavior and its neural correlates. Throughout the course, students will review these results in hopes of gaining better insight into how humans think, perceive and communicate.&#8232;&#8232;This course is an extension of the cognitive psychology portion taught in Psychology 001. Students are required to participate in experiments to help deepen their understanding and show an example of the different processes that go on within our minds. Students overall praised the organization of the course and the obvious amount of planning that went into every lecture.&#8232;&#8232;Professor Trueswell was both praised and critiqued for his lectures in this course. Though students said that he used Power Point effectively and did his best to keep students engaged throughout the class period, others found lectures to be a bit dry. Though the material was difficult and sometimes required remembering a lot of details, he spoke clearly and carefully, making sure that all students were following along. &#8232;&#8232;Overall, students found that the tests and homework did not run parallel to the coursework. Homework was thought to be graded inconsistently and tests seemed to be intentionally tricky, especially the multiple choice. Many took this course to fulfill a requirement within the major, and would only recommend it for others trying to do the same. Psychology 001 is a prerequisite, so only those pursuing psychology are advised to register for this course.", "num_students": 150, "path": "/courses/22345/sections/001/reviews/1023-JOHN-C--TRUESWELL", "instructor": {"path": "/instructors/1023-JOHN-C--TRUESWELL", "first_name": "JOHN C.", "last_name": "TRUESWELL", "id": "1023-JOHN-C--TRUESWELL", "name": "JOHN C. TRUESWELL"}, "num_reviewers": 143, "id": "22345-001-1023-JOHN-C--TRUESWELL"}]