[{"ratings": {"rAmountLearned": "3.12", "rDifficulty": "2.71", "rStimulateInterest": "2.97", "rRecommendMajor": "3.46", "rCourseQuality": "2.91", "rWorkRequired": "2.04", "rInstructorAccess": "2.57", "rReadingsValue": "2.23", "rRecommendNonMajor": "2.64", "rCommAbility": "3.14", "rInstructorQuality": "3.09"}, "section": {"name": "HEALTH CARE SYSTEMS", "sectionnum": "001", "primary_alias": "HCMG-101-001", "path": "/courses/27527/sections/001", "id": "27527-001", "aliases": ["HCMG-101-001"]}, "comments": "HCMG 101 takes a policy and politics angle to health care's three persistent issues - access, cost and quality. The roles of patients, physicians, hospitals, insurers, and pharmaceutical companies will be established. The interaction between the government and these different groups will also be covered. Current national health care policy initiatives and the interests of class members will steer the specific topics covered in The course aims to provide skills for critical and analytical thought about the U.S. health care system and the people in it.\r\n\r\nOverall, students had very positive reviews of the class. They mentioned that the course “presents very valuable and relevant information on the changing healthcare system.” Students also enjoyed the guest lecturers as they found them very engaging and interesting. However, students found the exams very difficult as they covered very minute details and focused on statistics instead of concepts. \r\n\r\nProfessor Harrington also had very positive reviews. Students found him “humorous” and “engaging.” Furthermore, they found his slides easy to follow. They also appreciate the fact that the professor made the material more interesting by making “jokes about his own political affiliation and his opinions on current issues.”\r\n\t\r\nThis elective class is recommended for both majors and non-majors alike.\r\n", "num_students": 91, "path": "/courses/27527/sections/001/reviews/3320-SCOTT-HARRINGTON", "instructor": {"path": "/instructors/3320-SCOTT-HARRINGTON", "first_name": "SCOTT", "last_name": "HARRINGTON", "id": "3320-SCOTT-HARRINGTON", "name": "SCOTT HARRINGTON"}, "num_reviewers": 82, "id": "27527-001-3320-SCOTT-HARRINGTON"}]