[{"ratings": {"rAmountLearned": "2.81", "rDifficulty": "2.44", "rStimulateInterest": "2.50", "rRecommendMajor": "2.67", "rCourseQuality": "2.54", "rWorkRequired": "2.00", "rInstructorAccess": "2.81", "rReadingsValue": "2.60", "rRecommendNonMajor": "2.14", "rCommAbility": "2.69", "rInstructorQuality": "2.67"}, "section": {"name": "FINANCING GOVERNMENT", "sectionnum": "401", "primary_alias": "BPUB-777-401", "path": "/courses/27073/sections/401", "id": "27073-401", "aliases": ["BPUB-777-401", "BPUB-204-401"]}, "comments": "This course is about the principal tool for project and policy evaluation in the public sector. For government, whose \"products\" are rarely sold, the valuation of costs and benefits by means alternative to market prices is necessary. It is the counterpart to cost accounting in private firms and provides guidance for avoiding wasteful projects and undertaking those that are worthwhile. In addition, given government regulations, cost benefit evaluations are critical for many private sector activities. Real estate developers, manufacturing firms, employers of all types are required to provide evaluations of environmental impacts and of urban impacts for their proposed projects. They too must engage in cost benefit analysis, in the valuation of social benefits and costs. Government analysts, consultants, and private firms regularly carry out cost benefit analyses for major investments -- bridges, roads, transit systems, convention centers, sports stadia, dams -- as well as for regulatory activities -- OSHA workplace safety regulations and the Clean Air Act are two important examples. PhD students will write a paper on a theoretical or applied issue in cost-benefit analysis in lieu of the final examination. Also listed as BPUB204/BPUB960.\r\nStudents thought this was a “terrific class” that provided “knowledge about how and why the government finances education and social security…and the effect that different taxes and benefits have on people's financial and personal decisions.” There was “a lot of content” but it was “very well presented and applied to current events.”\r\nProfessor Gelber “cares about the material and presents it clearly and directly.” He “made the course material relevant by connecting it to current issues,” which students would then use in their “everyday conversations.”  Professor Gelber has “fantastic energy” and is able to draw on his own experiences, which “really strengthened the course.” Professor Gelber made the material very accessible and does a “great job” at “presenting both sides to every issue despite his background of having worked for the Obama administration.”\r\nStudents would recommend this course to anyone, whether “in their line of study or not; it offers breadth and depth, and that is difficult to come by.” Some of the frameworks were difficult to grasp conceptually.\r\n", "num_students": 49, "path": "/courses/27073/sections/401/reviews/5298-ALEXANDER-GELBER", "instructor": {"path": "/instructors/5298-ALEXANDER-GELBER", "first_name": "ALEXANDER", "last_name": "GELBER", "id": "5298-ALEXANDER-GELBER", "name": "ALEXANDER GELBER"}, "num_reviewers": 47, "id": "27073-401-5298-ALEXANDER-GELBER"}]