[{"ratings": {"rAmountLearned": "2.53", "rDifficulty": "2.37", "rStimulateInterest": "1.79", "rRecommendMajor": "3.05", "rCourseQuality": "2.29", "rWorkRequired": "2.47", "rInstructorAccess": "2.53", "rReadingsValue": "2.28", "rRecommendNonMajor": "2.37", "rCommAbility": "2.39", "rInstructorQuality": "2.57"}, "section": {"name": "ENERGY SYS, RES & TECH", "sectionnum": "001", "primary_alias": "EAS-250-001", "path": "/courses/24251/sections/001", "id": "24251-001", "aliases": ["EAS-250-001"]}, "comments": "The course presents a comprehensive overview of the global demand for energy,\r\nand the resource availability and technology used in its current and future supply.\r\nThrough a personal energy audit, students are made aware of the extensive role that\r\nenergy plays in modern life, both directly, through electricity and transportation fuel, and\r\nindirectly in the manufacturing of goods they use. The course covers how that energy is\r\nsupplied, the anticipated global growth in energy demand, the resources availability and\r\nthe role of science and technology in meeting that demand in a world concerned about\r\nclimate change. The roles of conservation, improved efficiency and renewable energy in\r\nmeeting future demand in a sustainable, environmentally benign way are covered.\r\nStudents found this class to be an “excellent overview” of energy systems. Quite a\r\nfew students felt that the quizzes were too “detail oriented” and the answers too rigid.\r\nThey suggested that the quizzes should focus on broader concepts instead.\r\nOverall, students enjoyed Professor Jackson’s choice of topics and assignments.\r\nHowever, they wished that the professor could provide more feedback on the\r\nassignments.\r\nStudents did not find this course too difficult, but still thought that it required a\r\n“considerable amount of work.” This class is recommended to anyone interested in\r\nenergy.\r\nFewer than eight student comments were submitted for this course.", "num_students": 21, "path": "/courses/24251/sections/001/reviews/5231-ANDREW-JACKSON", "instructor": {"path": "/instructors/5231-ANDREW-JACKSON", "first_name": "ANDREW", "last_name": "JACKSON", "id": "5231-ANDREW-JACKSON", "name": "ANDREW JACKSON"}, "num_reviewers": 21, "id": "24251-001-5231-ANDREW-JACKSON"}]