{"coursehistories": {"path": "/coursehistories/4966"}, "description": "In this course, we will focus on the medium of the graphic novel. First, we will look at its literary history (medieval illuminated manuscripts, Hogarth, Goya, Toepfer, leading us into the 20th and 21th century). Next, we will investigate how graphic novels or comics work, studying them as hybrid word-and-image forms in which two narrative tracks--one veral and one visual--create a \"double vision' genre. We will pay special attention to the material comics are made of (words, images, color,...as well as typical formats) but also to its grammar: the panels (frames), gutters (the empty spaces between the panels) and spatial construction of the page, and aspects such as pace. The differences between the European, American and Asian (especially Japanese) traditions will form a central focus throughout the entire course, with special attention being paid to one of the key countries in the European BD (bande dessinee) tradition, to wit Belgium, which even has a national museum and a biennial festival dedicated to this \"9th Art\". \n\nNext, we will start reading botgh fiction and nonfiction graphic novels to discover the range of \"genres\" or modes one could discern within the medium: the autobiographical mode of personal expression; the superhero-comic; the mode of historical expression which aspires to ethical engagement; \"comics journalism\"; and even theorization of comics in its own medium... Themes that we will look into are the relation between the superhero and the villain, gender issues, childhood, the body, the representation of history, war, trauma, loss, colonialism, religion, identity, ethics,... We will also pay special attention to aspects that are crucial to the medium, such as reader participation and the way in which the different cognitive processes of reading words and pictures relate to each other. We will be reading works and excerpts by, among others, Masereel, Herge, Van Istendael, Swarte, Tardi, Moebius, Larcenet, David B, Sacco, Mignola, Spiegelman, Ware, Clowes, Smith, Burns and Tatsumi. \n\n", "semester": "2011A", "name": "THE GRAPHIC NOVEL: The Graphic Novel. Where Language and Image Meet", "reviews": {"path": "/courses/21806/reviews", "values": [{"ratings": {"rAmountLearned": "3.88", "rDifficulty": "2.00", "rStimulateInterest": "3.88", "rRecommendMajor": "3.88", "rCourseQuality": "3.75", "rWorkRequired": "1.75", "rInstructorAccess": "3.88", "rReadingsValue": "3.88", "rRecommendNonMajor": "4.00", "rCommAbility": "3.88", "rInstructorQuality": "3.88"}, "section": {"name": "THE GRAPHIC NOVEL: The Graphic Novel. Where Language and Image Meet", "sectionnum": "401", "primary_alias": "GRMN-275-401", "path": "/courses/21806/sections/401", "id": "21806-401", "aliases": ["GRMN-275-401", "COML-275-401", "GRMN-575-401", "COML-574-401", "DTCH-275-401"]}, "comments": "", "num_students": 9, "path": "/courses/21806/sections/401/reviews/5378-NELE-K-BEMONG", "instructor": {"path": "/instructors/5378-NELE-K-BEMONG", "first_name": "NELE K", "last_name": "BEMONG", "id": "5378-NELE-K-BEMONG", "name": "NELE K BEMONG"}, "num_reviewers": 8, "id": "21806-401-5378-NELE-K-BEMONG"}]}, "credits": null, "primary_alias": "GRMN-275", "path": "/courses/21806", "sections": {"path": "/courses/21806/sections", "values": [{"name": "THE GRAPHIC NOVEL: The Graphic Novel. Where Language and Image Meet", "sectionnum": "401", "primary_alias": "GRMN-275-401", "path": "/courses/21806/sections/401", "id": "21806-401", "aliases": ["GRMN-275-401", "COML-275-401", "GRMN-575-401", "COML-574-401", "DTCH-275-401"]}]}, "id": 21806, "aliases": ["GRMN-275", "COML-275", "GRMN-575", "COML-574", "DTCH-275"]}