{"coursehistories": {"path": "/coursehistories/1292"}, "description": "Numerical modeling using effective algorithms with applications to problems in engineering, science, and mathematics, and is intended for graduate and advanced undergraduate students in these areas. Interpolation and curve fitting, numerical integration, solution of ordinary and partial differential equations by finite difference, and finite element methods. Includes use of representative numerical software packages such as MATLAB PDE Toolbox. \n\n", "semester": "2010A", "name": "NUMERICAL MTHDS & MODLNG", "reviews": {"path": "/courses/25967/reviews", "values": [{"ratings": {"rAmountLearned": "2.85", "rDifficulty": "3.50", "rStimulateInterest": "2.00", "rRecommendMajor": "2.91", "rCourseQuality": "2.41", "rWorkRequired": "3.63", "rInstructorAccess": "2.25", "rReadingsValue": "1.87", "rRecommendNonMajor": "1.67", "rCommAbility": "2.73", "rInstructorQuality": "2.53"}, "section": {"name": "NUMERICAL MTHDS & MODLNG", "sectionnum": "001", "primary_alias": "ENM-502-001", "path": "/courses/25967/sections/001", "id": "25967-001", "aliases": ["ENM-502-001"]}, "comments": "This course will introduce the fundamentals of Numerical Methods for a broad engineering and applied science audience. The primary goal of the course is to provide a broad background in numerical methods. Most of the applications will be based on the use of MATLAB software. Topics will include numerical linear algebra, solution of linear systems of equations, nonlinear equations, nonlinear equations, integration of ordinary differential equations, and solutions of partial differential equations by finite difference and finite element methods.\r\n\r\nMany students liked the material presented and agreed that the course was “interesting”. Students also praised the “very thorough” course material citing that they “learned a great deal about different types of numerical methods”. Although some found the course difficult without prior MATLAB experience and thought that “more practical examples would be useful”, others thought the course moved “extremely slow because the material [was] repeated multiple times”.\r\n\r\nAlthough, some students enjoyed Professor Sinno’s teaching style in that it kept students “attentive and challenged”; others found Professor Sinno to be “abrasive”, “disorganized”, and “unapproachable”. Overall, students lamented his “intimidating” attitude, with one student noting “[the professor's] reluctance to respond to him” and his own subsequent inability to \"ask questions\".\r\n\r\nOverall, students found the class to be “appropriately challenging on the graduate level”. Students had a mixed opinion on the projects – some thought there was not enough connection to the lecture while others thought there was not enough time to complete the assignments. However, many students felt accomplished seeing their completed projects. Students commented that this course should not be recommended for those with little prior programming experience, especially in MATLAB. ", "num_students": 36, "path": "/courses/25967/sections/001/reviews/217-TALID-R--SINNO", "instructor": {"path": "/instructors/217-TALID-R--SINNO", "first_name": "TALID R.", "last_name": "SINNO", "id": "217-TALID-R--SINNO", "name": "TALID R. SINNO"}, "num_reviewers": 34, "id": "25967-001-217-TALID-R--SINNO"}]}, "credits": null, "primary_alias": "ENM-502", "path": "/courses/25967", "sections": {"path": "/courses/25967/sections", "values": [{"name": "NUMERICAL MTHDS & MODLNG", "sectionnum": "001", "primary_alias": "ENM-502-001", "path": "/courses/25967/sections/001", "id": "25967-001", "aliases": ["ENM-502-001"]}]}, "id": 25967, "aliases": ["ENM-502"]}