{"coursehistories": {"path": "/coursehistories/1686"}, "description": "Survey course introducing students to the breadth of bioengineering. Course consists of weekly guest lectures and a series of small projects and reports that allow students to explore different facets of bioengineering. \n\n", "semester": "2010C", "name": "INTRO TO BIOENGINEERING", "reviews": {"path": "/courses/22679/reviews", "values": [{"ratings": {"rAmountLearned": "1.77", "rDifficulty": "1.85", "rStimulateInterest": "2.62", "rRecommendMajor": "2.82", "rCourseQuality": "1.89", "rWorkRequired": "2.50", "rInstructorAccess": "2.75", "rReadingsValue": "1.40", "rRecommendNonMajor": "0.56", "rCommAbility": "2.94", "rInstructorQuality": "2.95"}, "section": {"name": "INTRO TO BIOENGINEERING", "sectionnum": "001", "primary_alias": "BE-100-001", "path": "/courses/22679/sections/001", "id": "22679-001", "aliases": ["BE-100-001"]}, "comments": "This is a survey course introducing students to the breadth of bioengineering. It consists of weekly guest lectures and a series of small projects and reports that allow students to explore different facets of bioengineering. MATLAB is a heavy component of this course, as well as a semester-long design project.\r\n\r\nMost students did not feel that MATLAB was taught effectively and that what was required in the programming assignments was far more difficult than what was covered in class. Nonetheless, most recognized the importance of learning MATLAB. Several students felt that while the course provided decent exposure to bioengineering and its subdisciplines, it was not organized well and was a “waste of time” and “a train wreck.” Students generally found the guest lecturers to be “insightful,” but they could not fully enjoy them since they were required to complete three essay questions before the end of the class.\r\n\r\nMany students described Professor Margulies as having the “ability to expose us to numerous fields within bioengineering” and “trying very hard to make the class successful.”\r\n\r\nStudents reported spending up to five hours on the MATLAB assignments, which were considered by many to be “frustrating” “busywork.” Several students recommended purchasing a MATLAB manual and downloading the software. The homework was described as “simply useless as no readings are tested and so no information need be absorbed.” This course is open to freshmen only and is directed toward students interested in majoring or minoring in Bioengineering. MATH 104 and PHYS 140/150 are co-requisites.\r\n", "num_students": 131, "path": "/courses/22679/sections/001/reviews/163-SUSAN-S-MARGULIES", "instructor": {"path": "/instructors/163-SUSAN-S-MARGULIES", "first_name": "SUSAN S", "last_name": "MARGULIES", "id": "163-SUSAN-S-MARGULIES", "name": "SUSAN S MARGULIES"}, "num_reviewers": 120, "id": "22679-001-163-SUSAN-S-MARGULIES"}, {"ratings": {"rAmountLearned": "1.77", "rDifficulty": "1.85", "rStimulateInterest": "1.86", "rRecommendMajor": "2.82", "rCourseQuality": "1.89", "rWorkRequired": "2.50", "rInstructorAccess": "3.00", "rReadingsValue": "1.40", "rRecommendNonMajor": "0.56", "rCommAbility": "2.53", "rInstructorQuality": "2.61"}, "section": {"name": "INTRO TO BIOENGINEERING", "sectionnum": "001", "primary_alias": "BE-100-001", "path": "/courses/22679/sections/001", "id": "22679-001", "aliases": ["BE-100-001"]}, "comments": "BE 100 is a survey course introducing students to the breadth of bioengineering. The course consists of weekly guest lectures and a series of small projects and reports that allow students to explore different facets of bioengineering. There is also a heavy emphasis on MATLAB in addition to a semester-long design project. \r\n\r\nMost students felt that MATLAB was not taught effectively and that the programming assignments were far more difficult than the level covered in class. Nonetheless, most students recognized the importance of learning MATLAB. Although the course was considered to provide decent exposure to bioengineering, several students felt that it was not organized well and could at times be a “waste of time.” Students generally found the guest lecturers “insightful,” but they did not fully enjoy the lectures because they were required to complete three essay questions before the end of the class. \r\n\r\nProfessor Rizk was described by many students as having the “ability to expose us to numerous fields within bioengineering” and as “trying very hard to make the class successful.” Many felt that he should have taught the MATLAB portions of the class in a computer lab so that the students could “walk through the code” with him and have a better idea of what he was talking about. \r\n\r\nStudents reported spending many hours on the MATLAB assignments, which were considered by many to be “frustrating” and “busywork.” Students recommended purchasing a MATLAB manual and downloading the software. Some students felt that the homework was “simply useless, as no readings are tested”. This course is open to freshmen only and is directed toward students interested in majoring or minoring in bioengineering. MATH 104 and PHYS 140/150 are co-requisites.\r\n", "num_students": 131, "path": "/courses/22679/sections/001/reviews/4750-MICHAEL-RIZK", "instructor": {"path": "/instructors/4750-MICHAEL-RIZK", "first_name": "MICHAEL", "last_name": "RIZK", "id": "4750-MICHAEL-RIZK", "name": "MICHAEL RIZK"}, "num_reviewers": 120, "id": "22679-001-4750-MICHAEL-RIZK"}]}, "credits": null, "primary_alias": "BE-100", "path": "/courses/22679", "sections": {"path": "/courses/22679/sections", "values": [{"name": "INTRO TO BIOENGINEERING", "sectionnum": "001", "primary_alias": "BE-100-001", "path": "/courses/22679/sections/001", "id": "22679-001", "aliases": ["BE-100-001"]}]}, "id": 22679, "aliases": ["BE-100"]}