{"coursehistories": {"path": "/coursehistories/3180"}, "description": "Modern Hebrew literature, an offspring of Zionism, has long rejected writing about one's personal life as embarrassing egocentrism and self-exposure. However, many well-known Israeli artists have reached the age where they want to tell their true stories, and the younger generation has grown up in an individualistic period where it is acceptable to talk about open wounds and trauma. Israeli scholar of autobiography Nitza Ben-Dov sees this trend as a symptom of the culture of exposure in which we live (e.g. reality TV, Facebook, etc.). In addition to the author's life. Therefore, the genres examined in this course are fluid: we will be studying memoirs; poetry and prose that conceal the author's life story; and even biographies (literary or not). Authors to be studied included: Yehuda Amichai, Dahlia Ravikovitch, Haim Be'er, Aharon Appelfeld, Amos Oz, Sami Michael, and S.Y. Agnon. Filmmakers include: Dror Shaul, Eli Cohen and Ari Folman. Not everything included in the syllabus will be studied. All works in translation. There will be 5-6 film screenings. Films will be placed on reserve at the library for those unable to attend the screenings. The contents of the course changes from year to year so students may take it for credit more than once. \n\n", "semester": "2010A", "name": "MOD HEB LIT & CULT TRANS: THE CITY IN ISR LIT/FILM", "reviews": {"path": "/courses/26476/reviews", "values": [{"ratings": {"rAmountLearned": "2.63", "rDifficulty": "1.69", "rStimulateInterest": "3.00", "rRecommendMajor": "3.44", "rCourseQuality": "2.89", "rWorkRequired": "1.81", "rInstructorAccess": "2.91", "rReadingsValue": "3.00", "rRecommendNonMajor": "3.06", "rCommAbility": "3.41", "rInstructorQuality": "3.33"}, "section": {"name": "MOD HEB LIT & CULT TRANS: THE CITY IN ISR LIT/FILM", "sectionnum": "401", "primary_alias": "NELC-159-401", "path": "/courses/26476/sections/401", "id": "26476-401", "aliases": ["NELC-159-401", "CINE-159-401", "JWST-102-401", "COML-282-401"]}, "comments": "This course examines cinematic and literary portrayals of childhood by Israelis and Europeans. Themes include conflicts, personal traumas, and nostalgia. Additionally, the course analyzes how film, poetry and prose use their respective languages to reconstruct the image of childhood; it discusses the authors’ and directors’ struggle to penetrate the psyche of a child and to retrieve fragments of past events, both personal and historical. There are five to six film screenings. \r\n\r\nAll students showed a moderate concern for the general structure of the course. Many students stated that the class was too big for in-depth discussions and suggested having “too much to cover but not enough time to cover it” as the main reason. Although many students enjoyed all the assigned readings which were able to “really open [their] eyes to new ideas, concepts, and perspectives,” some students also thought that some of the readings did not seem to fit the course theme, but “were stretched to fit it.”\r\n\r\nProfessor Gold, according to students, was “able to stimulate interesting discussions, be incredibly informative, and also be incredibly entertaining” at the same time. Most students described her as “knowledgeable” and “spirited.” Students often stated that the professor “sometimes seemed to incorporate her own thoughts into discussions,” keeping students’ actual opinions from being heard in class discussions.\r\n\r\nThe content of this course changes from year to year. Therefore, students may take the class for credit more than once. This course was recommended for majors and non-majors alike.", "num_students": 37, "path": "/courses/26476/sections/401/reviews/63-NILI-RACHEL-SCHARF-GOLD", "instructor": {"path": "/instructors/63-NILI-RACHEL-SCHARF-GOLD", "first_name": "NILI RACHEL SCHARF", "last_name": "GOLD", "id": "63-NILI-RACHEL-SCHARF-GOLD", "name": "NILI RACHEL SCHARF GOLD"}, "num_reviewers": 36, "id": "26476-401-63-NILI-RACHEL-SCHARF-GOLD"}]}, "credits": null, "primary_alias": "NELC-159", "path": "/courses/26476", "sections": {"path": "/courses/26476/sections", "values": [{"name": "MOD HEB LIT & CULT TRANS: THE CITY IN ISR LIT/FILM", "sectionnum": "401", "primary_alias": "NELC-159-401", "path": "/courses/26476/sections/401", "id": "26476-401", "aliases": ["NELC-159-401", "CINE-159-401", "JWST-102-401", "COML-282-401"]}]}, "id": 26476, "aliases": ["NELC-159", "CINE-159", "JWST-102", "COML-282"]}