{"coursehistories": {"path": "/coursehistories/947"}, "description": "This course focuses on evaluating the experiments that have sought to establish links between brain structure (the activity of specific brain circuits) and behavioral function (the control of particular motivated and emotional behaviors). Students are exposed to concepts from regulatory physiology, systems neuroscience, pharmacology, and endocrinology and read textbook as well as original source materials. The course focuses on the following behaviors: feeding, sex, fear, anxiety, the appetite for salt, and food aversion. The course also considers the neurochemical control of responses with an eye towards evaluating the development of drug treatments for: obesity, anorexia/cachexia, vomiting, sexual dysfunction, anxiety disorders, and depression. \n\n", "semester": "2009C", "name": "PHYSIOLOGY MOTIVATED BEH", "reviews": {"path": "/courses/17984/reviews", "values": [{"ratings": {"rAmountLearned": "2.42", "rDifficulty": "3.07", "rStimulateInterest": "1.76", "rRecommendMajor": "2.69", "rCourseQuality": "1.98", "rWorkRequired": "2.78", "rInstructorAccess": "1.95", "rReadingsValue": "2.49", "rRecommendNonMajor": "1.11", "rCommAbility": "2.05", "rInstructorQuality": "1.98"}, "section": {"name": "PHYSIOLOGY MOTIVATED BEH", "sectionnum": "401", "primary_alias": "PSYC-127-401", "path": "/courses/17984/sections/401", "id": "17984-401", "aliases": ["PSYC-127-401", "BIBB-227-401"]}, "comments": "This course focuses on evaluating the experiments that have sought to establish links between brain structure (the activity of specific brain circuits) and behavioral function (the control of particular motivated and emotional behaviors). Students are exposed to concepts from regulatory physiology, systems neuroscience, pharmacology, and endocrinology, and read textbook as well as original source materials. The course focuses on the following behaviors: feeding, sex, fear, anxiety, the appetite for salt, and food aversion. The course also considers the neuro-chemical control of responses with an eye towards evaluating the development of drug treatments for: obesity, anorexia/cachexia, vomiting, sexual dysfunction, anxiety disorders, and depression.\r\n\r\nMost students thought that the class was very difficult, disorganized, and frustrating. While some students were able to get through dense readings from psychology papers, most students found the course to be very challenging and not very interesting.\r\n\r\nProfessor Grill received mixed reviews for his teaching style. Some students described Professor Grill as very disorganized and unable to explain concepts simply. They claimed that his lectures were somewhat “erratic”. Other students appreciated his slow and methodical explanations, insisting that “his teaching style actually helps (the student) take in the complex material.”\r\n\r\nWhile the material and topics were interesting to students, several reported that the grading of exams was unfair and difficult. The essays required lengthy answers, but time constraints limited students’ ability to answer them appropriately. The lack of explanation about the grading system made it difficult for students to gauge their level in the class. The class was recommended for majors and students maintain that “this is a great class for anyone who enjoys linking physiological (specifically neurological) structure to function.” PSYC 001 is a prerequisite for this course.\r\n", "num_students": 55, "path": "/courses/17984/sections/401/reviews/1021-HARVEY-J-GRILL", "instructor": {"path": "/instructors/1021-HARVEY-J-GRILL", "first_name": "HARVEY J", "last_name": "GRILL", "id": "1021-HARVEY-J-GRILL", "name": "HARVEY J GRILL"}, "num_reviewers": 48, "id": "17984-401-1021-HARVEY-J-GRILL"}]}, "credits": null, "primary_alias": "PSYC-127", "path": "/courses/17984", "sections": {"path": "/courses/17984/sections", "values": [{"name": "PHYSIOLOGY MOTIVATED BEH", "sectionnum": "401", "primary_alias": "PSYC-127-401", "path": "/courses/17984/sections/401", "id": "17984-401", "aliases": ["PSYC-127-401", "BIBB-227-401"]}]}, "id": 17984, "aliases": ["PSYC-127", "BIBB-227"]}