{"coursehistories": {"path": "/coursehistories/2936"}, "description": "The aim of this course is to provide an interdisciplinary examination of the complex array of African American and other African Diaspora social practices and experiences. This class will focus on both classic texts and modern works that provide an introduction to the dynamics of African American and African Diaspora thought and practice. Topics include: What is Africana Studies?; The History Before 1492; Creating the African Diaspora After 1500; The Challenge of Freedom; Race, Gender and Class in the 20th Century; From Black Studies to Africana Studies: The Future of Africana Studies. \n\n", "semester": "2010C", "name": "INTRO AFRICANA STUDIES", "reviews": {"path": "/courses/22579/reviews", "values": [{"ratings": {"rAmountLearned": "2.21", "rDifficulty": "2.91", "rStimulateInterest": "2.33", "rRecommendMajor": "2.76", "rCourseQuality": "2.14", "rWorkRequired": "2.97", "rInstructorAccess": "2.61", "rReadingsValue": "2.12", "rRecommendNonMajor": "1.76", "rCommAbility": "2.15", "rInstructorQuality": "2.31"}, "section": {"name": "INTRO AFRICANA STUDIES", "sectionnum": "401", "primary_alias": "AFRC-001-401", "path": "/courses/22579/sections/401", "id": "22579-401", "aliases": ["AFRC-001-401", "ENGL-071-401"]}, "comments": "This course provides an interdisciplinary examination of the complex array of African American and other African Diaspora social practices and experiences. This class focuses on both classic texts and modern works that provide an introduction to the dynamics of African American and African Diaspora thought and practice. Topics include: What is Africana Studies?; The History Before 1492; Creating the African Diaspora After 1500; The Challenge of Freedom; Race, Gender and Class in the 20th Century; From Black Studies to Africana Studies: The Future of Africana Studies. &#8232;&#8232;\r\n\r\nStudents' feelings about the course structure were mixed. Some students thought the information presented in the course \"was intellectually stimulating\" and found the personal stories that the professor encouraged students \"enjoyable.\" Others believed that the discussions were overly focused on sharing personal anecdotes, rather than thinking critically and sharing insightful thoughts.&#8232;\r\n\r\n&#8232;Students agreed that Professor Beavers taught \"with a breadth and depth that allowed for engagement with the material on a wide spectrum of levels.” However, the professor could be \"a bit pompous,” and many students had difficulty approaching him or discussing concerns about class structure. His \"disorganized style of teaching\" failed to generate quality discussions in class. Nevertheless, a few students commented that, \"as long as [students] are willing to put in work, he's willing to help.\"&#8232;\r\n\r\nStudents commented that this class is perfect for an introductory class and that it is likely to have a strong mix of underclassmen and upperclassmen. Students thought that there were too many assigned readings and that they were often unrelated. The assignments such as papers were \"not easily graded.\"\r\n", "num_students": 39, "path": "/courses/22579/sections/401/reviews/1408-HERMAN-BEAVERS", "instructor": {"path": "/instructors/1408-HERMAN-BEAVERS", "first_name": "HERMAN", "last_name": "BEAVERS", "id": "1408-HERMAN-BEAVERS", "name": "HERMAN BEAVERS"}, "num_reviewers": 35, "id": "22579-401-1408-HERMAN-BEAVERS"}]}, "credits": null, "primary_alias": "AFRC-001", "path": "/courses/22579", "sections": {"path": "/courses/22579/sections", "values": [{"name": "INTRO AFRICANA STUDIES", "sectionnum": "401", "primary_alias": "AFRC-001-401", "path": "/courses/22579/sections/401", "id": "22579-401", "aliases": ["AFRC-001-401", "ENGL-071-401"]}]}, "id": 22579, "aliases": ["AFRC-001", "ENGL-071"]}