{"coursehistories": {"path": "/coursehistories/5399"}, "description": "How does the body speak even in the absence of words? In what ways do thoughts, feelings, messages, and experiences mark the body, revealing the invisible internal and making it visible to the understanding eye? Have notions of bodily communication changed over time? How were prevailing ideas about the languages of the body marked by wider philosophical, artistic, literary, scientific, and medical trends? \n\nIn this course, we will explore the speaking body from the eighteenth century through the early twentieth. Starting with the doctrine of maternal impressions, we will look at the ways in which the body became marked, and how these markings were expressed and understood. We will then explore physiognomy, phrenology, hysteria, and shell shock, ending the semester with a provocative discussion of psychosomatic medicine, and the modern manifestations of phrenology and physiognomy. \n\nDrawing on a variety of material and types of evidence, we will explore literary and historical documents, as well as works of art and visual culture. The assignments will be equally wide-ranging, including response papers, a primary source analysis, presentations, internet searches, visual analyses, and diary entries. The course will culminate in a written paper which will be produces in stages with careful and detailed guidance. In preparation for these assignments, we will dive in to the depths of Van Pelt to explore its treasures, and we will meet with a resource librarian to prepare ourselves to take full advantage of the resources on offer. We will also take at least one field trip to the Mutter Museum to examine their holdings and exhibits. \n\nWe will emerge from this seminar with a greater understanding of the speaking body, as well as with a variety of methodological scholarly tools for conducting interdisciplinary research. This course will be highly demanding, requiring all participants to engage fully with the material and to challenge themselves to think creatively and rigorously about the themes of the course. Students will receive a great deal of assistance and writing and research, and will also work closely with one another to share the unique skills and talents that each brings to the course material. \n\n", "semester": "2012A", "name": "The Speaking Body and the Marks of the Mind in Modern Western Culture", "reviews": {"path": "/courses/27201/reviews", "values": [{"ratings": {"rAmountLearned": "2.93", "rDifficulty": "1.40", "rStimulateInterest": "3.40", "rRecommendMajor": "3.20", "rCourseQuality": "3.07", "rWorkRequired": "1.86", "rInstructorAccess": "3.13", "rReadingsValue": "2.87", "rRecommendNonMajor": "2.93", "rCommAbility": "3.80", "rInstructorQuality": "3.47"}, "section": {"name": "The Speaking Body and the Marks of the Mind in Modern Western Culture", "sectionnum": "301", "primary_alias": "COMM-108-301", "path": "/courses/27201/sections/301", "id": "27201-301", "aliases": ["COMM-108-301"]}, "comments": "", "num_students": 17, "path": "/courses/27201/sections/301/reviews/4291-SHARRONA-HYLA-PEARL", "instructor": {"path": "/instructors/4291-SHARRONA-HYLA-PEARL", "first_name": "SHARRONA HYLA", "last_name": "PEARL", "id": "4291-SHARRONA-HYLA-PEARL", "name": "SHARRONA HYLA PEARL"}, "num_reviewers": 15, "id": "27201-301-4291-SHARRONA-HYLA-PEARL"}]}, "credits": null, "primary_alias": "COMM-108", "path": "/courses/27201", "sections": {"path": "/courses/27201/sections", "values": [{"name": "The Speaking Body and the Marks of the Mind in Modern Western Culture", "sectionnum": "301", "primary_alias": "COMM-108-301", "path": "/courses/27201/sections/301", "id": "27201-301", "aliases": ["COMM-108-301"]}]}, "id": 27201, "aliases": ["COMM-108"]}