[{"ratings": {"rAmountLearned": "2.39", "rDifficulty": "1.89", "rStimulateInterest": "2.37", "rRecommendMajor": "3.36", "rCourseQuality": "2.34", "rWorkRequired": "1.91", "rInstructorAccess": "2.86", "rReadingsValue": "2.29", "rRecommendNonMajor": "2.67", "rCommAbility": "2.72", "rInstructorQuality": "2.59"}, "section": {"name": "NEIGHBRHD DYN. OF CRIME", "sectionnum": "401", "primary_alias": "CRIM-280-401", "path": "/courses/21514/sections/401", "id": "21514-401", "aliases": ["CRIM-280-401", "SOCI-380-401"]}, "comments": "This course examines the influence of time, space, populations, and interactions on how crime develops in a neighborhood. This course will offer an overview of the socio-demographic structures and physical environments that predict variations in criminal behavior between neighborhoods. Students will explore both ethnographic and quantitative research data to examine the interactions between social and physical environments that lead to crime. &#8232;&#8232;Students expressed concern about the content of the course, noting that many topics were not thoroughly examined in class. One student argued that there was “little guidance or overall cohesion of the course.” Students maintained that the material was “informative,” but tended to think that the course “needs a little more structure.”&#8232;&#8232;Many students were favorable towards Professor Stokes. Students praised Professor Stokes for “great lectures’ and “a great sense of humor” that helped to keep the class interesting. Students cautioned, however that, “class was often canceled and not rescheduled.” Some students also expressed criticism about the lack of established office hours, which made contact with Professor Stokes difficult.&#8232;This course is not listed as fulfilling any major college requirements. In addition, there are no prerequisites listed. The course is open to both college freshmen and upperclassmen.", "num_students": 45, "path": "/courses/21514/sections/401/reviews/5330-ROBERT-J-STOKES", "instructor": {"path": "/instructors/5330-ROBERT-J-STOKES", "first_name": "ROBERT J", "last_name": "STOKES", "id": "5330-ROBERT-J-STOKES", "name": "ROBERT J STOKES"}, "num_reviewers": 41, "id": "21514-401-5330-ROBERT-J-STOKES"}]