{"coursehistories": {"path": "/coursehistories/2550"}, "description": "Stochastic systems analysis and simulation (ESE 303) is a class that explores stochastic systems which we could loosely define as anything random that changes in time. Stochastic systems are at the core of a number of disciplines in engineering, for example communication systems and machine learning. They also find application elsewhere, including social systems, markets, molecular biology and epidemiology. The goal of the class is to learn how to model, analyze and simulate stochastic systems. With respect to analysis we distinguish between what we could call theoretical and experimental analysis. By theoretical analysis we refer to a set of tools which let us discover and understand properties of the system. These analysis can only take us so far and is usually complemented with numerical analysis of experimental outcomes. Although we use the word experiment more often than not we simulate the stochastic system in a computer and analyze the outcomes of these virtual experiments. \n\nThe class's material is divided in four blocks respectively dealing with Markov chains, continuous time Markov chains, Gaussian processes and stationary processes. Emphasis is placed in the development of toolboxes to analyze these different classes of processes and on describing their applications to complex stochastic systems in different disciplines. Particular examples include: (i) the problem of ranking web pages by a search engine; (ii) the study of reputation and trust in social networks; (iii) modeling and analysis of communication networks; (iv) the use of queues in the modeling of transportation networks; (v) stochastic modeling and simulation of biochemical reactions and gene networks; (vi) arbitrages, pricing of stocks, and pricing of options through Black-Scholes formula; and (vii) linear filtering of stochastic processes to separate signals of interest from background noise. For more information visit the class's web page at http://alliance.seas.upenn.edu/~ese303/wiki/. \n\n", "semester": "2012C", "name": "STOCH SYS ANALYSIS SIMUL", "reviews": {"path": "/courses/28899/reviews", "values": [{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "3.49", "rTAQuality": "2.72", "rStimulateInterest": "3.05", "rRecommendMajor": "3.44", "rCourseQuality": "2.93", "rWorkRequired": "3.31", "rInstructorAccess": "2.84", "rReadingsValue": "2.11", "rRecommendNonMajor": "1.62", "rCommAbility": "3.18", "rInstructorQuality": "3.24"}, "section": {"name": "STOCH SYS ANALYSIS SIMUL", "sectionnum": "001", "primary_alias": "ESE-303-001", "path": "/courses/28899/sections/001", "id": "28899-001", "aliases": ["ESE-303-001"]}, "comments": "", "num_students": 47, "path": "/courses/28899/sections/001/reviews/4320-ALEJANDRO-RIBEIRO", "instructor": {"path": "/instructors/4320-ALEJANDRO-RIBEIRO", "first_name": "ALEJANDRO", "last_name": "RIBEIRO", "id": "4320-ALEJANDRO-RIBEIRO", "name": "ALEJANDRO RIBEIRO"}, "num_reviewers": 45, "id": "28899-001-4320-ALEJANDRO-RIBEIRO"}]}, "credits": null, "primary_alias": "ESE-303", "path": "/courses/28899", "sections": {"path": "/courses/28899/sections", "values": [{"name": "STOCH SYS ANALYSIS SIMUL", "sectionnum": "001", "primary_alias": "ESE-303-001", "path": "/courses/28899/sections/001", "id": "28899-001", "aliases": ["ESE-303-001"]}]}, "id": 28899, "aliases": ["ESE-303"]}