[{"ratings": {"rAmountLearned": "2.59", "rDifficulty": "2.89", "rStimulateInterest": "2.36", "rRecommendMajor": "3.20", "rCourseQuality": "2.55", "rWorkRequired": "2.24", "rInstructorAccess": "2.67", "rReadingsValue": "1.87", "rRecommendNonMajor": "1.82", "rCommAbility": "2.84", "rInstructorQuality": "2.67"}, "section": {"name": "COGNITIVE NEUROSCIENCE", "sectionnum": "401", "primary_alias": "PSYC-149-401", "path": "/courses/28068/sections/401", "id": "28068-401", "aliases": ["PSYC-149-401", "BIBB-249-401"]}, "comments": "The study of the neural systems that underlie human perception, memory and language; and of the pathological syndromes that result from damage to these systems. \r\n\r\nA vast majority of students seemed to agree that this course was “very difficult.” Many remarked that it “was a great class taken as a whole, but required the memorization of so much material that it proved impossible.” Students also stated that it seemed to overlap a lot with other psychology, BBB, and biology classes.\r\n\r\nThe majority of the students stated that Dr. Epstein was “very knowledgeable and passionate” but sometimes “confusing.” Most students felt that he had a good relationship with the class. A lot of students felt that Dr. Epstein was “too passive,” however, and let the TAs have too much control in grading, allowing for the arbitrary grading.\r\n\r\nStudents would recommend this course to anyone interesting in neuroscience, but made clear that people without a biology background might struggle. The class was said to be very memorization based. The grading was the main issue most students had, affirming that it was “arbitrary” and “too rigid.” ", "num_students": 153, "path": "/courses/28068/sections/401/reviews/2317-RUSSELL-ALAN-EPSTEIN", "instructor": {"path": "/instructors/2317-RUSSELL-ALAN-EPSTEIN", "first_name": "RUSSELL ALAN", "last_name": "EPSTEIN", "id": "2317-RUSSELL-ALAN-EPSTEIN", "name": "RUSSELL ALAN EPSTEIN"}, "num_reviewers": 149, "id": "28068-401-2317-RUSSELL-ALAN-EPSTEIN"}]