[{"ratings": {"rAmountLearned": "2.44", "rDifficulty": "2.66", "rStimulateInterest": "1.47", "rRecommendMajor": "2.81", "rCourseQuality": "2.19", "rWorkRequired": "2.59", "rInstructorAccess": "2.06", "rReadingsValue": "2.72", "rRecommendNonMajor": "2.03", "rCommAbility": "2.31", "rInstructorQuality": "2.16"}, "section": {"name": "URBAN CRISIS", "sectionnum": "401", "primary_alias": "HIST-153-401", "path": "/courses/26190/sections/401", "id": "26190-401", "aliases": ["HIST-153-401", "URBS-104-401"]}, "comments": "The course traces the economic, social, and political history of American cities after World War II. It focuses on how the economic problems of the industrial city were compounded by the racial conflicts of the 1950s and 1960s and the fiscal crises of the 1970s. The last part of the course examines the forces that led to the revitalization of cities in recent years.\r\n\r\nStudents commented that while the subject matter was very interesting, “the logistics of the class hindered it.” Many students thought the class would have been taught better in a small seminar setting instead of a big lecture in a room that “Was too large to have discussions.” \r\n\r\nStudents’ feelings for Professor Katz was mixed: while some students described him as “very knowledgeable and passionate about the topic,” some students thought he was “not very involved in the course.” Students sometimes found him “mumbling and going off on irrelevant tangents.” Due to these reasons, some students felt disconnected from the professor and the course. Students commented that Professor Katz “would be better in a small seminar setting.”\r\n\r\nAccording to students, the course readings were well-thought out and they complemented each other well. However, some students stated that keeping up with the reading “took more effort than expected.” This course was highly recommended to non-majors who are interested in the history of cities, because a lot of students found the class to be a “great introduction to urban studies,” and became interested in the major.", "num_students": 41, "path": "/courses/26190/sections/401/reviews/657-MICHAEL-B-KATZ", "instructor": {"path": "/instructors/657-MICHAEL-B-KATZ", "first_name": "MICHAEL B", "last_name": "KATZ", "id": "657-MICHAEL-B-KATZ", "name": "MICHAEL B KATZ"}, "num_reviewers": 39, "id": "26190-401-657-MICHAEL-B-KATZ"}]