{"coursehistories": {"path": "/coursehistories/1644"}, "description": "This course will explore the role played by disease in human evolution, from the emergence of the human lineage to the present day. We will evaluate both infectious and non-infectious diseases, and examine the way in which populations and disease organisms have co-evolved. Related issues to be explored include the nature of the virulence and pathogenicity of infectious agents, and the impact of vaccination on pathogen evolution. In addition, we will discuss the epidemiological transition and the rise of complex diseases of modernization (e.g., diabetes, cancer) that has occurred in the past several centuries. Overall, the course will provide a broader understanding of the influence of disease processes on the evolution of the human species. \n\n", "semester": "2010C", "name": "DISEASE & HUMAN EVOL: Disease and Human Evolution", "reviews": {"path": "/courses/22627/reviews", "values": [{"ratings": {"rAmountLearned": "2.95", "rDifficulty": "2.62", "rStimulateInterest": "2.73", "rRecommendMajor": "3.55", "rCourseQuality": "2.79", "rWorkRequired": "2.68", "rInstructorAccess": "3.09", "rReadingsValue": "2.91", "rRecommendNonMajor": "2.77", "rCommAbility": "2.95", "rInstructorQuality": "2.67"}, "section": {"name": "DISEASE & HUMAN EVOL: Disease and Human Evolution", "sectionnum": "301", "primary_alias": "ANTH-244-301", "path": "/courses/22627/sections/301", "id": "22627-301", "aliases": ["ANTH-244-301"]}, "comments": "This course explores the role played by disease in human evolution, from the emergence of the human lineage to the present day. It evaluates both infectious and non-infectious diseases and examines the way in which populations and disease organisms have co-evolved. Related issues explored include the nature of the virulence and pathogenicity of infectious agents and the impact of vaccination on pathogen evolution. In addition, the course discusses the epidemiological transition and the rise of complex diseases of modernization (e.g., diabetes, cancer) that has occurred in the past several centuries. The course provides a broader understanding of the influence of disease processes on the evolution of the human species.\r\n\r\nOverall, students enjoyed this course, and they described it as “interesting.” One student described the class as “awesome” and as the “best class” he has taken yet at Penn. In addition, students reported that the material for the course was “fascinating,” and the work required was “helpful” in teaching them about the material. \r\n\r\nStudents were generally satisfied with Professor Schurr. They appreciated his ability to present the material in a “stimulating manner” and described his teaching style as “very professional.” One student even hailed him as “the best professor” he had yet encountered at Penn.\r\n\r\nStudents were sometimes discontented with the amount of work demanded by this course. Students were required to write three research papers that were each seven pages long as well as two film responses. Students expressed that they felt that they could have learned the same amount while writing shorter assignments. The amount of work required was described as “stressful,” and some students reported that it detracted from their overall enjoyment of the course. Some students also expressed anxiety about what to expect on their final exam.\r\n", "num_students": 27, "path": "/courses/22627/sections/301/reviews/112-THEODORE-GEORGE-SCHURR", "instructor": {"path": "/instructors/112-THEODORE-GEORGE-SCHURR", "first_name": "THEODORE GEORGE", "last_name": "SCHURR", "id": "112-THEODORE-GEORGE-SCHURR", "name": "THEODORE GEORGE SCHURR"}, "num_reviewers": 25, "id": "22627-301-112-THEODORE-GEORGE-SCHURR"}]}, "credits": null, "primary_alias": "ANTH-244", "path": "/courses/22627", "sections": {"path": "/courses/22627/sections", "values": [{"name": "DISEASE & HUMAN EVOL: Disease and Human Evolution", "sectionnum": "301", "primary_alias": "ANTH-244-301", "path": "/courses/22627/sections/301", "id": "22627-301", "aliases": ["ANTH-244-301"]}]}, "id": 22627, "aliases": ["ANTH-244"]}