[{"ratings": {"rAmountLearned": "2.39", "rDifficulty": "2.13", "rStimulateInterest": "2.13", "rRecommendMajor": "2.83", "rCourseQuality": "2.20", "rWorkRequired": "2.22", "rInstructorAccess": "2.24", "rReadingsValue": "2.04", "rRecommendNonMajor": "1.47", "rCommAbility": "2.70", "rInstructorQuality": "2.47"}, "section": {"name": "COMMUNICATION BEHAVIOR", "sectionnum": "001", "primary_alias": "COMM-125-001", "path": "/courses/27202/sections/001", "id": "27202-001", "aliases": ["COMM-125-001"]}, "comments": "This course is an introduction to the fundamentals of communication behavior. It focuses on social science studies relating to the processes and effects of mass communication.  Research reviewed includes media use behavior and media influences on knowledge, perceptions of social reality, aggressive behavior, and political behavior. \r\nA majority of students felt this was an interesting course that provided insight into some “exciting” communications, topics, but did not stimulate their interest as much as they thought it would. Students seemed to enjoy the coursework and material, but in general did not hold strong feelings regarding the course content. \r\nAbout half of the students thought Professor Ben-Porath could present the material in an “engaging manner” but the other half found him very “dull and boring.” Overall, most students noted that the TAs were very helpful and that Professor Ben-Porath was very willing to help his students.\r\nStudents recommended this course for everybody with an interest in communications, but stated that students should be prepared to attend the lecture if they wish to do well.", "num_students": 131, "path": "/courses/27202/sections/001/reviews/3702-ERAN-N--BEN-PORATH", "instructor": {"path": "/instructors/3702-ERAN-N--BEN-PORATH", "first_name": "ERAN N.", "last_name": "BEN-PORATH", "id": "3702-ERAN-N--BEN-PORATH", "name": "ERAN N. BEN-PORATH"}, "num_reviewers": 122, "id": "27202-001-3702-ERAN-N--BEN-PORATH"}]