[{"ratings": {"rAmountLearned": "2.56", "rDifficulty": "3.12", "rStimulateInterest": "2.11", "rRecommendMajor": "3.19", "rCourseQuality": "2.14", "rWorkRequired": "2.82", "rInstructorAccess": "1.68", "rReadingsValue": "2.07", "rRecommendNonMajor": "1.00", "rCommAbility": "2.05", "rInstructorQuality": "2.04"}, "section": {"name": "INTRO TO BIOMECHANICS", "sectionnum": "001", "primary_alias": "BE-200-001", "path": "/courses/16992/sections/001", "id": "16992-001", "aliases": ["BE-200-001"]}, "comments": "This course is designed for sophomores and intended to provide a solid foundation in statics and mechanics of materials with particular focus on human joint biomechanics. The first portion of the course presents fundamental concepts of force and mechanics of rigid and deformable bodies. The remainder of the course consists of an introduction of materials science and engineering, including the classification and bulk properties of implantable materials, and also addresses specific topics including torsional loading and bending.\r\n\r\nOnly a small group of students reported that they enjoyed the contents of the course; most of them found it “frustrating” and “painful”. One student complained about the lack of “bio” in this biomechanics course and said that if it weren’t for the materials portions towards the end, it “might as well have been replaced by a MEAM statics course.” Most students agreed that the course was “poorly organized” and the materials portion was “ill-structured.” However, students generally enjoyed the guest lectures provided by Dr Pope. \r\n\r\nStudents also had several general complaints about Professor Winkelstein. They mostly agreed that she was unapproachable, rarely accessible, and “opposed to meeting with students” outside class. There was also a general consensus that she was not able to clearly explain the core concepts of the class. Students felt that she did not enjoy teaching them, especially since she seemed to assume that they did not enjoy learning about biomechanics. \r\nStudents complained that the exam was too long and covered content that was not discussed in the class, however, they appreciated that the exams were open-note. \r\nThe course is part of the core for bioengineers but was not recommended to non-majors. \r\n", "num_students": 112, "path": "/courses/16992/sections/001/reviews/1795-BETH-A--WINKELSTEIN", "instructor": {"path": "/instructors/1795-BETH-A--WINKELSTEIN", "first_name": "BETH A.", "last_name": "WINKELSTEIN", "id": "1795-BETH-A--WINKELSTEIN", "name": "BETH A. WINKELSTEIN"}, "num_reviewers": 102, "id": "16992-001-1795-BETH-A--WINKELSTEIN"}]