[{"ratings": {"rAmountLearned": "2.70", "rDifficulty": "2.07", "rStimulateInterest": "2.58", "rRecommendMajor": "3.09", "rCourseQuality": "2.76", "rWorkRequired": "1.77", "rInstructorAccess": "2.83", "rReadingsValue": "2.89", "rRecommendNonMajor": "1.97", "rCommAbility": "2.59", "rInstructorQuality": "2.68"}, "section": {"name": "NURSING OF CHILDREN THEORY I: CHILD AND FAMILY DEVELOPMENT", "sectionnum": "001", "primary_alias": "NURS-720-001", "path": "/courses/23571/sections/001", "id": "23571-001", "aliases": ["NURS-720-001"]}, "comments": "Nursing 720 focuses on developmental theories and concepts that form the basis for nursing assessment and intervention with children and families. This course emphasizes current research and issues in child and family development and functioning.\r\n\r\nMany students “enjoyed” this “interesting” course; some called it “excellent” or a “favorite course.” The content was “organized” and “well-planned.” A few commented that the material could sometimes be “dry.” One student remarked that “the second half of the course was awesome” and that she liked being able to discuss “topics that are traditionally taboo,” as many nursing schools do not include them in their curriculums. \r\n\r\nStudents generally liked the “integration of guest speakers” and felt that it added to the “specialty lectures.” However, there was the occasional guest lecturer that was “not engaging and just read off the slides,” noted one student. Overall, however, the “instructors were clear, thorough, and passionate about the material.”\r\n\r\nMost students reported that the exams were “well thought out and did not induce undue stress.” One student commented that the class was a bit “too broad for some specialty areas.” There were two multiple-choice exams that were worth 50% each and some students thought that the questions were sometimes difficult to understand.\r\n\r\n\r\nStudents generally recommended that \"everyone, even non-nursing, should take\" this class. Many students felt that \"it will be very useful in clinical practice\" and is \"extremely relevant to health care,\" insisting that it \"should be required for all nursing students.\" The class seemed to be difficult in the sense that lectures varied in structure and \"content material was in-depth,\" as well as the fact that they were not given \"feedback with each project or paper before the new next project was due.\"\r\n", "num_students": 104, "path": "/courses/23571/sections/001/reviews/913-KATHRYN-M-MURPHY", "instructor": {"path": "/instructors/913-KATHRYN-M-MURPHY", "first_name": "KATHRYN M", "last_name": "MURPHY", "id": "913-KATHRYN-M-MURPHY", "name": "KATHRYN M MURPHY"}, "num_reviewers": 99, "id": "23571-001-913-KATHRYN-M-MURPHY"}]