[{"ratings": {"rAmountLearned": "2.06", "rDifficulty": "1.94", "rStimulateInterest": "2.62", "rRecommendMajor": "3.10", "rCourseQuality": "2.45", "rWorkRequired": "1.83", "rInstructorAccess": "3.09", "rReadingsValue": "2.12", "rRecommendNonMajor": "2.50", "rCommAbility": "2.70", "rInstructorQuality": "2.78"}, "section": {"name": "COMM, CHILDHOOD, & PLAY", "sectionnum": "001", "primary_alias": "COMM-224-001", "path": "/courses/21497/sections/001", "id": "21497-001", "aliases": ["COMM-224-001"]}, "comments": "This course examines the history of childhood and play. The course begins with an exploration of the stages of childhood and how rearing, schooling, and relationships influence children. The second half of the course examines the theories, culture, and artifacts of playtime. Students attend lectures, participate in group discussions, read book chapters and journal articles, examine children’s artwork and writing samples, observe children at play, and examine representations of childhood in popular culture. &#8232;&#8232;Students were generally favorable towards the materials and topics covered in class. Most readings were “enjoyable and informative.” Several students noted a divergence between lectures and readings. Some students argued that a large portion of the reading assigned for the course was not discussed.&#8232;&#8232;Students generally praised Professor Linebarger for an engaging teaching style. Professor Linebarger’s incorporation of, “her own relevant family stories” helped keep the material refreshing. Students described Professor Linebarger as “entertaining and funny,” while also assuring that the professor was “always available for students.” &#8232;&#8232;Reaction to this course was generally favorable. One student claimed that, “I would recommend this course for both majors and non-majors.” Several students cautioned, however, that the exams were more difficult than expected. Students expressed anxiety that, “the exam was very specific” and that, “it was somewhat difficult to know what was important to study.” While many students noted how much reading was assigned for the course, students found Professor Linebarger to be, “very fair in grading” and, “flexible with cutting readings and extending deadlines.”", "num_students": 95, "path": "/courses/21497/sections/001/reviews/1814-DEBORAH-L--LINEBARGER", "instructor": {"path": "/instructors/1814-DEBORAH-L--LINEBARGER", "first_name": "DEBORAH L.", "last_name": "LINEBARGER", "id": "1814-DEBORAH-L--LINEBARGER", "name": "DEBORAH L. LINEBARGER"}, "num_reviewers": 92, "id": "21497-001-1814-DEBORAH-L--LINEBARGER"}]