{"coursehistories": {"path": "/coursehistories/2146"}, "description": "Elements of matrix algebra. Discrete and continuous random variables and their distributions. Moments and moment generating functions. Joint distributions. Functions and transformations of random variables. Law of large numbers and the central limit theorem. Point estimation: sufficiency, maximum likelihood, minimum variance. Confidence intervals. \n\n", "semester": "2010C", "name": "PROBABILITY", "reviews": {"path": "/courses/23839/reviews", "values": [{"ratings": {"rAmountLearned": "2.89", "rDifficulty": "3.26", "rStimulateInterest": "3.11", "rRecommendMajor": "3.00", "rCourseQuality": "2.52", "rWorkRequired": "3.17", "rInstructorAccess": "2.89", "rReadingsValue": "2.53", "rRecommendNonMajor": "2.11", "rCommAbility": "2.42", "rInstructorQuality": "2.70"}, "section": {"name": "PROBABILITY", "sectionnum": "401", "primary_alias": "STAT-510-401", "path": "/courses/23839/sections/401", "id": "23839-401", "aliases": ["STAT-510-401", "STAT-430-401"]}, "comments": "Cross-listed with STAT 430, this lecture is a course in probability. Course topics include:\r\ndiscrete and continuous sample spaces and probability, expectation and generating functions, Markov chains and recurrence theory, elements of matrix algebra, discrete and continuous random variables and their distributions, moments and moment generating functions, joint distributions, functions and transformations of random variables, law of large numbers and the central limit theorem, point estimation, and confidence intervals. Math 114 or equivalent is a prerequisite. The course is problem-based, with about 11-13 collected homework assignments and some that are not collected. The required textbook is Introduction to Probability (2nd Edition), by Grinstead and Snell. \r\n\r\nStudents found this course to be “very intellectually stimulating” but “tough” and demanding. Most students complained that the textbook “lacks clarity” and overcomplicates the material, and that the lecture material often did not coincide with the textbook material and problem sets. Students agreed, however, that much was gained from this course “in terms of knowledge and thinking ability”. \r\n\r\nOverall, students found Professor Foster to be engaging and creative in his ability to explain complicated statistical concepts, teaching students to use intuition as an approach to the problems. One student praised Professor Foster as being a “fantastic instructor; easily the best I have ever had at Penn”, and others called him “hilarious”. Students appreciated Professor Foster’s “understanding for people working in groups or needing to submit some assignments late.” Some students complained that while Professor Foster stimulated student interested, he “assumes a high level of preparation and prior knowledge” and thus can be difficult to understand. \r\n\r\nStudents agreed that the course was both conceptually difficult and had a demanding course-load due to the weekly assignments. One student wished the class “knew what they were in for”, and one student commented that Professor Foster’s exams were among the hardest he had taken at Penn. The grade breakdown is one midterm (35%), one final (40%), and homework (25%). Exams are closed book, but students may bring in one page of formulas for the midterm. Students may bring this page and one new page to the final. \r\n", "num_students": 27, "path": "/courses/23839/sections/401/reviews/1742-DEAN-P--FOSTER", "instructor": {"path": "/instructors/1742-DEAN-P--FOSTER", "first_name": "DEAN P.", "last_name": "FOSTER", "id": "1742-DEAN-P--FOSTER", "name": "DEAN P. FOSTER"}, "num_reviewers": 23, "id": "23839-401-1742-DEAN-P--FOSTER"}]}, "credits": null, "primary_alias": "STAT-510", "path": "/courses/23839", "sections": {"path": "/courses/23839/sections", "values": [{"name": "PROBABILITY", "sectionnum": "401", "primary_alias": "STAT-510-401", "path": "/courses/23839/sections/401", "id": "23839-401", "aliases": ["STAT-510-401", "STAT-430-401"]}]}, "id": 23839, "aliases": ["STAT-510", "STAT-430"]}