{"coursehistories": {"path": "/coursehistories/2933"}, "description": "This course discusses contemporary urban issues from an economics perspective, with the dual goal of illuminating the economic foundations of civic affairs and enhancing a student's economic literacy through the use of everyday examples. The first part of the course discusses the broad theory of urban economics by focusing on individual decision makers, both households and businesses, and the incentives they face as the key to understanding how cities operate economically. Significant topics include economic development, zoning, and land use. The second part of the course discusses several topics in detail, including transportation, government taxation and spending, housing, education, and cost-benefit analysis. \n\nWe will use current local issues as examples in the course. These issues will include tax reform, the development of the Delaware riverfront, casino locations, the ten-year tax abatements for new construction and rehabilitation, the real estate \"bubble,\" and tax increment financing. At the conclusion of the course the student will be able to apply economic thinking to the analysis of civic issues, understand how economic forces shaped and continue to shape the urban environment, and appreciate the role of government as an enabler or a hindrance. \n\nThe emphasis of the course is on the usefulness of economic thought and, as such, focuses more on policy implications than abstract economic modeling. Thecourse will teach any necessary economic tools, though an introductory course in microeconomics is helpful. \n\n", "semester": "2009C", "name": "ECONOMICS & URB AFFAIRS", "reviews": {"path": "/courses/18173/reviews", "values": [{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "2.20", "rStimulateInterest": "2.70", "rRecommendMajor": "3.20", "rCourseQuality": "2.36", "rWorkRequired": "2.00", "rInstructorAccess": "3.10", "rReadingsValue": "2.40", "rRecommendNonMajor": "2.60", "rCommAbility": "3.10", "rInstructorQuality": "3.00"}, "section": {"name": "ECONOMICS & URB AFFAIRS", "sectionnum": "601", "primary_alias": "URBS-456-601", "path": "/courses/18173/sections/601", "id": "18173-601", "aliases": ["URBS-456-601"]}, "comments": "", "num_students": 13, "path": "/courses/18173/sections/601/reviews/2832-PETER-A-ANGELIDES", "instructor": {"path": "/instructors/2832-PETER-A-ANGELIDES", "first_name": "PETER A", "last_name": "ANGELIDES", "id": "2832-PETER-A-ANGELIDES", "name": "PETER A ANGELIDES"}, "num_reviewers": 11, "id": "18173-601-2832-PETER-A-ANGELIDES"}]}, "credits": null, "primary_alias": "URBS-456", "path": "/courses/18173", "sections": {"path": "/courses/18173/sections", "values": [{"name": "ECONOMICS & URB AFFAIRS", "sectionnum": "601", "primary_alias": "URBS-456-601", "path": "/courses/18173/sections/601", "id": "18173-601", "aliases": ["URBS-456-601"]}]}, "id": 18173, "aliases": ["URBS-456"]}