{"coursehistories": {"path": "/coursehistories/2073"}, "description": "Classic case studies of successful reductionistic models of complex phenomena, emphasizing the key steps of (1) making estimates, often based on dimensional analysis, (2) using them to figure out which physical variables and phenomena will be most relevant to a given system, and which may be disregarded, and (3) finding analogies to purely physical systems whose behavior is already known. The cases studied involve basic biological processes, mainly at the molecular and cellular level, in the light of ideas from physics. Topics may include entropic forces, free energy transduction at the molecular level, the structure of biopolymers, molecular motors, pattern formation (oscillation and morphogenesis), immune response, nerve impulses and neural computing, and other forms of signal transduction. \n\n", "semester": "2011C", "name": "PHYS MODELS BIO SYSTEMS: Physical Models of Biological Systems", "reviews": {"path": "/courses/24981/reviews", "values": [{"ratings": {"rAmountLearned": "3.12", "rDifficulty": "3.40", "rStimulateInterest": "3.20", "rRecommendMajor": "3.32", "rCourseQuality": "2.88", "rWorkRequired": "2.96", "rInstructorAccess": "3.52", "rReadingsValue": "3.08", "rRecommendNonMajor": "2.52", "rCommAbility": "2.88", "rInstructorQuality": "3.15"}, "section": {"name": "PHYS MODELS BIO SYSTEMS: Physical Models of Biological Systems", "sectionnum": "401", "primary_alias": "PHYS-280-401", "path": "/courses/24981/sections/401", "id": "24981-401", "aliases": ["PHYS-280-401", "BCHE-280-401"]}, "comments": "This course covers classic case studies of successful reductionistic models of\r\ncomplex phenomena, emphasizing the key steps of (1) making estimates, often based on\r\ndimensional analysis, (2) using them to figure out which physical variables and\r\nphenomena will be most relevant to a given system, and which may be disregarded, and\r\n(3) finding analogies to purely physical systems whose behavior is already known. The\r\ncases studied involve basic biological processes, mainly at the molecular and cellular\r\nlevel, in the light of ideas from physics. Topics may include entropic forces, free energy\r\ntransduction at the molecular level, the structure of biopolymers, molecular motors,\r\npattern formation (oscillation and morphogenesis), immune response, nerve impulses and\r\nneural computing, and other forms of signal transduction.\r\nOverall, students called this class interesting and fascinating. Several students\r\ncalled this course “very relevant” and a “must-take course” for any science or\r\nengineering major.\r\nStudents described Professor Nelson as a great, engaging lecturer with an “ability\r\nto invoke interest in students.” He had “great passion” for the material. Students\r\nremarked that Professor Nelson was “always willing to explain things very thoroughly”\r\nand that he was “keen to help.”\r\nIn general, students called this a “tough” course. A large number of students\r\nremarked on the reliance on statistical theory, stating, “mastery of statistics was necessary\r\nfor this course.” Multiple students recommended Stat-430 prior to taking this course.\r\nMost students in the class found the tests to be quite difficult. Many students remarked\r\nthat there were not enough examples to prepare for the exams, especially with the more\r\ndifficult problems. One student commented that the professor was an “extremely hard\r\ngrader” and it was pointed out that there was little to no partial credit given on exams.", "num_students": 28, "path": "/courses/24981/sections/401/reviews/1675-PHILIP-NELSON", "instructor": {"path": "/instructors/1675-PHILIP-NELSON", "first_name": "PHILIP", "last_name": "NELSON", "id": "1675-PHILIP-NELSON", "name": "PHILIP NELSON"}, "num_reviewers": 27, "id": "24981-401-1675-PHILIP-NELSON"}]}, "credits": null, "primary_alias": "PHYS-280", "path": "/courses/24981", "sections": {"path": "/courses/24981/sections", "values": [{"name": "PHYS MODELS BIO SYSTEMS: Physical Models of Biological Systems", "sectionnum": "401", "primary_alias": "PHYS-280-401", "path": "/courses/24981/sections/401", "id": "24981-401", "aliases": ["PHYS-280-401", "BCHE-280-401"]}]}, "id": 24981, "aliases": ["PHYS-280", "BCHE-280"]}