{"coursehistories": {"path": "/coursehistories/5027"}, "description": "An introduction to the study of positive emotions, positive character traits, and positive institutions. The positive emotions consist of emotions about the past (e.g., serenity, satisfaction, pride), about the future (e.g., hope, optimism, faith), and emotions about the present (pleasure and gratification). The distinction among the pleasant life, the good life, and the meaningful life is drawn. The positive traits include wisdom, courage, humanity, justice, temperance, and spirituality, and the classification of these virtues is explored. The positive institutions are exemplified by extended families, free press, humane leadership, and representative government. \n\n", "semester": "2012A", "name": "INTRO POSITIVE PSYCH", "reviews": {"path": "/courses/28074/reviews", "values": [{"ratings": {"rAmountLearned": "2.93", "rDifficulty": "2.73", "rStimulateInterest": "3.32", "rRecommendMajor": "3.40", "rCourseQuality": "2.88", "rWorkRequired": "2.50", "rInstructorAccess": "3.01", "rReadingsValue": "2.80", "rRecommendNonMajor": "2.88", "rCommAbility": "3.32", "rInstructorQuality": "3.19"}, "section": {"name": "INTRO POSITIVE PSYCH", "sectionnum": "001", "primary_alias": "PSYC-266-001", "path": "/courses/28074/sections/001", "id": "28074-001", "aliases": ["PSYC-266-001"]}, "comments": "An introduction to the study of positive emotions, positive character traits, and positive institutions.  The positive emotions consist of emotions about the past (e.g., serenity, satisfaction, pride), about the future (e.g., hope, optimism, faith), and emotions about the present (pleasure and gratification). The distinction among the pleasant life, the good life, and the meaningful life is drawn.  The positive traits include wisdom, courage, humanity, justice, temperance, and spirituality, and the classification of these virtues is explored.  The positive institutions are exemplified by extended families, free press, humane leadership, and representative government.\r\n\r\nOverall, students felt like they enjoyed the material and subject matter of the class and felt they could “use it in a real life setting” though they had issues with the structure of the class in general. A vast majority of students stated that the tests were “entirely too focused on minute details” rather than the general themes of the class. While many students remarked that the class was “fun and enjoyable,” they stated that the exams contributed more to their dislike of the class than the material.\r\n\r\nMost students agreed that Dr. Duckworth was “engaging, exciting, and always well-prepared,” stating that she “was very accessible and would do anything to have her students success.” A significant portion of the students however, agreed that she could at times be “condescending” and “elitist.” Overall, most students seemed to enjoy Dr. Duckworth’s lectures, but noted that the structure of the class in general needed changing to make it more enjoyable for the professor and student.\r\n\r\nStudents stated that the pacing of the class needed to be changed, with some lectures covering a great deal of material and some going entirely too slow. Furthermore, almost every student remarked that the recitation was “pointless” and “required to much work that didn’t factor into your final grade.” Some students said that they wouldn’t recommend this class to a non-psych major.", "num_students": 149, "path": "/courses/28074/sections/001/reviews/3612-ANGELA-LEE-DUCKWORTH", "instructor": {"path": "/instructors/3612-ANGELA-LEE-DUCKWORTH", "first_name": "ANGELA LEE", "last_name": "DUCKWORTH", "id": "3612-ANGELA-LEE-DUCKWORTH", "name": "ANGELA LEE DUCKWORTH"}, "num_reviewers": 138, "id": "28074-001-3612-ANGELA-LEE-DUCKWORTH"}]}, "credits": null, "primary_alias": "PSYC-266", "path": "/courses/28074", "sections": {"path": "/courses/28074/sections", "values": [{"name": "INTRO POSITIVE PSYCH", "sectionnum": "001", "primary_alias": "PSYC-266-001", "path": "/courses/28074/sections/001", "id": "28074-001", "aliases": ["PSYC-266-001"]}]}, "id": 28074, "aliases": ["PSYC-266"]}