{"coursehistories": {"path": "/coursehistories/730"}, "description": "This course teaches the fundamental concepts underlying the dynamics of vibrations for single-degree of freedom, multi-degree and infinite-degree of freedom mechanical systems. The course will focus on Newton's Force Methods, Virtual-Work Methods, and Lagrange's Variation Methods for analyzing problems in vibrations. Students will learn how to analyze transient, steady state and forced motion of single and multi-degree of freedom linear and non-linear systems. The course teaches analytical solution techniques for linear systems and practical numerical and simulation methods for analysis and design of nonlinear systems. \n\n", "semester": "2008C", "name": "VIBRATION MECH SYSTEMS", "reviews": {"path": "/courses/18959/reviews", "values": [{"ratings": {"rAmountLearned": "2.94", "rDifficulty": "3.10", "rStimulateInterest": "2.23", "rRecommendMajor": "3.26", "rCourseQuality": "2.77", "rWorkRequired": "3.16", "rInstructorAccess": "3.73", "rReadingsValue": "3.07", "rRecommendNonMajor": "0.94", "rCommAbility": "3.52", "rInstructorQuality": "3.43"}, "section": {"name": "VIBRATION MECH SYSTEMS", "sectionnum": "001", "primary_alias": "MEAM-321-001", "path": "/courses/18959/sections/001", "id": "18959-001", "aliases": ["MEAM-321-001"]}, "comments": "MEAM 321 teaches students the fundamental concepts underlying vibration dynamics in a variety of mechanical systems. Focusing on Newton’s Force Methods, Virtual-Work Methods, and Lagrange’s Variation Methods for analysis, the course educates students about transient, steady state and forced motion of single and multi-degree of freedom linear and non-linear systems. The textbook Theory of Vibrations with Applications is required for this class.\r\n\r\nOn the whole, students enjoyed the course and found the content to be interesting. Many wrote that the course focused extensively on the mathematical side of the concepts and lost sight of the applications. One student noted it felt “too much like MATH 241.” Most remarked that they learned a lot from the course.\r\n\r\nAlmost everyone heaped praise upon Professor Carchidi and his teaching abilities. He did a “commendable” job conveying the concepts in the course. Many explained that although the course was difficult, he made it “clear and concise.” His online notes were “indispensable” to many students. Some found his lectures to be rather quick however and had trouble keeping up with his explanations. Professor Carchidi was also “very accessible” and “easy to talk to” about problems.\r\n\r\nTo take this course, students need to have completed MATH 241 and MEAM 211. Many students indicated that the course was “very difficult” and the workload was high. Homework assignments were found to be “very tricky” and “way too hard.” Some also noted that the grading was sometimes unfair.", "num_students": 36, "path": "/courses/18959/sections/001/reviews/774-MICHAEL-A--CARCHIDI", "instructor": {"path": "/instructors/774-MICHAEL-A--CARCHIDI", "first_name": "MICHAEL A.", "last_name": "CARCHIDI", "id": "774-MICHAEL-A--CARCHIDI", "name": "MICHAEL A. CARCHIDI"}, "num_reviewers": 31, "id": "18959-001-774-MICHAEL-A--CARCHIDI"}]}, "credits": null, "primary_alias": "MEAM-321", "path": "/courses/18959", "sections": {"path": "/courses/18959/sections", "values": [{"name": "VIBRATION MECH SYSTEMS", "sectionnum": "001", "primary_alias": "MEAM-321-001", "path": "/courses/18959/sections/001", "id": "18959-001", "aliases": ["MEAM-321-001"]}]}, "id": 18959, "aliases": ["MEAM-321"]}