[{"ratings": {"rAmountLearned": "2.85", "rDifficulty": "2.15", "rStimulateInterest": "2.85", "rRecommendMajor": "3.52", "rCourseQuality": "2.66", "rWorkRequired": "3.00", "rInstructorAccess": "3.58", "rReadingsValue": "2.96", "rRecommendNonMajor": "2.85", "rCommAbility": "3.04", "rInstructorQuality": "3.10"}, "section": {"name": "THE POLITICS OF FOOD", "sectionnum": "401", "primary_alias": "PSCI-135-401", "path": "/courses/25002/sections/401", "id": "25002-401", "aliases": ["PSCI-135-401", "HSOC-135-401", "GAFL-135-401"]}, "comments": "Political Science 135 is an academically based community service seminar that will explore the politics and institutions that have shaped—and continue to shape—food production and consumption. Students will use the readings, their community service, and ongoing \"food events\" at Penn to analyze the politics of food in many arenas: from farms, kitchens, supermarkets, schools, and communities of faith to corporations, research institutions, the media and international trade.\r\n\r\nA majority of students liked and were excited by this “fascinating” class, but were disappointed in the structure of the course. While they felt they learned “quite a lot of thrilling knowledge,” students almost exclusively thought this class was too large and would function better as a smaller seminar. The discussion-based aspect of the class would sometimes “detract” from students’ learning experience, since the class was so large. Furthermore, the class was deemed to have a lot of “busy work,” requiring students to blog for the course. But many students still would recommend this course.\r\n\r\nProfessor Summers was described as “wonderful, if a bit unorganized.” Students loved the way she conveyed information “clearly” and said she was “definitely knowledgeable about the subject.” She did a great job of “integrating many different views into the course,” but students wished she had structured the class differently so that she was teaching more, rather than relying on peer-led discussions.\r\n\r\nStudents were frustrated with having to blog and the disorganized Blackboard site of this class, but overall, they generally enjoyed the course and would recommend it to everyone. This class requires a service project, which students liked, but wish it composed a smaller part of the course.\r\n", "num_students": 36, "path": "/courses/25002/sections/401/reviews/990-MARY-E-SUMMERS", "instructor": {"path": "/instructors/990-MARY-E-SUMMERS", "first_name": "MARY E", "last_name": "SUMMERS", "id": "990-MARY-E-SUMMERS", "name": "MARY E SUMMERS"}, "num_reviewers": 30, "id": "25002-401-990-MARY-E-SUMMERS"}]