[{"ratings": {"rAmountLearned": "3.25", "rDifficulty": "2.80", "rStimulateInterest": "3.75", "rRecommendMajor": "3.90", "rCourseQuality": "3.57", "rWorkRequired": "2.80", "rInstructorAccess": "3.26", "rReadingsValue": "3.00", "rRecommendNonMajor": "3.53", "rCommAbility": "3.65", "rInstructorQuality": "3.73"}, "section": {"name": "ARB/ISR CON LIT & FILM: Arab-Israeli Conflict Through Literature and Film", "sectionnum": "401", "primary_alias": "HIST-166-401", "path": "/courses/27567/sections/401", "id": "27567-401", "aliases": ["HIST-166-401", "CINE-166-401"]}, "comments": "This course explores the origins, the history and, most importantly, the literary and cinematic art of the struggle that has endured for a century over the region that some call the Holy Land, some call Eretz Israel and others call Palestine.   The course considers religious motivations and interpretations that have inspired many involved in this conflict as well as the political consequences of world wars that contributed so greatly to the reconfiguration of the Middle East after the fall of the Ottoman Empire, and after the revelations of the Holocaust in Western Europe.  While the course relies on a textbook for historical grounding, the most significant material used to learn this history are films, novels and short stories. Can the arts lead us to a different understanding of the lives lived through what seems like unending crises?\r\n\r\nStudents greatly enjoyed the course overall, with one student stating that they “looked forward to going to class every week.”  The course was described to be fun, informative, and engaging, and students enjoyed the discussion format.  One student elaborated, “The content and analysis of the subject matter was insightful and interesting, and I have absolutely no doubt that it will indeed be useful down the road.\r\n\r\nStudents raved about Professor Troutt Powell as both a person and a professor.  One student described Professor Troutt Powell as “an excellent lecturer and wonderful moderator during class discussion,” with other students referring to Professor Troutt Powell as intelligent, thoughtful, kind, and humorous.  Furthermore, Professor Troutt Powell not only was clearly dedicated to delving deeper into the course material through her own research, but also “took the time within her busy schedule to ensure to talk with each individual student about their studies and career goals.”  \r\n\r\nOne student suggested the course to “anyone who has an interest in the Middle East,” regardless of major.   Graded assignments included two shorter papers, a midterm, class debates, and a longer final paper.", "num_students": 30, "path": "/courses/27567/sections/401/reviews/3326-EVE-TROUTT-POWELL", "instructor": {"path": "/instructors/3326-EVE-TROUTT-POWELL", "first_name": "EVE", "last_name": "TROUTT POWELL", "id": "3326-EVE-TROUTT-POWELL", "name": "EVE TROUTT POWELL"}, "num_reviewers": 23, "id": "27567-401-3326-EVE-TROUTT-POWELL"}]