[{"ratings": {"rAmountLearned": "3.27", "rDifficulty": "3.55", "rStimulateInterest": "3.50", "rRecommendMajor": "3.14", "rCourseQuality": "3.18", "rWorkRequired": "3.09", "rInstructorAccess": "3.73", "rReadingsValue": "3.00", "rRecommendNonMajor": "1.68", "rCommAbility": "3.32", "rInstructorQuality": "3.23"}, "section": {"name": "BIOCHEMISTRY", "sectionnum": "601", "primary_alias": "BIOL-402-601", "path": "/courses/17035/sections/601", "id": "17035-601", "aliases": ["BIOL-402-601"]}, "comments": "This course delves into five major topics in biochemistry, including protein characterization, enzyme kinetics and mechanism, membrane structure and function, metabolism and signal transduction. The course exposes students to the application of quantitative methods and problem-solving in biochemistry. Previous biochemistry coursework is expected, with Chem-242 as a pre- or co-requisite.\r\n\r\nStudents found the course was \"very informative\" and \"practical.\" Overall, students felt it very useful and enhanced their understanding of biochemistry. One student wrote that the metabolism section provided a valuable framework by which to interpret research on new drugs or new diet trends.\r\n\r\nStudents praised Dr. DiAngelo for his enthusiasm and his accessibility. Students liked how he explained the material in a way that students could easily understand. Many liked how he taught with a premedical focus and felt like they gleaned a lot of useful material because of Professor DiAngelo’s approach.\r\n\r\nStudents commented that exams were fair, and they liked having weekly quizzes to help them keep on top of the material. They felt the professor was clear about what material would be presented on examinations, although some felt the grading was a bit harsh. Some students liked that grades were determined by tests and quizzes, but others would have liked the chance to boost their grades with turn-in homework assignments or projects. One student recommended this class for pre-meds only.", "num_students": 30, "path": "/courses/17035/sections/601/reviews/4259-JUSTIN-DIANGELO", "instructor": {"path": "/instructors/4259-JUSTIN-DIANGELO", "first_name": "JUSTIN", "last_name": "DIANGELO", "id": "4259-JUSTIN-DIANGELO", "name": "JUSTIN DIANGELO"}, "num_reviewers": 23, "id": "17035-601-4259-JUSTIN-DIANGELO"}]