{"coursehistories": {"path": "/coursehistories/882"}, "description": "The aim of this course is to explore the relatoinships between philosophy and physics, with a focus on selected issues in modern physics. The course is organized around four main areas. In the first part, we concentrate on the basic metaphysical and epistemological questions posed by physics: causality, determinism, randomness, and the nature of physical laws. Are the laws of physics true? In the second part, we focus on the philosophy and (classical and relativistic) structure of space and time, including the proliferation of physical geometries (lobachevskian and Riemannian) of curved and \"gunky\" spacetime. Is space-time real? If so, what kind of thing is it? Is time travel possible? In the third part, we turn to the principal philosopihcal issues raised by quantum physics: structural realism and the interpretation of quantum mechanics, non-locality and Bell's theorem, the infamous Schrodinger cat paradox, decoherence, hidden variables, and quantum measurement. Finally, in the fourth part, we investigate the metaphysics underlying Big Bang cosmology, and evidence for a multiverse and baby universes. All these philosophicla issues will be addressed by looking at some simple examples or episodes taken from modern physics. The bulk of the readings iwll come from two textbooks (available at the University B & N bookstore) and articles in \n\njournals. PREREQUISITES: The course is entirely self-contained: all topics in physics that are necessary for understanding the pertinent philosophical problems will be reviewed in class. \n\n", "semester": "2012C", "name": "PHIL OF SCIENCE", "reviews": {"path": "/courses/29495/reviews", "values": [{"ratings": {"rDifficulty": "2.86", "rStimulateInterest": "3.57", "rCourseQuality": "3.56", "rWorkRequired": "2.57", "rInstructorQuality": "3.78", "rCommAbility": "3.71", "rInstructorAccess": "3.86"}, "section": {"name": "PHIL OF SCIENCE", "sectionnum": "401", "primary_alias": "PHIL-425-401", "path": "/courses/29495/sections/401", "id": "29495-401", "aliases": ["PHIL-425-401", "STSC-325-401"]}, "comments": "", "num_students": 12, "path": "/courses/29495/sections/401/reviews/954-ZOLTAN-DOMOTOR", "instructor": {"path": "/instructors/954-ZOLTAN-DOMOTOR", "first_name": "ZOLTAN", "last_name": "DOMOTOR", "id": "954-ZOLTAN-DOMOTOR", "name": "ZOLTAN DOMOTOR"}, "num_reviewers": 10, "id": "29495-401-954-ZOLTAN-DOMOTOR"}]}, "credits": null, "primary_alias": "PHIL-425", "path": "/courses/29495", "sections": {"path": "/courses/29495/sections", "values": [{"name": "PHIL OF SCIENCE", "sectionnum": "401", "primary_alias": "PHIL-425-401", "path": "/courses/29495/sections/401", "id": "29495-401", "aliases": ["PHIL-425-401", "STSC-325-401"]}]}, "id": 29495, "aliases": ["PHIL-425", "STSC-325"]}