{"coursehistories": {"path": "/coursehistories/484"}, "description": "The focus of this course is on the valuation of companies. Topics discussed include discounted cash flow techniques and valuation using alternative valuation techniques such as price multiples. Emphasis is on developing the required information for valuation from financial statements and other information sources. \n\n", "semester": "2010C", "name": "CORPORATE VALUATION", "reviews": {"path": "/courses/23088/reviews", "values": [{"ratings": {"rAmountLearned": "3.35", "rDifficulty": "3.71", "rStimulateInterest": "2.65", "rRecommendMajor": "3.58", "rCourseQuality": "3.20", "rWorkRequired": "3.87", "rInstructorAccess": "2.85", "rReadingsValue": "2.69", "rRecommendNonMajor": "1.48", "rCommAbility": "3.15", "rInstructorQuality": "3.15"}, "section": {"name": "CORPORATE VALUATION", "sectionnum": "001", "primary_alias": "FNCE-207-001", "path": "/courses/23088/sections/001", "id": "23088-001", "aliases": ["FNCE-207-001"]}, "comments": "Finance 207 focuses on the valuation of companies. Topics discussed include discounted cash flow techniques and valuation using alternative valuation techniques such as price multiples. Emphasis is on developing the required information for valuation from financial statements and other information sources.\r\n\r\nStudents generally described the course as “great” and particularly appreciated that they “learned a tremendous amount.” Many students thought that the course taught much “practical” information that would be “very helpful for [their] future career[s]”, with one student describing it as the “single most valuable course I’ve taken in my four years here” and another saying that he or she “learned more from this class than my other finance classes combined.” Another student called the class “Investment Banking 101.” A few students commented that the class “was extremely accounting oriented” and focused on a lot of “detail.”\r\n\r\nStudents generally described Professor Holthausen as a “great professor” with a number calling him the “best professor” that they had ever had. A few commented that he is “very knowledgeable and skilled at modeling” and has an “incredible grasp on the course material and can explain it in a variety of ways to ensure that each student also understands it.” Students also noted that he “expects a lot from his students.” One student who liked him overall described him as being “quite intimidating in class.”\r\n\r\nStudents almost universally described Finance 207 as “very challenging and difficult.” They said that the “amount of work expected is tremendous” and students need to “be prepared to work very, very hard.” Students also recommended to “make sure you know accounting very well going in” and suggested that course was only for those who “[want] to get extremely technical on the finance side.” Finance 207 can count towards a finance concentration. Finance 100 and 101 and Statistics 101 and 102 are prerequisites. It is recommended that students also take Accounting 201 beforehand.\r\n\r\n", "num_students": 75, "path": "/courses/23088/sections/001/reviews/1431-ROBERT-W--HOLTHAUSEN", "instructor": {"path": "/instructors/1431-ROBERT-W--HOLTHAUSEN", "first_name": "ROBERT W.", "last_name": "HOLTHAUSEN", "id": "1431-ROBERT-W--HOLTHAUSEN", "name": "ROBERT W. HOLTHAUSEN"}, "num_reviewers": 70, "id": "23088-001-1431-ROBERT-W--HOLTHAUSEN"}, {"ratings": {"rAmountLearned": "2.85", "rDifficulty": "2.56", "rStimulateInterest": "2.15", "rRecommendMajor": "3.26", "rCourseQuality": "2.44", "rWorkRequired": "3.17", "rInstructorAccess": "3.25", "rReadingsValue": "2.52", "rRecommendNonMajor": "2.02", "rCommAbility": "2.44", "rInstructorQuality": "2.45"}, "section": {"name": "CORPORATE VALUATION", "sectionnum": "002", "primary_alias": "FNCE-207-002", "path": "/courses/23088/sections/002", "id": "23088-002", "aliases": ["FNCE-207-002"]}, "comments": "The objective of this course is to develop the intuition and tools to value companies and their securities. The primary focus is on the valuation of equity in a public corporation, but the methods also apply to the valuation of private companies and small businesses. Class discussions cover the analysis of past corporate financial performance and projections of future performance. Other topics covered include the estimation of cash flows and discount rates, application of value multiples, and additional valuation issues within the context of mergers and acquisitions, emerging markets, and intellectual property. \r\n\r\nMost students agreed that the material learned in this class was “useful” and applicable to the real-world. Class assignments included 5 case reports done in groups, which required “an enormous amount of time, effort, and knowledge of the material,” one student wrote. \r\n\r\n“Fantastic, ””great,” and “fabulous” were some words students used to describe Professor Nelling. He was accessible and “very willing to discuss problems and difficulties.” \r\n\r\nStudents reported that the workload was high, but grading was “fair.” Prerequisites for this course include FNCE 100, FNCE 101, and STAT 101-102. Financial accounting, ACCT 201, is also recommended.\r\n", "num_students": 73, "path": "/courses/23088/sections/002/reviews/5214-EDWARD-NELLING", "instructor": {"path": "/instructors/5214-EDWARD-NELLING", "first_name": "EDWARD", "last_name": "NELLING", "id": "5214-EDWARD-NELLING", "name": "EDWARD NELLING"}, "num_reviewers": 72, "id": "23088-002-5214-EDWARD-NELLING"}]}, "credits": null, "primary_alias": "FNCE-207", "path": "/courses/23088", "sections": {"path": "/courses/23088/sections", "values": [{"name": "CORPORATE VALUATION", "sectionnum": "001", "primary_alias": "FNCE-207-001", "path": "/courses/23088/sections/001", "id": "23088-001", "aliases": ["FNCE-207-001"]}, {"name": "CORPORATE VALUATION", "sectionnum": "002", "primary_alias": "FNCE-207-002", "path": "/courses/23088/sections/002", "id": "23088-002", "aliases": ["FNCE-207-002"]}]}, "id": 23088, "aliases": ["FNCE-207"]}