{"coursehistories": {"path": "/coursehistories/1545"}, "description": "The Greeks enjoy a special place in the construction of western culture and identity, and yet many of us have only the vaguest notion of what their culture was like. A few Greek myths at bedtime when we are kids, maybe a Greek tragedy like Sophokles' Oidipous when we are at school: these are often the only contact we have with the world of the ancient Mediterranean. The story of the Greeks, however, deserves a wider audience, because so much of what we esteem in our own culture derives from them: democracy, epic poetry, lyric poetry, tragedy, history writing, philosophy, aesthetic taste, all of these and many other features of cultural life enter the West from Greece. The oracle of Apollo at Delphi had inscribed over the temple, \"Know Thyself.\" For us, that also means knowing the Greeks. We will cover the period from the Late Bronze Age, c. 1500 BC, down to the time of Philip of Macedon, c. 350 BC, concentrating on the two hundred year interval from 600-400 BC. \n\n", "semester": "2009C", "name": "ANCIENT GREECE", "reviews": {"path": "/courses/16919/reviews", "values": [{"ratings": {"rAmountLearned": "2.60", "rDifficulty": "2.91", "rStimulateInterest": "3.55", "rRecommendMajor": "3.44", "rCourseQuality": "2.81", "rWorkRequired": "3.09", "rInstructorAccess": "2.82", "rReadingsValue": "2.49", "rRecommendNonMajor": "2.64", "rCommAbility": "3.44", "rInstructorQuality": "3.42"}, "section": {"name": "ANCIENT GREECE", "sectionnum": "401", "primary_alias": "ANCH-026-401", "path": "/courses/16919/sections/401", "id": "16919-401", "aliases": ["ANCH-026-401", "HIST-026-401"]}, "comments": "This course is an introductory history class that covers the story of Greeks, including various aspects from which our culture derives from: democracy, epic poetry, lyric poetry, tragedy, history writing, philosophy, aesthetic taste, etc. The class will cover the period from the late Bronze Age, c. 1500 BC, down to the time of Philip of Macedon, c. 350 BC, concentrating on the two hundred year interval from 600-400 BC.\r\n\r\nStudents commented that the course was very “demanding” and required more than they expected for an introductory history course. The course, based on primary source readings, focused heavily on literature and details about “pottery, trade, philosophy, etc,” rather than actual historical events. \r\n\r\nStudent’s feelings about Professor McInerney were mixed. While some students commented that it was “one of the greatest teaching performances [they] have witnessed at this university,” and many called Professor McInerney an “amazing lecturer,” some students found it difficult to approach Professor McInerney with questions or comments. All students agreed that lectures were “interesting, informative, and highly entertaining” but a few students interpreted his “theatrics” as “arrogance” and were turned off by his demeanor.  Many praised Professor McInerney for his “animation” and ability to stimulate student interest.\r\n\r\nAlthough students learned a lot in the course, many commented that the heavy workload and harsh grading of papers made the course too difficult for non-classical studies majors taking the course as a general elective. A few commented that though they worked hard in the course, they didn’t feel like their progress was rewarded when it came time to receive grades.  This course was recommended for majors or students greatly interested in Greek history. The class fulfills the History & Tradition Sector and there are no prerequisites. \r\n", "num_students": 262, "path": "/courses/16919/sections/401/reviews/84-JEREMY-MCINERNEY", "instructor": {"path": "/instructors/84-JEREMY-MCINERNEY", "first_name": "JEREMY", "last_name": "MCINERNEY", "id": "84-JEREMY-MCINERNEY", "name": "JEREMY MCINERNEY"}, "num_reviewers": 238, "id": "16919-401-84-JEREMY-MCINERNEY"}]}, "credits": null, "primary_alias": "ANCH-026", "path": "/courses/16919", "sections": {"path": "/courses/16919/sections", "values": [{"name": "ANCIENT GREECE", "sectionnum": "401", "primary_alias": "ANCH-026-401", "path": "/courses/16919/sections/401", "id": "16919-401", "aliases": ["ANCH-026-401", "HIST-026-401"]}]}, "id": 16919, "aliases": ["ANCH-026", "HIST-026"]}