{"coursehistories": {"path": "/coursehistories/4546"}, "description": "Is there a natural-born killer? What makes a successful psychopath? And is it morally wrong for us to punish those who are biologically-wired for a life of crime? This course argues that answers to these inscrutable questions will ultimately be found in an interdisciplinary perspective that examines the interface between the social, clinical, and neuro-sciences. We will explore new biosocial treatments for violence, and analyze the controversial nueroethical, legal, and philosophical issues surrounding neurocriminology. The course presents perspectives from fields of psychology, nuerobiology, sociology, neurochemistry, anthropology, law, neuroanatomy, cinema, public health, neuroendocrinology, criminology forensics, pediatrics, and psychiatry. Only by integrating knowledge from multiple domains will we fully understand, predict, and prevent future criminal behavior. \n\n", "semester": "2011C", "name": "BIOSOCIAL CRIMINOLOGY", "reviews": {"path": "/courses/24232/reviews", "values": [{"ratings": {"rAmountLearned": "3.33", "rDifficulty": "2.24", "rStimulateInterest": "3.45", "rRecommendMajor": "3.87", "rCourseQuality": "3.43", "rWorkRequired": "2.12", "rInstructorAccess": "3.20", "rReadingsValue": "3.22", "rRecommendNonMajor": "3.30", "rCommAbility": "3.73", "rInstructorQuality": "3.67"}, "section": {"name": "BIOSOCIAL CRIMINOLOGY", "sectionnum": "001", "primary_alias": "CRIM-370-001", "path": "/courses/24232/sections/001", "id": "24232-001", "aliases": ["CRIM-370-001"]}, "comments": "Criminology 370 examines criminality from an interdisciplinary perspective. Incorporating psychology, neuroscience, sociology, anthropology, law, forensics, and other readings, the course explores various influences on criminality while also analyzing controversial ethical, legal, and philosophical issues of criminality. Broadly, the course will help students understand, predict, and prevent criminal behavior.\r\n\r\nThe majority of students enjoyed the course content. Several students described the course materials and content as “extremely interesting” and praised the organization of the course. Multiple students appreciated the course’s field trip as particularly useful and enlightening.\r\n\r\nMost students were enthusiastic about Professor Raine. Students described Professor Raine as “well-versed in the literature of the field” and “an excellent lecturer.” Students also appreciated that Professor Raine was “fair in his exams and expectations” and “seemed genuinely interested in getting to know all of the students.”\r\n\r\nThis course seemed to attract a range of students from different class years and majors. Most students found the coursework fair and tested for fairly. Many students recommended the class for both majors and non-majors.\r\n", "num_students": 72, "path": "/courses/24232/sections/001/reviews/4771-ADRIAN-RAINE", "instructor": {"path": "/instructors/4771-ADRIAN-RAINE", "first_name": "ADRIAN", "last_name": "RAINE", "id": "4771-ADRIAN-RAINE", "name": "ADRIAN RAINE"}, "num_reviewers": 64, "id": "24232-001-4771-ADRIAN-RAINE"}]}, "credits": null, "primary_alias": "CRIM-370", "path": "/courses/24232", "sections": {"path": "/courses/24232/sections", "values": [{"name": "BIOSOCIAL CRIMINOLOGY", "sectionnum": "001", "primary_alias": "CRIM-370-001", "path": "/courses/24232/sections/001", "id": "24232-001", "aliases": ["CRIM-370-001"]}]}, "id": 24232, "aliases": ["CRIM-370"]}