[{"ratings": {"rAmountLearned": "2.88", "rDifficulty": "2.35", "rStimulateInterest": "3.24", "rRecommendMajor": "3.76", "rCourseQuality": "3.24", "rWorkRequired": "2.65", "rInstructorAccess": "3.71", "rReadingsValue": "3.00", "rRecommendNonMajor": "3.06", "rCommAbility": "3.41", "rInstructorQuality": "3.47"}, "section": {"name": "BLACKFACE JEWFACE", "sectionnum": "401", "primary_alias": "THAR-240-401", "path": "/courses/28221/sections/401", "id": "28221-401", "aliases": ["THAR-240-401", "ENGL-376-401"]}, "comments": "This course was “fascinating” and “excellent” to most students, who appreciated both the topic and the format of the “entirely discussion-based” seminar. Students felt “it was really cool to talk about racial issues openly without prejudice with fellow peers,” though some felt there was “too much tiptoeing around the material to have a real, provocative discussion.” Students “really appreciated the use of video examples that complimented the assigned play readings,” and wished for more visual representations to complement the many readings.\r\n\r\n\tProfessor Mazer was described as “brilliant and wonderful,” and students loved how “incredibly well-versed” he was in the subject matter. He was “very invested in all his students,” and many appreciated how he served as “a great mediator in discussion.” However, some felt he too often inserted his own opinion into the discussions to the discomfort of some students. Overall though, he was seen as a “very passionate” professor whose knowledge added a great deal to the course.\r\n\r\n\tThe workload of this course consisted of several readings, two five-page papers and a 12-15-page term paper. Students felt the work was “manageable” though readings for certain classes “felt overwhelming at times.” While some felt that the course did not live up to expectations, most students would “highly recommend” it to theater majors or anyone interested in theater.", "num_students": 17, "path": "/courses/28221/sections/401/reviews/416-CARY-M-MAZER", "instructor": {"path": "/instructors/416-CARY-M-MAZER", "first_name": "CARY M", "last_name": "MAZER", "id": "416-CARY-M-MAZER", "name": "CARY M MAZER"}, "num_reviewers": 17, "id": "28221-401-416-CARY-M-MAZER"}]