{"coursehistories": {"path": "/coursehistories/2385"}, "description": "Whether America begins with the Puritans and the Mayflower Compact, or with the Declaration of Independence and the Revolution, it is founded in resistance to empire. In the generations between, Americans have desired, dreaded and debated empire. This course will focus on empire and imperialism in American political thought. We will read primary texts addressing empire: from the departure and dissent of the Puritans, and Burke's Speech on Conciliation with the Colonies, to twentieth and twenty-first century debates over America's role in the world. These texts will include political pamphlets and speeches, poetry, novels, policy papers and film. \n\n", "semester": "2010C", "name": "AMERICAN POLIT THOUGHT", "reviews": {"path": "/courses/23668/reviews", "values": [{"ratings": {"rAmountLearned": "2.69", "rDifficulty": "2.15", "rStimulateInterest": "2.84", "rRecommendMajor": "3.24", "rCourseQuality": "2.82", "rWorkRequired": "2.29", "rInstructorAccess": "2.71", "rReadingsValue": "2.81", "rRecommendNonMajor": "2.43", "rCommAbility": "2.71", "rInstructorQuality": "2.94"}, "section": {"name": "AMERICAN POLIT THOUGHT", "sectionnum": "001", "primary_alias": "PSCI-183-001", "path": "/courses/23668/sections/001", "id": "23668-001", "aliases": ["PSCI-183-001"]}, "comments": "This course examines the political history of the United States through the lens of empire. Beginning with the early settlers and ending with modern presidents, this course surveys major periods of United States history to examine how major political thinkers treated the topic of empire and how the United States conformed to and differed from the definition of an empire. Readings include works from Burke, Paine, as well as presidential speeches, American poets, and foundational documents.\r\n\r\nMany students commented that the course content was difficult to pin down. To some students, the readings appeared “random and assigned without rhyme or reason.” Students also criticized Professor Norton’s inclusion of non-introductory material in the class, in particular, references to political theorists not discussed in class or described in readings. Reactions to lectures were mixed. Some students admired the “unorthodox” approach to lecture material, while many described the lectures as simply “disorganized.”\r\n\r\nNearly all students praised Professor Norton’s “exciting” presence. Nevertheless, two broad camps reflected differing opinions of Professor Norton’s teaching style. One large group of students thought that Professor Norton tended “to ramble and get caught in tangents,” which caused difficultly in following the logic of lectures. An equally large group of students, however, considered Professor Norton to be “truly into teaching” and noted that “her excitement about the course material seems to inspire student interest, and she manages to be engaging in spite of the large class size.” \r\n\r\nThis introductory course fulfills the Humanities & Social Science sector requirement. Thus, many students appeared to take this class to fulfill the requirement and had no previous background in Political Science. Most students found that they could earn reasonable grades without prior knowledge. Many students found the workload uneven, however, with some weeks requiring “hours of assigned readings” and others, only  “twenty minutes.” Many students also found the assignments to be disconnected from the lectures, and complained that the only midterm fell within a few weeks of the final exam.\r\n", "num_students": 137, "path": "/courses/23668/sections/001/reviews/264-ANNE-NORTON", "instructor": {"path": "/instructors/264-ANNE-NORTON", "first_name": "ANNE", "last_name": "NORTON", "id": "264-ANNE-NORTON", "name": "ANNE NORTON"}, "num_reviewers": 119, "id": "23668-001-264-ANNE-NORTON"}]}, "credits": null, "primary_alias": "PSCI-183", "path": "/courses/23668", "sections": {"path": "/courses/23668/sections", "values": [{"name": "AMERICAN POLIT THOUGHT", "sectionnum": "001", "primary_alias": "PSCI-183-001", "path": "/courses/23668/sections/001", "id": "23668-001", "aliases": ["PSCI-183-001"]}]}, "id": 23668, "aliases": ["PSCI-183"]}