[{"ratings": {"rAmountLearned": "2.83", "rDifficulty": "2.65", "rStimulateInterest": "2.46", "rRecommendMajor": "3.46", "rCourseQuality": "2.77", "rWorkRequired": "2.68", "rInstructorAccess": "3.44", "rReadingsValue": "1.99", "rRecommendNonMajor": "1.38", "rCommAbility": "3.13", "rInstructorQuality": "3.15"}, "section": {"name": "INTRO TO BIOMECHANICS", "sectionnum": "001", "primary_alias": "BE-200-001", "path": "/courses/24026/sections/001", "id": "24026-001", "aliases": ["BE-200-001"]}, "comments": "Application of statics and dynamics to simple force analyses of the\r\nmusculoskeletal system. Introduction to the fundamentals of strength of materials.\r\nBiomechanics of soft and hard tissues: microstructure and mechanical properties. This\r\ncourse is intended to provide a solid foundation in statics and mechanics of materials with\r\nparticular focus on human joint biomechanics. The first portion of the course presents\r\nfundamental concepts of force and mechanics of rigid and deformable bodies. The\r\nremainder of the course consists of an introduction of materials science and engineering,\r\nincluding the classification and bulk properties of implantable materials, and also\r\naddresses specific topics including torsional loading and bending. By the end of the\r\ncourse, it is anticipated that students are able to integrate the origin of tissue mechanical\r\nproperties with structure/function analyses of load-bearing tissues in the human body.\r\nStudents generally found this class to be “well-organized”, “fair”, and\r\n“enjoyable.” While students reported that both the mechanics and the materials portions\r\nwere well-explained, they felt that there was little connection between the two sections.\r\nThe homework assignments prepared the students for the exams, which required a good\r\ngrasp of algebra and physics. Quite a few students found the textbook for the mechanics\r\nsection to be redundant.\r\nProfessor Dourte was described as an engaging instructor. Students found her\r\nnotes to be much more helpful in explaining mechanics concepts than the textbook.\r\nStudents described the weekly homework assignments as “challenging but feasible.” The\r\nwork usually took about 4 to 8 hours to finish. The exams were reasonable as long as\r\nstudents completed homework. This class is recommended for Bioengineering majors\r\nonly.", "num_students": 95, "path": "/courses/24026/sections/001/reviews/5711-LEANN-M--DOURTE-SEGAN", "instructor": {"path": "/instructors/5711-LEANN-M--DOURTE-SEGAN", "first_name": "LEANN M.", "last_name": "DOURTE SEGAN", "id": "5711-LEANN-M--DOURTE-SEGAN", "name": "LEANN M. DOURTE SEGAN"}, "num_reviewers": 89, "id": "24026-001-5711-LEANN-M--DOURTE-SEGAN"}]