{"coursehistories": {"path": "/coursehistories/966"}, "description": "This course examines the fundamentals of real estate finance and development from a legal perspective. The course serves as a foundation course for real estate majors and provides an introduction to real estate for other students. It attempts to develop skills in using legal concepts in a real estate transactional setting. The course will be of interest to students contemplating careers in accounting, real estate development, real estate finance, city planning, or banking. The main topics covered may include the following: land acquisition, finance; choice of entity; tax aspects; management (leasing, environmental); disposition of real property (sale of mortgaged property, foreclosures, wraparound mortgages, sale-leasebacks); and recent legal developments. \n\n", "semester": "2012A", "name": "REAL ESTATE LAW", "reviews": {"path": "/courses/28089/reviews", "values": [{"ratings": {"rAmountLearned": "2.87", "rDifficulty": "2.61", "rStimulateInterest": "2.27", "rRecommendMajor": "2.94", "rCourseQuality": "2.63", "rWorkRequired": "2.27", "rInstructorAccess": "2.62", "rReadingsValue": "2.37", "rRecommendNonMajor": "2.10", "rCommAbility": "2.94", "rInstructorQuality": "2.85"}, "section": {"name": "REAL ESTATE LAW", "sectionnum": "401", "primary_alias": "REAL-204-401", "path": "/courses/28089/sections/401", "id": "28089-401", "aliases": ["REAL-204-401", "LGST-204-401", "REAL-804-401", "LGST-804-401"]}, "comments": "Real Estate 204 examines the fundamentals of real estate finance and development from a legal perspective. The course serves as a foundation course for real estate majors and provides an introduction to real estate for other students. It attempts to develop skills in using legal concepts in a real estate transactional setting. The course will be of interest to students contemplating careers in accounting, real estate development, real estate finance, city planning, or banking. The main topics covered may include the following: land acquisition, finance; choice of entity; tax aspects; management (leasing, environmental); disposition of real property (sale of mortgaged property, foreclosures, wraparound mortgages, sale-leasebacks); and recent legal developments.\r\n\r\nOverall, this course was described as “great” and “well-structured.” However, some students said the course included “too little exposure to commercial real estate.” They suggested that the course would be more beneficial if it could “go through actual documents which are more useful and realistic.” Students also hoped that the course could discuss clearer definitions, examples and more difficult concepts instead of the obvious ones. \r\n\r\nStudents described Professor Lane as a “good professor with real-life experience.” Some students said Professor Lane “[went] on tangents a lot,” and it was sometimes hard to follow him in class.\r\n\r\nThis course is required for real estate concentration. There are no prerequisites of this course. Some students complained that they were tested on concepts not covered in lecture. Students found it very helpful that every lecture was recorded. Relevant projects were required for this course.\r\n", "num_students": 41, "path": "/courses/28089/sections/401/reviews/4549-ROBERT-D--LANE", "instructor": {"path": "/instructors/4549-ROBERT-D--LANE", "first_name": "ROBERT D.", "last_name": "LANE", "id": "4549-ROBERT-D--LANE", "name": "ROBERT D. LANE"}, "num_reviewers": 41, "id": "28089-401-4549-ROBERT-D--LANE"}]}, "credits": null, "primary_alias": "REAL-204", "path": "/courses/28089", "sections": {"path": "/courses/28089/sections", "values": [{"name": "REAL ESTATE LAW", "sectionnum": "401", "primary_alias": "REAL-204-401", "path": "/courses/28089/sections/401", "id": "28089-401", "aliases": ["REAL-204-401", "LGST-204-401", "REAL-804-401", "LGST-804-401"]}]}, "id": 28089, "aliases": ["REAL-204", "LGST-204", "REAL-804", "LGST-804"]}