{"coursehistories": {"path": "/coursehistories/1984"}, "description": "This course is intended for students in mechanical engineering, civil-systems, materials science, and other fields. It continues the treatment of the statics of rigid bodies begun in Physics 150 and MEAM 110 and leads to the treatment of deformable bodies and their response to loads. The concepts of stress, strain, and linearly elastic response are introduced and they are applied to the behavior of rods, beams, shafts and pressure valves. Safety factors and the onset of mechanical failure are discussed. The course incorporates the use of computers to solve problems, and includes a written library research assignment and a team design project. \n\n", "semester": "2011C", "name": "STATICS & STRENTH OF MAT", "reviews": {"path": "/courses/24717/reviews", "values": [{"ratings": {"rAmountLearned": "2.38", "rDifficulty": "2.77", "rStimulateInterest": "1.16", "rRecommendMajor": "3.30", "rCourseQuality": "1.82", "rWorkRequired": "2.56", "rInstructorAccess": "2.64", "rReadingsValue": "2.12", "rRecommendNonMajor": "0.70", "rCommAbility": "1.70", "rInstructorQuality": "1.76"}, "section": {"name": "STATICS & STRENTH OF MAT", "sectionnum": "001", "primary_alias": "MEAM-210-001", "path": "/courses/24717/sections/001", "id": "24717-001", "aliases": ["MEAM-210-001"]}, "comments": "This course is intended for students in mechanical engineering, civil-systems,\r\nmaterials science, and other fields. It continues the treatment of the statics of rigid bodies\r\nbegun in Physics 150 and MEAM 110 and leads to the treatment of deformable bodies\r\nand their response to loads. The concepts of stress, strain, and linearly elastic response\r\nare introduced and they are applied to the behavior of rods, beams, shafts and pressure\r\nvalves. Safety factors and the onset of mechanical failure are discussed. The course\r\nincorporates the use of computers to solve problems, and includes a written library\r\nresearch assignment and a team design project.\r\nOverall, students felt this course taught them a lot about statistics and static\r\nsystems. Students appreciated the class’s applications of the mechanical engineering\r\nperspective. However, some students felt that the course focused too much on textbook\r\nproblems rather than those they would encounter outside of the classroom.\r\nStudents expressed that the grading was “consistent and fair” in this course.\r\nMany students felt that Professor Jackson did not “communicate well during lectures,”\r\n“[breezing] through” many problems when it would have been much more helpful to\r\nslowly work through a few. Attendance dropped during the semester as students\r\ndeveloped a “lack of interest” in the material.\r\nThis course builds on the prerequisite course MEAM 110. Many students\r\nappreciated the structure and format of the class, where there are weekly quizzes and\r\nassignments, no midterms, and one final. Students felt that having quizzes every week\r\nkept them “on top of things.” The textbook for the course was not very helpful, as “it\r\narrives at equations without a good explanation as to how the derivation was achieved.”", "num_students": 75, "path": "/courses/24717/sections/001/reviews/5231-ANDREW-JACKSON", "instructor": {"path": "/instructors/5231-ANDREW-JACKSON", "first_name": "ANDREW", "last_name": "JACKSON", "id": "5231-ANDREW-JACKSON", "name": "ANDREW JACKSON"}, "num_reviewers": 73, "id": "24717-001-5231-ANDREW-JACKSON"}]}, "credits": null, "primary_alias": "MEAM-210", "path": "/courses/24717", "sections": {"path": "/courses/24717/sections", "values": [{"name": "STATICS & STRENTH OF MAT", "sectionnum": "001", "primary_alias": "MEAM-210-001", "path": "/courses/24717/sections/001", "id": "24717-001", "aliases": ["MEAM-210-001"]}]}, "id": 24717, "aliases": ["MEAM-210"]}