{"coursehistories": {"path": "/coursehistories/730"}, "description": "This course teaches the fundamental concepts underlying the dynamics of vibrations for single-degree of freedom, multi-degree and infinite-degree of freedom mechanical systems. The course will focus on Newton's Force Methods, Virtual-Work Methods, and Lagrange's Variation Methods for analyzing problems in vibrations. Students will learn how to analyze transient, steady state and forced motion of single and multi-degree of freedom linear and non-linear systems. The course teaches analytical solution techniques for linear systems and practical numerical and simulation methods for analysis and design of nonlinear systems. \n\n", "semester": "2011C", "name": "VIBRATION MECH SYSTEMS", "reviews": {"path": "/courses/24721/reviews", "values": [{"ratings": {"rAmountLearned": "2.40", "rDifficulty": "3.42", "rStimulateInterest": "1.65", "rRecommendMajor": "2.96", "rCourseQuality": "2.00", "rWorkRequired": "3.29", "rInstructorAccess": "3.37", "rReadingsValue": "2.40", "rRecommendNonMajor": "0.54", "rCommAbility": "2.46", "rInstructorQuality": "2.65"}, "section": {"name": "VIBRATION MECH SYSTEMS", "sectionnum": "001", "primary_alias": "MEAM-321-001", "path": "/courses/24721/sections/001", "id": "24721-001", "aliases": ["MEAM-321-001"]}, "comments": "This course teaches the fundamental concepts underlying the dynamics of\r\nvibrations for single-degree of freedom and multi-degree of freedom mechanical systems.\r\nThe course focuses on Newton's Force Methods, Virtual-Work Methods, and Lagrange's\r\nVariation Methods for analyzing problems in vibrations. Students learn how to anlayze\r\ntransient, steady state and forced motion of single and multi-degree of freedom linear and\r\nnon-linear systems. The course teaches analytical solution techniques for linear systems\r\nand practical numerical and simulation methods for analysis and design of nonlinear\r\nsystems.\r\nStudents found this to be a very math and theory intensive class. They were\r\ndivided on the usefulness of the course—some felt that it was “devoid of any connection\r\nto practice,” while others described it as “interesting and applicable.” Many students\r\nreflected that they should have more tutorials on MAPLE before using it to solve\r\nhomework problems. A majority of students thought that although they learned a lot, they\r\ndid not understand how to apply the theory in the real world.\r\nProfessor Carchidi was described as “always open for help.” Students felt that he\r\n“genuinely cares about his students” and did an excellent job of reviewing the math\r\nneeded for the course. Students generally wished that more examples were presented in\r\nlecture.\r\nOverall, students found this course to be “difficult” and “tedious.” Heavy use of\r\nMAPLE was required to complete the homework, which some students experienced\r\nproblems with. This course is only recommended to majors.", "num_students": 61, "path": "/courses/24721/sections/001/reviews/774-MICHAEL-A--CARCHIDI", "instructor": {"path": "/instructors/774-MICHAEL-A--CARCHIDI", "first_name": "MICHAEL A.", "last_name": "CARCHIDI", "id": "774-MICHAEL-A--CARCHIDI", "name": "MICHAEL A. CARCHIDI"}, "num_reviewers": 54, "id": "24721-001-774-MICHAEL-A--CARCHIDI"}]}, "credits": null, "primary_alias": "MEAM-321", "path": "/courses/24721", "sections": {"path": "/courses/24721/sections", "values": [{"name": "VIBRATION MECH SYSTEMS", "sectionnum": "001", "primary_alias": "MEAM-321-001", "path": "/courses/24721/sections/001", "id": "24721-001", "aliases": ["MEAM-321-001"]}]}, "id": 24721, "aliases": ["MEAM-321"]}