{"coursehistories": {"path": "/coursehistories/1894"}, "description": "Survey of major themes, events, and personalities in African history from the early nineteenth century through the 1960s. Topics include abolition of the slave trade, European imperialism, impact of colonial rule, African resistance, religious and cultural movements, rise of naturalism and pan-Africanism, issues of ethnicity and \"tribalism\" in modern Africa. \n\n", "semester": "2009C", "name": "AFRICA SINCE 1800", "reviews": {"path": "/courses/17491/reviews", "values": [{"ratings": {"rAmountLearned": "3.10", "rDifficulty": "2.15", "rStimulateInterest": "3.02", "rRecommendMajor": "3.64", "rCourseQuality": "3.20", "rWorkRequired": "2.62", "rInstructorAccess": "3.23", "rReadingsValue": "3.04", "rRecommendNonMajor": "3.08", "rCommAbility": "3.14", "rInstructorQuality": "3.29"}, "section": {"name": "AFRICA SINCE 1800", "sectionnum": "401", "primary_alias": "HIST-076-401", "path": "/courses/17491/sections/401", "id": "17491-401", "aliases": ["HIST-076-401", "AFST-076-401", "AFRC-076-401"]}, "comments": "Survey of major themes, events, and personalities in African history from the early 19th century through the 1970s. Topics include abolition of the slave trade, European imperialism, impact of colonial rule, African resistance, religious and cultural movements, rise of nationalism and pan-Africanism, issues of ethnicity and \"tribalism\" in modern Africa.&#8232;&#8232;\r\n\r\nMost students agreed that the course was “great,” “interesting,” “thought provoking,” and that they learned a lot.  Students generally had very few negative comments about the course, except for the course load.\r\n\r\nStudents commented that Professor Cassanelli was a great and passionate instructor. One student summed it up that “Professor Cassanelli is an incredible lecturer who is truly fascinated by the material and completely engaged in teaching it.” In addition, Professor Cassanelli was “approachable” and “extremely knowledgeable.” Students commended Professor Cassanelli for choosing to teach a recitation and more students wished they could have been in it.\r\n\r\nStudents commented that the course was work intensive and there were a lot of readings. A student also mentioned that the required journal entries were a bit excessive. This course was recommend to “anyone interested in contemporary Africa or history in general.” \r\n", "num_students": 155, "path": "/courses/17491/sections/401/reviews/658-LEE-V-CASSANELLI", "instructor": {"path": "/instructors/658-LEE-V-CASSANELLI", "first_name": "LEE V", "last_name": "CASSANELLI", "id": "658-LEE-V-CASSANELLI", "name": "LEE V CASSANELLI"}, "num_reviewers": 140, "id": "17491-401-658-LEE-V-CASSANELLI"}]}, "credits": null, "primary_alias": "HIST-076", "path": "/courses/17491", "sections": {"path": "/courses/17491/sections", "values": [{"name": "AFRICA SINCE 1800", "sectionnum": "401", "primary_alias": "HIST-076-401", "path": "/courses/17491/sections/401", "id": "17491-401", "aliases": ["HIST-076-401", "AFST-076-401", "AFRC-076-401"]}]}, "id": 17491, "aliases": ["HIST-076", "AFST-076", "AFRC-076"]}