[{"ratings": {"rAmountLearned": "2.60", "rDifficulty": "2.71", "rStimulateInterest": "2.12", "rRecommendMajor": "2.98", "rCourseQuality": "2.61", "rWorkRequired": "3.17", "rInstructorAccess": "2.92", "rReadingsValue": "2.29", "rRecommendNonMajor": "2.23", "rCommAbility": "2.72", "rInstructorQuality": "2.75"}, "section": {"name": "ENERGY & ITS IMPACTS", "sectionnum": "401", "primary_alias": "EAS-401-401", "path": "/courses/24254/sections/401", "id": "24254-401", "aliases": ["EAS-401-401", "EAS-501-401"]}, "comments": "EAS 401 introduces students to one of the most dominating and compelling areas\r\nof human existence and endeavor: energy, with its foundations in technology, association\r\nto economics, and impacts on ecology and society. The course spans from basic\r\nprinciples to applications through a review of energy consumption, use, and resources;\r\necological impacts, sustainability and design of sustainable energy systems; methods of\r\nenergy analysis; forecasting; electricity generation systems (steam and gas turbine based\r\npower plants, fuel cells), energy for transportation (cars, aircraft, and ships); nuclear\r\nenergy and wastes; renewable energy use: solar, wind, hydroelectric, geothermal,\r\nbiomass; and prospects for future energy systems: fusion power, power generation in\r\nspace.\r\nCourse content overall was “very interesting and informative,” but the methods of\r\nlearning it “were not very exciting.” This course is heavily geared toward upperclassmen\r\nengineers, so those not in their final years of college or not in engineering struggled more\r\nthan others.\r\nMany students felt that Professor Lior was an “awesome instructor” and taught a\r\n“great class.” The topics he gave out to write papers on were well received by the\r\nstudents.\r\nThe main complaint for this class was that the workload is very bottom-heavy,\r\nmeaning that in the last third of the semester, two 50 page papers, 5 homework\r\nassignments, and a final were all assigned. Students wished this were spread out more so\r\nthat they could plan better for the end of the semester. However, students viewed this as\r\na “valuable experience” and appreciate the skills learned from this course.", "num_students": 63, "path": "/courses/24254/sections/401/reviews/776-NOAM-LIOR", "instructor": {"path": "/instructors/776-NOAM-LIOR", "first_name": "NOAM", "last_name": "LIOR", "id": "776-NOAM-LIOR", "name": "NOAM LIOR"}, "num_reviewers": 60, "id": "24254-401-776-NOAM-LIOR"}]