[{"ratings": {"rAmountLearned": "1.98", "rDifficulty": "1.26", "rTAQuality": "2.34", "rStimulateInterest": "2.37", "rRecommendMajor": "2.00", "rCourseQuality": "1.94", "rWorkRequired": "1.26", "rInstructorAccess": "2.39", "rReadingsValue": "2.05", "rRecommendNonMajor": "1.28", "rCommAbility": "2.51", "rInstructorQuality": "2.20"}, "section": {"name": "ETHICAL ASPECTS OF HEALTH & TECHNOLOGY", "sectionnum": "001", "primary_alias": "NURS-525-001", "path": "/courses/27894/sections/001", "id": "27894-001", "aliases": ["NURS-525-001"]}, "comments": "Interdisciplinary approach to the study of the interface between ethics and law in the provision of health and illness care.  This course draws upon the disciplines of philosophy, law, biomedical engineering and nursing in examining such concepts as the use/nonuse of biomedical technology, who and how one decides what shall be done for a given \"patient,\" and the \"rights\" and responsibilities (accountability) of all persons involved in health/illness care decisions.  The interplay of ethical theory, personal value systems, law and technology will be stressed throughout.  Lectures, seminars and case studies will be used.  This course satisfies the Society & Social Structures Sector for Nursing Class of 2012 and Beyond.\r\n\tGroup discussions guided by the professor were typical of most classes.  Students appreciated the discussion element but wished there were more “real-life and less sensational cases” that would direct the focus back to the core situations in health care.  Students had mixed responses to the “trigger videos” used in class to act out ethics scenarios, and many felt that the material presented was “outdated.”\r\nStudents responded positively to Dr. Perlman’s non-hierarchical teaching style as a welcome change in the nursing school and appreciated the professor’s responsiveness to feedback.  The case studies were seen as extremely informative and class discussions led by Dr. Perlman were considered “engaging” because he “gave so much of himself while helping [students] explore the difficult subject matter.”\r\n\tSome thought that the style of this course would have been more conducive to a smaller class structure, but that Dr. Perlman managed the large class size “admirably.”  Points were given for participation, but students oftentimes felt pressured to speak in class, which created an environment where students would comment solely to receive participation points.  No comments were given in regards to grading or workload.  \r\n", "num_students": 56, "path": "/courses/27894/sections/001/reviews/3117-DAVID-PERLMAN", "instructor": {"path": "/instructors/3117-DAVID-PERLMAN", "first_name": "DAVID", "last_name": "PERLMAN", "id": "3117-DAVID-PERLMAN", "name": "DAVID PERLMAN"}, "num_reviewers": 50, "id": "27894-001-3117-DAVID-PERLMAN"}]