[{"ratings": {"rAmountLearned": "3.18", "rDifficulty": "3.27", "rStimulateInterest": "2.55", "rRecommendMajor": "3.18", "rCourseQuality": "2.91", "rWorkRequired": "3.82", "rInstructorAccess": "3.18", "rReadingsValue": "2.73", "rRecommendNonMajor": "1.91", "rCommAbility": "2.73", "rInstructorQuality": "3.00"}, "section": {"name": "MARKETING RESEARCH", "sectionnum": "001", "primary_alias": "MKTG-423-001", "path": "/courses/23448/sections/001", "id": "23448-001", "aliases": ["MKTG-423-001"]}, "comments": "This course develops appreciation of the role of marketing research in the formulation and solution of marketing problems and development of the student's basic skills in conducting and evaluating marketing research projects. Special emphasis is placed on problem formulation, research design, alternative methods of data collection (including data collection instruments, sampling, and field operations), and data analysis techniques. Applications of modern marketing research procedures to a variety of marketing problems are explored. Lecture, discussions, and case studies are used to convey curriculum. This overall objective of this course is to teach how to use marketing research to solve marketing problems and make better marketing decisions. Course textbook is Marketing Research (8th edition) by McDaniel and Gates, published by Wiley. MKTG 411 is a prerequisite. This course is for WPWP certificate students only. \r\n\r\nOverall, students found this course to be “very informative,” but it required far more work than they had anticipated. One student stated, “Many of the elements required in the final project were not covered in class or class reading.” Students agreed that they would have “preferred the course grading structure to be less dependent upon group activities.” However, students felt that they learned a lot from this course. \r\n\r\nStudents’ main complaint with Professor Madway was that he took a very long time to grade and return assignments, so students rarely knew how they were faring in the class. Students felt that they “would have benefited from more consistent and timely feedback on assignments.” Students praised Professor Madway for being “extremely thorough in teaching us Marketing Research” and agreed that he was always available and willing to answer any questions. Students felt that Professor Madway’s “career experience added tremendously to the course” and found him to be an engaging lecturer. \r\n\r\nStudents found the projects, exams, and weekly homework assignments to be difficult and time consuming. One student commented that he had “never worked so much in any course in the WPWP program.” Students agreed that the course would have been easier if they had received their homework and assignments back in a timely manner. Some students commented that the lectures moved slowly and often ran over time, and they were evaluated on some material that had not been presented or explained to them in lecture. \r\n", "num_students": 14, "path": "/courses/23448/sections/001/reviews/4670-WILLIAM-MADWAY", "instructor": {"path": "/instructors/4670-WILLIAM-MADWAY", "first_name": "WILLIAM", "last_name": "MADWAY", "id": "4670-WILLIAM-MADWAY", "name": "WILLIAM MADWAY"}, "num_reviewers": 11, "id": "23448-001-4670-WILLIAM-MADWAY"}]