[{"ratings": {"rAmountLearned": "3.18", "rDifficulty": "2.89", "rStimulateInterest": "3.36", "rRecommendMajor": "3.70", "rCourseQuality": "3.36", "rWorkRequired": "2.89", "rInstructorAccess": "3.43", "rReadingsValue": "3.11", "rRecommendNonMajor": "1.83", "rCommAbility": "3.47", "rInstructorQuality": "3.53"}, "section": {"name": "COMPUTER ARCHITECTURE", "sectionnum": "001", "primary_alias": "CIS-501-001", "path": "/courses/24178/sections/001", "id": "24178-001", "aliases": ["CIS-501-001"]}, "comments": "This course is an introductory graduate course on computer architecture with an\r\nemphasis on a quantitative approach to cost/performance design tradeoffs. The course\r\ncovers the fundamentals of classical and modern uniprocessor design: performance and\r\ncost issues, instruction sets, pipelining, superscalar, out-of-order, and speculative\r\nexecution mechanisms, caches, physical memory, virtual memory, and I/O. Other topics\r\ninclude static scheduling, VLIW and EPIC, software speculation, long (SIMD), and short\r\n(multimedia) vector execution, multithreading, and an introduction to shared memory\r\nmultiprocessors.\r\nStudents called the course “excellent” and “useful” but also “time-consuming”\r\nand “difficult.” A student stated that “most of the material we covered seemed to be a\r\nrehashing of material from CIS 371.” As a typical computer science course, there was a\r\nlot of emphasis on the homework, and students had plenty of comments about them, “The\r\nhomework felt like a lot of data generation and plotting, and I spent more time on this\r\nthan the actual coding,” and “Even though the homework assignments are challenging,\r\nthey're always very helpful in getting you to understand in a very tangible way the\r\nsomewhat abstract concepts of architecture.”\r\nStudents had mixed reviews for Professor Martin. Some students found him to be\r\ncaring and easy to talk to. However, others felt that his attitude was rude and that his\r\nlectures were slow-paced and relied too much on PowerPoint. Students also complained\r\nabout some dropped assignments due to time constraints.\r\nThis class is meant as an introductory graduate course for computer programmers.\r\nPrevious knowledge of computer programming is necessary. Students said the workload\r\nfor this class was heavy and time consuming. Students stated, “This is definitely the fall\r\ncore course to take,” and “highly recommended for anyone seeking a greater\r\nunderstanding of computers.”", "num_students": 82, "path": "/courses/24178/sections/001/reviews/2434-MILO-M--K--MARTIN", "instructor": {"path": "/instructors/2434-MILO-M--K--MARTIN", "first_name": "MILO M. K.", "last_name": "MARTIN", "id": "2434-MILO-M--K--MARTIN", "name": "MILO M. K. MARTIN"}, "num_reviewers": 77, "id": "24178-001-2434-MILO-M--K--MARTIN"}]