[{"ratings": {"rAmountLearned": "2.36", "rDifficulty": "2.27", "rStimulateInterest": "2.52", "rRecommendMajor": "3.00", "rCourseQuality": "2.06", "rWorkRequired": "2.64", "rInstructorAccess": "3.00", "rReadingsValue": "2.12", "rRecommendNonMajor": "1.79", "rCommAbility": "2.03", "rInstructorQuality": "2.53"}, "section": {"name": "INTRO SOC RESEARCH", "sectionnum": "001", "primary_alias": "SOCI-100-001", "path": "/courses/16457/sections/001", "id": "16457-001", "aliases": ["SOCI-100-001", "HSOC-100-001"]}, "comments": "Introduction to Sociological Research aims to provide a broad overview of how sociologists gather and analyze information to generate and test hypotheses about the social world. It does this by covering the building blocks of sociological research, reviewing various research designs and analytic approaches, and taking critical perspectives on topic such as research ethics and objectivity.\r\n&#8232;&#8232;Reviews are mixed on the value of this course. The majority of student reviewers found this class dull, though a handful said they value what they learned. One student called it “kind of boring, but the skills you learn are worth it,” while another said it was merely a “tremendous waste of time.” In general students felt that lecture time was not used well because it focused on examples rather than explaining concepts listed in the textbooks, creating additional work for students to do on their own. &#8232;&#8232;A lot of dissatisfaction with the course stemmed from the lecture content and style. Students observed that Professor Koppel lectured from the assumption that students had read the textbook comprehensively before coming to class, and that he taught with examples rather than fully explained concepts. A few others saw the focus on examples as an attempt to stimulate student interest. According to one review, Professor Koppel does not use visuals or interactive activities during lecture, making it hard to focus. &#8232;&#8232;\r\nThis course is a requirement for Sociology majors, so many of the students who take it are majors. Assignments include a midterm, final and weekly homework assignments; attendance is required. A number of students said they felt unprepared for the tests because the material on them was not adequately covered in class. Many of the concepts they were tested on had to be learned outside of the lectures and there was no “systematic way” to prepare for exams.", "num_students": 39, "path": "/courses/16457/sections/001/reviews/659-ROSS-KOPPEL", "instructor": {"path": "/instructors/659-ROSS-KOPPEL", "first_name": "ROSS", "last_name": "KOPPEL", "id": "659-ROSS-KOPPEL", "name": "ROSS KOPPEL"}, "num_reviewers": 37, "id": "16457-001-659-ROSS-KOPPEL"}]