{"coursehistories": {"path": "/coursehistories/5200"}, "description": "This course takes a philosophical, historical, and practical approach to understanding why and how the US media industries are regulated. It begins by examining the philosophical tension regarding free speech rights vs. child protection obligations and the media effects beliefs that would drive media regulation. Next, it examines the process of media policy formation and implementation, including the role of regulatory agencies, industry lobbyists, academic researchers and child advocates in advancing distinct policy agendas. Throughout the course we survey a range of policy actions, from legislatively required parental monitoring tools (such as the V-Chip) to voluntary industry efforts (such as network restriction of junk food advertising). We consider evidence of the success of these efforts in limiting children's exposure to damaging content and in improving parents' ability to supervise their children's media use. \n\n", "semester": "2011C", "name": "CHILDREN'S MEDIA POLICY", "reviews": {"path": "/courses/24222/reviews", "values": [{"ratings": {"rAmountLearned": "3.14", "rDifficulty": "2.33", "rStimulateInterest": "3.24", "rRecommendMajor": "3.33", "rCourseQuality": "3.38", "rWorkRequired": "2.24", "rInstructorAccess": "3.57", "rReadingsValue": "3.00", "rRecommendNonMajor": "2.43", "rCommAbility": "3.62", "rInstructorQuality": "3.77"}, "section": {"name": "CHILDREN'S MEDIA POLICY", "sectionnum": "301", "primary_alias": "COMM-341-301", "path": "/courses/24222/sections/301", "id": "24222-301", "aliases": ["COMM-341-301"]}, "comments": "*Communications 341 takes a philosophical, historical, and practical approach to understanding why and how the US media industries are regulated. It begins by examining the philosophical tension regarding free speech rights vs. child protection obligations and the media effects beliefs that would drive media regulation. Next, it examines the process of media policy formation and implementation, including the role of regulatory agencies, industry lobbyists, academic researchers and child advocates in advancing distinct policy agendas. Throughout the course a range of policy actions, from legislatively required parental monitoring tools (such as the V-Chip) to voluntary industry efforts (such as network restriction of junk food advertising) are surveyed. Evidence of the success of these efforts in limiting children's exposure to damaging content and in improving parents' ability to supervise their children's media use is considered. \r\n\r\nStudents enjoyed that the course structure was based on both lectures and student-led discussions. This allowed everyone to voice their opinions and have more open discussions. Students liked that the class was “relevant to current events.”\r\n\r\nA huge majority of the students raved about Professor Jordan. One student claimed that Professor Jordan was “a great instructor, fair, and incredibly nice.” This opinion was widely held, as many students claimed Professor Jordan was their favorite teacher at Penn. They praised Professor Jordan’s ability to make the subject matter very interesting. \r\n\r\nThis class comes recommended to all. Both the content and the professor were highly regarded as being both exceptionally interesting and very fair. \r\n\r\n*This review is based on only 8 student comments\r\n", "num_students": 22, "path": "/courses/24222/sections/301/reviews/281-AMY-B--JORDAN", "instructor": {"path": "/instructors/281-AMY-B--JORDAN", "first_name": "AMY B.", "last_name": "JORDAN", "id": "281-AMY-B--JORDAN", "name": "AMY B. JORDAN"}, "num_reviewers": 22, "id": "24222-301-281-AMY-B--JORDAN"}]}, "credits": null, "primary_alias": "COMM-341", "path": "/courses/24222", "sections": {"path": "/courses/24222/sections", "values": [{"name": "CHILDREN'S MEDIA POLICY", "sectionnum": "301", "primary_alias": "COMM-341-301", "path": "/courses/24222/sections/301", "id": "24222-301", "aliases": ["COMM-341-301"]}]}, "id": 24222, "aliases": ["COMM-341"]}