[{"ratings": {"rAmountLearned": "3.01", "rDifficulty": "2.71", "rStimulateInterest": "2.68", "rRecommendMajor": "3.57", "rCourseQuality": "2.80", "rWorkRequired": "2.91", "rInstructorAccess": "3.05", "rReadingsValue": "2.97", "rRecommendNonMajor": "2.52", "rCommAbility": "3.27", "rInstructorQuality": "3.05"}, "section": {"name": "INTRO TO INTL RELATIONS", "sectionnum": "001", "primary_alias": "PSCI-150-001", "path": "/courses/23665/sections/001", "id": "23665-001", "aliases": ["PSCI-150-001"]}, "comments": "This course is an introduction to the major theories and issues in international politics. The goals of the course are to give students a broad familiarity with the field of international relations, and to help them develop the analytical skills necessary to think critically about international politics. The course is divided into four parts: 1) Concepts and Theories of International Relations; 2) War and Security; 3) The Global Economy; and 4) Emerging Issues in International Relations. Each topic is explored through course readings and applications.\r\n\r\nStudents tended to use the word “average” or “typical” in describing this course. Students felt nothing was explored thoroughly, as the course aimed to cover a large range of subjects. \r\n\r\nProfessor Stanton was well liked by the students, praised for her ability to communicate the material and to inspire interest in students. However, she was thought to be “inaccessibly beyond the TAs.” This may have been due to the TAs being the main determiners of grades, but the Professor often would just refer students to their respective TA. Comments regarding the teaching technique and effectiveness seemed to be divided. Some said the lectures were interesting and connected the material well to the outside world, while others said they could tell the professor was young and still hadn’t mastered her teaching style.  \r\n\r\nThe class is heavily lecture based and though the textbook was said to be incredibly boring, the extra readings were reported to be interesting and thought to enhance the learning within the course by applying theory and material to current events. The readings overlapped heavily with lecture material so many students felt that the course got a little repetitive. One main complaint of students was the fact that the TAs were relied upon heavily for discussion, grading and questions. Students felt that in preparation for tests this gave some recitation sections an advantage. Therefore, comments ranged from “my favorite course of the semester” to “nothing interesting.” Many but not all of the students that took this course were Political Science majors. Students recommended the class more to a major and less to a non-major, primarily because of the heavy reading load that was not “unmanageable” as long as you had “a little time management.” Many complained about the heavy reading load and thought that the same material could be taught with less reading. \r\n", "num_students": 238, "path": "/courses/23665/sections/001/reviews/4537-JESSICA-STANTON", "instructor": {"path": "/instructors/4537-JESSICA-STANTON", "first_name": "JESSICA", "last_name": "STANTON", "id": "4537-JESSICA-STANTON", "name": "JESSICA STANTON"}, "num_reviewers": 212, "id": "23665-001-4537-JESSICA-STANTON"}]