[{"ratings": {"rAmountLearned": "2.12", "rDifficulty": "2.81", "rStimulateInterest": "0.96", "rRecommendMajor": "2.84", "rCourseQuality": "1.46", "rWorkRequired": "2.53", "rInstructorAccess": "2.59", "rReadingsValue": "2.18", "rRecommendNonMajor": "0.78", "rCommAbility": "1.55", "rInstructorQuality": "1.63"}, "section": {"name": "STATICS & STRENTH OF MAT", "sectionnum": "001", "primary_alias": "MEAM-210-001", "path": "/courses/23383/sections/001", "id": "23383-001", "aliases": ["MEAM-210-001"]}, "comments": "This course is intended for students in mechanical engineering, civil-systems, materials science, and other fields. It continues the treatment of the statics of rigid bodies begun in Physics 150 and MEAM 110 and leads to the treatment of deformable bodies and their response to loads. The concepts of stress, strain, and linearly elastic response are introduced and they are applied to the behavior of rods, beams, shafts and pressure valves. Safety factors and the onset of mechanical failure are discussed. The course incorporates the use of computers to solve problems, and includes a written library research assignment and a team design project. \r\n\r\nStudents reported that this course had an extremely heavy emphasis on the textbook. According to most, many examples in class were simply “rewrites of example problems from the book (that are already solved).” Several students agreed that some of the material was unclear and that it was “hard to focus in class.” \r\n\r\nProfessor Jackson was criticized by some students as being neither “helpful nor interested in the course.” According to several, his lectures were “straight from the book,” and students felt that his style was not very engaging. On the other hand, some students said that Professor Jackson had a very thorough understanding of the material. \r\n\r\nOverall, students reported that this course was heavily dependent on the textbook. Some stated that quizzes relied “too heavily upon visualizing 3D space rather than the material in class.” Some students said that it was “difficult to succeed in this class” because the book was “mediocre” and the professor would only cover what was in the book. This course was recommended for majors only.\r\n", "num_students": 63, "path": "/courses/23383/sections/001/reviews/5231-ANDREW-JACKSON", "instructor": {"path": "/instructors/5231-ANDREW-JACKSON", "first_name": "ANDREW", "last_name": "JACKSON", "id": "5231-ANDREW-JACKSON", "name": "ANDREW JACKSON"}, "num_reviewers": 57, "id": "23383-001-5231-ANDREW-JACKSON"}]