[{"ratings": {"rAmountLearned": "2.93", "rDifficulty": "2.30", "rStimulateInterest": "1.98", "rRecommendMajor": "2.82", "rCourseQuality": "2.59", "rWorkRequired": "2.52", "rInstructorAccess": "2.63", "rReadingsValue": "2.61", "rRecommendNonMajor": "2.09", "rCommAbility": "2.40", "rInstructorQuality": "2.35"}, "section": {"name": "CAPITAL MARKETS", "sectionnum": "001", "primary_alias": "FNCE-738-001", "path": "/courses/27445/sections/001", "id": "27445-001", "aliases": ["FNCE-738-001"]}, "comments": "FNCE 738 examines the available corporate securities that firms can use to finance investment. The course will focus on: (1) the design of these securities (Why do bonds have embedded options? What is the role of preferred stock?); (2) the issuing process for these securities (What do investment banks do? Is the underwriting process important for the cost of capital?); (3) the pricing of these securities (How are credit risk in bonds and loans priced?) The securities covered include corporate and junk bonds, bank loans, common and preferred equity, commercial paper, securitization, as well as some recent innovations. Other topics include the role of embedded options in corporate bonds; the role of bank and loan covenants; the function of bond rating agencies; exchange offers; prepackaged bankruptcies; bankruptcy Chapter 11; workouts; debtor-in-possession financing; and pricing credit risk. The course is designed to be complementary to Advanced Corporate Finance and Fixed Income Securities.\r\n\tMost students felt that this was a great class that tied together general and broad concepts of finance ranging from “bank-run model, bonds, bankruptcy, and structured securities.” The course does not go in depth on any particular topic but an “excellent theoretical class” that left many students with a better understanding of practical aspects in the financial world. A general theme among students was that the class was a very practical course that all finance majors should take.\r\n\tStudents depicted Professor Musto as a clear lecturer with extremely well written notes that are posted online. Professor Musto was also illustrated as a very dedicated teacher, who is passionate about the course material and successfully applies concepts learned in class to real life situations. \r\n\tThe class is a Wharton graduate level finance class but is taught with a fundamental-like approach. The workload was described as light and the grading scheme consisted of a few assignments and quizzes but no formal exams. Prerequisites include FNCE 611 or 612; FNCE 613.\r\n", "num_students": 73, "path": "/courses/27445/sections/001/reviews/520-DAVID-K--MUSTO", "instructor": {"path": "/instructors/520-DAVID-K--MUSTO", "first_name": "DAVID K.", "last_name": "MUSTO", "id": "520-DAVID-K--MUSTO", "name": "DAVID K. MUSTO"}, "num_reviewers": 69, "id": "27445-001-520-DAVID-K--MUSTO"}, {"ratings": {"rAmountLearned": "2.77", "rDifficulty": "2.30", "rStimulateInterest": "1.78", "rRecommendMajor": "3.22", "rCourseQuality": "2.64", "rWorkRequired": "2.48", "rInstructorAccess": "2.31", "rReadingsValue": "2.67", "rRecommendNonMajor": "2.33", "rCommAbility": "2.50", "rInstructorQuality": "2.38"}, "section": {"name": "CAPITAL MARKETS", "sectionnum": "002", "primary_alias": "FNCE-738-002", "path": "/courses/27445/sections/002", "id": "27445-002", "aliases": ["FNCE-738-002"]}, "comments": "", "num_students": 36, "path": "/courses/27445/sections/002/reviews/520-DAVID-K--MUSTO", "instructor": {"path": "/instructors/520-DAVID-K--MUSTO", "first_name": "DAVID K.", "last_name": "MUSTO", "id": "520-DAVID-K--MUSTO", "name": "DAVID K. MUSTO"}, "num_reviewers": 36, "id": "27445-002-520-DAVID-K--MUSTO"}]