{"coursehistories": {"path": "/coursehistories/3836"}, "description": "This is an introductory course about Basic Algorithms and Data Structures using the Java programming language. We introduce elementary concepts about the complexity of an algorithm and methods for analyzing the running time of software. We describe data structures like stacks, queues, lists, trees, priority queues, maps, hash tables and graphs, and we discuss how to implement them efficiently and how to use them in problems-solving software. A larger project introducing students to some of the challenges of software development concludes the course. \n\n", "semester": "2011A", "name": "PROG LANG AND TECH II", "reviews": {"path": "/courses/21445/reviews", "values": [{"ratings": {"rAmountLearned": "2.63", "rDifficulty": "3.05", "rStimulateInterest": "1.30", "rRecommendMajor": "3.33", "rCourseQuality": "2.04", "rWorkRequired": "3.18", "rInstructorAccess": "2.49", "rReadingsValue": "1.59", "rRecommendNonMajor": "1.30", "rCommAbility": "1.88", "rInstructorQuality": "1.96"}, "section": {"name": "PROG LANG AND TECH II", "sectionnum": "001", "primary_alias": "CIS-121-001", "path": "/courses/21445/sections/001", "id": "21445-001", "aliases": ["CIS-121-001"]}, "comments": "This is an introductory course using Java. The course introduces students to elementary concepts about the complexity of an algorithm. Students are taught to implement data structures like stacks, queues, lists, trees, priority queues, maps, has tables, and graphs in problem-solving software. The final project is designed to introduce students to the challenges of software development. &#8232;&#8232;Students generally found the material covered “interesting” and the course “valuable.” The course provided a “good foundation” for future CIS courses. The PowerPoint slides, which many students found “informative,” were posted online after each lecture. As a result, many students felt physical attendance was unnecessary. &#8232;&#8232;In addition, students felt Dr. Taskar lacked the ability to engage students and “couldn’t communicate the information well.” Though Dr. Taskar was “quick to solicit questions” from his students, the lecture environment made it “intimidating to ask.” Many also felt that his office hours were scheduled at inconvenient times. In addition, students felt that the TAs were “condescending and unsupportive” and “rarely made themselves available.” &#8232;&#8232;Students agreed that homework assignments, which were not assigned at regular intervals, were “very frustrating” and “unnecessarily difficult.” Assignments were often updated or corrected mere days before they were due, angering students. Multiple students reported that “even the TAs couldn’t complete” the assignments, which students also described as “misleading” and “horrendously designed.” In addition, students felt the grading was “unfair” and “absurd.”", "num_students": 56, "path": "/courses/21445/sections/001/reviews/3917-BENJAMIN-TASKAR", "instructor": {"path": "/instructors/3917-BENJAMIN-TASKAR", "first_name": "BENJAMIN", "last_name": "TASKAR", "id": "3917-BENJAMIN-TASKAR", "name": "BENJAMIN TASKAR"}, "num_reviewers": 50, "id": "21445-001-3917-BENJAMIN-TASKAR"}]}, "credits": null, "primary_alias": "CIS-121", "path": "/courses/21445", "sections": {"path": "/courses/21445/sections", "values": [{"name": "PROG LANG AND TECH II", "sectionnum": "001", "primary_alias": "CIS-121-001", "path": "/courses/21445/sections/001", "id": "21445-001", "aliases": ["CIS-121-001"]}]}, "id": 21445, "aliases": ["CIS-121"]}