[{"ratings": {"rAmountLearned": "2.96", "rDifficulty": "2.35", "rStimulateInterest": "2.74", "rRecommendMajor": "3.50", "rCourseQuality": "2.93", "rWorkRequired": "1.89", "rInstructorAccess": "2.53", "rReadingsValue": "2.17", "rRecommendNonMajor": "2.72", "rCommAbility": "3.07", "rInstructorQuality": "3.02"}, "section": {"name": "HEALTH CARE SYSTEMS", "sectionnum": "001", "primary_alias": "HCMG-101-001", "path": "/courses/15858/sections/001", "id": "15858-001", "aliases": ["HCMG-101-001"]}, "comments": "HCMG101 is an introductory course which takes a policy and politics angle to health care\\'s three persistent issues - access, cost and quality. The roles of patients, physicians, hospitals, insurers, and pharmaceutical companies will be established. The interaction between the government and these different groups will also be covered. Current national health care policy initiatives and the interests of class members will steer the specific topics covered. The course aims to provide skills for critical and analytical thought about the U.S. health care system and the people in it.\r\n\r\nStudents described the course as “very informative” and reported learning a large quantity of material over the course of the semester. For the most part, students liked how the class format incorporated many guest lecturers. Though many students found there to be a lot of information to master, nearly everyone agreed that it was presented well in class.\r\n\r\nMost students praised Professor Harrington’s sense of humor and considered him to be “a great lecturer.” Some students commented that Professor Harrington tended to spend more time on the conservative viewpoint when discussing a controversial issue.\r\n\r\nRegarding the midterm exam, many students commented that it focused too heavily on recalling statistics as opposed to applying concepts, but they appreciated the optional quizzes that were offered to improve their grade.", "num_students": 101, "path": "/courses/15858/sections/001/reviews/3320-SCOTT-HARRINGTON", "instructor": {"path": "/instructors/3320-SCOTT-HARRINGTON", "first_name": "SCOTT", "last_name": "HARRINGTON", "id": "3320-SCOTT-HARRINGTON", "name": "SCOTT HARRINGTON"}, "num_reviewers": 97, "id": "15858-001-3320-SCOTT-HARRINGTON"}]