[{"ratings": {"rAmountLearned": "2.92", "rDifficulty": "3.30", "rStimulateInterest": "2.26", "rRecommendMajor": "3.11", "rCourseQuality": "2.79", "rWorkRequired": "3.07", "rInstructorAccess": "2.44", "rReadingsValue": "2.36", "rRecommendNonMajor": "1.70", "rCommAbility": "2.19", "rInstructorQuality": "2.46"}, "section": {"name": "MACHINE PERCEPTION", "sectionnum": "001", "primary_alias": "CIS-580-001", "path": "/courses/27179/sections/001", "id": "27179-001", "aliases": ["CIS-580-001"]}, "comments": "This course introduces the problems of computer vision and other forms of machine perception that can be solved using geometrical approaches rather than statistical methods. Emphasis will be placed on both analytical and computational techniques. This course is designed to provide students with an exposure to the fundamental mathematical and algorithmic techniques that are used to tackle challenging image based modeling problems. The subject matter of this course finds application in the fields of Computer Vision, Computer Graphics and Robotics. Some of the topics to be covered include: Projective Geometry, Camera Calibration, Image Formation, Projective, Affine and Euclidean Transformations, Computational Stereopsis, and the recovery of 3D structure from multiple 2D images. This course will also explore various approaches to object recognition that make use of geometric techniques, these would include alignment based methods and techniques that exploit geometric invariants. In the assignments for this course, students will be able to apply the techniques to actual computer vision problems.\r\n\r\nStudents overall reported that the course was “wonderful,” “good,” and “very interesting.”\r\n\r\nStudents felt the professor could “improve on his methods” but “loves teaching” and has a “good interest.” Most students also agreed that the TAs were “understandable and hardworking.”\r\n\r\nAlthough the class was “difficult,” students felt the homework assignments were “great applications.” Students also found the 24-hour exams to be “very stressful.”   This course is appropriate as an upper-level undergraduate CIS elective.\r\n", "num_students": 31, "path": "/courses/27179/sections/001/reviews/312-KONSTANTINOS-DANIILIDIS", "instructor": {"path": "/instructors/312-KONSTANTINOS-DANIILIDIS", "first_name": "KONSTANTINOS", "last_name": "DANIILIDIS", "id": "312-KONSTANTINOS-DANIILIDIS", "name": "KONSTANTINOS DANIILIDIS"}, "num_reviewers": 28, "id": "27179-001-312-KONSTANTINOS-DANIILIDIS"}]