{"coursehistories": {"path": "/coursehistories/3988"}, "description": "Whether as statues, walls, plaques, parks, or other commemorative structures, monuments are regular features of urban topography. Such \"sites of memory\" not only instruct us about significant events of the past, but do so in the space and time of the present. And yet, the historical memory of cities is alsomade legible through modes of cultural expression and inscription - including literature, visual art, graffiti, music, and street performance. Cycles of urban de-industrialization and renewal since the 1970s, as well as legacies of conflict and inequality, have exacerbated the need for alternate forms of commemoration. The Occupy movement is one continued example of how urban space can be reanimated through demarcation, embodiment, and calls for collectivity. \n\nIn the course, \"Memory, Monuments, and Urban Space\", we will explore literary, cultural, and architectural approaches to historical memory and urban policy. We will look to officially sanctioned monuments as well as countercultural or grassroots expressions of memory as sites to study cultures of urban space. We will focus primarily on the period between 1968 and the present, considering the role of race, gender, sexuality, and class in debates about cultural memory, and we will delve into such ongoing matters of historical reflection: the Vietnam War, the War on Drugs, the MOVE bombing, the AIDS epidemic, and 9/11. Students will develop skills useful for urban spatial and historical analysis through readings of contemporary cultural productions, engaged online research through social media platforms, and regular fieldwork observations at monument sites around Philadelphia. \n\n", "semester": "2007C", "name": "Memory and Urbanism in the Americas", "reviews": {"path": "/courses/13999/reviews", "values": [{"ratings": {"rAmountLearned": "2.67", "rDifficulty": "2.00", "rStimulateInterest": "2.67", "rRecommendMajor": "2.67", "rCourseQuality": "2.33", "rWorkRequired": "2.67", "rInstructorAccess": "3.00", "rReadingsValue": "3.00", "rRecommendNonMajor": "2.67", "rCommAbility": "3.00", "rInstructorQuality": "2.67"}, "section": {"name": "Memory and Urbanism in the Americas", "sectionnum": "401", "primary_alias": "URBS-414-401", "path": "/courses/13999/sections/401", "id": "13999-401", "aliases": ["URBS-414-401", "LALS-414-401"]}, "comments": "", "num_students": 4, "path": "/courses/13999/sections/401/reviews/4136-MATTHEW-JAMES-HILL", "instructor": {"path": "/instructors/4136-MATTHEW-JAMES-HILL", "first_name": "MATTHEW JAMES", "last_name": "HILL", "id": "4136-MATTHEW-JAMES-HILL", "name": "MATTHEW JAMES HILL"}, "num_reviewers": 3, "id": "13999-401-4136-MATTHEW-JAMES-HILL"}]}, "credits": null, "primary_alias": "URBS-414", "path": "/courses/13999", "sections": {"path": "/courses/13999/sections", "values": [{"name": "Memory and Urbanism in the Americas", "sectionnum": "401", "primary_alias": "URBS-414-401", "path": "/courses/13999/sections/401", "id": "13999-401", "aliases": ["URBS-414-401", "LALS-414-401"]}]}, "id": 13999, "aliases": ["URBS-414", "LALS-414"]}