{"coursehistories": {"path": "/coursehistories/893"}, "description": "An introduction to the classical laws of motion requiring a background in calculus. Suggested for students in a pre-health program. \n\n", "semester": "2011C", "name": "GEN.PHYS:MECH,HEAT,SOUND", "reviews": {"path": "/courses/24972/reviews", "values": [{"ratings": {"rAmountLearned": "2.50", "rDifficulty": "2.32", "rStimulateInterest": "2.50", "rRecommendMajor": "3.16", "rCourseQuality": "2.38", "rWorkRequired": "2.41", "rInstructorAccess": "3.12", "rReadingsValue": "2.54", "rRecommendNonMajor": "1.88", "rCommAbility": "2.48", "rInstructorQuality": "2.69"}, "section": {"name": "GEN.PHYS:MECH,HEAT,SOUND", "sectionnum": "001", "primary_alias": "PHYS-101-001", "path": "/courses/24972/sections/001", "id": "24972-001", "aliases": ["PHYS-101-001"]}, "comments": "This is an introductory course in the branch of physics known as classical\r\nmechanics requiring a background in calculus. Students who master classical mechanics\r\noften report that, in addition to acquiring some of the tools they will need for future\r\nstudies in science, mathematics, medicine, or engineering, they have also gained a new\r\nappreciation for the beauty of everyday phenomena and have substantially developed\r\ntheir reasoning skills. Physics 101 lab is a co-requisite.\r\nSome students thought that this course was the “best science course” they took at\r\nPenn. However, others thought that this course required too much memorization and\r\ndidn’t focus enough on actually understanding the material in an applicable manner.\r\nStudents overall thought that Professor Drndic was an extremely fair professor.\r\nShe was “approachable” and willing to alter the class schedule “based on what students\r\nfelt worked and didn’t work.” Professor Drndic was quick to respond to emails which\r\nmade it easier for students to get extra help. However, some students felt that the course\r\nwas disorganized and that Professor Drndic “lacked the ability to stimulate” the students.\r\nShe spent too much time on the first half of the course and had to speed through the\r\nsecond half of the course, which made it difficult for some students to keep up.\r\nOverall, students thought that this was an easy course. They found Professor\r\nDrndic’s grading to be extremely fair. This course is suggested for students in a prehealth\r\nprogram. It is also good for people “who don’t have a strong physics\r\nbackground.” It fulfills the physical world sector.", "num_students": 144, "path": "/courses/24972/sections/001/reviews/2304-MARIJA-DRNDIC", "instructor": {"path": "/instructors/2304-MARIJA-DRNDIC", "first_name": "MARIJA", "last_name": "DRNDIC", "id": "2304-MARIJA-DRNDIC", "name": "MARIJA DRNDIC"}, "num_reviewers": 126, "id": "24972-001-2304-MARIJA-DRNDIC"}, {"ratings": {"rAmountLearned": "2.59", "rDifficulty": "3.43", "rStimulateInterest": "2.23", "rRecommendMajor": "2.46", "rCourseQuality": "2.11", "rWorkRequired": "3.17", "rInstructorAccess": "2.48", "rReadingsValue": "2.33", "rRecommendNonMajor": "1.41", "rCommAbility": "2.06", "rInstructorQuality": "2.05"}, "section": {"name": "GEN.PHYS:MECH,HEAT,SOUND", "sectionnum": "601", "primary_alias": "PHYS-101-601", "path": "/courses/24972/sections/601", "id": "24972-601", "aliases": ["PHYS-101-601"]}, "comments": "An introduction to the classical laws of motion and thermodynamics requiring a\r\nbackground in calculus. Suggested for students in a pre-health program.\r\nStudents found the course to be “engaging” with “good content.” Students reported\r\nlearning a lot from the class, but at the same time found the course material to be a bit\r\nrushed. On the whole, students felt Professor Allen’s “concept tests” were one of his most\r\neffective teaching tools.\r\nStudents had mixed opinions about Professor Allen. Most students found him to\r\nbe “very passionate” about his class and both “enthusiastic and knowledgeable.”\r\nHowever, others felt that he was inadequately prepared to teach. Additionally, most\r\nstudents felt that he was accessible throughout the semester, while others found the fact\r\nthat he had no recitation suboptimal.\r\nMany students also noted that exam problems were “much more difficult” than\r\nexamples given in lecture and homework. Most students enrolled in this class were postbacs.", "num_students": 71, "path": "/courses/24972/sections/601/reviews/4527-PETER-ALLEN", "instructor": {"path": "/instructors/4527-PETER-ALLEN", "first_name": "PETER", "last_name": "ALLEN", "id": "4527-PETER-ALLEN", "name": "PETER ALLEN"}, "num_reviewers": 56, "id": "24972-601-4527-PETER-ALLEN"}]}, "credits": null, "primary_alias": "PHYS-101", "path": "/courses/24972", "sections": {"path": "/courses/24972/sections", "values": [{"name": "GEN.PHYS:MECH,HEAT,SOUND", "sectionnum": "001", "primary_alias": "PHYS-101-001", "path": "/courses/24972/sections/001", "id": "24972-001", "aliases": ["PHYS-101-001"]}, {"name": "GEN.PHYS:MECH,HEAT,SOUND", "sectionnum": "601", "primary_alias": "PHYS-101-601", "path": "/courses/24972/sections/601", "id": "24972-601", "aliases": ["PHYS-101-601"]}]}, "id": 24972, "aliases": ["PHYS-101"]}