[{"ratings": {"rAmountLearned": "2.75", "rDifficulty": "2.94", "rStimulateInterest": "3.43", "rRecommendMajor": "3.25", "rCourseQuality": "2.72", "rWorkRequired": "3.10", "rInstructorAccess": "3.37", "rReadingsValue": "2.58", "rRecommendNonMajor": "2.35", "rCommAbility": "3.56", "rInstructorQuality": "3.62"}, "section": {"name": "SURVEY OF THE UNIVERSE", "sectionnum": "001", "primary_alias": "ASTR-001-001", "path": "/courses/21307/sections/001", "id": "21307-001", "aliases": ["ASTR-001-001"]}, "comments": "This is a general survey course designed to explore the facts and theories of the astronomical universe, from solar system, to stars, to galaxies and cosmology. Topics include planets, satellites, small objects in the solar system, and extraterrestrial life; stars, their evolution, and their final state as white dwarfs, neutron stars, or black holes; galaxies, quasars, large structures, background radiation, and big bang cosmology. Elementary algebra and geometry will be used. This course is not recommended for physical-science majors or engineering students.\r\n\r\nSome students found the material “extremely interesting.” On the other hand, one student noted: “I did not find the material especially interesting, but the course overall was well-structured, moving at a pace that ensured that students understood the material without being too slow.” Another student thought that the course “was very well taught and structured.” One student remarked that it was \"one of the BEST courses” he had ever taken since it was “useful, interesting, and rewarding.”\r\n\r\nProfessor Devlin was described as an “awesome professor” whose “lectures are always entertaining.” He took the time to simplify the subject material so that students could understand. He also “welcomes questions” and “is willing to meet pretty much anytime.” One student commented that he “could make anything interesting.” \r\n\r\nStudents found the course “difficult and work-intensive,” especially the observing labs. They noted that most students were taking the course to fulfill multiple requirements. One student wrote that the course was “definitely not easy.” Many found the class to be “way too difficult for an introductory class as a sector requirement,” noting that the labs and homework were “unnecessarily time consuming” and that more math was required than many students expected. This course fulfills the Physical World sector and College Quantitative Data Analysis requirement.\r\n", "num_students": 91, "path": "/courses/21307/sections/001/reviews/146-MARK-J--DEVLIN", "instructor": {"path": "/instructors/146-MARK-J--DEVLIN", "first_name": "MARK J.", "last_name": "DEVLIN", "id": "146-MARK-J--DEVLIN", "name": "MARK J. DEVLIN"}, "num_reviewers": 81, "id": "21307-001-146-MARK-J--DEVLIN"}, {"ratings": {"rAmountLearned": "2.71", "rDifficulty": "2.76", "rStimulateInterest": "2.52", "rRecommendMajor": "2.46", "rCourseQuality": "2.43", "rWorkRequired": "2.98", "rInstructorAccess": "3.24", "rReadingsValue": "2.62", "rRecommendNonMajor": "2.57", "rCommAbility": "2.92", "rInstructorQuality": "2.83"}, "section": {"name": "SURVEY OF THE UNIVERSE", "sectionnum": "002", "primary_alias": "ASTR-001-002", "path": "/courses/21307/sections/002", "id": "21307-002", "aliases": ["ASTR-001-002"]}, "comments": "This course is a general survey, designed for the non-major, of the facts and theories of the astronomical universe, from solar system, to stars, to galaxies and cosmology. Topics include planets, satellites, small objects in the solar system, and extraterrestrial life; stars, their evolution, and their final state as white dwarfs, neutron stars, or black holes; galaxies, quasars, large structures, background radiation, and big bang cosmology. Elementary algebra and geometry will be used. This course is not recommended for physical-science majors or engineering students.\r\n\r\nStudents found the class to be \"fascinating\" and enjoyed the class much more than they anticipated. They thought the class was \"fun, interesting, and not too difficult to digest.\"\r\n\r\nProfessor Lidz was \"engaging\" and \"very attentive to the needs of his students\" making himself “available and approachable to go over difficult content and answer any questions.” He presents course material well, and makes the class interesting by pointing out \"recent developments in astronomy\" that were related to the material covered in class.\r\n\r\nStudents found that the class required \"an immense amount of work,\" including \"homework, labs, and tests\". Attending class is also important since the material is not “easy or self-explanatory.” The exams were difficult but \"the curve is very generous.\" Some students found that textbook notes were exactly the same as lecture notes. This class is listed as a course for non-majors and can be used to satisfy a college requirement (Physical World).\r\n", "num_students": 74, "path": "/courses/21307/sections/002/reviews/4961-ADAM-LIDZ", "instructor": {"path": "/instructors/4961-ADAM-LIDZ", "first_name": "ADAM", "last_name": "LIDZ", "id": "4961-ADAM-LIDZ", "name": "ADAM LIDZ"}, "num_reviewers": 64, "id": "21307-002-4961-ADAM-LIDZ"}, {"ratings": {"rAmountLearned": "2.82", "rDifficulty": "2.94", "rStimulateInterest": "2.47", "rRecommendMajor": "2.71", "rCourseQuality": "2.54", "rWorkRequired": "3.06", "rInstructorAccess": "3.35", "rReadingsValue": "3.06", "rRecommendNonMajor": "2.35", "rCommAbility": "2.63", "rInstructorQuality": "2.83"}, "section": {"name": "SURVEY OF THE UNIVERSE", "sectionnum": "003", "primary_alias": "ASTR-001-003", "path": "/courses/21307/sections/003", "id": "21307-003", "aliases": ["ASTR-001-003"]}, "comments": "", "num_students": 29, "path": "/courses/21307/sections/003/reviews/4249-JAMES-ERIK-AGUIRRE", "instructor": {"path": "/instructors/4249-JAMES-ERIK-AGUIRRE", "first_name": "JAMES ERIK", "last_name": "AGUIRRE", "id": "4249-JAMES-ERIK-AGUIRRE", "name": "JAMES ERIK AGUIRRE"}, "num_reviewers": 26, "id": "21307-003-4249-JAMES-ERIK-AGUIRRE"}]