[{"ratings": {"rAmountLearned": "2.92", "rDifficulty": "2.74", "rStimulateInterest": "3.27", "rRecommendMajor": "3.53", "rCourseQuality": "3.08", "rWorkRequired": "3.12", "rInstructorAccess": "2.87", "rReadingsValue": "2.81", "rRecommendNonMajor": "2.91", "rCommAbility": "3.55", "rInstructorQuality": "3.51"}, "section": {"name": "AMERICAN SOUTH 1861-PRES", "sectionnum": "001", "primary_alias": "HIST-171-001", "path": "/courses/21857/sections/001", "id": "21857-001", "aliases": ["HIST-171-001"]}, "comments": "This course traces the history of the American South from the end of the Civil War to the present. It investigates Reconstruction, the New South, Populism, racial disfranchisement and the rise of Jim Crow, the politics of the One-Party South, the South in the Progressive era and its role in the New Deal and World War II, the Civil Rights Movement of the 1950s and 1960s, and the rise of the Republican South. While following the narrative of politics and economic development, students pay particular attention to race relations and gender roles. In addition, the course takes frequent peeks at the evolving Southern identity as reflected in popular culture and literature as well as in other corners of the public sphere.&#8232;&#8232;Some students thought it was a “fantastic” class and others though that the class expectations were unclear and the course seemed to cover too much material. However, students reported learning a lot of fascinating things about American history. &#8232;&#8232;Professor Hahn got rave reviews from all of his students. Many said that he inspired a love of history in them when it had previously been one of their least favorite subjects. He was often described as “phenomenal” and “outstanding.” Though he is a Pulitzer Prize winner, he is quite accessible to students and wants each to enjoy what they are learning. He is extremely knowledgeable in the subject matter and is able to communicate complex ideas and concepts in a clear manner so all students understand. One student put it perfectly by saying “Professor Hahn is the best professor I have ever encountered.” &#8232;&#8232;Many students complained about the amount of reading required for this course. Some of the texts were found to be a little irrelevant to the overall goals of the class, and the number of required chapters could have been cut drastically. Overall this class is highly recommended to anyone and everyone.", "num_students": 106, "path": "/courses/21857/sections/001/reviews/2506-STEVEN-HAHN", "instructor": {"path": "/instructors/2506-STEVEN-HAHN", "first_name": "STEVEN", "last_name": "HAHN", "id": "2506-STEVEN-HAHN", "name": "STEVEN HAHN"}, "num_reviewers": 96, "id": "21857-001-2506-STEVEN-HAHN"}]