[{"ratings": {"rAmountLearned": "2.57", "rDifficulty": "2.70", "rStimulateInterest": "1.85", "rRecommendMajor": "2.63", "rCourseQuality": "2.07", "rWorkRequired": "2.48", "rInstructorAccess": "2.79", "rReadingsValue": "2.58", "rRecommendNonMajor": "1.79", "rCommAbility": "1.83", "rInstructorQuality": "2.14"}, "section": {"name": "PUBLIC FINANCE", "sectionnum": "001", "primary_alias": "ECON-231-001", "path": "/courses/25892/sections/001", "id": "25892-001", "aliases": ["ECON-231-001"]}, "comments": "This course has two parts. The first looks at market and government failures and discusses the need for public policies as well as limits to their effectiveness including the evaluation of public projects using cost benefit analysis. The second part focuses on the economic analysis of taxation, including the economic incidence and efficiency of taxes. Prerequisites include ECON101, MATH104 and MATH114 or MATH115, and ECON 103 is recommended. \r\n\r\nStudents agreed that the course material was generally applicable to real-world situations. One student mentioned that the supplemental material on topics such as information asymmetry and health insurance “provided some thoughtful conclusions.” \r\n\r\nSeveral students expressed that they would have preferred Professor Fang’s presentations to be organized in a more straightforward fashion. On the other hand, some students believed that the professor was effective in connecting the material to tangible examples and that he is knowledgeable and friendly. According to one student, “his fluency in subject material expressed both in class and in office visits impressed me.” \r\n\r\nSome students indicated that the exams did not adequately reflect the material taught in the classroom. A few students would have liked more guidance in problem sets and other deliverables.", "num_students": 60, "path": "/courses/25892/sections/001/reviews/5607-HANMING-FANG", "instructor": {"path": "/instructors/5607-HANMING-FANG", "first_name": "HANMING", "last_name": "FANG", "id": "5607-HANMING-FANG", "name": "HANMING FANG"}, "num_reviewers": 59, "id": "25892-001-5607-HANMING-FANG"}]