[{"ratings": {"rAmountLearned": "3.18", "rDifficulty": "2.47", "rStimulateInterest": "3.10", "rRecommendMajor": "3.55", "rCourseQuality": "3.19", "rWorkRequired": "2.35", "rInstructorAccess": "3.38", "rReadingsValue": "2.64", "rRecommendNonMajor": "2.77", "rCommAbility": "3.53", "rInstructorQuality": "3.44"}, "section": {"name": "ABNORMAL PSYCHOLOGY", "sectionnum": "001", "primary_alias": "PSYC-162-001", "path": "/courses/20754/sections/001", "id": "20754-001", "aliases": ["PSYC-162-001"]}, "comments": "This course provides an overview of the various psychological disorders. Specifically, course objectives include: (a) examine historical and current conceptions of normal and abnormal behavior; (b) survey the symptoms and characteristics of several adult psychological disorders (including mood disorders, anxiety disorders, schizophrenia, and eating disorders); (c) explore theory and research on the origins of these disorders; and d) introduce the main treatment approaches for these disorders.\r\n\r\nOverall, students enjoyed the class and found the material to be both interesting and relevant to daily life. One student claimed that this class “goes on to paint an extremely clear picture of psychopathology!” \r\n\r\nStudents appreciated Professor Ruscio’s organization, communication skills and passion for her subject. The majority of the class felt that she was “very enthusiastic and committed to the class.” One student declared that “students respect Professor Ruscio and she is able to stimulate much interest. She is a great professor and this is a great class.” Another raved that he was “impressed by not only her organization but by her great compassion. If only all of Penn’s professors could be like her!” The majority of students were also happy with Professor Ruscio’s utilization of video clips to help them “see” what each mental disorder looks like in the real world. \r\n\r\nWhile some students complained that “the assignments felt like busy work,” most felt like the work and readings were excellent supplements to the material covered in lectures. The only prerequisite for the course is Psyc 001, Introduction to Experimental Psychology. Students highly recommended this class for all psychology majors and others suggested that any student interested in the field, regardless of major, should enroll in this course.", "num_students": 110, "path": "/courses/20754/sections/001/reviews/4208-AYELET-MERON-RUSCIO", "instructor": {"path": "/instructors/4208-AYELET-MERON-RUSCIO", "first_name": "AYELET MERON", "last_name": "RUSCIO", "id": "4208-AYELET-MERON-RUSCIO", "name": "AYELET MERON RUSCIO"}, "num_reviewers": 86, "id": "20754-001-4208-AYELET-MERON-RUSCIO"}, {"ratings": {"rAmountLearned": "3.04", "rDifficulty": "2.22", "rStimulateInterest": "2.96", "rRecommendMajor": "3.63", "rCourseQuality": "2.96", "rWorkRequired": "2.00", "rInstructorAccess": "3.04", "rReadingsValue": "3.04", "rRecommendNonMajor": "2.67", "rCommAbility": "3.19", "rInstructorQuality": "3.22"}, "section": {"name": "ABNORMAL PSYCHOLOGY", "sectionnum": "601", "primary_alias": "PSYC-162-601", "path": "/courses/20754/sections/601", "id": "20754-601", "aliases": ["PSYC-162-601"]}, "comments": "", "num_students": 33, "path": "/courses/20754/sections/601/reviews/3610-JEDIDIAH-SIEV", "instructor": {"path": "/instructors/3610-JEDIDIAH-SIEV", "first_name": "JEDIDIAH", "last_name": "SIEV", "id": "3610-JEDIDIAH-SIEV", "name": "JEDIDIAH SIEV"}, "num_reviewers": 27, "id": "20754-601-3610-JEDIDIAH-SIEV"}]