{"coursehistories": {"path": "/coursehistories/1589"}, "description": "A developmental perspective on the general empirical and theoretical psychologyof perception, cognition, language, learning, comparative ethology, and socialization. \n\n", "semester": "2010C", "name": "DEVELOPMENTAL PSYCH", "reviews": {"path": "/courses/23706/reviews", "values": [{"ratings": {"rAmountLearned": "2.13", "rDifficulty": "2.19", "rStimulateInterest": "1.67", "rRecommendMajor": "2.52", "rCourseQuality": "2.05", "rWorkRequired": "2.02", "rInstructorAccess": "2.65", "rReadingsValue": "2.06", "rRecommendNonMajor": "1.75", "rCommAbility": "2.10", "rInstructorQuality": "2.16"}, "section": {"name": "DEVELOPMENTAL PSYCH", "sectionnum": "001", "primary_alias": "PSYC-180-001", "path": "/courses/23706/sections/001", "id": "23706-001", "aliases": ["PSYC-180-001"]}, "comments": "\r\nPSYC 180 provides developmental perspective on the general empirical and theoretical psychology of social and emotional development over the lifespan. The course emphasizes the application of basic science to real-world contexts.\r\n\r\nThis course covers a wide range of materials. Students felt that they learned a lot, but that classes were rushed, due to the large amount of information crammed into each one. Additionally, some students stated that the topics covered in this course were only vaguely linked to each other.\r\n\r\nMost students found Professor Hafetz to be knowledgeable and organized in her presentation of the material. Additionally, many reported that she is nice and accommodating; she makes an effort to schedule appointments with students outside of class time and to respond promptly to emails. However, many students felt that Professor Hafetz rushed through the lecture slides and dismissed her classes early. Students felt that this made taking notes and staying focused in class very difficult. Professor Hafetz also mainly read off of her slides.\r\n\r\nWhile there is not a lot of work required for this course for the majority of the semester, students reported that the third midterm and the final exam were lengthy take-home tests. The midterm was 16 pages long to be done in a week and the final was 12 pages long to be done in two weeks. Nevertheless, most students did not feel that the tests were too difficult. One student commented, however, that preparing for exams was challenging due to the wide range of material.\r\n", "num_students": 72, "path": "/courses/23706/sections/001/reviews/5524-JESSICA-S-HAFETZ", "instructor": {"path": "/instructors/5524-JESSICA-S-HAFETZ", "first_name": "JESSICA S", "last_name": "HAFETZ", "id": "5524-JESSICA-S-HAFETZ", "name": "JESSICA S HAFETZ"}, "num_reviewers": 64, "id": "23706-001-5524-JESSICA-S-HAFETZ"}]}, "credits": null, "primary_alias": "PSYC-180", "path": "/courses/23706", "sections": {"path": "/courses/23706/sections", "values": [{"name": "DEVELOPMENTAL PSYCH", "sectionnum": "001", "primary_alias": "PSYC-180-001", "path": "/courses/23706/sections/001", "id": "23706-001", "aliases": ["PSYC-180-001"]}]}, "id": 23706, "aliases": ["PSYC-180"]}