[{"ratings": {"rAmountLearned": "2.91", "rDifficulty": "2.39", "rStimulateInterest": "3.44", "rRecommendMajor": "3.74", "rCourseQuality": "3.09", "rWorkRequired": "1.93", "rInstructorAccess": "3.45", "rReadingsValue": "1.98", "rRecommendNonMajor": "2.56", "rCommAbility": "3.71", "rInstructorQuality": "3.63"}, "section": {"name": "POLITICAL ECONOMY", "sectionnum": "401", "primary_alias": "ECON-232-401", "path": "/courses/15593/sections/401", "id": "15593-401", "aliases": ["ECON-232-401", "PPE-232-401"]}, "comments": "This course examines the political and economic determinants of government policies. The course presents economic arguments for government action in the private economy. How government decides policies via simple majority voting, representative legislatures, and executive veto and agenda-setting politics are covered. Applications include government spending and redistributive policies.\r\n\r\nStudents described this course as \\\"great\\\" and an \\\"absolute favorite.\\\" While some found the final group projects to be \\\"enjoyable,\\\" others thought that the groups should be smaller to avoid difficulties and \\\"free loaders.\\\"&#8232;&#8232;\r\n\r\nStudents enthusiastically praised Professor Merlo, with several students calling him the \\\"best Econ professor\\\" at Penn and a \\\"gem\\\" of the department. He was described as \\\"great,\\\" \\\"excellent,\\\" and \\\"energetic.\\\" He was also \\\"very helpful\\\" with homework problems during office hours.\r\n\r\nStudents described this course as \\\"not so difficult.\\\" Some complained about the final group projects, noting that because of the large group sizes, students sometimes got away with contributing little effort.", "num_students": 87, "path": "/courses/15593/sections/401/reviews/344-ANTONIO-M--MERLO", "instructor": {"path": "/instructors/344-ANTONIO-M--MERLO", "first_name": "ANTONIO M.", "last_name": "MERLO", "id": "344-ANTONIO-M--MERLO", "name": "ANTONIO M. MERLO"}, "num_reviewers": 82, "id": "15593-401-344-ANTONIO-M--MERLO"}]