{"coursehistories": {"path": "/coursehistories/3055"}, "description": "This course examines the political and economic determinants of government policies. The course presents economic arguments for government action in the private economy. How government decides policies via simple majority voting, representative legislatures, and executive veto and agenda-setting politics will be studied. Applications include government spending and redistributive policies. \n\n", "semester": "2010A", "name": "POLITICAL ECONOMY", "reviews": {"path": "/courses/25893/reviews", "values": [{"ratings": {"rAmountLearned": "2.30", "rDifficulty": "3.00", "rStimulateInterest": "2.71", "rRecommendMajor": "2.88", "rCourseQuality": "2.54", "rWorkRequired": "2.78", "rInstructorAccess": "2.55", "rReadingsValue": "1.73", "rRecommendNonMajor": "1.27", "rCommAbility": "2.90", "rInstructorQuality": "2.75"}, "section": {"name": "POLITICAL ECONOMY", "sectionnum": "401", "primary_alias": "ECON-232-401", "path": "/courses/25893/sections/401", "id": "25893-401", "aliases": ["ECON-232-401", "PPE-232-401"]}, "comments": "This course examines the political and economic determinants of government policies. The course presents economic arguments for government action in the private economy. How government decides policies via simple majority voting, representative legislatures, and executive veto and agenda-setting politics will be studied. Applications include government spending and redistributive policies. Prerequisites for this course include ECON101, MATH104 and MATH114 or MATH115, and ECON 103 is recommended. \r\n\r\nMost students found the course material to be interesting and engaging. One student emphasized, “I feel like I have a very strong grasp on a lot of the tools needed to understand economics.” One student stated that this class was an “excellent course for any Economics major.” \r\n\r\nStudents found Professor Azzimonti to be an effective instructor. As one student explained, “She explained everything clearly and went back to topics when students were confused.” On the other hand, some students felt that the pace of lectures was too fast, as one student mentioned, “I struggle to keep up writing my notes and don't have time to think it through in class.” \r\n\r\nSome students expressed displeasure with assessments. According to one student, “No extra exercises were given other than class examples,” and “there was no way for students to review the materials through algebraic exercises.” Furthermore, students found the final exam rather difficult. Some students would have preferred some extra guidance on problem sets and would have liked more details in the lecture notes.", "num_students": 81, "path": "/courses/25893/sections/401/reviews/4785-MARINA-D--AZZIMONTI", "instructor": {"path": "/instructors/4785-MARINA-D--AZZIMONTI", "first_name": "MARINA D.", "last_name": "AZZIMONTI", "id": "4785-MARINA-D--AZZIMONTI", "name": "MARINA D. AZZIMONTI"}, "num_reviewers": 73, "id": "25893-401-4785-MARINA-D--AZZIMONTI"}]}, "credits": null, "primary_alias": "ECON-232", "path": "/courses/25893", "sections": {"path": "/courses/25893/sections", "values": [{"name": "POLITICAL ECONOMY", "sectionnum": "401", "primary_alias": "ECON-232-401", "path": "/courses/25893/sections/401", "id": "25893-401", "aliases": ["ECON-232-401", "PPE-232-401"]}]}, "id": 25893, "aliases": ["ECON-232", "PPE-232"]}