[{"ratings": {"rAmountLearned": "3.71", "rDifficulty": "2.82", "rStimulateInterest": "3.88", "rRecommendMajor": "3.88", "rCourseQuality": "3.83", "rWorkRequired": "3.00", "rInstructorAccess": "3.65", "rReadingsValue": "3.50", "rRecommendNonMajor": "3.53", "rCommAbility": "3.81", "rInstructorQuality": "3.89"}, "section": {"name": "WORLD WAR I", "sectionnum": "001", "primary_alias": "HIST-425-001", "path": "/courses/21883/sections/001", "id": "21883-001", "aliases": ["HIST-425-001"]}, "comments": "This survey course examines the outbreak, conduct, and aftermath of the First World War. The First World War put an end to the world of the nineteenth century and laid the foundations of the twentieth century, the age of destruction and devastation. This course examines the war in three components: the long-term and immediate causes of the First World War; the war's catastrophic conduct, on the battlefield and on the home front; and, the war's devastating aftermath. While  military operations and certain battles will be discussed, this course is not a military history of the war; it covers the social, economic, political and diplomatic aspects that contributed to the war's outbreak and made possible its execution over four devastating years. No preliminary knowledge or coursework is required.\r\n\r\nStudents agreed that this course was “excellent” and one of the “best courses” at Penn.  Many commented that classes were well organized, and they learned far more than they had initially expected. Most students noted that they appreciated the “complete perspective” of the course, examining the war from a variety of angles. \r\n\r\nStudents praised Professor Holquist for his teaching style and approach to History. One student, summing up the overall student consensus, stated, “Professor Holquist is an excellent lecturer, and his energetic style helps keep students engaged in a very complicated and occasionally confusing subject.”  Multiple respondents declared Professor Holquist to be the best professor they have had at Penn. Students also praised Professor Holquist for his ability to give constructive feedback on assignments. Many appreciated his efforts to be accessible before exams and assignments.\r\n\r\nMost found the readings to be quite long, but others commented that all of the assignments were interesting and relevant to understanding the course. Students generally felt this course challenged them, but stated that Professor Holquist was invested in their success and more than willing to help. Both Majors and non-majors highly recommended this course. \r\n", "num_students": 24, "path": "/courses/21883/sections/001/reviews/3325-PETER-HOLQUIST", "instructor": {"path": "/instructors/3325-PETER-HOLQUIST", "first_name": "PETER", "last_name": "HOLQUIST", "id": "3325-PETER-HOLQUIST", "name": "PETER HOLQUIST"}, "num_reviewers": 18, "id": "21883-001-3325-PETER-HOLQUIST"}]