{"coursehistories": {"path": "/coursehistories/1033"}, "description": "Sociology provides a unique way to look at human behavior and social interaction. Sociology is the systematic study of the groups and societies in which people live. In this introductory course, we analyze how social structures and cultures are created, maintained, and changed, and how they affect lives of individuals. In this course, we will reconsider our taken for granted world and examine what theory and research can tell us about our social world. \n\n", "semester": "2010A", "name": "INTRO TO SOCIOLOGY", "reviews": {"path": "/courses/26761/reviews", "values": [{"ratings": {"rAmountLearned": "2.46", "rDifficulty": "1.41", "rStimulateInterest": "3.37", "rRecommendMajor": "3.53", "rCourseQuality": "2.90", "rWorkRequired": "1.80", "rInstructorAccess": "3.28", "rReadingsValue": "2.75", "rRecommendNonMajor": "3.29", "rCommAbility": "3.22", "rInstructorQuality": "3.16"}, "section": {"name": "INTRO TO SOCIOLOGY", "sectionnum": "001", "primary_alias": "SOCI-001-001", "path": "/courses/26761/sections/001", "id": "26761-001", "aliases": ["SOCI-001-001"]}, "comments": "Sociology provides a unique way to look at human behavior and the world. Sociology is the systematic study of the groups and societies in which people live. In this introductory course, we examine and analyze how social structures and cultures are created, maintained, and most importantly, how they affect behavior. The course deconstructs our taken for granted world of social interactions and behaviors and examines what theory and research can tell about human social behavior.\r\nAn overwhelming majority of students found this course to be extremely easy. Many felt that it was too easy, which caused them to lose interest and not learn as much as they could have. Some felt that the focus of the class was too narrow, focusing a lot on race, and not enough on general theory. Some students found the reading to be one-sided.\r\nDifficulty level aside, many students found Professor Nopper to be “energetic” and felt that she “clearly communicates themes of the reading to the class.” Students had mixed feelings regarding the discussion-heavy nature of the class, in which Professor Nopper encouraged participation. Students noted that Professor Nopper really made an effort to connect to her students. However, a few students felt that Professor Nopper did not always show both sides of the argument in a given story.\r\nStudents found the exams and papers to be very easy, and recommended this class to anyone looking to improve their GPA. ", "num_students": 96, "path": "/courses/26761/sections/001/reviews/4248-TAMARA-K--NOPPER", "instructor": {"path": "/instructors/4248-TAMARA-K--NOPPER", "first_name": "TAMARA K.", "last_name": "NOPPER", "id": "4248-TAMARA-K--NOPPER", "name": "TAMARA K. NOPPER"}, "num_reviewers": 93, "id": "26761-001-4248-TAMARA-K--NOPPER"}]}, "credits": null, "primary_alias": "SOCI-001", "path": "/courses/26761", "sections": {"path": "/courses/26761/sections", "values": [{"name": "INTRO TO SOCIOLOGY", "sectionnum": "001", "primary_alias": "SOCI-001-001", "path": "/courses/26761/sections/001", "id": "26761-001", "aliases": ["SOCI-001-001"]}]}, "id": 26761, "aliases": ["SOCI-001"]}