{"coursehistories": {"path": "/coursehistories/712"}, "description": "Syllabus for MATH 360-361: a study of the foundations of the differential and integral calculus, including the real numbers and elementary topology, continuous and differentiable functions, uniform convergence of series of functions, and inverse and implicit function theorems. MATH 508-509 is a masters level version of this course. \n\n", "semester": "2012A", "name": "ADVANCED CALCULUS", "reviews": {"path": "/courses/27715/reviews", "values": [{"ratings": {"rAmountLearned": "3.22", "rDifficulty": "3.89", "rStimulateInterest": "1.33", "rRecommendMajor": "3.44", "rCourseQuality": "2.16", "rWorkRequired": "3.89", "rInstructorAccess": "3.06", "rReadingsValue": "3.06", "rRecommendNonMajor": "1.06", "rCommAbility": "1.88", "rInstructorQuality": "2.37"}, "section": {"name": "ADVANCED CALCULUS", "sectionnum": "001", "primary_alias": "MATH-360-001", "path": "/courses/27715/sections/001", "id": "27715-001", "aliases": ["MATH-360-001"]}, "comments": "A study of the foundations of the differential and integral calculus, including the real numbers and elementary topology, continuous and differentiable functions, uniform convergence of series of functions, and inverse and implicit function theorems. MATH 508-509 is a masters level version of this course.\r\n\r\n\tStudents generally thought this course had difficult aspects, but the course was considered well organized. Many students thought that lecture notes posted online were “really helpful” and “excellent.” One student remarked, “for an introductory course it was completely overwhelming,” while another remarked that the course was “the most stressful experience.”\r\n\r\n\tProfessor Le was considered a good professor by many students in the course. Several students remarked that Professor Le was “very clear,” while several others noted Professor Le’s accessibility and willingness to help during office hours. A number of students noted that Professor Le’s writing was sometimes “too messy” and that the professor erased things from the board too quickly. Students praised the lecture notes Professor Le posted online, with one student remarking that they were “better than any textbook.”\r\n\r\nThe workload of this course was widely considered to be very challenging. The students called the weekly problems sets “extremely heavy and difficult” and “unreasonable.” One student noted that the professor “liberally…deducts points on exams.” The prerequisite to this course was MATH 240. This review is based on 8 student comments.", "num_students": 24, "path": "/courses/27715/sections/001/reviews/5633-TRIET-M-LE", "instructor": {"path": "/instructors/5633-TRIET-M-LE", "first_name": "TRIET M", "last_name": "LE", "id": "5633-TRIET-M-LE", "name": "TRIET M LE"}, "num_reviewers": 20, "id": "27715-001-5633-TRIET-M-LE"}]}, "credits": null, "primary_alias": "MATH-360", "path": "/courses/27715", "sections": {"path": "/courses/27715/sections", "values": [{"name": "ADVANCED CALCULUS", "sectionnum": "001", "primary_alias": "MATH-360-001", "path": "/courses/27715/sections/001", "id": "27715-001", "aliases": ["MATH-360-001"]}]}, "id": 27715, "aliases": ["MATH-360"]}