[{"ratings": {"rAmountLearned": "1.24", "rDifficulty": "1.95", "rStimulateInterest": "1.54", "rRecommendMajor": "1.95", "rCourseQuality": "1.74", "rWorkRequired": "2.17", "rInstructorAccess": "1.41", "rReadingsValue": "1.22", "rRecommendNonMajor": "1.59", "rCommAbility": "1.61", "rInstructorQuality": "1.52"}, "section": {"name": "ANTHROPOLOGY AND CINEMA", "sectionnum": "401", "primary_alias": "ANTH-231-401", "path": "/courses/25593/sections/401", "id": "25593-401", "aliases": ["ANTH-231-401", "CINE-231-401"]}, "comments": "This course analyzes mass-market American films using traditional anthropological theories about symbolism, ritual, mythology, language, metaphor, narrative and discourse. The goal is to think of the movies as significant cultural artifacts that we use to make sense of the world rather than as just forms of entertainment or art. Through a study of popular American films and their related merchandise and cultural influences, students also see how anthropology can be used to study contemporary cultures.\r\nStudents were for the most part neutral towards the content of the course. One student commented that the course was “very fluffy in nature” and another described it as “easy and entertaining.” However, several students objected to the large amount of time spent on the final video project.\r\nProfessor Krasniewicz received mostly negative reviews. Several students felt that her expectations were unclear and that she was “impossible to approach.” In class discussions, one student said that she “does not compromise and refuses to alter her views on the subject.” Many claimed that she did not provide adequate technological assistance throughout the final assignment—according to one, she was “unhelpful and refused to give advice on a project fraught with tons of complications.”\r\nOverall, although students did not believe the class to be difficult, they were reluctant to recommend the course to those not incredibly interested in the topic.", "num_students": 52, "path": "/courses/25593/sections/401/reviews/2851-LOUISE-KRASNIEWICZ", "instructor": {"path": "/instructors/2851-LOUISE-KRASNIEWICZ", "first_name": "LOUISE", "last_name": "KRASNIEWICZ", "id": "2851-LOUISE-KRASNIEWICZ", "name": "LOUISE KRASNIEWICZ"}, "num_reviewers": 47, "id": "25593-401-2851-LOUISE-KRASNIEWICZ"}]