[{"ratings": {"rAmountLearned": "3.58", "rDifficulty": "2.65", "rStimulateInterest": "3.79", "rRecommendMajor": "3.78", "rCourseQuality": "3.69", "rWorkRequired": "2.13", "rInstructorAccess": "3.41", "rReadingsValue": "2.84", "rRecommendNonMajor": "3.53", "rCommAbility": "3.82", "rInstructorQuality": "3.78"}, "section": {"name": "LEG ASP ENTREPRENRSHP", "sectionnum": "001", "primary_alias": "LGST-813-001", "path": "/courses/27674/sections/001", "id": "27674-001", "aliases": ["LGST-813-001"]}, "comments": "Legal Studies 813, Legal and Transactional Aspects of Entrepreneurship, is a practical and intensive course that examines the critical legal and transactional issues confronting start-up and emerging growth companies. Although the context of the course is early stage companies, many of the concepts studied are equally applicable to more mature, established companies. The course provides perspective on how to use the law strategically to manage risk, deploy resources and maximize shareholder value. Topics include the enforceability of confidentiality, non-competition and other restrictive covenants in employment agreements; choice of business form including the legal, financial and tax advantages and disadvantages of general partnerships, limited partnerships, corporations and limited liability companies; tax and securities law; legal aspects of raising capital including structuring venture capital and private equity financing; entrepreneurial acquisition structures, employment law, and intellectual property law including trade secrets, copyrights, patents, and trademarks. Format: Lecture and discussion with coverage of legal cases and materials. \r\n\tThis course is an incredibly popular MBA course. Students commented that this class is “the best class they have taken at Wharton!” Another agreed, stating that that he believed this course should be part of the Wharton core. Students felt that the course contained “excellent real-life oriented content” but would have appreciated “a bit more of the investor’s perspective.” \r\n\tProfessor Borghese received positive reviews. Students described Professor Borghese as “great” and “absolutely inspiring.” Many commented that Professor Borghese was pretty accessible to students who sought his advice. Several students went on to praise Professor Borghese’s enthusiasm.\r\n\tThis is an MBA course, and consists of class participation, a midterm, and a final exam.  Students who have taken legal studies courses before may find some overlap. \r\n", "num_students": 60, "path": "/courses/27674/sections/001/reviews/4404-ROBERT-J-BORGHESE", "instructor": {"path": "/instructors/4404-ROBERT-J-BORGHESE", "first_name": "ROBERT J", "last_name": "BORGHESE", "id": "4404-ROBERT-J-BORGHESE", "name": "ROBERT J BORGHESE"}, "num_reviewers": 47, "id": "27674-001-4404-ROBERT-J-BORGHESE"}, {"ratings": {"rAmountLearned": "2.70", "rDifficulty": "2.80", "rStimulateInterest": "2.30", "rRecommendMajor": "2.40", "rCourseQuality": "2.60", "rWorkRequired": "3.50", "rInstructorAccess": "3.10", "rReadingsValue": "2.70", "rRecommendNonMajor": "2.30", "rCommAbility": "3.10", "rInstructorQuality": "2.80"}, "section": {"name": "LEG ASP ENTREPRENRSHP", "sectionnum": "751", "primary_alias": "LGST-813-751", "path": "/courses/27674/sections/751", "id": "27674-751", "aliases": ["LGST-813-751"]}, "comments": "", "num_students": 20, "path": "/courses/27674/sections/751/reviews/5400-MATTHEW-S-ROSSITER", "instructor": {"path": "/instructors/5400-MATTHEW-S-ROSSITER", "first_name": "MATTHEW S", "last_name": "ROSSITER", "id": "5400-MATTHEW-S-ROSSITER", "name": "MATTHEW S ROSSITER"}, "num_reviewers": 10, "id": "27674-751-5400-MATTHEW-S-ROSSITER"}]