[{"ratings": {"rAmountLearned": "3.20", "rDifficulty": "2.67", "rStimulateInterest": "3.57", "rRecommendMajor": "3.48", "rCourseQuality": "3.38", "rWorkRequired": "2.76", "rInstructorAccess": "3.33", "rReadingsValue": "2.85", "rRecommendNonMajor": "3.00", "rCommAbility": "3.57", "rInstructorQuality": "3.75"}, "section": {"name": "MANAGEMENT INFO SYSTEMS", "sectionnum": "001", "primary_alias": "OPIM-210-001", "path": "/courses/27956/sections/001", "id": "27956-001", "aliases": ["OPIM-210-001"]}, "comments": "This course is an introduction to the management of information technology\r\nfocusing on: technology, organization, and strategy. The goal of this course is to equip\r\nstudents with the knowledge and tools to utilize information systems to pursue a firm's\r\nstrategic and organizational goals. There are no prerequisites for the course other than a\r\ngeneral interest in the applications of information technology.\r\nMany students found this class to be “rewarding” and “amazing.” Students\r\nconsidered the course content to be full of “valuable lessons that are applicable in the\r\nlives of everyone”.\r\nGenerally students commented that Professor Clemons was an “entertaining ” and\r\n“passionate” teacher. Many students liked Professor Clemons as he “has a great wealth of\r\npersonal stories, many of which are hilarious, but all of which add context to the course\r\nmaterial.”\r\nSome students complained that “the readings seemed disconnected, and there\r\nwere indeed a little too many cases to analyze.” Students also suggested that “the final\r\nproject had little to do with the course content.” This class is recommended for students\r\nwho are interested in “learning more about business, entrepreneurship, or information\r\neconomics.”", "num_students": 26, "path": "/courses/27956/sections/001/reviews/4075-ERIC-K-CLEMONS", "instructor": {"path": "/instructors/4075-ERIC-K-CLEMONS", "first_name": "ERIC K", "last_name": "CLEMONS", "id": "4075-ERIC-K-CLEMONS", "name": "ERIC K CLEMONS"}, "num_reviewers": 23, "id": "27956-001-4075-ERIC-K-CLEMONS"}]