{"coursehistories": {"path": "/coursehistories/4111"}, "description": "Our perceptions of the bases and content of legal and moral obligation - our owand that of others - are often related to our religious or spiritual outlook. The course will provide a context in which we can explore, individually and collectively, what the contours of that relation are for each of us. It will also consider questions like these: Is such a connection appropriate only as a private matter, not to be brought into the evaluation of questions of public policy or even into conversation about our own life choices, except with one's chosen intimates? Can its importance to our thinking be honored in a manner that honors too the diversity of outlooks that characterizes our society and its commitment to freedom of conscience? What are the implications of religiously-grounded values for our thinking about disputed issues of public policy? What is the difference, if any, between religious and secular sources of values? We will encounter and reflect on the significance of the greatly heightened diversity of religious thinking in our contemporary society; the similarities as well as the differences between religions; the differences as well as the commonalities that exist within a specific religion; and the differences in the way we go about arriving at, and testing, our moral judgments, in personal life and in approaching questions of \n\nThis is not a course on the law of the First Amendment, or the role of courts in religious-freedom cases, although it may affect our understanding of some of the controversies that have arisen there. \n\n", "semester": "2007A", "name": "MLA Proseminar: Religion, Law and Moral Discernment", "reviews": {"path": "/courses/15107/reviews", "values": [{"ratings": {"rAmountLearned": "3.83", "rDifficulty": "1.67", "rStimulateInterest": "3.00", "rRecommendMajor": "3.17", "rCourseQuality": "3.33", "rWorkRequired": "1.67", "rInstructorAccess": "3.33", "rReadingsValue": "3.83", "rRecommendNonMajor": "3.17", "rCommAbility": "3.33", "rInstructorQuality": "3.50"}, "section": {"name": "MLA Proseminar: Religion, Law and Moral Discernment", "sectionnum": "640", "primary_alias": "RELS-414-640", "path": "/courses/15107/sections/640", "id": "15107-640", "aliases": ["RELS-414-640"]}, "comments": "", "num_students": 7, "path": "/courses/15107/sections/640/reviews/4212-HOWARD-LESNICK", "instructor": {"path": "/instructors/4212-HOWARD-LESNICK", "first_name": "HOWARD", "last_name": "LESNICK", "id": "4212-HOWARD-LESNICK", "name": "HOWARD LESNICK"}, "num_reviewers": 6, "id": "15107-640-4212-HOWARD-LESNICK"}]}, "credits": null, "primary_alias": "RELS-414", "path": "/courses/15107", "sections": {"path": "/courses/15107/sections", "values": [{"name": "MLA Proseminar: Religion, Law and Moral Discernment", "sectionnum": "640", "primary_alias": "RELS-414-640", "path": "/courses/15107/sections/640", "id": "15107-640", "aliases": ["RELS-414-640"]}]}, "id": 15107, "aliases": ["RELS-414"]}