[{"ratings": {"rAmountLearned": "2.77", "rDifficulty": "2.37", "rStimulateInterest": "3.19", "rRecommendMajor": "3.35", "rCourseQuality": "2.93", "rWorkRequired": "2.44", "rInstructorAccess": "3.09", "rReadingsValue": "2.91", "rRecommendNonMajor": "2.60", "rCommAbility": "3.16", "rInstructorQuality": "2.76"}, "section": {"name": "ORGANIZATIONAL BEHAVIOR", "sectionnum": "001", "primary_alias": "MGMT-238-001", "path": "/courses/16077/sections/001", "id": "16077-001", "aliases": ["MGMT-238-001"]}, "comments": "This course primarily deals with organizational behavior, that is, the management of individuals in the workplace. The course ranges from examining individuals themselves to the structure of the organization and how this affects its employees. The course focuses on identifying problems in organizational behavior as well as on the leadership and organization needed to address these issues in large firms. Field work, a group project, and a presentation can be expected.\r\n\r\nStudents enjoyed the case study structure of the class as it put a “practical, real-life foundation to a ‘fluffy’ subject.” While enjoying the readings, many students found the grading structure of the class vague and frustrating and thought the final project “didn’t add any value.”\r\n\r\nStudents were very split on Professor Stallings. While one student said Professor Stallings is “extremely biased, plays favorites and is completely unprepared” others thought she was an “outstanding lecturer and did a terrific job engaging the class.” Overall, the main concern was that Professor Stallings was unorganized, though a vast majority appreciated her enthusiasm.\r\n\r\nMany students found the large class size of over 50 students frustrating as it made collecting participation points difficult and thus the participation grade unfair. ", "num_students": 49, "path": "/courses/16077/sections/001/reviews/2552-MONICA-MULLICK-STALLINGS", "instructor": {"path": "/instructors/2552-MONICA-MULLICK-STALLINGS", "first_name": "MONICA MULLICK", "last_name": "STALLINGS", "id": "2552-MONICA-MULLICK-STALLINGS", "name": "MONICA MULLICK STALLINGS"}, "num_reviewers": 48, "id": "16077-001-2552-MONICA-MULLICK-STALLINGS"}]