{"coursehistories": {"path": "/coursehistories/2621"}, "description": "This course focuses on venture capital management issues in the context of a high-growth potential start-up company. The course is motivated by rapid increases in both the supply of and demand for private equity over the past two decades. The topic is addressed from two distinct perspectives: issues that relate to the demand for private equity and venture capital (the entrepreneur's perspective) on the one hand, and issues that relate to the supply of capital (the investor's perspective) on the other. As well, we will address management issues that relate to how the VC and the entrepreneur work together once an investment has been made, compensation issues, and governance issues in the privately held venture capital backed company. \n\nThe course is designed principally to address the interests of students who either expect to embark on an entrepreneurial career, or those who expect to assume a managerial role with a venture-backed start-up company, or students who wish to pursue a career in venture capital. The course will touch upon a range of fields including management, finance, accounting, strategy, and legal- and attempt to identify mainstream \"best practices\" in the area of high growth potential start-ups, with the objective of ensuring that students completing the course will have a solid understanding of the questions and issues that face the typical start-up. \n\n", "semester": "2008C", "name": "VEN CAPITAL & ENT MGMT", "reviews": {"path": "/courses/18981/reviews", "values": [{"ratings": {"rAmountLearned": "3.32", "rDifficulty": "2.44", "rStimulateInterest": "2.88", "rRecommendMajor": "3.28", "rCourseQuality": "3.28", "rWorkRequired": "3.12", "rInstructorAccess": "2.88", "rReadingsValue": "2.60", "rRecommendNonMajor": "2.80", "rCommAbility": "3.20", "rInstructorQuality": "3.08"}, "section": {"name": "VEN CAPITAL & ENT MGMT", "sectionnum": "001", "primary_alias": "MGMT-264-001", "path": "/courses/18981/sections/001", "id": "18981-001", "aliases": ["MGMT-264-001"]}, "comments": "", "num_students": 28, "path": "/courses/18981/sections/001/reviews/2563-RAPHAEL-H-AMIT", "instructor": {"path": "/instructors/2563-RAPHAEL-H-AMIT", "first_name": "RAPHAEL H", "last_name": "AMIT", "id": "2563-RAPHAEL-H-AMIT", "name": "RAPHAEL H AMIT"}, "num_reviewers": 25, "id": "18981-001-2563-RAPHAEL-H-AMIT"}]}, "credits": null, "primary_alias": "MGMT-264", "path": "/courses/18981", "sections": {"path": "/courses/18981/sections", "values": [{"name": "VEN CAPITAL & ENT MGMT", "sectionnum": "001", "primary_alias": "MGMT-264-001", "path": "/courses/18981/sections/001", "id": "18981-001", "aliases": ["MGMT-264-001"]}]}, "id": 18981, "aliases": ["MGMT-264"]}