[{"ratings": {"rAmountLearned": "2.09", "rDifficulty": "2.27", "rStimulateInterest": "2.25", "rRecommendMajor": "3.26", "rCourseQuality": "2.21", "rWorkRequired": "2.51", "rInstructorAccess": "2.80", "rReadingsValue": "2.14", "rRecommendNonMajor": "1.32", "rCommAbility": "2.61", "rInstructorQuality": "2.53"}, "section": {"name": "GEN CHEM LAB I", "sectionnum": "001", "primary_alias": "CHEM-053-001", "path": "/courses/21391/sections/001", "id": "21391-001", "aliases": ["CHEM-053-001"]}, "comments": "This is a general laboratory course covering aspects of qualitative and quantitative analysis, determination of chemical and physical properties, and chemical synthesis.\r\n\r\nStudents felt that the course “complemented CHEM 101 very well” and was “extremely useful.” However, many felt that it was “a bit unorganized and grading was not communicated effectively.” One student explained that “It's good for people who have never worked in a lab before. The concepts are fairly straightforward.” \r\n\r\nProfessor Maeyer received mixed reviews from her students. Some felt that she was hard to reach: “She rarely responded to emails and was always late to office hours.” However, “she was very helpful in answering questions in class” and was described as “wonderful” and “excellent and engaging.” At least one student felt Professor Maeyer “made me think about majoring” in chemistry. She was praised for “walking among us as we performed our experiments in-lab to monitor our progress and let us ask questions.” \r\n\r\nStudents felt that there was “WAY too much work for a half-credit course,” and that material on the lab practicals had not been covered in class. This course is a co-requisite of CHEM 101.\r\n", "num_students": 119, "path": "/courses/21391/sections/001/reviews/4760-JENINE-MAEYER", "instructor": {"path": "/instructors/4760-JENINE-MAEYER", "first_name": "JENINE", "last_name": "MAEYER", "id": "4760-JENINE-MAEYER", "name": "JENINE MAEYER"}, "num_reviewers": 104, "id": "21391-001-4760-JENINE-MAEYER"}]