[{"ratings": {"rAmountLearned": "2.82", "rDifficulty": "2.40", "rStimulateInterest": "1.75", "rRecommendMajor": "3.33", "rCourseQuality": "2.29", "rWorkRequired": "2.66", "rInstructorAccess": "2.25", "rReadingsValue": "1.99", "rRecommendNonMajor": "2.35", "rCommAbility": "1.67", "rInstructorQuality": "1.81"}, "section": {"name": "INTRO TO COMP PROG", "sectionnum": "001", "primary_alias": "CIS-110-001", "path": "/courses/22818/sections/001", "id": "22818-001", "aliases": ["CIS-110-001"]}, "comments": "This course introduces core concepts of computer programming and computing to those with no experience. Concepts and techniques covered include algorithms, objects, state, methods, data types, expressions, testing, debugging, data abstraction, iteration, and basic data structures. Java is used as the modern object-oriented programming language to teach students how to solve real-world problems computationally with an emphasis on data modeling and algorithmic thinking. The course covers fundamentals of object-oriented programming such as objects, classes, state, methods, loops, arrays, inheritance, and recursion using the Java programming language. This course is a general requirement for Computer Science majors. It counts as a Tech Elective or Computer Science Elective for other Engineering students and as a Formal Reasoning course for College students. There are no midterms and finals for the course – there are six tests spread out over the semester. &#8232;&#8232;\r\nStudents seem to have enjoyed the class greatly. They described it to be “demanding, but fair,” “very interesting and well constructed.” Students generally agreed that the course “contains very useful material” and that they “learned a lot,” especially because it was “very hands on.” The course was a “great introduction to programming concepts” and “very helpful and inclusive for a complete beginner.” The basic concepts were “taught in a fun way” and there were “lots of opportunities to practice.” However, a few students felt that it was “hard to follow if you’ve never programmed before and don’t catch on right away.” However, many students commented that even if it was tough at the beginning, it got easier once they “got the hang of it.” Some of them mentioned that they were inspired to “delve deeper into other programming classes” or decide to major or minor in computer science. &#8232;\r\nThe general consensus was that the labs and homework assignments were much more valuable and enjoyable than the lectures. “The labs were highly informative,” said one student, “and allowed practice of concepts learned in class to give a very good practical introduction to computer science.” The lab section, said most students, was “where the true learning happened.” Lecture was “marginally useful for learning basics” and “helpful to see the process of writing code,” but sometimes the students “couldn't really see the connection between the activities in class and what [they] were learning.” Many students felt that lectures were downright useless, although one student explained that this maybe due to “the students' lack of willingness to come prepared to class.” &#8232;\r\nNevertheless, the majority of the students called for more labs to replace lecture. Some even called for “a fully lab-based course.” Several students commented on the “pair programming” policy of the labs; while some found it “extremely beneficial,” others felt that “working individually [would have benefitted them] more.”&#8232;&#8232;\r\nAlthough some students felt that having six tests was “less stressful” than having a midterm and a final, others found the tests “aggravating to the extreme.” They felt that handwriting code in a short span of time was redundant and that “test performance did not really correlate with programming ability.” They also complained about the harsh grading system. “[If you] miss one line of code, [you] get 30 points off.” However, there was a lot of praise for the review sessions held by the TAs and the TAs in general, which were “very helpful and knowledgeable.”&#8232;&#8232;\r\nMost students loved Dr. Griffin as a teacher. They felt she was “enthusiastic,” “understanding,” and “always willing to help;” however, one student felt that she wasn’t “accessible as an instructor.” Almost everyone agreed that she was “very knowledgeable in computer science.” There were various reactions to her teaching methods. Some students praised her demonstrations and attempts to make lectures interactive, while others commented on the “cute” examples she used with contempt. They felt like they were being treated “like five year olds” and felt that a “more serious … environment would be more conducive to learning the material.” Some students also felt it was “intimidating to participate [in her interactive games] in front of the whole class.” &#8232;&#8232;\r\nAlthough most students had numerous complaints about the course, the general consensus appears to be that they more or less enjoyed it and learned a great deal from it. Students mentioned that “a lot of time, thought and preparation went into the course [as obvious] from the homework assignments and lab sessions.” Students learned “an entirely new way of thinking,” and were able to “sharpen their problem solving skills.” The course was highly recommended to everyone regardless of major.\r\n", "num_students": 169, "path": "/courses/22818/sections/001/reviews/1353-JEAN-GRIFFIN", "instructor": {"path": "/instructors/1353-JEAN-GRIFFIN", "first_name": "JEAN", "last_name": "GRIFFIN", "id": "1353-JEAN-GRIFFIN", "name": "JEAN GRIFFIN"}, "num_reviewers": 158, "id": "22818-001-1353-JEAN-GRIFFIN"}]