{"coursehistories": {"path": "/coursehistories/731"}, "description": "This course covers fundamentals of heat and mass transfer and applications to practical problems in energy conversion and conservation. Emphasis will be on developing a physical and analytical understanding of conductive, convective, and radiative heat transfer, as well as design of heat exchangers and heat transfer with phase change. Topics covered will include: types of heat transfer processes, their relative importance, and the interactions between them, solutions of steady state and transient state conduction, emission and absorption of radiation by real surfaces and radiative transfer between surfaces, heat transfer by forced and natural convection owing to flow around bodies and through ducts, analytical solutions for some sample cases and applications of correlations for engineering problems. Students will develop an ability to apply governing principles and physical intuition to solve problems. \n\n", "semester": "2009A", "name": "HEAT/MASS TRANSFER", "reviews": {"path": "/courses/16058/reviews", "values": [{"ratings": {"rAmountLearned": "2.31", "rDifficulty": "3.31", "rStimulateInterest": "1.41", "rRecommendMajor": "2.84", "rCourseQuality": "1.85", "rWorkRequired": "3.56", "rInstructorAccess": "2.78", "rReadingsValue": "2.71", "rRecommendNonMajor": "0.53", "rCommAbility": "1.66", "rInstructorQuality": "1.64"}, "section": {"name": "HEAT/MASS TRANSFER", "sectionnum": "001", "primary_alias": "MEAM-333-001", "path": "/courses/16058/sections/001", "id": "16058-001", "aliases": ["MEAM-333-001"]}, "comments": "This course covers fundamentals of heat and mass transfer and discusses applications to problems in energy conversion and conservation. The course emphasizes a physical and analytical understanding of conductive, convective, radiative heat transfer, the design of heat exchangers, and heat transfer with phase change. Topics covered include types of heat transfer processes, steady state and transient conduction solutions, emission and absorption of radiation, and heat transfer by forced and natural convection.\r\n\r\nStudents described the material covered in the class as “interesting” and applicable to future careers.\r\n\r\nStudents thought Professor Lukes possessed “extensive knowledge” of the subject and made good efforts to ensure understanding of class material. However, many also reported that Professor Lukes relied heavily on powerpoint slides, making her lectures less helpful than recitations.\r\n\r\nSome students felt the material in the class was “rushed,” contributing further to a heavy workload. Many deemed the amount of work to be “way too much” relative to the amount learned, and complained that the exams were “ridiculously hard.”", "num_students": 33, "path": "/courses/16058/sections/001/reviews/1891-JENNIFER-R--LUKES", "instructor": {"path": "/instructors/1891-JENNIFER-R--LUKES", "first_name": "JENNIFER R.", "last_name": "LUKES", "id": "1891-JENNIFER-R--LUKES", "name": "JENNIFER R. LUKES"}, "num_reviewers": 33, "id": "16058-001-1891-JENNIFER-R--LUKES"}]}, "credits": null, "primary_alias": "MEAM-333", "path": "/courses/16058", "sections": {"path": "/courses/16058/sections", "values": [{"name": "HEAT/MASS TRANSFER", "sectionnum": "001", "primary_alias": "MEAM-333-001", "path": "/courses/16058/sections/001", "id": "16058-001", "aliases": ["MEAM-333-001"]}]}, "id": 16058, "aliases": ["MEAM-333"]}