[{"ratings": {"rAmountLearned": "2.52", "rDifficulty": "2.74", "rStimulateInterest": "2.79", "rRecommendMajor": "3.11", "rCourseQuality": "2.43", "rWorkRequired": "1.92", "rInstructorAccess": "2.34", "rReadingsValue": "1.79", "rRecommendNonMajor": "2.13", "rCommAbility": "2.28", "rInstructorQuality": "2.63"}, "section": {"name": "BEHAVIORAL ECON & PSYCH", "sectionnum": "401", "primary_alias": "PPE-203-401", "path": "/courses/26643/sections/401", "id": "26643-401", "aliases": ["PPE-203-401", "PSYC-165-401"]}, "comments": "This course applies psychological research to economic theory, investigating what happens when agents have human limitations and complications. The effects of limited cognitive capacities, willpower, and self-interest will be considered.\r\n\r\nMost students agreed that the course was challenging but found the information “fascinating” and very applicable to real life situations.\r\n\r\nStudents varied in their opinions of Professor Dana. Some lauded him for his humor, but others found his sarcasm “controversial” and “patronizing.” Some complained that Professor Dana read from his slides too often while others appreciated that the theories were straight-forward. Students were also split on his teaching style, either describing Professor Dana as “funny” and “engaging” or as \"uninteresting.\"\r\n\r\nThis course is a required course for PPE majors, and ECON 001 is a prerequisite. Students mostly agreed that the course was “challenging” and that there was some “disconnect between the class lectures and the exams” since the class focused on theory while the exams focused on numerical calculations.  The course work consisted of “three problem sets and three midterms” with minimal additional readings. Most students found Professor Dana to be a “fair” grader and that it was not too difficult to do well once the course-curve was applied. Students commented that PPE majors should \"not be afraid\" of this course.", "num_students": 212, "path": "/courses/26643/sections/401/reviews/4078-JASON-D--DANA", "instructor": {"path": "/instructors/4078-JASON-D--DANA", "first_name": "JASON D.", "last_name": "DANA", "id": "4078-JASON-D--DANA", "name": "JASON D. DANA"}, "num_reviewers": 191, "id": "26643-401-4078-JASON-D--DANA"}]