{"coursehistories": {"path": "/coursehistories/4566"}, "description": "The use of distributed wireless sensor networks has surged in popularity in recent years with applications ranging from environmental monitoring, to people- and object-tracking in both cooperative and hostile environments. This course is targeted at understanding and obtaining hands-on experience with the state-of-the-art in such wireless sensor networks which are often composed using relatively inexpensive sensor nodes that have low power consumption, low processing power and bandwidth. The course will span a variety of topics ranging from radio communications, network stack, systems infrastructure including QoS support and energy management, programming paradigms, distributed algorithms and example applications. Some guest lectures may be given. \n\n", "semester": "2010C", "name": "REAL TIME EMBEDDED SYS", "reviews": {"path": "/courses/23044/reviews", "values": [{"ratings": {"rAmountLearned": "2.85", "rDifficulty": "3.00", "rStimulateInterest": "2.85", "rRecommendMajor": "3.35", "rCourseQuality": "2.80", "rWorkRequired": "3.55", "rInstructorAccess": "3.00", "rReadingsValue": "2.70", "rRecommendNonMajor": "1.75", "rCommAbility": "2.80", "rInstructorQuality": "2.80"}, "section": {"name": "REAL TIME EMBEDDED SYS", "sectionnum": "001", "primary_alias": "ESE-519-001", "path": "/courses/23044/sections/001", "id": "23044-001", "aliases": ["ESE-519-001"]}, "comments": "ESE 519 focuses on understanding and obtaining hands-on experience with the state-of-the-art in such wireless sensor networks which are often composed using relatively inexpensive sensor nodes that have low power consumption, low processing power and bandwidth. The primary objectives of this course are to obtain a broad understanding of the technologies and applications for the emerging and exciting domain of real-time systems and embedded wireless networks, get in-depth hands-on experience in designing and developing a real operational embedded network system, and design and develop foundational systems software, sensor-actuator-controller algorithms and network protocols. The class is graded based on homework assignments, an exam, and a final project. \r\n\r\nMost students found that the course was “disorganized,” but that it still managed to be “very good” and even “fun.” Students seemed to agree that it was “overall a great course with great course content,” though it did have its problems.\r\n\r\nStudents generally found it frustrating that Professor Mangharam provided little feedback on submitted work throughout the semester. Many were also upset at the fact that Professor Mangharam seemed to give too little notice when assignments would be due, which resulted in the students having to put a lot of hours into homework over a short period of time. Some students reported that the “lecture is interesting but [attendance is] not needed to do well.”\r\n\r\nMost students found that the course did “involve a lot of time and effort on a weekly basis,” but that it was manageable and could be expected from such a higher-level course. It was “purely a project-based class” that students generally found to be “a ton of work, but a fun class.”\r\n", "num_students": 23, "path": "/courses/23044/sections/001/reviews/4798-RAHUL-MANGHARAM", "instructor": {"path": "/instructors/4798-RAHUL-MANGHARAM", "first_name": "RAHUL", "last_name": "MANGHARAM", "id": "4798-RAHUL-MANGHARAM", "name": "RAHUL MANGHARAM"}, "num_reviewers": 20, "id": "23044-001-4798-RAHUL-MANGHARAM"}]}, "credits": null, "primary_alias": "ESE-519", "path": "/courses/23044", "sections": {"path": "/courses/23044/sections", "values": [{"name": "REAL TIME EMBEDDED SYS", "sectionnum": "001", "primary_alias": "ESE-519-001", "path": "/courses/23044/sections/001", "id": "23044-001", "aliases": ["ESE-519-001"]}]}, "id": 23044, "aliases": ["ESE-519"]}