[{"ratings": {"rAmountLearned": "2.65", "rDifficulty": "1.90", "rStimulateInterest": "2.54", "rRecommendMajor": "3.71", "rCourseQuality": "2.76", "rWorkRequired": "2.10", "rInstructorAccess": "3.24", "rReadingsValue": "2.51", "rRecommendNonMajor": "2.71", "rCommAbility": "2.98", "rInstructorQuality": "2.90"}, "section": {"name": "WORLD FILM HIST TO 1945", "sectionnum": "401", "primary_alias": "ENGL-091-401", "path": "/courses/22966/sections/401", "id": "22966-401", "aliases": ["ENGL-091-401", "ARTH-108-401", "CINE-101-401"]}, "comments": "World Film history to 1945 surveys the history of world film from cinema’s precursors to 1945. It develops methods for analyzing film while examining the growth of film as an art, an industry, and a political instrument, beginning with the emergence of film technology and early film audiences. Students then explore the rise of narrative film and the birth of Hollywood before turning to a number of national film industries that flourished after World War I, including French, Italian, Soviet, German, Japanese, Chinese, and Indian film. Along the way, the class looks at different genres and topics including African-American independent film during the silent era, animation, ethnographic and documentary film, censorship, and the coming of sound. The course also covers the transformation of several film industries into propaganda tools during World War II (including the Nazi, Soviet, and US film industries). &#8232;&#8232;\r\n\r\nStudents generally consider this course “excellent” and a “great class overall.” While some felt it was “difficult to get invested in the subject matter,” others believed that “the subject matter was very interesting.” A few students expressed a desire for “more required film viewings,” but others anticipate taking future Cinema classes due to their experiences in this one. &#8232;&#8232;\r\n\r\nProfessor Decherney did an “excellent job of making the material interesting and explaining how early cinema differs (and why) from modern cinema.” Some students observed that he “spoke too fast and didn't speak loudly or clearly enough.” He periodically “gave the impression of not being very prepared, constantly consulting notes instead of just talking to the class.” Professor Decherney’s incorporation of “clips, guest speakers, powerpoints, and class discussion [made] the film history course very rewarding.” Students generally felt he was “approachable and engaging.” &#8232;&#8232;\r\n\r\nThis class fulfills Sector 2: Language, Literature and Culture and Sector 6: 20th Century Literature of the English Standard Major as well as the Arts and Letter Sector. There are no prerequisites. Course requirements include a short essay, a research project, a midterm, and a final.\r\n", "num_students": 73, "path": "/courses/22966/sections/401/reviews/2467-PETER-DECHERNEY", "instructor": {"path": "/instructors/2467-PETER-DECHERNEY", "first_name": "PETER", "last_name": "DECHERNEY", "id": "2467-PETER-DECHERNEY", "name": "PETER DECHERNEY"}, "num_reviewers": 69, "id": "22966-401-2467-PETER-DECHERNEY"}]