{"coursehistories": {"path": "/coursehistories/2379"}, "description": "Kant was a thinker who formed his own views in conscious opposition to his foremost predecessors, and Leibniz and Hume were among his central targets, often at the same time: for example, Kant's defense of the necessity of causality for our experience should be understood as a response to Leibniz as well as to Hume. We will focus on causality as well as a number of other issues where Kant responded to both philosophers, including his distinction between analytic and synthetic judgments, the distinction between intuition and concepts, his theory of space and time, and his treatment of theology and teleology. Readings will be drawn from the Critique of Pure Reason and the Critique of the Power of Judgment as well as texts such as the Eberhard controversy and the draft What Real Progress has Metaphysics made in Germany from the Times of Leibniz and Wolff, and from texts of Leibniz and Hume known to Kant: in the case of Leibniz, texts such as the Principles of Naure and Grace, the Monadology, the Leibniz-Clarke Correspondence, and (extracts from) the Theodicy and New Essays concerning Human Understanding; in the case of Hume, our primary texts will be the Enquiry concerning Human Understanding and the Dialogues concerning Natural Religion. \n\nThe course will be run as a seminar, with student presentations. Grades will be based on classroom participation and a term paper. Some prior experience with the history of modern philosophy will be expected, but background material will be available for students who have not previously taken a course on the Critique of Pure Reason. \n\n", "semester": "2011A", "name": "TOPICS EARLY MODERN PHIL: Kant's Response to Leibniz & Hume", "reviews": {"path": "/courses/22281/reviews", "values": [{"ratings": {"rAmountLearned": "3.80", "rDifficulty": "3.60", "rStimulateInterest": "3.00", "rRecommendMajor": "3.60", "rCourseQuality": "3.67", "rWorkRequired": "3.40", "rInstructorAccess": "3.60", "rReadingsValue": "3.80", "rRecommendNonMajor": "1.40", "rCommAbility": "3.60", "rInstructorQuality": "3.67"}, "section": {"name": "TOPICS EARLY MODERN PHIL: Kant's Response to Leibniz & Hume", "sectionnum": "401", "primary_alias": "PHIL-551-401", "path": "/courses/22281/sections/401", "id": "22281-401", "aliases": ["PHIL-551-401", "GRMN-560-401"]}, "comments": "", "num_students": 8, "path": "/courses/22281/sections/401/reviews/1670-PAUL-D-GUYER", "instructor": {"path": "/instructors/1670-PAUL-D-GUYER", "first_name": "PAUL D", "last_name": "GUYER", "id": "1670-PAUL-D-GUYER", "name": "PAUL D GUYER"}, "num_reviewers": 6, "id": "22281-401-1670-PAUL-D-GUYER"}]}, "credits": null, "primary_alias": "PHIL-551", "path": "/courses/22281", "sections": {"path": "/courses/22281/sections", "values": [{"name": "TOPICS EARLY MODERN PHIL: Kant's Response to Leibniz & Hume", "sectionnum": "401", "primary_alias": "PHIL-551-401", "path": "/courses/22281/sections/401", "id": "22281-401", "aliases": ["PHIL-551-401", "GRMN-560-401"]}]}, "id": 22281, "aliases": ["PHIL-551", "GRMN-560"]}