[{"ratings": {"rAmountLearned": "2.97", "rDifficulty": "1.76", "rStimulateInterest": "2.66", "rRecommendMajor": "3.10", "rCourseQuality": "2.76", "rWorkRequired": "1.93", "rInstructorAccess": "2.76", "rReadingsValue": "2.21", "rRecommendNonMajor": "2.38", "rCommAbility": "2.97", "rInstructorQuality": "2.90"}, "section": {"name": "INTR COMPLE & ALTERN MED: Complementary & Alternative Medicine, An Introduction", "sectionnum": "601", "primary_alias": "HSOC-259-601", "path": "/courses/15929/sections/601", "id": "15929-601", "aliases": ["HSOC-259-601", "STSC-259-601"]}, "comments": "This course introduces the study of complementary and alternative medicine (CAM) and common modalities and systems used in the US. The class covers topics such as the social context of health, the emergence of integrative medicine, ethnicity and ethnomedicine, spirituality and health, and belief systems.\r\nOverwhelmingly students liked this “excellent” class. Saying that it “changed my preconceived notions on health.” Students appreciate that the class balanced lecture with discussion and found the subject of alternative medicine “extremely” interesting. “Even if you have taken related courses on the subject, you are bound to discover something new,” said one student. Another added that “it would serve a lot of pre-meds well to get an overview of CAM therapies that exist.”\r\nProfessor Mackenzie is described as “passionate” and “extremely knowledgeable.” The tone set by Professor Mackenzie is relaxed and comfortable, encouraging students to express their opinions. One student complimented her on her “ability to explain esoteric concepts in accessible terms,” but another felt that “she did not answer questions with relevant answers...and relied too much on videos to teach the class.”\r\nThis class provides a “nice crash course/into to a broad subject” of alternative medicine. Many premed students took the course in the past and found the class to be useful for those interested in a medical profession. Readings are said to be a bit repetitive and are not assigned far enough in advance. The term paper and class participation make up the majority of a student’s grade.", "num_students": 33, "path": "/courses/15929/sections/601/reviews/1440-ELIZABETH-R--MACKENZIE", "instructor": {"path": "/instructors/1440-ELIZABETH-R--MACKENZIE", "first_name": "ELIZABETH R.", "last_name": "MACKENZIE", "id": "1440-ELIZABETH-R--MACKENZIE", "name": "ELIZABETH R. MACKENZIE"}, "num_reviewers": 29, "id": "15929-601-1440-ELIZABETH-R--MACKENZIE"}]