{"coursehistories": {"path": "/coursehistories/1131"}, "description": "This course offers an introduction to, and an overview of, many of the key issues confronting urban public schools in America. Conversations about schooling, and urban schooling in particular, are currently at the forefront of public discussions about how to improve the economy and the nation as a whole. In this course we will examine the historical, social, and cultural contexts of urban education and schooling in society. Beginning with philosophical and theoretical perspectives on why we educate, this course will also explore the ways in which schools are implicated in a range of social issues and we will interrogate the role of education in relation to social mobility, life changes, and civic opportunity. This course will also critically examine recent policies and reform efforts which have been designed to remedy the urban public school \"crisis.\" In addition to readings and class discussions, popular media (e.g. news reports, and films and documentaries on urban schools) will also be used to provide students with an opportunity to explore these larger course themes and issues, particularly as they relate to public schools in Philadelphia. \n\n", "semester": "2009A", "name": "URBAN EDUCATION", "reviews": {"path": "/courses/16546/reviews", "values": [{"ratings": {"rAmountLearned": "3.27", "rDifficulty": "2.47", "rStimulateInterest": "3.00", "rRecommendMajor": "3.53", "rCourseQuality": "3.00", "rWorkRequired": "2.73", "rInstructorAccess": "2.73", "rReadingsValue": "3.29", "rRecommendNonMajor": "2.67", "rCommAbility": "2.93", "rInstructorQuality": "3.00"}, "section": {"name": "URBAN EDUCATION", "sectionnum": "401", "primary_alias": "URBS-202-401", "path": "/courses/16546/sections/401", "id": "16546-401", "aliases": ["URBS-202-401", "EDUC-202-401"]}, "comments": "Professor Wolfson’s class was thought to be very “philosophy based,” focusing mostly on “theoretical issues.” Much of the class was based upon weekly responses, student presentations, and class participation in discussions on nine assigned texts. One student found the reading material to contain the “same messages” and the weekly blog posts to be “somewhat redundant.\" Students generally seemed to think class discussions could have used more “structure” and “instructor input.” While one student thought the discussions “often seemed rushed and forced,” most others tended to “enjoy” how they could “openly debate issues surrounding public education.”\r\n\r\nStudents appreciated Professor Wolfson’s “insight” in linking the “theoretical readings to tangible social problems” and his “willingness to engage the opinion of each individual student.”&#8232;&#8232;\r\n\r\nAs an introduction course, this class was “highly” recommended to those looking for a “comprehensive overview of educational disparities across lines of race and class.” For some, this course was “very different” from what was expected, but it certainly had its “high points.” This course is cross-listed with EDUC 202 and fulfills the Cultural Diversity in the US college requirement. It is also an academically based community service course. ", "num_students": 17, "path": "/courses/16546/sections/401/reviews/1974-TODD-A--WOLFSON", "instructor": {"path": "/instructors/1974-TODD-A--WOLFSON", "first_name": "TODD A.", "last_name": "WOLFSON", "id": "1974-TODD-A--WOLFSON", "name": "TODD A. WOLFSON"}, "num_reviewers": 16, "id": "16546-401-1974-TODD-A--WOLFSON"}]}, "credits": null, "primary_alias": "URBS-202", "path": "/courses/16546", "sections": {"path": "/courses/16546/sections", "values": [{"name": "URBAN EDUCATION", "sectionnum": "401", "primary_alias": "URBS-202-401", "path": "/courses/16546/sections/401", "id": "16546-401", "aliases": ["URBS-202-401", "EDUC-202-401"]}]}, "id": 16546, "aliases": ["URBS-202", "EDUC-202"]}