[{"ratings": {"rAmountLearned": "2.37", "rDifficulty": "3.15", "rStimulateInterest": "2.06", "rRecommendMajor": "3.15", "rCourseQuality": "1.96", "rWorkRequired": "3.15", "rInstructorAccess": "2.79", "rReadingsValue": "2.06", "rRecommendNonMajor": "0.54", "rCommAbility": "1.72", "rInstructorQuality": "2.09"}, "section": {"name": "FLUID MECHANICS", "sectionnum": "001", "primary_alias": "MEAM-302-001", "path": "/courses/23387/sections/001", "id": "23387-001", "aliases": ["MEAM-302-001"]}, "comments": "The topics covered in this course include: Physical properties; fluid statics; Bernoulli equation; fluid kinematics; conservation laws and finite control-volume analysis; conservation laws and differential analysis; inviscid flow; The Navier-Stokes equation and some exact solutions; similitude, dimensional analysis, and modeling; flow in pipes and channels; boundary layer theory; lift and drag. \r\n\r\nStudents generally felt that the “homework had nothing to do with class” and that it was “weighted too heavily.” The textbook was described as being “too vague” and students said that “it would be helpful if there were more sample problems.” A few students said that the course, at times, “lacked mathematical rigor.” \r\n\r\nThere were mixed reviews for Professor Arratia. Some students said they loved him, and that his course was “interesting and well instructed.” Others said that he was sometimes “unable to admit his mistakes.” Some students felt that Professor Arratia did “not communicate course concepts well” and that some topics on the homework “were never covered.” However, many felt that he was very dedicated and that he really wanted to “make sure that everyone was doing well.” Additionally, he was described as being “very accessible.” \r\n\r\nOverall, students said that the course was “decent.” Some stated that “the final exam was fair.” One complaint was that the “quizzes were weighted too heavily when compared to the homework.” This course was recommended for majors only.\r\n", "num_students": 60, "path": "/courses/23387/sections/001/reviews/4018-PAULO-E--ARRATIA", "instructor": {"path": "/instructors/4018-PAULO-E--ARRATIA", "first_name": "PAULO E.", "last_name": "ARRATIA", "id": "4018-PAULO-E--ARRATIA", "name": "PAULO E. ARRATIA"}, "num_reviewers": 55, "id": "23387-001-4018-PAULO-E--ARRATIA"}]