[{"ratings": {"rAmountLearned": "2.12", "rDifficulty": "2.31", "rStimulateInterest": "1.98", "rRecommendMajor": "2.62", "rCourseQuality": "2.03", "rWorkRequired": "2.31", "rInstructorAccess": "2.44", "rReadingsValue": "2.06", "rRecommendNonMajor": "2.14", "rCommAbility": "2.30", "rInstructorQuality": "2.39"}, "section": {"name": "DATABASE & INFO SYSTEMS", "sectionnum": "001", "primary_alias": "CIS-550-001", "path": "/courses/22842/sections/001", "id": "22842-001", "aliases": ["CIS-550-001"]}, "comments": "CIS 550 provides an introduction to the theory and practice of database management systems. This class provides an introduction to the field, providing a foundation in the theory of relational and XML data design and the basics of query languages, two-tier architectures, schema mediation, database tuning, and database systems design. The class uses Database Management Systems by Ramarkrishnan and Gehrke, and there are a number of other suggested textbooks and online documents. Class grades are based on homework, midterms, a final exam, and a final project.\r\n\r\nMost students “appreciated the course very much” and found it to be “well-structured.” However, some students found that the course was too large and felt that it would have been better in a smaller setting. Many students found that the final project of the course required too much knowledge of material not covered in the course.\r\n\r\nProfessor Tannen’s being “constantly late for class” bothered many students. Many students found his lectures to be “difficult to follow” and “often moving too fast.” However, others reported that he was a “good professor.” While some found it difficult to learn from the PowerPoint’s used in lectures, those students reported, “Some of the best lectures were the days when the computers were malfunctioning and Professor Tannen lectured from the blackboard.”\r\n\r\nThis is a graduate level course that can be taken by undergraduates with permission by the department. Students generally found the workload to be manageable excluding the final project, which required a lot of outside knowledge and lacked clear instructions.\r\n", "num_students": 85, "path": "/courses/22842/sections/001/reviews/297-VAL-BREAZU-TANNEN", "instructor": {"path": "/instructors/297-VAL-BREAZU-TANNEN", "first_name": "VAL BREAZU", "last_name": "TANNEN", "id": "297-VAL-BREAZU-TANNEN", "name": "VAL BREAZU TANNEN"}, "num_reviewers": 71, "id": "22842-001-297-VAL-BREAZU-TANNEN"}]