{"coursehistories": {"path": "/coursehistories/4192"}, "description": "How do you optimally encode a text file? How do you find shortest paths in a map? How do you desgin a communication network? How do you route data in a network? What are the limits of efficient computation? This course gives a comprehensive introduction to design and analysis of algorithms, and answers along the way to these and many other interesting computational questions. You will learn about problem-solving; advanced data structures such as universal hashing and red-black trees; advanced design and analysis techniques such as dynamic programming and amortized analysis; graph algorithms such as minimum spanning trees and network flos; NP-completeness theory; and approximation algorithms. \n\n", "semester": "2010A", "name": "INTRO TO ALGORITHMS", "reviews": {"path": "/courses/25801/reviews", "values": [{"ratings": {"rAmountLearned": "3.29", "rDifficulty": "3.68", "rStimulateInterest": "3.11", "rRecommendMajor": "3.67", "rCourseQuality": "3.09", "rWorkRequired": "3.13", "rInstructorAccess": "3.21", "rReadingsValue": "2.77", "rRecommendNonMajor": "1.29", "rCommAbility": "3.24", "rInstructorQuality": "3.43"}, "section": {"name": "INTRO TO ALGORITHMS", "sectionnum": "001", "primary_alias": "CIS-320-001", "path": "/courses/25801/sections/001", "id": "25801-001", "aliases": ["CIS-320-001"]}, "comments": "This course introduces the design and analysis of algorithms, focusing on problem solving, advanced data structures, advanced design and analysis techniques, graph algorithms, NP-completeness theory, and approximation algorithms.\r\n\r\nStudents overwhelmingly enjoyed the material in this class, calling it “informative” and “super interesting.” They appreciated the highly conceptual and logical basis for all of the knowledge from this class.\r\n\r\nSimilarly, students unanimously praised Professor Khanna, noting his “excellent” explanations of “difficult concepts or examples,” his wonderful “sense of humor,” and his generally “engaging lectures.” A few students suggested that proceeding in lectures a little more slowly or posting lectures notes could greatly enhance the amount of material understood; however, most found the pace satisfactory and ideal for maintaining interest.\r\n\r\nStudents judged this class to be extremely difficult, recommending it only to those who are “interested in the subject material and not afraid of a challenge.” Though the work was time-consuming, students concluded that it consistently “stimulated thought” and resulted in a worthwhile understanding of important topics. ", "num_students": 98, "path": "/courses/25801/sections/001/reviews/305-SANJEEV-KHANNA", "instructor": {"path": "/instructors/305-SANJEEV-KHANNA", "first_name": "SANJEEV", "last_name": "KHANNA", "id": "305-SANJEEV-KHANNA", "name": "SANJEEV KHANNA"}, "num_reviewers": 97, "id": "25801-001-305-SANJEEV-KHANNA"}]}, "credits": null, "primary_alias": "CIS-320", "path": "/courses/25801", "sections": {"path": "/courses/25801/sections", "values": [{"name": "INTRO TO ALGORITHMS", "sectionnum": "001", "primary_alias": "CIS-320-001", "path": "/courses/25801/sections/001", "id": "25801-001", "aliases": ["CIS-320-001"]}]}, "id": 25801, "aliases": ["CIS-320"]}