{"coursehistories": {"path": "/coursehistories/925"}, "description": "This course will provide an overview of major figures and themes of modern political thought. We will focus on themes and questions pertinent to political theory in the modern era, particularly focusing on the relationship of the individual to community, society, and state. Although the emergence of the individual as a central moral, political, and conceptual category arguably began in earlier eras, it is in the seventeenth century that it takes firm hold in defining the state, political institutions, moral thinking, and social relations. The centrality of \"the individual\" has created difficulties, even paradoxes, for community and social relations, and political theorists have struggled to reconicle those throughout the modern era. We will consider the political forms that emerged out of those struggles, as well as the changed and distinctly \"modern\" conceptualizations of political theory such as freedom, responsibilty, justice, rights and obligations, as central categories for organizing moral and political life. \n\n", "semester": "2011A", "name": "MODERN POLITICAL THOUGHT", "reviews": {"path": "/courses/22323/reviews", "values": [{"ratings": {"rAmountLearned": "2.49", "rDifficulty": "2.77", "rStimulateInterest": "2.29", "rRecommendMajor": "2.89", "rCourseQuality": "2.34", "rWorkRequired": "2.74", "rInstructorAccess": "2.53", "rReadingsValue": "2.80", "rRecommendNonMajor": "1.74", "rCommAbility": "2.76", "rInstructorQuality": "2.60"}, "section": {"name": "MODERN POLITICAL THOUGHT", "sectionnum": "001", "primary_alias": "PSCI-181-001", "path": "/courses/22323/sections/001", "id": "22323-001", "aliases": ["PSCI-181-001"]}, "comments": "&#8232;&#8232;This course provides an overview of major figures and themes of modern political thought. It focuses on themes and questions pertinent to political theory in the modern era, particularly focusing on the relationship of the individual to community, society, and state. Although the emergence of the individual as a central moral, political, and conceptual category arguably began in earlier eras, it is in the seventeenth century that it takes firm hold in defining the state, political institutions, moral thinking, and social relations. The centrality of \"the individual\" has created difficulties, even paradoxes, for community and social relations, and political theorists have struggled to reconcile those throughout the modern era. This course considers the political forms that emerged out of those struggles, as well as the changed and distinctly \"modern\" conceptualizations of political theory such as freedom, responsibility, justice, rights and obligations, as central categories for organizing moral and political life.&#8232;&#8232;Students found the course to be difficult, especially due to the confusing readings. Students did find that the course opened up their minds to think about complex ideas in new ways, thus improving their critical thinking skills. Due to the lack of visual aids in lecture and the unfocused prompts for class writing, many students said they would have liked to see more structure within the course. &#8232;&#8232;Professor Hirschmann has an obvious enthusiasm for the subject and for her students. She is very accessible by appointment or by email and is always willing to discuss something that a student does not understand. She was able to stimulate interest in lecture, even when the material got flat. &#8232;&#8232;The majority of students liked this course, but many said that it was difficult to know what material was the most relevant for tests and papers. Professor Hirschmann allows students to take home exams but the grading is tough. Students generally would recommend this course, but only to a major or someone highly interested in this field.", "num_students": 115, "path": "/courses/22323/sections/001/reviews/1678-NANCY-J--HIRSCHMANN", "instructor": {"path": "/instructors/1678-NANCY-J--HIRSCHMANN", "first_name": "NANCY J.", "last_name": "HIRSCHMANN", "id": "1678-NANCY-J--HIRSCHMANN", "name": "NANCY J. HIRSCHMANN"}, "num_reviewers": 103, "id": "22323-001-1678-NANCY-J--HIRSCHMANN"}]}, "credits": null, "primary_alias": "PSCI-181", "path": "/courses/22323", "sections": {"path": "/courses/22323/sections", "values": [{"name": "MODERN POLITICAL THOUGHT", "sectionnum": "001", "primary_alias": "PSCI-181-001", "path": "/courses/22323/sections/001", "id": "22323-001", "aliases": ["PSCI-181-001"]}]}, "id": 22323, "aliases": ["PSCI-181"]}