[{"ratings": {"rAmountLearned": "2.79", "rDifficulty": "2.46", "rStimulateInterest": "3.05", "rRecommendMajor": "3.53", "rCourseQuality": "2.96", "rWorkRequired": "2.18", "rInstructorAccess": "3.00", "rReadingsValue": "2.66", "rRecommendNonMajor": "2.34", "rCommAbility": "3.16", "rInstructorQuality": "3.32"}, "section": {"name": "FNCE OF BUYOUTS & ACQS", "sectionnum": "001", "primary_alias": "FNCE-251-001", "path": "/courses/23095/sections/001", "id": "23095-001", "aliases": ["FNCE-251-001"]}, "comments": "The focus of this course is on buying (or acquiring controlling stakes in) firms. The main topics to be covered are mergers and friendly acquisitions, hostile takeovers and buyouts. Using case studies, the course surveys the drivers of success in the transactions. While issues regarding motive and strategy will be discussed, financial theory would be the main lens used to view these control-acquiring transactions. The objective is two-fold: (1) Develop a concept and translate that idea into a proposal through deal design; and (2) analyze to form opinions about proposed deals. The course should be of interest to students interested in pursuing careers as private equity investors, advisors in investment banking and corporate managers that deal with these issues. \r\n\r\nStudents described this course as “a good wrap-up for those with lots of finance experience already.” One wrote that “as a finance concentrator, I'm really happy to have taken this class because I feel that it has solidified what I've learned in the last few years.” Most students appreciated the material’s real-world applications, but one student criticized the focus on less relevant issues like “auction theory and soft factors.” \r\n\r\nProfessor Yilmaz was described as an effective and engaging instructor, although several reviewers suggested that there was too much emphasis on group work over individual assignments. This review is based on the seven student comments that were submitted. \r\n", "num_students": 58, "path": "/courses/23095/sections/001/reviews/2138-BILGE-YILMAZ", "instructor": {"path": "/instructors/2138-BILGE-YILMAZ", "first_name": "BILGE", "last_name": "YILMAZ", "id": "2138-BILGE-YILMAZ", "name": "BILGE YILMAZ"}, "num_reviewers": 55, "id": "23095-001-2138-BILGE-YILMAZ"}]