[{"ratings": {"rAmountLearned": "2.83", "rDifficulty": "2.58", "rStimulateInterest": "3.04", "rRecommendMajor": "3.33", "rCourseQuality": "3.00", "rWorkRequired": "2.83", "rInstructorAccess": "3.78", "rReadingsValue": "2.78", "rRecommendNonMajor": "2.54", "rCommAbility": "3.17", "rInstructorQuality": "3.26"}, "section": {"name": "TOPICS IN LIT. & SOCIETY", "sectionnum": "001", "primary_alias": "ENGL-105-001", "path": "/courses/22970/sections/001", "id": "22970-001", "aliases": ["ENGL-105-001"]}, "comments": "\r\nThis seminar delves into the rich tradition of empirical literature – literary works that incorporated the theories and methods of contemporary science – that explores the “weird science” of how humans work and how nature functions.  These experiments in literature produced a wildly exotic mix of fiction and poetry, from Poe’s thrilling accounts of the edge of the known world, to modern classics like Woolf’s To the Lighthouse.  Along the way, these writers interrogated the role of fiction and language in the practice of science, and the relationship between objectivity, interrogation, and introspection.  Using a variety of perspectives, from Romantic theories of sensation, to nineteenth-century theories of mind, to theoretical physics, this course examines how literature can model formal experimentation.  In addition to the weekly seminars, the class involves several brief essays.&#8232;&#8232;\r\n\r\nStudents described this course as “really interesting” and one worth taking at Penn. &#8232;&#8232;\r\n\r\nStudents found Professor Griffiths to be “enthusiastic,” “competent,” and “engaging” in lecture, and “very approachable” at any time outside of class. Majors and non-majors alike felt that he was able to stimulate class interest. Though students found him “brilliant” and “insightful,” some felt that “it was difficult for him to relay the subject matter in an understandable way” during lecture. Nevertheless, he had a good connection with students; one student commented, “I heart Devin Griffiths [...] He is the man.”&#8232;\r\n\r\n&#8232;Although students praised Professor Griffiths, most had issues with the class structure. Most students felt that there were too many readings, which meant that few could be covered in depth and that class discussion sometimes “felt scattered and disorganized.” Students had split opinions about the weekly response papers and quizzes. Some felt that they were good for keeping “up-to-date” with the readings, but others felt that they “did not necessarily asses whether one had read or not.” One student complained that they “never received one writing assignment back all semester,” which made it difficult to figure out where they stood in the semester. Overall, students tended to agree that the workload was heavy, but “never overwhelming.”\r\n", "num_students": 30, "path": "/courses/22970/sections/001/reviews/5343-DEVIN-S-GRIFFITHS", "instructor": {"path": "/instructors/5343-DEVIN-S-GRIFFITHS", "first_name": "DEVIN S", "last_name": "GRIFFITHS", "id": "5343-DEVIN-S-GRIFFITHS", "name": "DEVIN S GRIFFITHS"}, "num_reviewers": 28, "id": "22970-001-5343-DEVIN-S-GRIFFITHS"}]