{"coursehistories": {"path": "/coursehistories/1505"}, "description": "This course opens and closes with two important contemporary novels: Umberto Eco's The Name of the Rose and Milorad Pavic's Dictionary of the Khazars. Both are \"novels of ideas\" set in the middle ages; both feature monks, mayhem, and a book that kills those who come too close. But while Eco's novel has the dubious honor of a Hollywood adaptation, Pavic's has been the inspiration for cutting-edge performance, music, and multimedia. What do these books and their adaptations tell us about present-day habits of reading and managing information in the West and East? And why do both books kill not only their compilers and readers, but \"kill time,\" turning back the clock to the middle ages? \n\nWe will explore the possibility that many qualities of \"new media\" were already present in medieval texts, and that medievals may have conceptualized reading in ways that now seem closer to the postmodern. We will seek the origins of \"bookish\" and \"hypertextual\" styles of reading, currently struggling for dominance, in the middle ages and even before. We will watch film and video, read 20th- and 21st-century novels and stories on paper and on CD-ROM, and get our hands dirty with the information-managing practices of the middle ages to better understand those of our own age. \n\nEvaluation is based on discussion, responses in an on-line \"open book\" of the course, six short writing activities, and the in-class presentation of a hypertext of your own devising. All readings are in English. \n\n", "semester": "2003A", "name": "Killing Time, Killing the Reader, Killing the Author: Old Habits New Media", "reviews": {"path": "/courses/2215/reviews", "values": [{"ratings": {"rAmountLearned": "4.00", "rDifficulty": "2.00", "rStimulateInterest": "3.50", "rRecommendMajor": "4.00", "rCourseQuality": "4.00", "rWorkRequired": "2.00", "rInstructorAccess": "2.50", "rReadingsValue": "3.50", "rRecommendNonMajor": "4.00", "rCommAbility": "2.50", "rInstructorQuality": "4.00"}, "section": {"name": "Killing Time, Killing the Reader, Killing the Author: Old Habits New Media", "sectionnum": "301", "primary_alias": "SLAV-106-301", "path": "/courses/2215/sections/301", "id": "2215-301", "aliases": ["SLAV-106-301"]}, "comments": "", "num_students": 2, "path": "/courses/2215/sections/301/reviews/1957-ROBERT-ROMANCHUK", "instructor": {"path": "/instructors/1957-ROBERT-ROMANCHUK", "first_name": "ROBERT", "last_name": "ROMANCHUK", "id": "1957-ROBERT-ROMANCHUK", "name": "ROBERT ROMANCHUK"}, "num_reviewers": 2, "id": "2215-301-1957-ROBERT-ROMANCHUK"}]}, "credits": null, "primary_alias": "SLAV-106", "path": "/courses/2215", "sections": {"path": "/courses/2215/sections", "values": [{"name": "Killing Time, Killing the Reader, Killing the Author: Old Habits New Media", "sectionnum": "301", "primary_alias": "SLAV-106-301", "path": "/courses/2215/sections/301", "id": "2215-301", "aliases": ["SLAV-106-301"]}]}, "id": 2215, "aliases": ["SLAV-106"]}