[{"ratings": {"rAmountLearned": "3.17", "rDifficulty": "2.64", "rStimulateInterest": "3.17", "rRecommendMajor": "3.31", "rCourseQuality": "3.02", "rWorkRequired": "2.42", "rInstructorAccess": "2.91", "rReadingsValue": "2.86", "rRecommendNonMajor": "3.00", "rCommAbility": "3.25", "rInstructorQuality": "3.13"}, "section": {"name": "STRAT & COMPET ADVANTAGE", "sectionnum": "001", "primary_alias": "MGMT-701-001", "path": "/courses/27760/sections/001", "id": "27760-001", "aliases": ["MGMT-701-001"]}, "comments": "\tThis course is concerned with strategy issues at the business unit level. Its focus is on the question of how firms can create and sustain a competitive advantage. A central part of the course deals with concepts that have been developed around the notions of complementarities and fit. Other topics covered in the course include the creation of competitive advantage through commitment, competitor analysis, different organizational responses to environmental changes, real options, modularity, and increasing returns. An important feature of the course is a term-length project in which groups of students work on firm analyses that require the application of the course concepts.\r\n\r\n\tStudents loved the course as they said it was “excellent,” “great,” and “very relevant.” They said it “covered a lot of valuable topics” and “challenged students to think for themselves.”\r\n\r\nStudents also loved Professor Marciano as they said she was “great,” “terrific,” and “by far the most amazing prof.”  Specifically, students commented that Professor Marciano was good with “engaging students” and “pushing discussions to go deeper.”\r\n\r\n\tThe course is an advanced MGMT course.\r\n", "num_students": 62, "path": "/courses/27760/sections/001/reviews/6124-SONIA-MARCIANO", "instructor": {"path": "/instructors/6124-SONIA-MARCIANO", "first_name": "SONIA", "last_name": "MARCIANO", "id": "6124-SONIA-MARCIANO", "name": "SONIA MARCIANO"}, "num_reviewers": 49, "id": "27760-001-6124-SONIA-MARCIANO"}]