{"coursehistories": {"path": "/coursehistories/3176"}, "description": "This course provides an introduction to the society, culture and history of ancient Egypt. The objective of the course is to provide an understanding of the characteristics of the civilization of ancient Egypt and how that ancient society succeeded as one of the most successful and long-lived civilizations in world history. \n\n", "semester": "2012A", "name": "LAND OF THE PHARAOHS", "reviews": {"path": "/courses/27847/reviews", "values": [{"ratings": {"rAmountLearned": "2.40", "rDifficulty": "2.06", "rStimulateInterest": "2.39", "rRecommendMajor": "3.17", "rCourseQuality": "2.73", "rWorkRequired": "1.96", "rInstructorAccess": "2.81", "rReadingsValue": "1.66", "rRecommendNonMajor": "2.57", "rCommAbility": "2.96", "rInstructorQuality": "2.92"}, "section": {"name": "LAND OF THE PHARAOHS", "sectionnum": "401", "primary_alias": "NELC-062-401", "path": "/courses/27847/sections/401", "id": "27847-401", "aliases": ["NELC-062-401", "AFST-062-401"]}, "comments": "This course provides an introduction to the society, culture and history of ancient Egypt.  The objective of the course is to provide an understanding of the characteristics of the civilization of ancient Egypt and how that ancient society succeeded as one of the most successful and long-lived civilizations in world history.\r\n\r\nStudents seemed to either really enjoy the material or find it relatively uninteresting and dry.  Some students described the class material as interesting, exciting, and enjoyable, while others who were less interested in ancient Egyptian history described it as not particularly engaging.  \r\n\r\nStudents were relatively split regarding Professor Wegner’s lecturing.  Some students enjoyed Professor Wegner’s “sense of humor in his lectures, which were very well explained and informative.”  However, several students found the lectures to be somewhat dry and monotonous.  In addition, a handful of students stated that the course materials—especially the PowerPoint slides—were slightly disorganized and would benefit from being updated and shortened.  \r\n\r\nCoursework included multiple exams, which asked for relatively detailed information from the material, and therefore required a significant amount of memorization.  This course satisfies the History and Tradition sector requirement. ", "num_students": 139, "path": "/courses/27847/sections/401/reviews/76-JOSEF-W-WEGNER", "instructor": {"path": "/instructors/76-JOSEF-W-WEGNER", "first_name": "JOSEF W", "last_name": "WEGNER", "id": "76-JOSEF-W-WEGNER", "name": "JOSEF W WEGNER"}, "num_reviewers": 123, "id": "27847-401-76-JOSEF-W-WEGNER"}]}, "credits": null, "primary_alias": "NELC-062", "path": "/courses/27847", "sections": {"path": "/courses/27847/sections", "values": [{"name": "LAND OF THE PHARAOHS", "sectionnum": "401", "primary_alias": "NELC-062-401", "path": "/courses/27847/sections/401", "id": "27847-401", "aliases": ["NELC-062-401", "AFST-062-401"]}]}, "id": 27847, "aliases": ["NELC-062", "AFST-062"]}