[{"ratings": {"rAmountLearned": "2.84", "rDifficulty": "2.34", "rStimulateInterest": "2.70", "rRecommendMajor": "3.09", "rCourseQuality": "2.98", "rWorkRequired": "2.39", "rInstructorAccess": "2.91", "rReadingsValue": "2.98", "rRecommendNonMajor": "2.73", "rCommAbility": "3.05", "rInstructorQuality": "3.00"}, "section": {"name": "US HISTORY 1865-PRESENT", "sectionnum": "001", "primary_alias": "HIST-021-001", "path": "/courses/20307/sections/001", "id": "20307-001", "aliases": ["HIST-021-001"]}, "comments": "This course covers the social, political, and economic history of the nation from the Civil War to the present. Topics discussed include the causes and course of the Civil War, Reconstruction, politics in the Gilded Age, late nineteenth-century urbanization and immigration, Populism, Progressivism, the sociology and politics of the twenties, the New Deal, post-World War II America, the turbulence of the sixties, and contemporary affairs.\r\n\r\nMany students felt that it was a “great class” that was “very interesting and stimulating.” One student said that, “the class was amazing, before taking the course I despised history but now I feel able to analyze and appreciate history more because of the issues addressed.” However, others were frustrated. The main point of contention was the subject matter. Many students found the course title misleading and felt that the class dealt more with cultural history than traditional history. Some yearned for a more “traditional” approach and others felt the class overlooked “political, socioeconomic, and race details crucial to the depiction of history.” Students appreciated the analytical skills they gained in the class though some felt there was a lot of reading.\r\n\r\nMost of the students praised Professor Kropp as “interesting and engaging” as well as “organized and clear.” They applauded the variety of techniques she used in lecture, from music to movies and video clips. Students felt these mediums helped them identify with the periods discussed and brought the history to life. However, other students found Professor Kropp’s lectures to be “boring” at times. One student felt her lectures were “often labored, awkward, and uninteresting.” Another student claimed that Professor Kropp never responded to his e-mail.\r\n\r\nThis course is an introductory course. Students who usually did not like history thoroughly enjoyed the course, while others who claimed they “loved” US History were not satisfied. Some students felt some of the readings were not relevant and that there was a lot of reading. This course fulfils the history and tradition sector requirement and a regional requirement for the history major.", "num_students": 57, "path": "/courses/20307/sections/001/reviews/641-PHOEBE-S-KROPP", "instructor": {"path": "/instructors/641-PHOEBE-S-KROPP", "first_name": "PHOEBE S", "last_name": "KROPP", "id": "641-PHOEBE-S-KROPP", "name": "PHOEBE S KROPP"}, "num_reviewers": 44, "id": "20307-001-641-PHOEBE-S-KROPP"}]