{"coursehistories": {"path": "/coursehistories/5482"}, "description": "In a nurturing, non-judgemental environment this course is designed to develop and hone your expressive abilities, and encourage you to create poetry, short stories and creative non-fiction in Urdu. We will read original and translated works of literature, music, and art in Urdu, English, and other languages which will inspire you and enhance your vocabulary. You will practice and experiment using structured techniques and exercises in diverse genres such as haiku, prose, nazm, rubaai, ghazal, and creative non-fiction. Course materials will draw upon your suggestions as well as contemporary, modern, and classical sources including Faiz, Maraji, Jagan Nath Azad, Auden, Ghalib, Neruda, Tagore, Fehmida Riaz, Sadequain and many others. Since participants may have widely varying backgrounds in the language, grading will be entirely individual. Your grade will be determined by an assessment of your performance in relation to your background and capabilities. Class attendance, participation, completion of weekly reading and assignments will also count towards your overall grade, along with a final independent project of creative expression. The latter will be developed with guidance from the professor, suitable to your level and aspiration, and due at the end of the semester. \n\nPriority will be given to imaginative expression, with vocabulary and grammar development used as needed to refine your creations. As self confidence grows and appreciation increases, it is expected that you will push yourself and others to higher levels of expression and understanding. The four language skills of reading, listening, speaking and writing will be enhanced to express what we feel or want to say, rather than only what we need for everyday functional purposes. A multimedia approach will be used, including audio, video, and online materials and tools. Intermediate reading, writing and speaking skills in Urdu are recommended but please contact Mustafa Menai (mustafamenai@gmail.com) if you are unsure of your eligility and want to discuss further. \n\n", "semester": "2012A", "name": "AD URDU: PROSE: URDU IN RELIGIOUS CLTR", "reviews": {"path": "/courses/28252/reviews", "values": [{"ratings": {"rAmountLearned": "2.00", "rDifficulty": "2.00", "rStimulateInterest": "2.00", "rRecommendMajor": "2.00", "rCourseQuality": "2.67", "rWorkRequired": "2.50", "rInstructorAccess": "2.00", "rReadingsValue": "2.00", "rRecommendNonMajor": "2.00", "rCommAbility": "2.00", "rInstructorQuality": "2.67"}, "section": {"name": "AD URDU: PROSE: URDU IN RELIGIOUS CLTR", "sectionnum": "401", "primary_alias": "URDU-431-401", "path": "/courses/28252/sections/401", "id": "28252-401", "aliases": ["URDU-431-401", "NELC-431-401"]}, "comments": "", "num_students": 4, "path": "/courses/28252/sections/401/reviews/1956-RUBAB-QURESHI", "instructor": {"path": "/instructors/1956-RUBAB-QURESHI", "first_name": "RUBAB", "last_name": "QURESHI", "id": "1956-RUBAB-QURESHI", "name": "RUBAB QURESHI"}, "num_reviewers": 3, "id": "28252-401-1956-RUBAB-QURESHI"}]}, "credits": null, "primary_alias": "URDU-431", "path": "/courses/28252", "sections": {"path": "/courses/28252/sections", "values": [{"name": "AD URDU: PROSE: URDU IN RELIGIOUS CLTR", "sectionnum": "401", "primary_alias": "URDU-431-401", "path": "/courses/28252/sections/401", "id": "28252-401", "aliases": ["URDU-431-401", "NELC-431-401"]}]}, "id": 28252, "aliases": ["URDU-431", "NELC-431"]}