{"coursehistories": {"path": "/coursehistories/1689"}, "description": "Analysis of cellular and systems-level human physiology with an emphaisis on clinical applications. Particular emphasis is on mechanisms of function in the neural and cardiovascular systems. \n\n", "semester": "2010C", "name": "ENG PRINC OF HUMAN PHYSI", "reviews": {"path": "/courses/22684/reviews", "values": [{"ratings": {"rAmountLearned": "2.53", "rDifficulty": "2.86", "rStimulateInterest": "1.54", "rRecommendMajor": "3.16", "rCourseQuality": "2.58", "rWorkRequired": "2.62", "rInstructorAccess": "2.54", "rReadingsValue": "2.24", "rRecommendNonMajor": "1.58", "rCommAbility": "1.51", "rInstructorQuality": "1.55"}, "section": {"name": "ENG PRINC OF HUMAN PHYSI", "sectionnum": "001", "primary_alias": "BE-305-001", "path": "/courses/22684/sections/001", "id": "22684-001", "aliases": ["BE-305-001"]}, "comments": "This course is an analysis of cellular and systems-level human physiology with an emphasis on clinical applications. Particular emphasis is placed on mechanisms of function in the neural and cardiovascular systems.\r\n\r\nThe class was described as “an exploration in anatomy and its engineering opportunities rather than an actual anatomy class” and many students felt that it was well-suited for Bioengineering majors. Most students appreciated the guest lecture format of the class and found the research presented to be extremely interesting and relevant. However, many indicated that this format made the course very disorganized. One student suggested that it was “necessary for the overseeing professors to more closely guide the guest lecturers in preparing their material” to bring more structure to the class. Homework assignments were often not representative of lecture material; they were “more mathematical, something barely touched on during the class”. Several students also felt that the readings were unnecessary and that it was hard to anticipate what would be covered on the exams.\r\n\r\nThis course was taught as a series of guest lectures organized by Dr. Mauck and Dr. Buchsbaum. Many applauded Dr. Mauck for his hard work in organizing the guest lectures and his receptiveness to emails. However, students reported that they “rarely ever heard from Dr. Buchsbaum.” A majority of students generally enjoyed listening to the guest lecturers, touting the great knowledge and “tremendous passion” each expert had for their area of research.\r\n\r\nWhile some felt that the assignments were difficult as they did not represent what was taught in class, others thought that they were not difficult enough to help prepare them for the examinations. This class is a requirement for the Bioengineering curriculum, and the prerequisites are MATH 241 and junior standing.\r\n", "num_students": 48, "path": "/courses/22684/sections/001/reviews/164-GERSHON-BUCHSBAUM", "instructor": {"path": "/instructors/164-GERSHON-BUCHSBAUM", "first_name": "GERSHON", "last_name": "BUCHSBAUM", "id": "164-GERSHON-BUCHSBAUM", "name": "GERSHON BUCHSBAUM"}, "num_reviewers": 45, "id": "22684-001-164-GERSHON-BUCHSBAUM"}, {"ratings": {"rAmountLearned": "2.53", "rDifficulty": "2.86", "rStimulateInterest": "2.73", "rRecommendMajor": "3.16", "rCourseQuality": "2.58", "rWorkRequired": "2.62", "rInstructorAccess": "3.05", "rReadingsValue": "2.24", "rRecommendNonMajor": "1.58", "rCommAbility": "3.11", "rInstructorQuality": "2.98"}, "section": {"name": "ENG PRINC OF HUMAN PHYSI", "sectionnum": "001", "primary_alias": "BE-305-001", "path": "/courses/22684/sections/001", "id": "22684-001", "aliases": ["BE-305-001"]}, "comments": "This course covers analysis of cellular and systems-level human physiology with an emphasis on clinical applications, with particular emphasis given to mechanisms of function in the neural and cardiovascular systems.\r\n\r\nMost students found this course “interesting” and enjoyed the numerous guest lecturers who spoke as experts in their fields. However, students reported that these guest lecturers often expected students to have a higher level of knowledge of the subject. \r\n\r\nDescribed as “awesome” and “helpful,” Dr. Mauck was respected by a majority of his students, and students generally felt that he always returned their emails and messages within hours. One student commented that Dr. Mauck was the reason that BE 305 was his favorite class he has taken at Penn so far. \r\n\r\nStudents reported that homework assignments and tests were often completely different from lectures. According to some, assignments lacked consistency because of the variance in material caused by the guest lecturers. Some students felt that the skills learned in class failed to connect with the homework assignments and were more mathematical than the class required.\r\n", "num_students": 48, "path": "/courses/22684/sections/001/reviews/5589-ROBERT-L--MAUCK", "instructor": {"path": "/instructors/5589-ROBERT-L--MAUCK", "first_name": "ROBERT L.", "last_name": "MAUCK", "id": "5589-ROBERT-L--MAUCK", "name": "ROBERT L. MAUCK"}, "num_reviewers": 45, "id": "22684-001-5589-ROBERT-L--MAUCK"}]}, "credits": null, "primary_alias": "BE-305", "path": "/courses/22684", "sections": {"path": "/courses/22684/sections", "values": [{"name": "ENG PRINC OF HUMAN PHYSI", "sectionnum": "001", "primary_alias": "BE-305-001", "path": "/courses/22684/sections/001", "id": "22684-001", "aliases": ["BE-305-001"]}]}, "id": 22684, "aliases": ["BE-305"]}