[{"ratings": {"rAmountLearned": "2.83", "rDifficulty": "1.83", "rStimulateInterest": "2.79", "rRecommendMajor": "3.23", "rCourseQuality": "2.88", "rWorkRequired": "2.45", "rInstructorAccess": "3.79", "rReadingsValue": "2.67", "rRecommendNonMajor": "2.73", "rCommAbility": "3.07", "rInstructorQuality": "3.26"}, "section": {"name": "HEALTHY SCHOOLS", "sectionnum": "401", "primary_alias": "PSCI-335-401", "path": "/courses/22335/sections/401", "id": "22335-401", "aliases": ["PSCI-335-401", "HSOC-335-401"]}, "comments": "This Fox Leadership and academically based community service seminar uses course readings and students’ own observations and interviews in their service learning projects in West Philadelphia schools to analyze the causes and impact of school health and educational inequalities and efforts to address them. Course readings include texts by Jonathan Kozol, studies of health inequalities and their causes, and studies of No Child Left Behind, the CDC’s School Health Index, recess, school meal, and nutrition education programs. Course speakers help students examine the history, theories, politics and leadership behind different strategies for addressing school-based inequalities and their outcomes. Service options focus especially on the West Philadelphia Recess Initiative. Other service options include work with Community School Student Partnerships and the Urban Nutrition Initiative. Students write several short papers based on course readings and present group reports and case studies based on the service projects. (A research paper is optional.)&#8232;&#8232;&#8232;&#8232;Students generally enjoyed this course, and one student called it “one of my favorite classes at Penn.” The service placement was the “central component” of the course, which one student described as “truly hands-on learning.” The focus certainly seemed to be on students’ placements, and one student commented that sometimes class discussion dwelt too much “on anecdotes from service placements” that didn’t necessarily contribute substantially to their understanding of greater issues in education. A couple of students found the class “a little too large for a seminar” and thought the course would have functioned better with fewer students.&#8232;&#8232;&#8232;&#8232;Students described Professor Summers very positively, describing her as “excellent,” “incredibly sweet,” and “truly passionate” about improving urban schools. Students also found Professor Summers to be extremely “flexible” and “understanding” when it came to making adjustments to assignments and coursework. Professor Summers was genuinely interested in hearing about students’ experiences with their placements and was dedicated to helping students do well on their projects. A few students mentioned that a little more organization and direction of class discussions would have been beneficial.&#8232;&#8232;&#8232;&#8232;Students described this ABCS course as a good course for students interested in service learning, urban environments, schools, and politics. One student noted that it was a “great introduction to a service learning class.”&#8232;&#8232;**Class only reviewed by 6 students", "num_students": 39, "path": "/courses/22335/sections/401/reviews/990-MARY-E-SUMMERS", "instructor": {"path": "/instructors/990-MARY-E-SUMMERS", "first_name": "MARY E", "last_name": "SUMMERS", "id": "990-MARY-E-SUMMERS", "name": "MARY E SUMMERS"}, "num_reviewers": 35, "id": "22335-401-990-MARY-E-SUMMERS"}]