{"coursehistories": {"path": "/coursehistories/3970"}, "description": "During the last 500 years, science has emerged as a central and transformative force that continues to reshape everyday life in countless ways. This introductory course will survey the emergence of the scientific world view fromthe Renaissance through the end of the 20th century. By focusing on the life, work and cultural contexts of those who created modern science, we will explore their core ideas and techniques, where they came from, what problems they solved, what made them controversial and exciting and how they related to contemporary religious beliefs, politics, art, literature, and music. The course is organized chronologically and thematically. In short, this is a \"Western Civ\" course with a difference, open to students at all levels. \n\n", "semester": "2010C", "name": "EMERGENCE OF MODERN SCI", "reviews": {"path": "/courses/23847/reviews", "values": [{"ratings": {"rAmountLearned": "2.86", "rDifficulty": "1.89", "rStimulateInterest": "3.16", "rRecommendMajor": "3.61", "rCourseQuality": "3.20", "rWorkRequired": "2.08", "rInstructorAccess": "3.19", "rReadingsValue": "2.07", "rRecommendNonMajor": "3.12", "rCommAbility": "3.43", "rInstructorQuality": "3.43"}, "section": {"name": "EMERGENCE OF MODERN SCI", "sectionnum": "401", "primary_alias": "STSC-001-401", "path": "/courses/23847/sections/401", "id": "23847-401", "aliases": ["STSC-001-401", "HSOC-001-401"]}, "comments": "\r\nThis course examines the emergence and development of the scientific world-view, from the Renaissance to the end of the 20th century. Students explore the history of scientific ideas, the social contexts which gave rise to them, and their social and human implications. Sample topics include: Copernican revolution; Galileo, science and the Church; Newton and the mechanical worldview; Enlightenment and Romantic science; Lavoisier, industrialization and the rise of modern chemistry; Darwin, Darwinism and evolution; atomic physics, the bomb and its aftermath; the emergence of modern genetics; the DNA revolution; computers and the information age; and science and the human future. &#8232;\r\nStudents found the course “very interesting” because of its focus on “science within a historical, social, and political context.” Some students felt that the course focused too much on historical details and not enough on analyzing history. One student recommended that the class should instead focus on material “I can’t just Google.” However, one student noted, “the primary source documents and several of the readings definitely provided the course material with more substance and depth” to supplement the detail oriented lectures. Students also noted that due to the breath of the material covered, the course felt very rushed. Others thought, “this is exactly what a History of Science course at the 001 level should be.” Nonetheless, students still “looked [forward] to every lecture” and “learned a lot.”&#8232;\r\n\r\n&#8232;Students enjoyed Professor Tresch, whom they called an “interesting and engaging lecturer.” Professor Tresch’s “passion for the subject matter is palpable.” Many students noted that his lectures frequently exceeded the time limit of the class. Students also felt that Professor Tresch would occasionally move too quickly through the material, making his lectures difficult to follow. One student could not understand his speech and therefore had difficulty comprehending lecture. Overall, however, students found Professor Tresch “stimulating,” “fantastic,” “outstanding,” and “amazing.”&#8232;&#8232;\r\n\r\nStudents really enjoyed the interactive portion of their class that involved taking field trips to places like the Penn Rare Books Library. The students then wrote papers about these experiences, and they expressed enthusiasm about the topics they chose for these projects. Students also enjoyed the guest lecturers featured in the class. In terms of workload, the class had “a fair amount of work - not too much, not too little” and the “exams [were] predictable (but fair).”\r\n", "num_students": 88, "path": "/courses/23847/sections/401/reviews/4131-JOHN-TRESCH", "instructor": {"path": "/instructors/4131-JOHN-TRESCH", "first_name": "JOHN", "last_name": "TRESCH", "id": "4131-JOHN-TRESCH", "name": "JOHN TRESCH"}, "num_reviewers": 82, "id": "23847-401-4131-JOHN-TRESCH"}]}, "credits": null, "primary_alias": "STSC-001", "path": "/courses/23847", "sections": {"path": "/courses/23847/sections", "values": [{"name": "EMERGENCE OF MODERN SCI", "sectionnum": "401", "primary_alias": "STSC-001-401", "path": "/courses/23847/sections/401", "id": "23847-401", "aliases": ["STSC-001-401", "HSOC-001-401"]}]}, "id": 23847, "aliases": ["STSC-001", "HSOC-001"]}