{"coursehistories": {"path": "/coursehistories/5010"}, "description": "This course provides an introduction to the construction of data analysis tools that are commonly used for business applications, especially in consulting and finance. The course builds on the spreadsheet and analytical skills developed in OPIM101, providing a much more extensive treatment of spreadsheet application development and database management. The first portion of the course will focus on programming in VBA, the embedded programming language in the Microsoft Office suite of applications. This will be supplemented with discussion of industry best practice in software development, such as specification development, interface design, documentation, and testing. The second portion of the class will emphasize data access and analysis utilizing SQL, the industry standard language for interacting with database software. \n\n", "semester": "2012A", "name": "DEV TOOLS FOR DATA ANLYS: DEVELOPING TOOLS FOR DATA ACCESS AND ANALYSIS", "reviews": {"path": "/courses/27955/reviews", "values": [{"ratings": {"rAmountLearned": "3.74", "rDifficulty": "3.29", "rStimulateInterest": "3.29", "rRecommendMajor": "3.71", "rCourseQuality": "3.59", "rWorkRequired": "3.43", "rInstructorAccess": "3.63", "rReadingsValue": "2.86", "rRecommendNonMajor": "2.91", "rCommAbility": "3.46", "rInstructorQuality": "3.69"}, "section": {"name": "DEV TOOLS FOR DATA ANLYS: DEVELOPING TOOLS FOR DATA ACCESS AND ANALYSIS", "sectionnum": "001", "primary_alias": "OPIM-105-001", "path": "/courses/27955/sections/001", "id": "27955-001", "aliases": ["OPIM-105-001"]}, "comments": "OPIM 105 provides an introduction to the construction of data analysis tools that are commonly used for business applications, especially in consulting and finance. The first portion of the course will focus on programming in VBA, the embedded programming language in the Microsoft Office suite of applications.  This will be supplemented with discussion of industry best practice in software development, such as specification development, interface design, documentation, and testing.  The second portion of the class will emphasize data access and analysis utilizing SQL, the industry standard language for interacting with database software. \r\n\r\nMost of the students raved about the usefulness of the class. One student described it as \"an excellent course which teaches some of the most useful skills I have learned over the course of my entire Wharton career.\" The problem sets have many real life applications, focusing on \"finance, statistics and business data analysis.\" However, the same students also stressed the high difficulty level, especially for people who have not had prior programming experience. Part of the challenge came from the fast paced nature of the class, fitting in \"more than a semester of VBA and SQL\" in the short time frame.\r\n\r\nStudents had very high opinions of Professor Hitt. They described him as having \"extensive knowledge of the industry\" with the ability to communicate the content in an interesting manner. He is described as being very committed to the success of his students, which can be seen in his willingness to see students outside of his office hours and replying to emails very quickly. According to one student, \"Professor Hitt was one of the most approachable and attentive professors I have ever had at Penn\" and is also \"very flexible and understanding with deadlines.\"\r\n\r\nThe course is recommended for majors and nonmajors alike as the material that is taught has several applications to solving industry problems. There are no prerequisites, although students with no prior programming experience need to work harder to stay on top of the material.\r\n", "num_students": 42, "path": "/courses/27955/sections/001/reviews/938-LORIN-M--HITT", "instructor": {"path": "/instructors/938-LORIN-M--HITT", "first_name": "LORIN M.", "last_name": "HITT", "id": "938-LORIN-M--HITT", "name": "LORIN M. HITT"}, "num_reviewers": 41, "id": "27955-001-938-LORIN-M--HITT"}]}, "credits": null, "primary_alias": "OPIM-105", "path": "/courses/27955", "sections": {"path": "/courses/27955/sections", "values": [{"name": "DEV TOOLS FOR DATA ANLYS: DEVELOPING TOOLS FOR DATA ACCESS AND ANALYSIS", "sectionnum": "001", "primary_alias": "OPIM-105-001", "path": "/courses/27955/sections/001", "id": "27955-001", "aliases": ["OPIM-105-001"]}]}, "id": 27955, "aliases": ["OPIM-105"]}