[{"ratings": {"rAmountLearned": "3.40", "rDifficulty": "3.33", "rStimulateInterest": "3.67", "rRecommendMajor": "3.67", "rCourseQuality": "3.40", "rWorkRequired": "3.13", "rInstructorAccess": "3.60", "rReadingsValue": "2.71", "rRecommendNonMajor": "1.36", "rCommAbility": "3.53", "rInstructorQuality": "3.60"}, "section": {"name": "QUANTUM MECH II", "sectionnum": "001", "primary_alias": "PHYS-532-001", "path": "/courses/28022/sections/001", "id": "28022-001", "aliases": ["PHYS-532-001"]}, "comments": "This course is part two of Quantum Mechanics.  This course focuses on spin and other two-dimensional systems, matrix mechanics, rotation group, symmetries, time independent and time dependent perturbation theory, and atomic and molecular systems. \r\n\r\nThe course, while challenging, gave great insight into the subject and the formulation of its underlying theories. However, students found that lectures were often a little too fast-paced at times.\r\n\r\nStudents said that one of the best things about this class was how engaged Professor Khoury himself was with the subject matter.  He clearly spent a lot of time preparing for lectures and thinking about the kinds of questions that might come up. He was always really willing—excited even—to address new questions that people brought up in class.  Students said this attitude really made it a joy to sit in class.  One student said, “Professor Khoury is certainly the best physics instructor I have encountered in my undergraduate and graduate career.”\r\n\r\nThe prerequisite for this course is PHYS 531.  Students said that the problem sets were very well constructed and the interludes into special topics brought up in class (such as dynamical symmetries of the 2D harmonic oscillator) were thoughtful and insightful.   However, one student commented that the problem sets were too math focused. ", "num_students": 15, "path": "/courses/28022/sections/001/reviews/4530-JUSTIN-KHOURY", "instructor": {"path": "/instructors/4530-JUSTIN-KHOURY", "first_name": "JUSTIN", "last_name": "KHOURY", "id": "4530-JUSTIN-KHOURY", "name": "JUSTIN KHOURY"}, "num_reviewers": 15, "id": "28022-001-4530-JUSTIN-KHOURY"}]