{"coursehistories": {"path": "/coursehistories/2830"}, "description": "Natural disturbances play a fundamental role in sculpturing landscapes and structuring natural and human-based ecosystems. This course explores the natural and social science of disturbances by analyzing their geologic causes, their ecological and social consequences, and the role of human behavior in disaster reduction and mitigation. Volcanoes, earthquakes, floods, droughts, fires, and extraterrestrial impacts are analyzed and compared. \n\n", "semester": "2011A", "name": "Natural Disturbances and Human Disasters", "reviews": {"path": "/courses/21777/reviews", "values": [{"ratings": {"rAmountLearned": "1.80", "rDifficulty": "2.21", "rStimulateInterest": "1.27", "rRecommendMajor": "2.32", "rCourseQuality": "1.73", "rWorkRequired": "1.81", "rInstructorAccess": "2.12", "rReadingsValue": "1.43", "rRecommendNonMajor": "1.89", "rCommAbility": "2.02", "rInstructorQuality": "1.84"}, "section": {"name": "Natural Disturbances and Human Disasters", "sectionnum": "001", "primary_alias": "GEOL-103-001", "path": "/courses/21777/sections/001", "id": "21777-001", "aliases": ["GEOL-103-001"]}, "comments": "This course explores the natural and social science of disturbances by analyzing their geologic causes, their ecological and social consequences, and the role of human behavior in disaster reduction and mitigation. Volcanoes, earthquakes, floods, droughts, fires, and extraterrestrial impacts are analyzed and compared.\r\n\r\nMany students said that although the course material wasn’t the most exciting, it was interesting enough to take to fulfill the Physical World sector requirement.\r\n\r\nStudents said that Professor Scatena was always able to make the subject material relevant and applicable to real-world situations. He was very dedicated in involving the class and kept the material interesting. Yet students sometimes found that Professor Scatena was disorganized during his lectures, making it hard to understand the course material. In addition, students did not like that Professor Scatena often just read straight from his lecture slides.\r\n\r\nThis course fulfills the Physical World sector requirement. Student found that the exams were far too detailed, and focused on small details rather than major concepts. However, students said that the curve on the exams was very forgiving.\r\n", "num_students": 209, "path": "/courses/21777/sections/001/reviews/1839-FREDERICK-N--SCATENA", "instructor": {"path": "/instructors/1839-FREDERICK-N--SCATENA", "first_name": "FREDERICK N.", "last_name": "SCATENA", "id": "1839-FREDERICK-N--SCATENA", "name": "FREDERICK N. SCATENA"}, "num_reviewers": 203, "id": "21777-001-1839-FREDERICK-N--SCATENA"}]}, "credits": null, "primary_alias": "GEOL-103", "path": "/courses/21777", "sections": {"path": "/courses/21777/sections", "values": [{"name": "Natural Disturbances and Human Disasters", "sectionnum": "001", "primary_alias": "GEOL-103-001", "path": "/courses/21777/sections/001", "id": "21777-001", "aliases": ["GEOL-103-001"]}]}, "id": 21777, "aliases": ["GEOL-103"]}