[{"ratings": {"rAmountLearned": "2.92", "rDifficulty": "2.51", "rStimulateInterest": "3.45", "rRecommendMajor": "3.55", "rCourseQuality": "2.72", "rWorkRequired": "3.36", "rInstructorAccess": "2.87", "rReadingsValue": "2.10", "rRecommendNonMajor": "1.45", "rCommAbility": "3.21", "rInstructorQuality": "3.32"}, "section": {"name": "LECTURE", "sectionnum": "001", "primary_alias": "MEAM-247-001", "path": "/courses/24719/sections/001", "id": "24719-001", "aliases": ["MEAM-247-001"]}, "comments": "This sophomore-level laboratory course teaches the principles of experimentation\r\nand measurement systems as well as design. The fall semester follows closely with\r\nMEAM 210, doing experiments in statics and strength of materials. The spring semester\r\nfollows closely with MEAM 203 and MEAM 211 with project based design projects in\r\nthermodynamics and dynamics.\r\n“The information is overwhelming fascinating” and “fun.” Students reported\r\nbuilding bridges and games in class. A student stated, “the projects were very helpful in\r\ngaining intuition about mechanical engineering problems.\" Students reported learning a\r\nlot and using a variety of tools. A student complained that “more time could have been\r\nspent on making students familiar with the tools available (i.e. how to run FEA,\r\nMATLAB, types of projects done in previous years).”\r\nStudents also praised Professor Fiene as an “amazing” and “engaging” professor\r\nwho pushed them to think outside the box.” Many felt that he was “creative,”\r\n“enthusiastic,” and someone who was “engaging” to listen to during lecture. However,\r\nsome people did feel that Dr. Fiene should have made himself more readily available to\r\nanswer questions for the projects and that he should have given more guidance on\r\nMATLAB related material.\r\nThis lab course is meant for sophomores in the mechanical engineering\r\ndepartment to take alongside MEAM 210 and MEAM 203/MEAM 211. This course was\r\nnot recommended for any other engineers. The main complaint was that this course was\r\na lot of fun for a half credit that required many extra hours outside of class.", "num_students": 75, "path": "/courses/24719/sections/001/reviews/3916-JONATHAN-FIENE", "instructor": {"path": "/instructors/3916-JONATHAN-FIENE", "first_name": "JONATHAN", "last_name": "FIENE", "id": "3916-JONATHAN-FIENE", "name": "JONATHAN FIENE"}, "num_reviewers": 69, "id": "24719-001-3916-JONATHAN-FIENE"}]