[{"ratings": {"rAmountLearned": "2.05", "rDifficulty": "2.69", "rStimulateInterest": "1.72", "rRecommendMajor": "2.85", "rCourseQuality": "2.00", "rWorkRequired": "2.41", "rInstructorAccess": "2.55", "rReadingsValue": "1.76", "rRecommendNonMajor": "1.74", "rCommAbility": "2.23", "rInstructorQuality": "2.16"}, "section": {"name": "INTRO TO ARCH: Introduction to Archaeology", "sectionnum": "001", "primary_alias": "ANTH-001-001", "path": "/courses/21249/sections/001", "id": "21249-001", "aliases": ["ANTH-001-001"]}, "comments": "This course is an introduction to the history, concepts, and methods of the anthropological study of ancient peoples using archaeological illustrations to indicate the relationships of archaeological interpretations with cultural and physical anthropology. &#8232;&#8232;Students reported that this course provided them with an in-depth overview of, “the development of cultures through an archeological perspective”. However, some students felt that the exams focused too much on memorization. &#8232;&#8232;Many students reported that Professor Ristvet was “kind” and “knowledgeable”. However, some students felt that she did not provide enough context for the material and as a result the material seemed disconnected. Additionally, some students felt that the professor did not focus enough on the general theme of the course.&#8232;&#8232;This course is an introductory course in anthropology. There are no prerequisites listed for this course. This course may be used to fulfill the History and Tradition sector requirement.", "num_students": 56, "path": "/courses/21249/sections/001/reviews/4239-LAUREN-M--RISTVET", "instructor": {"path": "/instructors/4239-LAUREN-M--RISTVET", "first_name": "LAUREN M.", "last_name": "RISTVET", "id": "4239-LAUREN-M--RISTVET", "name": "LAUREN M. RISTVET"}, "num_reviewers": 52, "id": "21249-001-4239-LAUREN-M--RISTVET"}, {"ratings": {"rAmountLearned": "3.05", "rDifficulty": "1.90", "rStimulateInterest": "3.24", "rRecommendMajor": "3.62", "rCourseQuality": "3.16", "rWorkRequired": "1.86", "rInstructorAccess": "3.62", "rReadingsValue": "2.95", "rRecommendNonMajor": "3.24", "rCommAbility": "3.29", "rInstructorQuality": "3.48"}, "section": {"name": "INTRO TO ARCHAEOLOGY", "sectionnum": "601", "primary_alias": "ANTH-001-601", "path": "/courses/21249/sections/601", "id": "21249-601", "aliases": ["ANTH-001-601"]}, "comments": "&#8232;&#8232;This course offers an introduction to the history, concepts, and methods of the anthropological study of ancient peoples using archaeological illustrations to indicate the relationships of archaeological interpretations with cultural and physical anthropology. It is an introductory course, so there is not much deep study within one aspect of archaeology. Instead, the course offers a broad overview of the field as a whole. &#8232;&#8232;Overall, students enjoyed this course very much as an introduction to both archaeology and anthropology. The general consensus was that this course was “interesting” and “engaging.” Although the course did go into too much detail, many students reported leaving the class with knowledge of the basic concepts and debates within the field. &#8232;&#8232;Professor Schweitzer was described as “knowledgeable” and “kind”. She got rave reviews from her students, mostly because of the variability in her teaching tools. Professor Schweitzer was very well liked and she kept the class interested in the material due to her “unique way of connecting with students.” Along with her clear communication of the material, she was able to keep the class fun and upbeat.&#8232;&#8232;The course load was neither described as easy nor hard, but everything covered in class was relevant to the subject. Although activities were sometimes fun and silly, they still had a purpose that was clear to students. Exams were described as fair and though the class was said to challenge one’s brain, it was in a fun and interesting manner that left students pleased with the course.", "num_students": 28, "path": "/courses/21249/sections/601/reviews/5194-TEAGAN-A-SCHWEITZER", "instructor": {"path": "/instructors/5194-TEAGAN-A-SCHWEITZER", "first_name": "TEAGAN A", "last_name": "SCHWEITZER", "id": "5194-TEAGAN-A-SCHWEITZER", "name": "TEAGAN A SCHWEITZER"}, "num_reviewers": 25, "id": "21249-601-5194-TEAGAN-A-SCHWEITZER"}]