{"coursehistories": {"path": "/coursehistories/4603"}, "description": "Students who are interested in math or science might also want to consider a more challenging Honors version of Calculus II and III, Math 116 and Math 260 (the analogues of Math 114 and Math 240, respectively). These courses will cover essentially the same material as 114 and 240, but more in depth and involve discussion of the underlying theory as well as computations. \n\n", "semester": "2009C", "name": "HONORS CALCULUS", "reviews": {"path": "/courses/17635/reviews", "values": [{"ratings": {"rAmountLearned": "3.52", "rDifficulty": "3.44", "rStimulateInterest": "3.56", "rRecommendMajor": "3.82", "rCourseQuality": "3.58", "rWorkRequired": "3.53", "rInstructorAccess": "3.88", "rReadingsValue": "3.28", "rRecommendNonMajor": "2.09", "rCommAbility": "3.56", "rInstructorQuality": "3.83"}, "section": {"name": "HONORS CALCULUS", "sectionnum": "001", "primary_alias": "MATH-116-001", "path": "/courses/17635/sections/001", "id": "17635-001", "aliases": ["MATH-116-001"]}, "comments": "MATH116 is the honors version of Calculus II, taking a more challenging and theoretical approach. It covers material similar to MATH114, but with greater depth, including a review of the foundations of calculus, vector algebra and its applications, the calculus of vector-valued functions, ordinary differential equations, and linear algebra (linear spaces, inner product spaces, linear transformations and matrices).\r\n\r\nMost students heaped high praise on the course material, calling it “very interesting,” “absolutely amazing,” and a “fantastic course.” Most students liked the “comprehensive” depth of the material, although some said it was a little “too abstract.” One wrote, “I would recommend this course to anyone who wants a challenge beyond the usual plug-and-chug math classes.”\r\n\r\nProfessor Harbater was universally named “an amazing instructor,” and more than one student said that he was the “best math teacher” they’d ever had. Professor Harbater “inspires a passion for mathematics,” while being “very knowledgeable” about the subject. One reviewer wrote that the professor’s enthusiasm was both “encouraging” and “infectious.”\r\n\r\nMATH104 or an appropriate equivalent is a prerequisite for MATH116. The class is intended for those who are interested in mathematics or science, but may be “too abstract” for those who do not intend to major in mathematics or a related subject. Students overall noted the difficulty of MATH116. Problem sets were “very difficult and time-consuming.” While one student noted that the midterms were “quite difficult,” another student wrote that “they could be a little harder.” One reviewer felt that overall “the work is certainly challenging but the payoff and skills learned are certainly worth it.”", "num_students": 39, "path": "/courses/17635/sections/001/reviews/3362-DAVID-HARBATER", "instructor": {"path": "/instructors/3362-DAVID-HARBATER", "first_name": "DAVID", "last_name": "HARBATER", "id": "3362-DAVID-HARBATER", "name": "DAVID HARBATER"}, "num_reviewers": 38, "id": "17635-001-3362-DAVID-HARBATER"}]}, "credits": null, "primary_alias": "MATH-116", "path": "/courses/17635", "sections": {"path": "/courses/17635/sections", "values": [{"name": "HONORS CALCULUS", "sectionnum": "001", "primary_alias": "MATH-116-001", "path": "/courses/17635/sections/001", "id": "17635-001", "aliases": ["MATH-116-001"]}]}, "id": 17635, "aliases": ["MATH-116"]}