[{"ratings": {"rAmountLearned": "2.78", "rDifficulty": "2.80", "rStimulateInterest": "2.48", "rRecommendMajor": "3.23", "rCourseQuality": "2.63", "rWorkRequired": "2.03", "rInstructorAccess": "2.47", "rReadingsValue": "2.60", "rRecommendNonMajor": "1.85", "rCommAbility": "2.58", "rInstructorQuality": "2.70"}, "section": {"name": "INTERNATIONAL FINANCE", "sectionnum": "001", "primary_alias": "ECON-252-001", "path": "/courses/24278/sections/001", "id": "24278-001", "aliases": ["ECON-252-001"]}, "comments": "Economics 252 examines international monetary policy, emphasizing economic policy in an open economy. Students will learn about balance-of-payments adjustments, theories of exchange rate determination, effects of exchange rate devaluation, macroeconomic policy under fixed and floating exchange rates, as well as currency and balance of payments crises. \r\n\r\nMost students felt positively about the course material, claimed that the class included “lots of relevant information.” Many students found the textbook particularly useful, noting that it was \"clear and well-written.”\r\n\r\nThe majority of students praised Professor Ethier’s teaching. Professor Ethier focused on lectures with notes on the blackboard rather than PowerPoint’s or discussions, which several students appreciated. Many students also appreciated Professor Ethier’s “intimate knowledge of the material” and described him as very approachable. \r\n\r\nMost students considered the presentation of the course and its material fair. A few students noted, however, that the exams proved challenging, since all material was “fair game” for the exams. Some students felt that more practice materials would aid in preparation for the assessments. The prerequisites are ECON 101, ECON 102, and MATH 114. \r\n", "num_students": 64, "path": "/courses/24278/sections/001/reviews/347-WILFRED-J-ETHIER", "instructor": {"path": "/instructors/347-WILFRED-J-ETHIER", "first_name": "WILFRED J", "last_name": "ETHIER", "id": "347-WILFRED-J-ETHIER", "name": "WILFRED J ETHIER"}, "num_reviewers": 60, "id": "24278-001-347-WILFRED-J-ETHIER"}]