[{"ratings": {"rAmountLearned": "2.91", "rDifficulty": "2.14", "rStimulateInterest": "3.18", "rRecommendMajor": "3.11", "rCourseQuality": "3.03", "rWorkRequired": "2.48", "rInstructorAccess": "3.42", "rReadingsValue": "2.75", "rRecommendNonMajor": "2.72", "rCommAbility": "3.37", "rInstructorQuality": "3.36"}, "section": {"name": "EMBEDDED SYSTEMS PROG", "sectionnum": "001", "primary_alias": "CIS-542-001", "path": "/courses/27173/sections/001", "id": "27173-001", "aliases": ["CIS-542-001"]}, "comments": "In this project-based course, students will explore techniques for creating applications for embedded and mobile systems, including model-driven development, testing and verification, software design, networking, and low-level performance tuning and analysis. This course incorporates topics from the domains of software engineering, compilers, operating systems, and computer architecture, and provides students with the foundation they will need for addressing the concerns of developing real-world embedded systems software.\r\n\r\nOverall, students described the course as rewarding and open-ended. They “learnt knowledge of a great range” and gained “hands-on experience” through fun projects. Many were interested in the “Android and embedded programming.” Some pointed out that group work could be more structured to balance each team member’s contribution, but overall the course was worth taking.\r\n\r\nThe majority of students did not directly comment on Professor Murphy but all agreed that the course was presented in an interesting and useful way. Some claimed that too many labs were scheduled when they could have been better consolidated.\r\n\r\nThe prerequisites for this course are CIS 120 and CIS 121 (or equivalent) as well as one of CIS 371, CIS 501 and CIT 593 (or equivalent). Students are expected to have proficiency in both Java and C.\r\n", "num_students": 82, "path": "/courses/27173/sections/001/reviews/5320-CHRISTIAN-MURPHY", "instructor": {"path": "/instructors/5320-CHRISTIAN-MURPHY", "first_name": "CHRISTIAN", "last_name": "MURPHY", "id": "5320-CHRISTIAN-MURPHY", "name": "CHRISTIAN MURPHY"}, "num_reviewers": 70, "id": "27173-001-5320-CHRISTIAN-MURPHY"}]