{"coursehistories": {"path": "/coursehistories/745"}, "description": "MGMT 230 integrates the material introduced in business fundamental courses andapplies it to the design and evaluation of new ventures. The purpose of this course is to explore the many dimensions of new venture creation and growth and to foster innovation and new business formations in independent and corporate settings. The course addresses both a theoretical perspective on venture initiation and the application of writing an actual business plan. \n\n", "semester": "2009C", "name": "ENTREPRENEURSHIP", "reviews": {"path": "/courses/17689/reviews", "values": [{"ratings": {"rAmountLearned": "3.35", "rDifficulty": "2.57", "rStimulateInterest": "3.57", "rRecommendMajor": "3.70", "rCourseQuality": "3.45", "rWorkRequired": "2.76", "rInstructorAccess": "3.32", "rReadingsValue": "3.27", "rRecommendNonMajor": "3.11", "rCommAbility": "3.56", "rInstructorQuality": "3.53"}, "section": {"name": "ENTREPRENEURSHIP", "sectionnum": "001", "primary_alias": "MGMT-230-001", "path": "/courses/17689/sections/001", "id": "17689-001", "aliases": ["MGMT-230-001"]}, "comments": "MGMT 230 integrates the material introduced in core courses and applies it to the design and evaluation of new ventures. The purpose of this course is to explore the many dimensions of new venture creation and growth and to foster innovation and new business formations in independent and corporate settings. The course addresses both a theoretical perspective on venture initiation and the application of writing an actual business plan. \r\n\r\nStudents said the material in this class was “very interesting and useful for the real world.” Furthermore, they said that lectures were entertaining and stimulating. Guest lecturers tended to add great value to the class. \r\n\r\nStudents commented that “Professor Dushnitsky is very knowledgeable, dynamic, and communicates the course material very well.” He is articulate and stimulating with the course material, though he does follow a rigid structure. \r\n\r\nStudents say that the class does require a lot of work (in terms of the business plan that must be developed) but that there is also a great amount of freedom. Students say that this is a great course for those with an entrepreneurial spirit. \r\n", "num_students": 41, "path": "/courses/17689/sections/001/reviews/2562-GERSON-DUSHNITSKY", "instructor": {"path": "/instructors/2562-GERSON-DUSHNITSKY", "first_name": "GERSON", "last_name": "DUSHNITSKY", "id": "2562-GERSON-DUSHNITSKY", "name": "GERSON DUSHNITSKY"}, "num_reviewers": 40, "id": "17689-001-2562-GERSON-DUSHNITSKY"}]}, "credits": null, "primary_alias": "MGMT-230", "path": "/courses/17689", "sections": {"path": "/courses/17689/sections", "values": [{"name": "ENTREPRENEURSHIP", "sectionnum": "001", "primary_alias": "MGMT-230-001", "path": "/courses/17689/sections/001", "id": "17689-001", "aliases": ["MGMT-230-001"]}]}, "id": 17689, "aliases": ["MGMT-230"]}