{"coursehistories": {"path": "/coursehistories/3790"}, "description": "Modern anthropology has developed in the face of colonial genocides, mass killing, torure, war, ethnic conflict and other extreme forms of violence and mass destruction of peoples. Yet, in spite of this hsitory, until recently anthropology has been relatively silent about the destructive events it has witnessed. In this course we will critically examine the processes that have been conceptually grouped together under the rubric of violence. The course is divided into three main parts. First, we will familiarize ourselves with how anthropology constructs an object like violence. Here we shall explore different ways in which scholars approach the subject of violence, such as symbolic, structural, and psychological violence. The primary focus of this cours, however, constituting the second part, concerns the forms of violence that are often grouped under the category of political violence. Political violence covers a broad range of phenomena, including terrorism, ethnic conflict, torutre, gender based violence, oppression, war, and genocide. In addition to looking at the anthropological studies of violence, here we will learn about the complexities of doing ethnography during the times of violent conflict, and the challenges that \"ethnographies of the war zone\" present to the field of anthropology. \n\nThe third part of the course looks at the emerging research on the post-conflict reconciliation. First, we will explore the relationship between the theoretical concept of reconcliation, and other related concepts such as social reconstruction, forgiveness, coexistence, and tolerance. then, we will read several case studies that focus on the special role of the International Community, education, youth, and gener in the processes of social reconstruction. We will complete our journey by discussing if and how anthropological and ethnographic writing can become a \"site of resistence,\" or a way to \"write against terror\" so that anthropology becomes an agent of social change. \n\n", "semester": "2007B", "name": "ANTH OF VIOLENC & RECONC", "reviews": {"path": "/courses/12537/reviews", "values": [{"ratings": {"rAmountLearned": "3.60", "rDifficulty": "2.80", "rStimulateInterest": "3.40", "rRecommendMajor": "3.60", "rCourseQuality": "3.60", "rWorkRequired": "3.00", "rInstructorAccess": "3.80", "rReadingsValue": "3.60", "rRecommendNonMajor": "3.20", "rCommAbility": "3.80", "rInstructorQuality": "4.00"}, "section": {"name": "ANTH OF VIOLENC & RECONC", "sectionnum": "920", "primary_alias": "ANTH-113-920", "path": "/courses/12537/sections/920", "id": "12537-920", "aliases": ["ANTH-113-920"]}, "comments": "", "num_students": 7, "path": "/courses/12537/sections/920/reviews/3809-AZRA-HROMADZIC", "instructor": {"path": "/instructors/3809-AZRA-HROMADZIC", "first_name": "AZRA", "last_name": "HROMADZIC", "id": "3809-AZRA-HROMADZIC", "name": "AZRA HROMADZIC"}, "num_reviewers": 5, "id": "12537-920-3809-AZRA-HROMADZIC"}]}, "credits": null, "primary_alias": "ANTH-113", "path": "/courses/12537", "sections": {"path": "/courses/12537/sections", "values": [{"name": "ANTH OF VIOLENC & RECONC", "sectionnum": "920", "primary_alias": "ANTH-113-920", "path": "/courses/12537/sections/920", "id": "12537-920", "aliases": ["ANTH-113-920"]}]}, "id": 12537, "aliases": ["ANTH-113"]}