{"coursehistories": {"path": "/coursehistories/3085"}, "description": "From the fall of the Roman Empire to Love Canal to the epidemics of asthma, childhood obesity and lead poisoning in West Philadelphia, the impact of the environment on health has been a continuous challenge to society. The environment can affect people's health more strongly than biological factors, medical care and lifestyle. The water we drink, the food we eat, the air we breathe, and the neighborhood we live in are all components of the environment that impact our health. Some estimates, based on morbidity and mortality statistics, indicate that the impact of the environment on health is as high as 80%. These impacts are particularly significant in urban areas like West Philadelphia. Over the last 20 years, the field of environmental health has matured and expanded to become one of the most comprehensive and humanly relevant disciplines in science. \n\nThis course will examine not only the toxicity of physical agents, but also the effects on human health of lifestyle, social and economic factors, and the built environment. Topics include cancer clusters, water borne diseases, radon and lung cancer, lead poisoning, environmental tobacco smoke, respiratory diseases and obesity. Students will research the health impacts of classic industrial pollution case studies in the US. Class discussions will also include risk communication, community outreach and education, access to health care and impact on vulnerable populations. Each student will have the opportunity to focus on Public Health, Environmental Protection, Public Policy, and Environmental Education issues as they discuss approaches to mitigating environmental health risks. \n\nThis honors seminar will consist of lectures, guest speakers, readings, student presentations, discussions, research, and community service. The students will have two small research assignments including an Environmental and Health Policy Analysis and an Industrial Pollution Case Study Analysis. Both assignments will include class presentations. The major research assignment for the course will be a problem-oriented research paper and presentation on a topic related to community-based environmental health selected by the student. In this paper, the student must also devise practical recommendations for the problem based on their research. \n\n", "semester": "2008A", "name": "COMM BASED ENVIR HEALTH: Community Based Environmental Health", "reviews": {"path": "/courses/20120/reviews", "values": [{"ratings": {"rAmountLearned": "3.13", "rDifficulty": "2.43", "rStimulateInterest": "3.50", "rRecommendMajor": "3.64", "rCourseQuality": "2.96", "rWorkRequired": "2.52", "rInstructorAccess": "3.82", "rReadingsValue": "2.50", "rRecommendNonMajor": "3.00", "rCommAbility": "3.48", "rInstructorQuality": "3.65"}, "section": {"name": "COMM BASED ENVIR HEALTH: Community Based Environmental Health", "sectionnum": "301", "primary_alias": "ENVS-406-301", "path": "/courses/20120/sections/301", "id": "20120-301", "aliases": ["ENVS-406-301"]}, "comments": "Community Based Environmental Health, an honors seminar offered in the spring, explored the effect of the environment on health.  The curriculum ranged from diverse topics such as household mold and second-hand smoke to cancer clusters and obesity.  The class was also an Academically-Based Community Service course that required community service in addition to class time.\r\n\r\nThe class involved a combination of lectures, guest speakers, readings, student presentations, discussions, research, and community service.  The students had two small research assignments with class presentations, including an Environmental and Health Policy Analysis and an Industrial Pollution Case Study Analysis, according to the course description. The major research assignment for the course was an environmental health topic of the student’s choosing, with recommendations for solving the problem based on the student’s research.\r\n\r\nStudents found the class to be fairly easy and extremely rewarding, providing “useful knowledge about the problems in the community and how to alleviate them.”  They especially enjoyed the “interesting” guest lecturers.  Students worked in groups and individually to research the environmental health topics.\r\n\r\nStudents thought Professor Pepino was “awesome,” “energetic,” and “inspiring.”  Several commented on his ability to stimulate interest in the subject matter.  As one student raved, “He really cares both about the subject matter and about his students.  One of the best teachers at Penn; take any course he offers even if you’re not interested.”  The only complaint was that Pepino was sometimes hard to get in touch with, or feedback was delayed.  Overall, however, he was rated highly for accessibility.  ", "num_students": 26, "path": "/courses/20120/sections/301/reviews/3292-RICHARD-PEPINO", "instructor": {"path": "/instructors/3292-RICHARD-PEPINO", "first_name": "RICHARD", "last_name": "PEPINO", "id": "3292-RICHARD-PEPINO", "name": "RICHARD PEPINO"}, "num_reviewers": 23, "id": "20120-301-3292-RICHARD-PEPINO"}]}, "credits": null, "primary_alias": "ENVS-406", "path": "/courses/20120", "sections": {"path": "/courses/20120/sections", "values": [{"name": "COMM BASED ENVIR HEALTH: Community Based Environmental Health", "sectionnum": "301", "primary_alias": "ENVS-406-301", "path": "/courses/20120/sections/301", "id": "20120-301", "aliases": ["ENVS-406-301"]}]}, "id": 20120, "aliases": ["ENVS-406"]}