[{"ratings": {"rAmountLearned": "3.92", "rDifficulty": "3.69", "rStimulateInterest": "3.77", "rRecommendMajor": "3.92", "rCourseQuality": "3.82", "rWorkRequired": "3.76", "rInstructorAccess": "3.84", "rReadingsValue": "3.28", "rRecommendNonMajor": "2.16", "rCommAbility": "3.92", "rInstructorQuality": "3.95"}, "section": {"name": "HUMAN ANATOMY & PHYSIOLOGY-PART B", "sectionnum": "001", "primary_alias": "NURS-132-001", "path": "/courses/20565/sections/001", "id": "20565-001", "aliases": ["NURS-132-001"]}, "comments": " NURS 132 is the second part of the Nursing School’s Anatomy and Physiology course, continued from NURS 131.  The goal of the course is to develop an understanding of the structure and function of the major organ systems of the human body.  The histology and gross anatomy of each organ system are studied in both the lecture and laboratory component of the course.  According to the course syllabus, emphasis is placed on the integration and function of the nervous and endocrine systems. \r\n\r\n      A student recalled of the class, “I cannot express how valuable this class is and how much I thoroughly enjoyed it.”  Many students commented on the positive experience of a trip to the cadaver lab.  Most agreed that Dr. Scanga’s exams were fair but difficult.  \r\n\r\n      From student responses, Dr. Scanga is a great resource and prepared to explain both the breadth and depth of information presented in the course.  Repeatedly, students described Dr. Scanga as passionate about Anatomy and Physiology.  One student called Dr. Scanga, “an absolutely fantastic instructor.”  Exams are returned quickly, a factor students seemed to appreciate.  Overall, there was no dissent to the description of Dr. Scanga as engaged and committed to her students and Anatomy and Physiology.\r\n\r\n      One student reported that the course was, “very challenging.”  Another student summed up the N132 experience as, “incredibly difficult, but of extremely high quality.”  Students that succeeded spent a great deal of time studying the course material.  The course is intense but a necessary and useful preparation for a career in healthcare. ", "num_students": 100, "path": "/courses/20565/sections/001/reviews/1637-CONNIE-B--SCANGA", "instructor": {"path": "/instructors/1637-CONNIE-B--SCANGA", "first_name": "CONNIE B.", "last_name": "SCANGA", "id": "1637-CONNIE-B--SCANGA", "name": "CONNIE B. SCANGA"}, "num_reviewers": 86, "id": "20565-001-1637-CONNIE-B--SCANGA"}]