{"coursehistories": {"path": "/coursehistories/4546"}, "description": "Is there a natural-born killer? What makes a successful psychopath? And is it morally wrong for us to punish those who are biologically-wired for a life of crime? This course argues that answers to these inscrutable questions will ultimately be found in an interdisciplinary perspective that examines the interface between the social, clinical, and neuro-sciences. We will explore new biosocial treatments for violence, and analyze the controversial nueroethical, legal, and philosophical issues surrounding neurocriminology. The course presents perspectives from fields of psychology, nuerobiology, sociology, neurochemistry, anthropology, law, neuroanatomy, cinema, public health, neuroendocrinology, criminology forensics, pediatrics, and psychiatry. Only by integrating knowledge from multiple domains will we fully understand, predict, and prevent future criminal behavior. \n\n", "semester": "2010C", "name": "BIOSOCIAL CRIMINOLOGY", "reviews": {"path": "/courses/22887/reviews", "values": [{"ratings": {"rAmountLearned": "3.27", "rDifficulty": "2.34", "rStimulateInterest": "3.54", "rRecommendMajor": "3.79", "rCourseQuality": "3.35", "rWorkRequired": "2.22", "rInstructorAccess": "3.43", "rReadingsValue": "2.99", "rRecommendNonMajor": "3.26", "rCommAbility": "3.60", "rInstructorQuality": "3.65"}, "section": {"name": "BIOSOCIAL CRIMINOLOGY", "sectionnum": "001", "primary_alias": "CRIM-370-001", "path": "/courses/22887/sections/001", "id": "22887-001", "aliases": ["CRIM-370-001"]}, "comments": "CRIM370 is an interdisciplinary course, linking psychology, genetics, and criminology into the study of criminal behavior. The course emphasizes the biosocial treatments for violent behavior and the neuroethical, legal, and philosophical controversies pertaining to the study of neurocriminology. Biosocial Criminology is aimed at exploring and understanding the detection, treatment, and prevention of psychopathic violent behavior.\r\n\r\nStudents almost unanimously reported that they learned a lot from this class. Many students reported that this class has been one of their favorite classes at Penn. In particular, students found that in-class debates, a field trip, and Professor Raine’s slides and teaching style allowed them to learn a great deal of material in this course.\r\n\r\nStudents almost unanimously reported that Professor Raine is an interesting, engaging, and knowledgeable lecturer. Students have described him as “entertaining” and “brilliant”, as well as very accessible outside of the classroom. Despite the 3-hour duration of the class, Professor Raine is able to maintain his students’ attention. Additionally, Professor Raine is a leader in his field of research, and his passion and expertise were said to be very apparent in his lectures.\r\n\r\nAlthough students have recommended this course for non-majors as well as majors, a few have stated that they found some of the biology and psychology covered in the course inaccessible because they had never taken biology or psychology before. Additionally, a few students reported that the class workload during finals week was quite overwhelming because Professor Raine assigned both a final paper and a final exam.\r\n", "num_students": 86, "path": "/courses/22887/sections/001/reviews/4771-ADRIAN-RAINE", "instructor": {"path": "/instructors/4771-ADRIAN-RAINE", "first_name": "ADRIAN", "last_name": "RAINE", "id": "4771-ADRIAN-RAINE", "name": "ADRIAN RAINE"}, "num_reviewers": 74, "id": "22887-001-4771-ADRIAN-RAINE"}]}, "credits": null, "primary_alias": "CRIM-370", "path": "/courses/22887", "sections": {"path": "/courses/22887/sections", "values": [{"name": "BIOSOCIAL CRIMINOLOGY", "sectionnum": "001", "primary_alias": "CRIM-370-001", "path": "/courses/22887/sections/001", "id": "22887-001", "aliases": ["CRIM-370-001"]}]}, "id": 22887, "aliases": ["CRIM-370"]}