{"coursehistories": {"path": "/coursehistories/3850"}, "description": "Modern AI uses a collection of techniques from a number of fields in the design intelligent systems:probability, statistics, logic, operations research, optim and economics, to name a few. This course covers basic modeling and algorithms from these fields underlying current research and highlights their application computer vision, robotics, and natural language processing. \n\n", "semester": "2012A", "name": "FUNDAMENTALS OF AI", "reviews": {"path": "/courses/27170/reviews", "values": [{"ratings": {"rAmountLearned": "2.84", "rDifficulty": "2.82", "rStimulateInterest": "3.00", "rRecommendMajor": "2.88", "rCourseQuality": "2.54", "rWorkRequired": "2.94", "rInstructorAccess": "2.97", "rReadingsValue": "2.81", "rRecommendNonMajor": "1.77", "rCommAbility": "2.87", "rInstructorQuality": "2.92"}, "section": {"name": "FUNDAMENTALS OF AI", "sectionnum": "001", "primary_alias": "CIS-521-001", "path": "/courses/27170/sections/001", "id": "27170-001", "aliases": ["CIS-521-001"]}, "comments": "Prerequisite(s): Students are expected to have the following background: Basic algorithms, data structures and complexity (dynamic programming, queues, stacks, graphs, big-O, P/NP; Basic probability and statistics (random variables, standard distributions, simple regression); Basic linear algebra (matrices, vectors, norms, inverses); Reasonable programming skills. Modern AI uses a collection of techniques from a number of fields in the design intelligent systems: probability, statistics, logic, operations research, optim and economics, to name a few.  This course covers basic modeling and algorithms from these fields underlying current research and highlights their application computer vision, robotics, and natural language processing.\r\n\r\nStudents generally thought that the class material was fairly interesting, and that they learned a good deal in the course. However, they were less enthusiastic about course organization; one student noted that the TAs released “programming assignments the night before their due date, which is somewhat unheard of.” The exams for the class were entirely multiple choice, which one student thought was highly unusual for a 500 level CIS class.\r\n\r\nOne student remarked that Dr. Ungar was “great at communicating with us the ideas and principles of the subject.”\r\n\r\nThis a graduate course in CIS, and was recommended for majors. Although many students were unfamiliar with Python, the language was not thoroughly explained in lecture before the homework, which greatly increased the workload.\r\n", "num_students": 45, "path": "/courses/27170/sections/001/reviews/2085-LYLE-H-UNGAR", "instructor": {"path": "/instructors/2085-LYLE-H-UNGAR", "first_name": "LYLE H", "last_name": "UNGAR", "id": "2085-LYLE-H-UNGAR", "name": "LYLE H UNGAR"}, "num_reviewers": 38, "id": "27170-001-2085-LYLE-H-UNGAR"}]}, "credits": null, "primary_alias": "CIS-521", "path": "/courses/27170", "sections": {"path": "/courses/27170/sections", "values": [{"name": "FUNDAMENTALS OF AI", "sectionnum": "001", "primary_alias": "CIS-521-001", "path": "/courses/27170/sections/001", "id": "27170-001", "aliases": ["CIS-521-001"]}]}, "id": 27170, "aliases": ["CIS-521"]}