[{"ratings": {"rAmountLearned": "2.72", "rDifficulty": "1.44", "rStimulateInterest": "3.25", "rRecommendMajor": "3.56", "rCourseQuality": "3.18", "rWorkRequired": "1.48", "rInstructorAccess": "3.13", "rReadingsValue": "2.71", "rRecommendNonMajor": "3.36", "rCommAbility": "3.09", "rInstructorQuality": "3.24"}, "section": {"name": "NEGOTIATIONS", "sectionnum": "401", "primary_alias": "OPIM-291-401", "path": "/courses/27960/sections/401", "id": "27960-401", "aliases": ["OPIM-291-401", "LGST-206-401"]}, "comments": "Negotiation is the art and the science of creating good agreements. This course develops managerial negotiation skills by mixing lectures and practice, using cases and exercises in which students negotiate with each other. The cases cover a wide range of problems and settings: one-shot deals between individuals, repeated negotiations, negotiations over several issues, negotiations among several parties (both within and between organizations), and cross-cultural issues. Performance in the cases accounts for nearly half the course grade. Students must also describe their experience and thoughts in a journal and write a term paper.\r\n\r\nOverall, this course was described as “genuinely useful” and helpful. This course allowed students to practice negotiating in class and helped them explored different negotiation skills. Students said they were able to receive truly hand-on experience in “understanding human emotions and manipulations.” Many students enjoyed the atmosphere of this course. \r\n\r\nThe majority of students had nothing but high regards for Professor Kimbrough. Many students described Professor Kimbrough as “intelligent,” “friendly,” and with “a lot of previous experience.” Students also said Professor Kimbrough was able to “explain concepts clearly and in an engaging way.”\r\n\r\nThere are no prerequisites of this course. However, students had much complaint about the grading policy of this course. Specifically, class discussion and negotiations comprised 40% of the grade, while students felt they received few opportunities to interact and familiarize themselves with fellow students. Some students also suggested that the grading policy potentially undermined the goal of this course and encouraged competition instead of cooperation.\r\n", "num_students": 36, "path": "/courses/27960/sections/401/reviews/931-STEVEN-O-KIMBROUGH", "instructor": {"path": "/instructors/931-STEVEN-O-KIMBROUGH", "first_name": "STEVEN O", "last_name": "KIMBROUGH", "id": "931-STEVEN-O-KIMBROUGH", "name": "STEVEN O KIMBROUGH"}, "num_reviewers": 36, "id": "27960-401-931-STEVEN-O-KIMBROUGH"}, {"ratings": {"rAmountLearned": "3.50", "rDifficulty": "2.10", "rStimulateInterest": "3.50", "rRecommendMajor": "3.40", "rCourseQuality": "3.20", "rWorkRequired": "2.25", "rInstructorAccess": "3.45", "rReadingsValue": "2.90", "rRecommendNonMajor": "3.25", "rCommAbility": "3.45", "rInstructorQuality": "3.52"}, "section": {"name": "NEGOTIATIONS", "sectionnum": "402", "primary_alias": "OPIM-291-402", "path": "/courses/27960/sections/402", "id": "27960-402", "aliases": ["OPIM-291-402", "LGST-206-402"]}, "comments": "", "num_students": 26, "path": "/courses/27960/sections/402/reviews/5505-JULIA-MINSON", "instructor": {"path": "/instructors/5505-JULIA-MINSON", "first_name": "JULIA", "last_name": "MINSON", "id": "5505-JULIA-MINSON", "name": "JULIA MINSON"}, "num_reviewers": 22, "id": "27960-402-5505-JULIA-MINSON"}]