{"coursehistories": {"path": "/coursehistories/3460"}, "description": "In this course we will examine the ways in which one of the world's most ancient and longest lasting civilizations was governed. Egypt is renowned for the ubiquitous images of its Pharaohs: divine kings who ruled Egypt under the divine sanction of the gods. The king was only the top of a vast pyramid of powerful officials which included viziers, treasurers, military leaders, local governors, town mayors and scribes. The course aims to investigate the ways in which the rulership of Egypt worked: from the highest levels of royal power down to the running of towns and villages. \n\nIn the first part of the course we will explore the nature of the Pharaoh and his role as the supreme political and religious leader in the country. We will continue by looking at the activities of the royal family and central government working our way into an examination of how Egypt's provinces were run by local noble families (the \"nomarchs\"-who could often become as powerful as the king himself). At a lower level, but perhaps more important in the daily lives of most ancient Egyptians, we will look at the administration of cities, towns and villages by local headmen and mayors. Other topics we will delve into will include the role of the temples; crime and punishment; the military; the lifestyles of Egypt's rich and powerful, as well as the ways in which Egypt's rulers could be rapidly altered through revolution, coups and assassinations. Our ultimate goal will be an appreciation of both the successes and failures of the lords of the Nile in ruling their country over the remarkable time span of 3000 years. \n\n", "semester": "2006C", "name": "LORDS OF THE NILE", "reviews": {"path": "/courses/9281/reviews", "values": [{"ratings": {"rAmountLearned": "2.21", "rDifficulty": "1.79", "rStimulateInterest": "1.64", "rRecommendMajor": "2.93", "rCourseQuality": "2.00", "rWorkRequired": "1.93", "rInstructorAccess": "2.93", "rReadingsValue": "2.07", "rRecommendNonMajor": "1.71", "rCommAbility": "2.71", "rInstructorQuality": "2.50"}, "section": {"name": "LORDS OF THE NILE", "sectionnum": "301", "primary_alias": "NELC-066-301", "path": "/courses/9281/sections/301", "id": "9281-301", "aliases": ["NELC-066-301"]}, "comments": "", "num_students": 15, "path": "/courses/9281/sections/301/reviews/76-JOSEF-W-WEGNER", "instructor": {"path": "/instructors/76-JOSEF-W-WEGNER", "first_name": "JOSEF W", "last_name": "WEGNER", "id": "76-JOSEF-W-WEGNER", "name": "JOSEF W WEGNER"}, "num_reviewers": 14, "id": "9281-301-76-JOSEF-W-WEGNER"}]}, "credits": null, "primary_alias": "NELC-066", "path": "/courses/9281", "sections": {"path": "/courses/9281/sections", "values": [{"name": "LORDS OF THE NILE", "sectionnum": "301", "primary_alias": "NELC-066-301", "path": "/courses/9281/sections/301", "id": "9281-301", "aliases": ["NELC-066-301"]}]}, "id": 9281, "aliases": ["NELC-066"]}