[{"ratings": {"rAmountLearned": "2.87", "rDifficulty": "1.35", "rStimulateInterest": "3.43", "rRecommendMajor": "3.22", "rCourseQuality": "3.04", "rWorkRequired": "1.74", "rInstructorAccess": "3.70", "rReadingsValue": "2.74", "rRecommendNonMajor": "3.35", "rCommAbility": "3.13", "rInstructorQuality": "3.35"}, "section": {"name": "INTRO.POSITIVE PSYCH.", "sectionnum": "601", "primary_alias": "PSYC-166-601", "path": "/courses/23704/sections/601", "id": "23704-601", "aliases": ["PSYC-166-601"]}, "comments": "This course introduces the study of positive psychology. Topics include positive emotions, positive character traits, and positive institutions, with emphasis placed on describing these aspects of positive psychology and how they can be applied to both individuals and communities.\r\n\r\nStudents found the course content both challenging and rewarding. Some students praised the “engaging material” and “stimulating discussion” of the course. Others noted that the course encouraged introspection and that “you learn a lot about yourself through this class.” Students seemed content with the course material and readings, and several noted how lessons learned in class could be applied to daily life.\r\n\r\nStudents praised Professor Doshi’s presence in the classroom. Many students described professor Doshi as “a fantastic instructor,” who proved “approachable, friendly, [and] encouraging.” Students lauded the small setting which allowed Professor Doshi to ensure that “every student gets involved.”\r\n\r\nStudents described feeling like they had “gained personal insights” from the course. Many described the course as “very challenging” but “worthwhile.”\r\n", "num_students": 30, "path": "/courses/23704/sections/601/reviews/3875-KINJAL-DOSHI", "instructor": {"path": "/instructors/3875-KINJAL-DOSHI", "first_name": "KINJAL", "last_name": "DOSHI", "id": "3875-KINJAL-DOSHI", "name": "KINJAL DOSHI"}, "num_reviewers": 26, "id": "23704-601-3875-KINJAL-DOSHI"}]