[{"ratings": {"rAmountLearned": "3.43", "rDifficulty": "2.53", "rStimulateInterest": "3.50", "rRecommendMajor": "3.41", "rCourseQuality": "3.19", "rWorkRequired": "2.53", "rInstructorAccess": "3.47", "rReadingsValue": "3.17", "rRecommendNonMajor": "3.07", "rCommAbility": "3.23", "rInstructorQuality": "3.61"}, "section": {"name": "QUANTITATIVE METHODS I", "sectionnum": "001", "primary_alias": "SOCI-535-001", "path": "/courses/25127/sections/001", "id": "25127-001", "aliases": ["SOCI-535-001", "DEMG-535-001"]}, "comments": "Sociology 535 is an introduction to the practice of statistics in social and behavioral sciences. It is open to beginning graduate students and--with the permission of the instructor--advanced undergraduates. Topics covered include the description of social science data, in graphical and non-graphical form; correlation and other forms of association, including cross-tabulation; bivariate regression; an introduction to probability theory; the logic of sampling; the logic of statistical inference and significance tests. There is a lecture twice weekly and a mandatory \"lab.\"\r\n\r\nNearly all students enjoyed the content of the class. They appreciated the fact that they were pushed to “get beyond thinking about statistics as number crunching.” Students appreciated the relevant examples emphasized in class. The material was deemed to be generally interesting, especially its emphasis on real-world examples. \r\n\r\nStudents raved about Professor Smith’s ability to make difficult material “accessible, interesting, and useful.” Almost all students agreed that Professor Smith used a great approach in teaching the class. A majority of students praised Professor Smith’s enthusiastic nature and ability to engage with the students. \r\n\r\nStudents agreed that this is a great class as an “introduction and beyond” to statistics. The only prerequisite is basic algebra, and as such, it may be better suited towards those who prefer less quantitative classes. A few students mentioned the exams and material were difficult, however, the students agreed that Professor Smith made it not only easy to understand, but enjoyable. \r\n", "num_students": 33, "path": "/courses/25127/sections/001/reviews/2338-HERBERT-L-SMITH", "instructor": {"path": "/instructors/2338-HERBERT-L-SMITH", "first_name": "HERBERT L", "last_name": "SMITH", "id": "2338-HERBERT-L-SMITH", "name": "HERBERT L SMITH"}, "num_reviewers": 31, "id": "25127-001-2338-HERBERT-L-SMITH"}]