{"coursehistories": {"path": "/coursehistories/1701"}, "description": "This lecture course is designed to introduce the student to the functioning of the autonomic nervous system (ANS), which is critically involved in the maintenance of body homeostasis through regulation of behavior and physiology. The course will begin with a review of the basic anatomy and physiology of the ANS including the sympathetic, parasympathetic and enteric divisions. The mechanisms by which the ANS regulates peripheral tissues will be discussed, including reflex and regulatory functions, as will the effect of drugs which modulate ANS activity. The role of the ANS in regulating behavior will be addressed in the context of thirst, salt appetite and food intake. \n\n", "semester": "2011C", "name": "AUTONOMIC PHYSIOLOGY", "reviews": {"path": "/courses/24048/reviews", "values": [{"ratings": {"rAmountLearned": "3.42", "rDifficulty": "3.33", "rStimulateInterest": "3.47", "rRecommendMajor": "3.57", "rCourseQuality": "3.24", "rWorkRequired": "3.11", "rInstructorAccess": "3.31", "rReadingsValue": "1.93", "rRecommendNonMajor": "1.91", "rCommAbility": "3.64", "rInstructorQuality": "3.58"}, "section": {"name": "AUTONOMIC PHYSIOLOGY", "sectionnum": "001", "primary_alias": "BIBB-269-001", "path": "/courses/24048/sections/001", "id": "24048-001", "aliases": ["BIBB-269-001"]}, "comments": "This lecture course is designed to introduce the student to the functioning of the\r\nautonomic nervous system (ANS), which is critically involved in the maintenance of\r\nbody homeostasis through regulation of behavior and physiology. The course begins with\r\na review of the basic anatomy and physiology of the ANS including the sympathetic,\r\nparasympathetic and enteric divisions. The mechanisms by which the ANS regulates\r\nperipheral tissues are discussed, including reflex and regulatory functions, as are the\r\neffect of drugs, which modulate ANS activity. The role of the ANS in regulating behavior\r\nis addressed in the context of thirst, salt appetite and food intake.\r\nStudents reported that they “learned a lot from the course” and that the material\r\nwas enjoyable. Students also wrote that BIBB 269 was one of their favorite courses at\r\nPenn.\r\nStudents really liked Professor Heerding, describing her as an “excellent\r\nprofessor” who explained things very well. She was very engaging and was able to “tie\r\nin stories about patients, studies, and specific drugs” very effectively. One student did\r\nmention that Professor Heerding was not easily accessible outside of class; although,\r\nanother wrote that Heerding was the best professor he has had at Penn.\r\nWhile students spoke favorably of the material, the course involved “a lot of\r\ninformation and required a lot of time to memorize.” One student also mentioned that\r\nexams could be “confusing” and “tricky.” Another suggested that it is “great for pre-med\r\nstudents to take this class, but probably not otherwise.”\r\n*Only eight students submitted reviews for this course.", "num_students": 57, "path": "/courses/24048/sections/001/reviews/1799-JENNIFER-N--HEERDING", "instructor": {"path": "/instructors/1799-JENNIFER-N--HEERDING", "first_name": "JENNIFER N.", "last_name": "HEERDING", "id": "1799-JENNIFER-N--HEERDING", "name": "JENNIFER N. HEERDING"}, "num_reviewers": 53, "id": "24048-001-1799-JENNIFER-N--HEERDING"}]}, "credits": null, "primary_alias": "BIBB-269", "path": "/courses/24048", "sections": {"path": "/courses/24048/sections", "values": [{"name": "AUTONOMIC PHYSIOLOGY", "sectionnum": "001", "primary_alias": "BIBB-269-001", "path": "/courses/24048/sections/001", "id": "24048-001", "aliases": ["BIBB-269-001"]}]}, "id": 24048, "aliases": ["BIBB-269"]}