[{"ratings": {"rAmountLearned": "3.11", "rDifficulty": "3.02", "rStimulateInterest": "3.51", "rRecommendMajor": "3.67", "rCourseQuality": "3.07", "rWorkRequired": "3.02", "rInstructorAccess": "3.47", "rReadingsValue": "2.31", "rRecommendNonMajor": "1.84", "rCommAbility": "3.44", "rInstructorQuality": "3.53"}, "section": {"name": "ENG MECHANICS: DYNAMICS", "sectionnum": "001", "primary_alias": "MEAM-211-001", "path": "/courses/27730/sections/001", "id": "27730-001", "aliases": ["MEAM-211-001"]}, "comments": "This course introduces the basic concepts in kinematics and dynamics that are necessary to understand, analyze and design mechanisms and machines. These concepts are also fundamental to the modeling and analysis of human movement, biomechanics, animation of synthetic human models and robotics. The topics covered include: Particle dynamics using energy and momentum methods of analysis; Dynamics of systems of particles; Impact; Systems of variable mass; Kinematics and dynamics of rigid bodies in plane motion; Computer-aided dynamic simulation and animation. This class uses both computer and physical examples to demonstrate dynamics phenomena. The textbook and MATLAB are both highly used in this class.  This class focused both on physical and computer examples to demonstrate dynamics phenomena.\r\n\r\nStudents reported learning a lot in this course, but said homework was time-consuming especially because of the required MATLAB assignments with each homework.\r\n\r\nThe professor received high marks as being an extremely helpful and accessible outside of class. One student even said “She is the best professor at Penn, although her midterms are tricky and long. I never finished any of them.”\r\n\r\nThis class is required for MEAM majors during their sophomore year, although all types of engineering majors can be found in this class. Workload was considered pretty heavy, especially with the MATLAB programming. Overall multiple students as “great” but “very difficult” considered the class.\r\nThis review is based off the 7 student comments that were submitted.\r\n", "num_students": 72, "path": "/courses/27730/sections/001/reviews/4016-KATHERINE-J--KUCHENBECKER", "instructor": {"path": "/instructors/4016-KATHERINE-J--KUCHENBECKER", "first_name": "KATHERINE J.", "last_name": "KUCHENBECKER", "id": "4016-KATHERINE-J--KUCHENBECKER", "name": "KATHERINE J. KUCHENBECKER"}, "num_reviewers": 59, "id": "27730-001-4016-KATHERINE-J--KUCHENBECKER"}]