{"coursehistories": {"path": "/coursehistories/526"}, "description": "The oceans cover over 2/3 of the Earth's surface. This course introduces basic oceanographic concepts such as plate tectonics, marine sediments, physical and chemical properties of seawater, ocean circulation, air-sea interactions, waves, tides, nutrient cycles in the ocean, biology of the oceans, and environmental issues related to the marine environment. \n\n", "semester": "2008A", "name": "Oceanography:  Oceans & Climate", "reviews": {"path": "/courses/20245/reviews", "values": [{"ratings": {"rAmountLearned": "2.71", "rDifficulty": "2.30", "rStimulateInterest": "2.64", "rRecommendMajor": "3.13", "rCourseQuality": "2.82", "rWorkRequired": "2.40", "rInstructorAccess": "2.40", "rReadingsValue": "2.24", "rRecommendNonMajor": "2.35", "rCommAbility": "3.14", "rInstructorQuality": "2.98"}, "section": {"name": "Oceanography:  Oceans & Climate", "sectionnum": "001", "primary_alias": "GEOL-130-001", "path": "/courses/20245/sections/001", "id": "20245-001", "aliases": ["GEOL-130-001"]}, "comments": "This course, designed for students of any background, serves as an introduction to oceanography, with an emphasis placed on the topic of global warming. Other major topics include marine geology, physical oceanography, marine chemistry and marine biology. Students learn about scientific concepts in the context of their applications.  After taking the course, students should be able to better interpret media reports and current events regarding the oceans. This course used Essentials of Oceanography as its primary text, and also used clickers during lecture.\r\n\r\nThis course fulfills the quantitative data analysis requirement for the College and sector requirements for different graduating classes (See the course registrar for your particular year). Although this course can be used to fulfill requirements in the Geology and Environmental Studies majors, it also accommodates students with nonscientific backgrounds. This course is generally offered in the spring.\r\n\r\nOverall, students found the course “interesting,” albeit heavy in terms of workload. Several students noted that the exams were hard, and one student commented that this class had the most amount of homework of all her classes. Many students would have liked more lab or hands-on experience, although the focus on current events made lectures compelling. Students had mixed reactions to the readings and assigned homework. Some thought that the homework from the textbook was the most important tool in learning the material, while others described the textbook as “pointless.” \r\n\r\nStudents found Professor Horton engaging and “informative.” His lectures were “fantastic” and did the material justice by spinning it towards current events. Although some commented that Horton was “sometimes hard to get a hold of,” Horton did lead one of the recitation sections. Overall, Students were happy with the professor’s lecturing style, though many had complaints about the grading and administrative aspects of the course.", "num_students": 75, "path": "/courses/20245/sections/001/reviews/2987-BENJAMIN-P--HORTON", "instructor": {"path": "/instructors/2987-BENJAMIN-P--HORTON", "first_name": "BENJAMIN P.", "last_name": "HORTON", "id": "2987-BENJAMIN-P--HORTON", "name": "BENJAMIN P. HORTON"}, "num_reviewers": 60, "id": "20245-001-2987-BENJAMIN-P--HORTON"}]}, "credits": null, "primary_alias": "GEOL-130", "path": "/courses/20245", "sections": {"path": "/courses/20245/sections", "values": [{"name": "Oceanography:  Oceans & Climate", "sectionnum": "001", "primary_alias": "GEOL-130-001", "path": "/courses/20245/sections/001", "id": "20245-001", "aliases": ["GEOL-130-001"]}]}, "id": 20245, "aliases": ["GEOL-130"]}