[{"ratings": {"rAmountLearned": "1.93", "rDifficulty": "1.98", "rStimulateInterest": "1.48", "rRecommendMajor": "2.59", "rCourseQuality": "1.77", "rWorkRequired": "1.73", "rInstructorAccess": "2.70", "rReadingsValue": "1.85", "rRecommendNonMajor": "1.41", "rCommAbility": "2.07", "rInstructorQuality": "2.05"}, "section": {"name": "HEALTH OF POPULATIONS: The Health of Populations", "sectionnum": "401", "primary_alias": "SOCI-111-401", "path": "/courses/23786/sections/401", "id": "23786-401", "aliases": ["SOCI-111-401", "HSOC-111-401"]}, "comments": "This course develops some of the major measures used to assess the health of populations and uses those measures to consider the major factors that determine levels of health in large aggregates. These factors include disease environment, medical technology, public health initiatives, and personal behaviors. The approach is comparative and historical and includes attention to differences in health levels among major social groups.\r\n\r\nStudents described this course as “excellent” and reported learning “a tremendous amount from it.” Most described the material as “very interesting,” but some students noted that the lectures were “redundant of the readings,” which made them “a little dull.” Students found assignments and lectures useful for “reinforcing concepts” and “capturing main ideas.”\r\n\r\nStudents heaped praise on Professor Kohler, describing him as an “exceptionally good teacher” with a strong understanding of the material he was teaching. Professor Kohler was further described as “enthusiastic” and “enjoyable.” Students also complimented his “sweet” and dedicated nature, noting that he genuinely wanted the class to do well and was “very approachable.” However, several students commented that his presentation of material was “rather dry” and “monotonous,” which made paying attention in class difficult at times.\r\n\r\nThis class was recommended to majors, but non-majors were warned that it was “quite difficult in the amount of quantitative analysis it required.” One student also commented that the course was “based on a lot of statistics, which was difficult for a course required for a humanities major.” Overall, however, the course was not very demanding in terms of coursework.\r\n", "num_students": 50, "path": "/courses/23786/sections/401/reviews/2337-HANS-PETER-KOHLER", "instructor": {"path": "/instructors/2337-HANS-PETER-KOHLER", "first_name": "HANS-PETER", "last_name": "KOHLER", "id": "2337-HANS-PETER-KOHLER", "name": "HANS-PETER KOHLER"}, "num_reviewers": 44, "id": "23786-401-2337-HANS-PETER-KOHLER"}]