{"coursehistories": {"path": "/coursehistories/772"}, "description": "The course is directed at the development of a background in basic physics required to understand the behavior of electrons in atoms, molecules and solids. Examples to illustrate the application of these techniques will be centered in the free and nearly free electron theory of solids. The application of modern physics to many state-of-the-art materials analysis techniques will be demonstrated throughout the course. \n\n", "semester": "2011C", "name": "QUANTUM PHYS OF MATLS", "reviews": {"path": "/courses/24800/reviews", "values": [{"ratings": {"rAmountLearned": "2.94", "rDifficulty": "3.09", "rStimulateInterest": "2.57", "rRecommendMajor": "3.49", "rCourseQuality": "2.68", "rWorkRequired": "2.63", "rInstructorAccess": "3.03", "rReadingsValue": "2.69", "rRecommendNonMajor": "1.77", "rCommAbility": "2.91", "rInstructorQuality": "3.03"}, "section": {"name": "QUANTUM PHYS OF MATLS", "sectionnum": "001", "primary_alias": "MSE-221-001", "path": "/courses/24800/sections/001", "id": "24800-001", "aliases": ["MSE-221-001"]}, "comments": "The course is directed at the development of a background in basic physics\r\nrequired to understand the behavior of electrons in atoms, molecules and solids.\r\nExamples to illustrate the application of these techniques are centered in the free and\r\nnearly free electron theory of solids. The application of modern physics to many state-ofthe-\r\nart materials analysis techniques are demonstrated throughout the course.\r\nStudents found the theory to be interesting and “definitely challenging.” There\r\nwas “too much material to cover” in one course, and “the lectures flew by too quickly”\r\nfor students to ask questions or even copy down material. The exams involved an\r\noverwhelming amount of “memorization and derivation,” which led to “blind\r\nmemorization of equations rather than a real understanding of concepts.”\r\nA good number of students felt that Professor Khantha was a good instructor, but\r\n“[moved] extremely fast through the material” due to the large number of concepts to\r\ncover. One student thought that her delivery of the lectures was “dry.”\r\nDue to the amount and difficult of material covered, this course had a substantial\r\nworkload.\r\n*This course review was written based on the 8 student comments received.", "num_students": 40, "path": "/courses/24800/sections/001/reviews/3392-MAHADEVAN-KHANTHA", "instructor": {"path": "/instructors/3392-MAHADEVAN-KHANTHA", "first_name": "MAHADEVAN", "last_name": "KHANTHA", "id": "3392-MAHADEVAN-KHANTHA", "name": "MAHADEVAN KHANTHA"}, "num_reviewers": 38, "id": "24800-001-3392-MAHADEVAN-KHANTHA"}]}, "credits": null, "primary_alias": "MSE-221", "path": "/courses/24800", "sections": {"path": "/courses/24800/sections", "values": [{"name": "QUANTUM PHYS OF MATLS", "sectionnum": "001", "primary_alias": "MSE-221-001", "path": "/courses/24800/sections/001", "id": "24800-001", "aliases": ["MSE-221-001"]}]}, "id": 24800, "aliases": ["MSE-221"]}