{"coursehistories": {"path": "/coursehistories/4192"}, "description": "How do you optimally encode a text file? How do you find shortest paths in a map? How do you desgin a communication network? How do you route data in a network? What are the limits of efficient computation? This course gives a comprehensive introduction to design and analysis of algorithms, and answers along the way to these and many other interesting computational questions. You will learn about problem-solving; advanced data structures such as universal hashing and red-black trees; advanced design and analysis techniques such as dynamic programming and amortized analysis; graph algorithms such as minimum spanning trees and network flos; NP-completeness theory; and approximation algorithms. \n\n", "semester": "2011A", "name": "INTRO TO ALGORITHMS", "reviews": {"path": "/courses/21452/reviews", "values": [{"ratings": {"rAmountLearned": "3.15", "rDifficulty": "3.76", "rStimulateInterest": "2.82", "rRecommendMajor": "3.57", "rCourseQuality": "2.90", "rWorkRequired": "3.21", "rInstructorAccess": "3.13", "rReadingsValue": "2.69", "rRecommendNonMajor": "1.32", "rCommAbility": "3.07", "rInstructorQuality": "3.26"}, "section": {"name": "INTRO TO ALGORITHMS", "sectionnum": "001", "primary_alias": "CIS-320-001", "path": "/courses/21452/sections/001", "id": "21452-001", "aliases": ["CIS-320-001"]}, "comments": "This course introduces the design and analysis of algorithms. Students explore many interesting computational questions, such as the following: How do we optimally encode a text file? How do we find shortest paths in a map? How do we design a communication network? How do we route data in a network? What are the limits of efficient computation? Students learn about problem-solving, advanced data structures such as universal hashing and red-black trees, advanced design and analysis techniques such as dynamic programming and amortized analysis, graph algorithms such as minimum spanning trees and network flows, NP-complet for the most part found this course to be “interesting,” “fantastic,” and very rewarding, as they “learned a lot.” For example, one student claimed that this course “made me a better problem solver and critical thinker.” Most of the students who enrolled in this class were very pleased with Professor Khanna’s teaching. He was “engaging” and “passionate about the material.” Professor Khanna was also regarded as being extremely knowledgeable not only about the course material, but also about the field of computer science in general. Some students, however, wished that Professor Khanna spent more time making sure that everyone in the class was fully understanding and keeping up with the material. &#8232;&#8232;Students generally considered this course to be very difficult and challenging, agreeing that it “requires a lot of study and homework time.” Exams given in this class were regarded as difficult and often required more time than was given. Prerequisites for this course are CIS 120, 121, 160, and 262.", "num_students": 93, "path": "/courses/21452/sections/001/reviews/305-SANJEEV-KHANNA", "instructor": {"path": "/instructors/305-SANJEEV-KHANNA", "first_name": "SANJEEV", "last_name": "KHANNA", "id": "305-SANJEEV-KHANNA", "name": "SANJEEV KHANNA"}, "num_reviewers": 86, "id": "21452-001-305-SANJEEV-KHANNA"}]}, "credits": null, "primary_alias": "CIS-320", "path": "/courses/21452", "sections": {"path": "/courses/21452/sections", "values": [{"name": "INTRO TO ALGORITHMS", "sectionnum": "001", "primary_alias": "CIS-320-001", "path": "/courses/21452/sections/001", "id": "21452-001", "aliases": ["CIS-320-001"]}]}, "id": 21452, "aliases": ["CIS-320"]}