{"coursehistories": {"path": "/coursehistories/4381"}, "description": "This course explores some crucial foundational issues of contemporary social science. It focuses on various types of explanation, the construction of social models, and their validation. Specific topics will include: 1. Rational choice models (including game-theoretic ones) and alternative models of bounded rationality; 2. Experimental models in economics and psychology and whether they present a radical departure from traditional economic models; 3. Evolutionary models of the emergence of institutions, and agent-based simulations of such dynamics. In particular, we will explore theoretical and empirical models of trust, reciprocity, cooperation and fairness, asking what motivates individuals to engage in pro-social behavior and how such behavior can emerge and persist. This course will cover some of the material presented in other Core courses, with particular attention to foundational and explanatory issues that are not usually discussed in a typical social science course. \n\n", "semester": "2010A", "name": "PHIL OF SOCIAL SCIENCE", "reviews": {"path": "/courses/26604/reviews", "values": [{"ratings": {"rAmountLearned": "2.38", "rDifficulty": "2.83", "rStimulateInterest": "2.58", "rRecommendMajor": "2.67", "rCourseQuality": "2.17", "rWorkRequired": "2.69", "rInstructorAccess": "2.96", "rReadingsValue": "2.44", "rRecommendNonMajor": "1.15", "rCommAbility": "2.87", "rInstructorQuality": "2.78"}, "section": {"name": "PHIL OF SOCIAL SCIENCE", "sectionnum": "401", "primary_alias": "PHIL-228-401", "path": "/courses/26604/sections/401", "id": "26604-401", "aliases": ["PHIL-228-401", "PPE-204-401"]}, "comments": "This course was about the foundations of contemporary social science. It focused on the nature of social systems, the similarities and differences between social and natural sciences, the construction, analysis, and confirmation of social theories, and the nature of social explanations. Students were expected to construct and analyze simple computational models of social phenomena. Prerequisites for this class includes PHIL 008 or PPE 008, ECON 001, and one other social science course.\r\n\r\nStudents found the course material to be “relevant for a PPE major.” While the subject material was very dense, the lectures were “informative, yet fast-paced.” Students showed some concern about the grading system of the course. Many students found that the format of the test failed to display their understanding of the material. Although students thought grading was “sometimes subjective,” they were not given “feedback or opportunities to improve.”\r\n\r\nProfessor Weisberg, according to students, is “very passionate and does an excellent job conveying the material.” He was very engaging in lectures, and “available for help outside of the classroom.\r\n\r\nStudents stated that the course “requires a real commitment from the student.” There were a lot of dense assigned readings, and some found them to be irrelevant to the course material sometimes. “Because students are held to a very high standard in class evaluation,” students did not recommend this class to non-major students.", "num_students": 64, "path": "/courses/26604/sections/401/reviews/2302-MICHAEL-WEISBERG", "instructor": {"path": "/instructors/2302-MICHAEL-WEISBERG", "first_name": "MICHAEL", "last_name": "WEISBERG", "id": "2302-MICHAEL-WEISBERG", "name": "MICHAEL WEISBERG"}, "num_reviewers": 62, "id": "26604-401-2302-MICHAEL-WEISBERG"}]}, "credits": null, "primary_alias": "PHIL-228", "path": "/courses/26604", "sections": {"path": "/courses/26604/sections", "values": [{"name": "PHIL OF SOCIAL SCIENCE", "sectionnum": "401", "primary_alias": "PHIL-228-401", "path": "/courses/26604/sections/401", "id": "26604-401", "aliases": ["PHIL-228-401", "PPE-204-401"]}]}, "id": 26604, "aliases": ["PHIL-228", "PPE-204"]}