[{"ratings": {"rAmountLearned": "2.45", "rDifficulty": "2.60", "rStimulateInterest": "2.29", "rRecommendMajor": "3.08", "rCourseQuality": "2.30", "rWorkRequired": "2.42", "rInstructorAccess": "2.28", "rReadingsValue": "2.55", "rRecommendNonMajor": "1.99", "rCommAbility": "2.38", "rInstructorQuality": "2.33"}, "section": {"name": "Personality and Individual Differences", "sectionnum": "001", "primary_alias": "PSYC-160-001", "path": "/courses/25032/sections/001", "id": "25032-001", "aliases": ["PSYC-160-001"]}, "comments": "\r\nPsychology 160 explores the psychology of personality and individual differences with respect to the question, “how are people different from each other?” The course will explore this issue from a multidimensional approach integrating biological, cognitive-experimental, and social-cultural influences on differences between individuals. \r\n\r\nMany students considered the material covered in this course “interesting,” but occasionally “dry” and “repetitive.” Several students praised the course for being well designed and organized. \r\n\r\nMost students considered Professor Kable “incredibly kind and knowledgeable.” Several students, however, noted that his lectures occasionally bordered on “boring.” Nevertheless, many students appreciated Professor Kable’s attempts to “explain topics in a variety of different ways” and that Professor Kable was consistently “accessible and approachable for any questions.”\r\n\r\nThis class may fulfill part of the Individual and Group Bases of Behavior requirement for Psychology majors. Many students in this course found the exams and papers “challenging.” Several students indicated that this course includes many assignments for an introductory lecture course, but thought that these assignments helped their grades. The only prerequisite is PSYC 001. \r\n", "num_students": 101, "path": "/courses/25032/sections/001/reviews/4548-JOSEPH-W--KABLE", "instructor": {"path": "/instructors/4548-JOSEPH-W--KABLE", "first_name": "JOSEPH W.", "last_name": "KABLE", "id": "4548-JOSEPH-W--KABLE", "name": "JOSEPH W. KABLE"}, "num_reviewers": 84, "id": "25032-001-4548-JOSEPH-W--KABLE"}]