{"coursehistories": {"path": "/coursehistories/2551"}, "description": "Model Building and Linear Programming: Graphical Methods and The Simplex Method, the LINDO and LINGO Computer Packages, Degeneracies, Minimization and the BigM and the Two-Phase Methods, and Goal Programming. Sensitivity Analysis: Geometric and Algebraic Approaches, The Computer and Sensitivity Analysis, The Dual of An LP Problem, The Dual Theorem, Shadow Prices, Complementary Slackness, The Dual Simplex Method, and The Revised Simplex Method. Integer Programming: The Branch and Bound Method, Enumeration Methods, and the Cutting Plane Method. Nonlinear Programming: Review of Differential Calculus, Convex and Concave Functions, Solving NLP Problems with One Variable, Uncontraint Nonlinear Optimization with Several Variables, Lagrange Multipliers and Constraint Nonlinear Optimization with Several Variables, The Kuhn-Tucker Conditions and Quadratic Programming. \n\n", "semester": "2012A", "name": "OPTIMIZATION OF SYSTEMS", "reviews": {"path": "/courses/27364/reviews", "values": [{"ratings": {"rAmountLearned": "2.72", "rDifficulty": "2.22", "rStimulateInterest": "1.17", "rRecommendMajor": "3.04", "rCourseQuality": "2.33", "rWorkRequired": "2.28", "rInstructorAccess": "2.73", "rReadingsValue": "2.78", "rRecommendNonMajor": "1.31", "rCommAbility": "2.30", "rInstructorQuality": "2.40"}, "section": {"name": "OPTIMIZATION OF SYSTEMS", "sectionnum": "001", "primary_alias": "ESE-304-001", "path": "/courses/27364/sections/001", "id": "27364-001", "aliases": ["ESE-304-001"]}, "comments": "This class covers model building and linear programming: graphical methods and\r\nthe simplex method, the LINDO and LINGO computer packages, degeneracies,\r\nminimization and the BigM and the two-phase methods, and goal programming.\r\nSensitivity analysis: geometric and algebraic approaches, the computer and sensitivity\r\nanalysis, the dual of an LP problem, the dual theorem, shadow prices, complementary\r\nslackness, the dual simplex method, and the revised Simplex method. Integer\r\nProgramming: the branch and bound method, enumeration methods, and the cutting plane\r\nmethod. Nonlinear programming: review of differential calculus, convex and concave\r\nfunctions, solving NLP problems with one variable, unconstraint nonlinear optimization\r\nwith several variables, Lagrange multipliers and constraint nonlinear optimization with\r\nseveral variables, the Kuhn-Tucker conditions and quadratic programming.\r\nThis course was thought to be an interesting course overall. Students thought that\r\n\"the course was useful … I learned a lot about how to formulate and solve problems.\"\r\nOne student surmised that the \"course material is a bit dry, but straightforward and easy\r\nto grasp when enough effort is put in.\"\r\nNot much was said about the professor except that the notes he gave to the class\r\nwere re-written notes from the Handbook. His notes were more confusing than the\r\nHandbook, which was very well-written and very good. Therefore, some students felt\r\nthat they did not need to attend class and get the notes, as long as you learned from the\r\nHandbook. It was useful that the professor laid out everything for the course beforehand.\r\nHomework sets and quizzes were given in this class. The homework was a good\r\ndepiction of the exam questions and the quizzes was not relevant to the material from the\r\nhomework set. The Handbook for the class is thought to be an excellent guide for this\r\ncourse.", "num_students": 44, "path": "/courses/27364/sections/001/reviews/774-MICHAEL-A--CARCHIDI", "instructor": {"path": "/instructors/774-MICHAEL-A--CARCHIDI", "first_name": "MICHAEL A.", "last_name": "CARCHIDI", "id": "774-MICHAEL-A--CARCHIDI", "name": "MICHAEL A. CARCHIDI"}, "num_reviewers": 41, "id": "27364-001-774-MICHAEL-A--CARCHIDI"}]}, "credits": null, "primary_alias": "ESE-304", "path": "/courses/27364", "sections": {"path": "/courses/27364/sections", "values": [{"name": "OPTIMIZATION OF SYSTEMS", "sectionnum": "001", "primary_alias": "ESE-304-001", "path": "/courses/27364/sections/001", "id": "27364-001", "aliases": ["ESE-304-001"]}]}, "id": 27364, "aliases": ["ESE-304"]}