[{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "3.43", "rStimulateInterest": "3.36", "rRecommendMajor": "3.07", "rCourseQuality": "2.93", "rWorkRequired": "3.14", "rInstructorAccess": "3.07", "rReadingsValue": "2.69", "rRecommendNonMajor": "2.62", "rCommAbility": "2.86", "rInstructorQuality": "3.07"}, "section": {"name": "MONETARY ECONOMICS", "sectionnum": "001", "primary_alias": "FNCE-411-001", "path": "/courses/23096/sections/001", "id": "23096-001", "aliases": ["FNCE-411-001"]}, "comments": "The economy is the biggest driver of corporate performance, providing the context for a company’s key financial decisions. In this course on monetary economics, students learn how financial markets work and how government policies affect the business environment. The goal is to provide a unified framework for understanding macroeconomic events and policy, paying attention to the interdependence of business, banking institutions, government, and the public in determining the performance of the economy. While focused on the U.S. economy, international aspects such as trade and exchange rates are also considered. This course is appropriate for everyone who holds, or aspires to, a position where big-picture thinking and decision making is required. This course is for WPWP certificate students only. \r\n\r\nStudents found the course content to be “very relevant to one’s life.” Students reported learning a lot of practical and relevant material in this class, though all agreed that an excessive amount of material was covered. Required reading was often overwhelming, especially since lectures did not always correspond to outside reading material. Whereas one student found the class to be “one of the best courses I took at Wharton,” some complained that the class was unnecessary and a waste, as much of the learning was done with external sources outside of the classroom. \r\n\r\nStudents praised Professor Thomas as being “very knowledgeable” and an engaging lecturer. One student commented that Professor Thomas was “capable of communicating information in an excellent manner.” Since he included much outside information in his lectures, students appreciated that “the class wasn’t a class where the teacher reads out a textbook.” Students found Professor Thomas to be approachable and accessible for students seeking assistance and advice. One student called Professor Thomas a “truly wonderful professor”, and students felt privileged to have been taught by him.\r\n\r\nMany of the students in the class complained about the difficulty and amount of required reading outside the classroom. Students agreed that a great amount of work, effort, and time was required in order to succeed in the course. One student stated that “this one course is consuming an abnormal amount of time” compared to other courses. Students further complained about the difficult format of the exams, especially the “fill in the blank” questions. \r\n", "num_students": 20, "path": "/courses/23096/sections/001/reviews/1421-KENNETH-H-THOMAS", "instructor": {"path": "/instructors/1421-KENNETH-H-THOMAS", "first_name": "KENNETH H", "last_name": "THOMAS", "id": "1421-KENNETH-H-THOMAS", "name": "KENNETH H THOMAS"}, "num_reviewers": 15, "id": "23096-001-1421-KENNETH-H-THOMAS"}]