{"coursehistories": {"path": "/coursehistories/596"}, "description": "", "semester": "2012A", "name": "EUR PRE-1800: BF SEM: UTOPIA", "reviews": {"path": "/courses/27577/reviews", "values": [{"ratings": {"rAmountLearned": "3.62", "rDifficulty": "2.23", "rStimulateInterest": "3.77", "rRecommendMajor": "3.77", "rCourseQuality": "3.64", "rWorkRequired": "3.00", "rInstructorAccess": "3.77", "rReadingsValue": "3.85", "rRecommendNonMajor": "3.54", "rCommAbility": "3.62", "rInstructorQuality": "3.93"}, "section": {"name": "EUR PRE-1800: BF SEM: UTOPIA", "sectionnum": "301", "primary_alias": "HIST-211-301", "path": "/courses/27577/sections/301", "id": "27577-301", "aliases": ["HIST-211-301"]}, "comments": "Western thinkers from the ancient Greeks to the present have speculated about what the ideal human society would look like.  We can study the resultant utopias as works of literature, philosophy, religion, psychology or political science; we must understand them in their historical contexts.  This seminar takes a multidisciplinary approach to utopian thought from Plato's Republic to the ecological utopias of the 1980s.  Works examined include More's Utopia; seventeenth century scientific utopias like Bacon's New Atlantis; the political theory of Rousseau (Social Contract); essays of the French utopian socialists and Hawthorne's version of the Brook Farm experiment; Morris' News from Nowhere; its American counterpart, Bellamy's Looking Backward; Gilman's feminist blueprint, Herland; BF Skinner's psychological utopia, Walden Two; and the utopian science fiction of LeGuin.  Huxley's dystopia, Brave New World, will be set against his later utopia, Island.\r\n\r\nThis heavily discussion-based seminar was greatly enjoyed by a majority of students.  Almost all students commented on the level of deep thinking cultivated over the course of the semester by the readings and structure, and were grateful for the experience. \r\n\r\nStudents greatly appreciated Professor Todd’s teachings and methods, and found Professor Todd’s passion about the material to be quite evident.  One student’s “writing improved tremendously from Professor Todd’s comments.” Generally, students found Professor Todd to be good at stimulating discussion, although a few students wished Professor Todd had interjected a few more of her own thoughts during student-led discussions.  \r\n\r\nThis course is an advanced seminar, mainly for juniors and seniors in the Benjamin Franklin Scholars Program.  All other students need permission from the instructor to enroll in the course.  The course required a fair amount of work, as judged by students.  In addition to a few written assignments, the course required the reading of approximately a book per week plus journal entries.  One student stated that if one is prepared to put in the time and effort to complete the assigned work and engage in class discussions, then one “is basically guaranteed an A.”  Most students recommend this class to anyone who enjoys reading and discussing.  ", "num_students": 14, "path": "/courses/27577/sections/301/reviews/2774-MARGO-TODD", "instructor": {"path": "/instructors/2774-MARGO-TODD", "first_name": "MARGO", "last_name": "TODD", "id": "2774-MARGO-TODD", "name": "MARGO TODD"}, "num_reviewers": 14, "id": "27577-301-2774-MARGO-TODD"}]}, "credits": null, "primary_alias": "HIST-211", "path": "/courses/27577", "sections": {"path": "/courses/27577/sections", "values": [{"name": "EUR PRE-1800: BF SEM: UTOPIA", "sectionnum": "301", "primary_alias": "HIST-211-301", "path": "/courses/27577/sections/301", "id": "27577-301", "aliases": ["HIST-211-301"]}]}, "id": 27577, "aliases": ["HIST-211"]}