[{"ratings": {"rAmountLearned": "3.11", "rDifficulty": "2.91", "rStimulateInterest": "2.94", "rRecommendMajor": "3.66", "rCourseQuality": "2.76", "rWorkRequired": "3.03", "rInstructorAccess": "3.06", "rReadingsValue": "2.58", "rRecommendNonMajor": "1.00", "rCommAbility": "2.94", "rInstructorQuality": "3.16"}, "section": {"name": "MATERIAL&ENERGY BALANCES", "sectionnum": "001", "primary_alias": "CBE-230-001", "path": "/courses/24093/sections/001", "id": "24093-001", "aliases": ["CBE-230-001"]}, "comments": "This course is an analysis of processes used in the chemical and pharmaceutical\r\nindustries. Emphasis is placed on mass and energy balances, properties of pure fluids,\r\nand equations of state. It also focuses on heat effects accompanying phase changes and\r\nchemical reactions.\r\nMany students indicated that the course helped them develop necessary skills and\r\nknowledge to be a chemical engineer. Students agreed that the course was difficult and\r\nthe problem sets for this course were unevenly lengthy, but they found them helpful in\r\nunderstanding the course material and rewarding in preparing for the exams. However,\r\none student thought this course did “not contain that much information and could\r\npossibly be changed to include more topics.”\r\nStudents described Professor Shieh as “flexible and reasonable about adjusting the\r\ndue dates as necessary.” One student reported that he “especially enjoyed all the real\r\nworld application Professor Shieh would discuss” in lectures. Yet, another student\r\nthought that Dr. Shieh “did a poor job estimating how difficult the exams would be.”\r\nStudents deemed the exams as relatively difficult but fair, since each exam is 2\r\nhours long and open-note/open-book. These exams were “a fair reflection of what was\r\ntaught in class” and were “graded exceptionally fairly.”", "num_students": 42, "path": "/courses/24093/sections/001/reviews/1168-WEN-K-SHIEH", "instructor": {"path": "/instructors/1168-WEN-K-SHIEH", "first_name": "WEN K", "last_name": "SHIEH", "id": "1168-WEN-K-SHIEH", "name": "WEN K SHIEH"}, "num_reviewers": 40, "id": "24093-001-1168-WEN-K-SHIEH"}]