{"coursehistories": {"path": "/coursehistories/4943"}, "description": "The course provides an introduction to modern logic design and digital systems. It starts with an overview of the major building blocks of a computer. It covers combinational logic including logic gates, minimization techniques, arithmetic circuits and modern logic devices such as programmable logic arrays. The next part deals with sequential circuits: flip-flops, registers memories, and state machines. Case studies of real-world applications are used to illustrate the design of sequential circuits. The use of hardware description language will be introduced. There is a companion lab-based course, ESE 171, required for EE/CMPE majors. \n\n", "semester": "2011A", "name": "PRIN OF DIGITAL DESIGN", "reviews": {"path": "/courses/21645/reviews", "values": [{"ratings": {"rAmountLearned": "3.03", "rDifficulty": "2.77", "rStimulateInterest": "2.54", "rRecommendMajor": "3.54", "rCourseQuality": "2.93", "rWorkRequired": "3.00", "rInstructorAccess": "3.00", "rReadingsValue": "2.26", "rRecommendNonMajor": "1.67", "rCommAbility": "2.82", "rInstructorQuality": "3.02"}, "section": {"name": "PRIN OF DIGITAL DESIGN", "sectionnum": "001", "primary_alias": "ESE-170-001", "path": "/courses/21645/sections/001", "id": "21645-001", "aliases": ["ESE-170-001"]}, "comments": "This course introduces modern logic design and digital systems. Starting with an overview of the major building blocks of a computer, the course covers combinational logic including logic gates, minimization techniques, arithmetic circuits, and modern logic devices such as programmable logic arrays. Students will also learn about flip-flops, registry memories, and state machines. Case studies of real-world applications are used to illustrate the design of sequential circuits. The use of hardware description language is also included.&#8232;&#8232;Students who took this class found it to be “interesting.” This course gave students a “very good basic understanding of the building blocks of digital electronics” and students felt that they learned a lot about digital systems throughout the semester. &#8232;&#8232;Professor Van der Spiegel was highly praised. He was very knowledgeable, “engaging,” and “sincerely cared about his students’ success.” Students also liked how Professor Van der Spiegel incorporated several examples throughout his lectures and how he printed out slides for all of his students every lecture. Students claimed that they could not help but share Professor Van der Spiegel’s excitement about the course material. &#8232;&#8232;This course was considered by students to be relatively difficult and required a lot of time to complete the homework assignments. Nevertheless, students expressed that this course was an “ideal introduction to digital logic” for anyone who was interested. This course is usually taken by freshmen in Electrical & Systems Engineering, but is open to all students who are interested in the material.", "num_students": 50, "path": "/courses/21645/sections/001/reviews/350-JAN-DER-SPIEGEL", "instructor": {"path": "/instructors/350-JAN-DER-SPIEGEL", "first_name": "JAN", "last_name": "DER SPIEGEL", "id": "350-JAN-DER-SPIEGEL", "name": "JAN DER SPIEGEL"}, "num_reviewers": 45, "id": "21645-001-350-JAN-DER-SPIEGEL"}]}, "credits": null, "primary_alias": "ESE-170", "path": "/courses/21645", "sections": {"path": "/courses/21645/sections", "values": [{"name": "PRIN OF DIGITAL DESIGN", "sectionnum": "001", "primary_alias": "ESE-170-001", "path": "/courses/21645/sections/001", "id": "21645-001", "aliases": ["ESE-170-001"]}]}, "id": 21645, "aliases": ["ESE-170"]}