{"coursehistories": {"path": "/coursehistories/2821"}, "description": "There is an abundance of evidence suggesting that the standard economic paradigm - rational agents in an efficent market - does not adequately describe behavior in financial markets. In this course, we will survey the evidence and use psychology to guide alternative theories of financial markets. Along the way, we will address the standard argument that smart, profit-seeing agents can correct any distortions caused by irrational investors. Further, we will examine more closely the preferences and trading decisions of individual investors. We will argue that their systematic biases can aggregate into observed market inefficiencies. The second half of the course extends the analysis to corporate decision making. We then explore the evidence for both views in the context of capital structure, investment, dividend, and merger decisions. \n\n", "semester": "2012A", "name": "BEHAVIORAL FINANCE", "reviews": {"path": "/courses/27432/reviews", "values": [{"ratings": {"rAmountLearned": "2.40", "rDifficulty": "1.98", "rStimulateInterest": "1.96", "rRecommendMajor": "2.78", "rCourseQuality": "2.26", "rWorkRequired": "2.00", "rInstructorAccess": "2.75", "rReadingsValue": "1.76", "rRecommendNonMajor": "1.80", "rCommAbility": "2.12", "rInstructorQuality": "2.13"}, "section": {"name": "BEHAVIORAL FINANCE", "sectionnum": "001", "primary_alias": "FNCE-239-001", "path": "/courses/27432/sections/001", "id": "27432-001", "aliases": ["FNCE-239-001"]}, "comments": "In FNCE 239 students will survey the evidence and use psychology to guide alternative theories of financial markets. Along the way, the class will address the standard argument that smart, profit-seeing agents can correct any distortions caused by irrational investors. Further, the class will examine more closely the preferences and trading decisions of individual investors. The class will argue that their systematic biases can aggregate into observed market inefficiencies. The second half of the course extends the analysis to corporate decision making. The class will then explore the evidence for both views in the context of capital structure, investment, dividend, and merger decisions.\r\n\r\nStudents found this course to be a “nice perspective on all the non-classical financial world,” and multiple students said the subject matter was “interesting.” One student noted there was “very little on practical applications of concepts discussed in class.” A significant number of students found the hedge fund project “subjective” and felt that the part of their grade based on this project was “largely dependent on luck” since the class did not cover the investment strategies needed to do well on the project. However, one student felt that the hedge fund project was “the most valuable part of this course.” \r\n\r\nMany students commented that Professor Yuan was very “passionate” about the topic, but was “extremely difficult to understand” because he had a “heavy accent.”\r\n\r\nOverall, most students commented that they enjoyed the subject matter but felt that the grading did not necessarily reflect the subject matter. The prerequisites for this course include FNCE 100 and FNCE 101. FNCE 203 and FNCE 205 are recommended.\r\n", "num_students": 77, "path": "/courses/27432/sections/001/reviews/5361-YU-YUAN", "instructor": {"path": "/instructors/5361-YU-YUAN", "first_name": "YU", "last_name": "YUAN", "id": "5361-YU-YUAN", "name": "YU YUAN"}, "num_reviewers": 76, "id": "27432-001-5361-YU-YUAN"}]}, "credits": null, "primary_alias": "FNCE-239", "path": "/courses/27432", "sections": {"path": "/courses/27432/sections", "values": [{"name": "BEHAVIORAL FINANCE", "sectionnum": "001", "primary_alias": "FNCE-239-001", "path": "/courses/27432/sections/001", "id": "27432-001", "aliases": ["FNCE-239-001"]}]}, "id": 27432, "aliases": ["FNCE-239"]}