[{"ratings": {"rAmountLearned": "2.67", "rDifficulty": "3.33", "rStimulateInterest": "2.08", "rRecommendMajor": "2.83", "rCourseQuality": "1.93", "rWorkRequired": "3.50", "rInstructorAccess": "2.50", "rReadingsValue": "1.64", "rRecommendNonMajor": "0.67", "rCommAbility": "2.42", "rInstructorQuality": "2.47"}, "section": {"name": "SENIOR SEMINAR PROJECT", "sectionnum": "301", "primary_alias": "FNAR-489-301", "path": "/courses/15765/sections/301", "id": "15765-301", "aliases": ["FNAR-489-301"]}, "comments": "This course is a continuation of FNAR 488: Senior Seminar and Project (A) and culminates in an exhibition. Students will design and present a project reflecting a personal investigation in the visual arts. The instructors will guide students in readings on contemporary critical issues relevant to the student’s research. The resulting work will be presented in an exhibition during the spring semester, which is evaluated by the seminar participants and the instructors.\r\n&#8232;&#8232; Students found this class “improved” from the previous semester in part because they “already had a track to work from.” They found working in the studio “informative” yet “disorganized.” Because the class was flexible in letting students choose their own subject matter, the class felt strained, “cramming multiple artistic disciplines into a rigid academic framework.” The class mostly met individually which inhibited “constructive relationships with peers.” Students described the instructors as “great people” but one reported that Professor Mosley could be “very cryptic and capricious,” which confused and “dismayed” him. Both professors were often “unclear” in their critiques and because the class was open-media, some felt they “seemed to lack a real understanding of many of the students’ particular mediums.” &#8232;&#8232;\r\nThis course is for Fine Arts Majors only and limited to seniors, being the second half of the Senior Seminar and Project course. It requires “an unrealistic amount of work” that students called “draining” and a “complete waste of time.” The thesis (the art work, set up, and class roles for the final show) only accounted for 30% of the final grade, disappointing some students who felt that such a project should have been given more weight.&#8232; Many felt that grades were “unfair” and “arbitrarily assigned,” because some students spent “countless hours” on projects for little reward, while others did fine for “minimal work.”", "num_students": 18, "path": "/courses/15765/sections/301/reviews/498-JOSHUA-MOSLEY", "instructor": {"path": "/instructors/498-JOSHUA-MOSLEY", "first_name": "JOSHUA", "last_name": "MOSLEY", "id": "498-JOSHUA-MOSLEY", "name": "JOSHUA MOSLEY"}, "num_reviewers": 15, "id": "15765-301-498-JOSHUA-MOSLEY"}, {"ratings": {"rAmountLearned": "2.67", "rDifficulty": "3.33", "rStimulateInterest": "3.17", "rRecommendMajor": "2.83", "rCourseQuality": "1.93", "rWorkRequired": "3.50", "rInstructorAccess": "3.17", "rReadingsValue": "1.64", "rRecommendNonMajor": "0.67", "rCommAbility": "2.83", "rInstructorQuality": "2.71"}, "section": {"name": "SENIOR SEMINAR PROJECT", "sectionnum": "301", "primary_alias": "FNAR-489-301", "path": "/courses/15765/sections/301", "id": "15765-301", "aliases": ["FNAR-489-301"]}, "comments": "This course is a continuation of FNAR 488: Senior Seminar and Project (A) and culminates in an exhibition. Students will design and present a project reflecting a personal investigation in the visual arts. The instructors will guide students in readings on contemporary critical issues relevant to the student’s research. The resulting work will be presented in an exhibition during the spring semester, which is evaluated by the seminar participants and the instructors.\r\n&#8232;Students found this class “improved” from the previous semester in part because they “already had a track to work from.” They found working in the studio “informative” yet “disorganized.” Because the class was flexible in letting students choose their own subject matter, the class felt strained, “cramming multiple artistic disciplines into a rigid academic framework.” The class mostly met individually inhibiting “constructive relationships with peers.”\r\nStudents described the instructors as “great people” and felt that Professor Martinez was “very encouraging and enthusiastic.” However, some felt professors were “unclear” in their critiques and that “criticism often veered into matters of personal taste.”\r\nThis course is for Fine Arts majors only and limited to seniors. It requires “an unrealistic amount of work” that students called “draining” and a “complete waste of time.” The thesis (the art work, set up, and class roles for the final show) only accounted for 30% of the final grade, disappointing some students who felt that such a project should have been given more weight. Many felt that grades were “unfair” and “arbitrarily assigned,” because some students spent “countless hours” on projects for little reward, while others were fine with “minimal work.”", "num_students": 18, "path": "/courses/15765/sections/301/reviews/503-GABRIEL-MARTINEZ", "instructor": {"path": "/instructors/503-GABRIEL-MARTINEZ", "first_name": "GABRIEL", "last_name": "MARTINEZ", "id": "503-GABRIEL-MARTINEZ", "name": "GABRIEL MARTINEZ"}, "num_reviewers": 15, "id": "15765-301-503-GABRIEL-MARTINEZ"}]