[{"ratings": {"rAmountLearned": "2.67", "rDifficulty": "2.10", "rStimulateInterest": "2.29", "rRecommendMajor": "3.35", "rCourseQuality": "2.67", "rWorkRequired": "2.24", "rInstructorAccess": "3.57", "rReadingsValue": "2.70", "rRecommendNonMajor": "2.52", "rCommAbility": "2.76", "rInstructorQuality": "2.76"}, "section": {"name": "Race and Media in 20th Century U.S. History", "sectionnum": "401", "primary_alias": "COMM-206-401", "path": "/courses/21496/sections/401", "id": "21496-401", "aliases": ["COMM-206-401", "AFRC-202-401"]}, "comments": "&#8232;&#8232;This course offers an interesting look inside the relationship between race and the how it is portrayed in the media. Thus, the course looks at how race is constructed through the media as a sociopolitical concept and how race affects or reflects social attitudes. The class is intended to study these two concepts from various angles so students are able to understand them in multiple ways. &#8232;&#8232;Students found this course to be “excellent.” In general, the material was described as interesting and the course itself gave students a medium of learning and discussing a hot issue. At times the material could be presented in solely abstract ways, which sometimes lessened interest and confused students. &#8232;&#8232;Professor Berger was liked but sometimes described as boring. Though one could tell that he had an interest in the matter, some students said he often struggled to inspire interest in others. Students agreed that he was kind and genuine. Overall, he was praised for being understanding of his students. &#8232;&#8232;This course was neither described as easy nor hard but the required readings that were often said to be dense and “a bit much,” although it was all relevant to the course. Often students had trouble incorporating these theoretical readings into class discussions and consequently they turned out a little flat. Overall the course was well liked by the students.", "num_students": 22, "path": "/courses/21496/sections/401/reviews/4635-DANIEL-BERGER", "instructor": {"path": "/instructors/4635-DANIEL-BERGER", "first_name": "DANIEL", "last_name": "BERGER", "id": "4635-DANIEL-BERGER", "name": "DANIEL BERGER"}, "num_reviewers": 21, "id": "21496-401-4635-DANIEL-BERGER"}]