{"coursehistories": {"path": "/coursehistories/1468"}, "description": "The study of the neural systems that underlie human perception, memory and language; and of the pathological syndromes that result from damage to these systems. \n\n", "semester": "2008A", "name": "COGNITIVE NEUROSCIENCE", "reviews": {"path": "/courses/20751/reviews", "values": [{"ratings": {"rAmountLearned": "3.14", "rDifficulty": "2.82", "rStimulateInterest": "2.78", "rRecommendMajor": "3.49", "rCourseQuality": "3.04", "rWorkRequired": "2.30", "rInstructorAccess": "3.23", "rReadingsValue": "2.44", "rRecommendNonMajor": "2.04", "rCommAbility": "3.00", "rInstructorQuality": "3.16"}, "section": {"name": "COGNITIVE NEUROSCIENCE", "sectionnum": "401", "primary_alias": "PSYC-149-401", "path": "/courses/20751/sections/401", "id": "20751-401", "aliases": ["PSYC-149-401", "BIBB-249-401"]}, "comments": "This course covers the neural systems that underlie human perception, memory and language. It also addresses the pathological syndromes that result from damage to these systems.\r\n\r\nStudents frequently used the same two words to describe this cognitive neuroscience course: “interesting” and “difficult.” Most students applauded the subject matter and structure of the course. The course was designed with “a focus on the importance of material to our world and not its relevance to the exam.” The difficulty of the material presented a considerable—but, “if you put in enough effort,” a surmountable—challenge to students as well. The fact that there were no small, periodic assignments on material presented in class to help reinforce concepts was distressing to some students.\r\n\r\nProfessor Epstein’s sense humor and passion for the material made the material much more digestible. His use of “helpful” video clips to demonstrate particular cognitive disorders was also much appreciated by his students. However, they critiqued the pacing of the lectures and the class, saying that some sections of the course were “rushed” and that a little too much time was spent on perception, the professor’s area of expertise. Students also complained that the course often had more breadth than depth, citing the fact that too many experiments were presented in lecture without adequate explanation. In general, however, most students characterized the class as a “positive intellectual experience” and characterized Professor Epstein as a “great professor.” \r\n\r\nThis course fulfills the Living World Sector. It is cross-listed under psychology and biology. Some psychology students in the course reported a concern about their ability to do well in the class: one student wrote “one of my favorite psych lecture courses in all 4 years here, but definitely challenging.” Some biology-focused students were not satisfied with the organization or approach of the class.", "num_students": 72, "path": "/courses/20751/sections/401/reviews/2317-RUSSELL-ALAN-EPSTEIN", "instructor": {"path": "/instructors/2317-RUSSELL-ALAN-EPSTEIN", "first_name": "RUSSELL ALAN", "last_name": "EPSTEIN", "id": "2317-RUSSELL-ALAN-EPSTEIN", "name": "RUSSELL ALAN EPSTEIN"}, "num_reviewers": 50, "id": "20751-401-2317-RUSSELL-ALAN-EPSTEIN"}]}, "credits": null, "primary_alias": "PSYC-149", "path": "/courses/20751", "sections": {"path": "/courses/20751/sections", "values": [{"name": "COGNITIVE NEUROSCIENCE", "sectionnum": "401", "primary_alias": "PSYC-149-401", "path": "/courses/20751/sections/401", "id": "20751-401", "aliases": ["PSYC-149-401", "BIBB-249-401"]}]}, "id": 20751, "aliases": ["PSYC-149", "BIBB-249"]}