[{"ratings": {"rAmountLearned": "2.18", "rDifficulty": "2.67", "rStimulateInterest": "1.70", "rRecommendMajor": "2.99", "rCourseQuality": "2.01", "rWorkRequired": "2.44", "rInstructorAccess": "2.01", "rReadingsValue": "1.69", "rRecommendNonMajor": "1.44", "rCommAbility": "1.84", "rInstructorQuality": "1.96"}, "section": {"name": "INTRO TO LINGUISTICS", "sectionnum": "001", "primary_alias": "LING-001-001", "path": "/courses/27676/sections/001", "id": "27676-001", "aliases": ["LING-001-001"]}, "comments": "A general introduction to the nature, history and use of human language, speech and writing. Topics include the biological basis of human language, and analogous systems in other creatures; relations to cognition, communication, and social organization; sounds, forms and meanings in the world’s languages; the reconstruction of linguistic history and the family tree of languages; dialect variation and language standardization; language and gender; language learning by children and adults; the neurology of language and language disorders; the nature and history of writing systems. Intended for any undergraduate interested in language or its use, this course is also recommended as an introduction for students who plan to major in linguistics.\r\n\r\nOverall, the students commented that the course quality could be improved. For example, although the “course content is very interesting,” “the lectures were not so productive and the homeworks were quite ambiguous.” One student said that he or she “wish[ed] that the midterm/final corresponded more with the homeworks, both in terms of content, the types of questions, and the format.” However, the course “provides a great understanding of the basics of language.”\r\n\r\nMany students mentioned that they found it rather confusing to have two professors alternating in their teaching of the class. The students stated that Professor Legate and Professor Yang “were both great.” However, one student mentioned that “Professor Yang struggled with getting students interested in the material and successfully communicating the information to them.”\r\n\r\nSeveral students commented on the ambiguity of the homework and that there was little correlation between the homework and the midterm and final exams. There is “a lot of memorization required.” Students mentioned that this course would be interesting for a non-major but not necessary. This course fulfills the Natural Science and Mathematics sector. There are no prerequisites for this course. ", "num_students": 115, "path": "/courses/27676/sections/001/reviews/3353-CHARLES-YANG", "instructor": {"path": "/instructors/3353-CHARLES-YANG", "first_name": "CHARLES", "last_name": "YANG", "id": "3353-CHARLES-YANG", "name": "CHARLES YANG"}, "num_reviewers": 102, "id": "27676-001-3353-CHARLES-YANG"}, {"ratings": {"rAmountLearned": "2.18", "rDifficulty": "2.67", "rStimulateInterest": "2.16", "rRecommendMajor": "2.99", "rCourseQuality": "2.01", "rWorkRequired": "2.44", "rInstructorAccess": "2.29", "rReadingsValue": "1.69", "rRecommendNonMajor": "1.44", "rCommAbility": "2.58", "rInstructorQuality": "2.47"}, "section": {"name": "INTRO TO LINGUISTICS", "sectionnum": "001", "primary_alias": "LING-001-001", "path": "/courses/27676/sections/001", "id": "27676-001", "aliases": ["LING-001-001"]}, "comments": "This course offers a general introduction to the nature, history and use of human language, speech and writing.  Topics include the biological basis of human language, and analogous systems in other creatures; relations to cognition, communication, and social organization; sounds, forms and meanings in the world’s languages; the reconstruction of linguistic history and the family tree of languages; dialect variation and language standardization; language and gender; language learning by children and adults; the neurology of language and language disorders; the nature and history of writing systems.\r\n\tStudent opinion seemed to be mixed about his course, with some describing it as “boring” and others finding it to be both “very enjoyable” and “interesting.”  The assigments were criticized by some as “quite ambiguous.” Some found the course “very easy,” while others were put off by the textbook, which was described as “horrible, dense, and awful to get through.”\r\n\tProfessor Legate was praised as being “great,” but the two-professor structure of the course was critiqued as being “challenging.” Some students felt that both professors “communicated the subject matter very well” but others had a hard time understanding Professor Legate’s Co-Professor, Professor Yang.\r\n\tThis course was recommended for those interested in Linguistics, and was described as “pretty easy.” Students noted that this course was a good way for engineers to fulfill their Social Sciences requirement, and this course also fulfills the Natural Sciences and Math Sector for the college. The course is intended for any undergraduate interested in language or its use, this course is also recommended as an introduction for students who plan to major in linguistics.", "num_students": 115, "path": "/courses/27676/sections/001/reviews/4407-JULIE-ANNE-LEGATE", "instructor": {"path": "/instructors/4407-JULIE-ANNE-LEGATE", "first_name": "JULIE ANNE", "last_name": "LEGATE", "id": "4407-JULIE-ANNE-LEGATE", "name": "JULIE ANNE LEGATE"}, "num_reviewers": 102, "id": "27676-001-4407-JULIE-ANNE-LEGATE"}]