{"coursehistories": {"path": "/coursehistories/3834"}, "description": "How do you program computers to accomplish tasks? How do you break down a complex task into simpler ones? CIS 110 is a \"Java lite\" course that covers the fundamentals of object-oriented programming such as objects, classes, state, methods, loops, arrays, inheritance, and recursion using the Java programming language. \n\n", "semester": "2009C", "name": "INTRO TO COMP PROG", "reviews": {"path": "/courses/17122/reviews", "values": [{"ratings": {"rAmountLearned": "2.88", "rDifficulty": "2.53", "rStimulateInterest": "1.93", "rRecommendMajor": "3.32", "rCourseQuality": "2.33", "rWorkRequired": "2.90", "rInstructorAccess": "2.56", "rReadingsValue": "1.98", "rRecommendNonMajor": "2.21", "rCommAbility": "1.90", "rInstructorQuality": "2.03"}, "section": {"name": "INTRO TO COMP PROG", "sectionnum": "001", "primary_alias": "CIS-110-001", "path": "/courses/17122/sections/001", "id": "17122-001", "aliases": ["CIS-110-001"]}, "comments": "This course introduces core concepts of computer programming and computing to those with no experience. Concepts and techniques covered include algorithms, objects, state, methods, data types, expressions, testing, debugging, data abstraction, iteration, and basic data structures. Java is used as the modern object-oriented programming language to teach students how to solve real-world problems computationally with an emphasis on data modeling and algorithmic thinking.\r\n\r\nOverall, students found the labs helpful, allowing for lots of programming practice that “really hammer home the learned concepts.” Students also reported the homework was beneficial to prepare for the weekly exams, which was much appreciated by students in place of \"bigger, more overbearing midterms.\" However, several students indicated the difficulty and workload of the course escalated towards the end of the course. The final homework assignment was described as “unbelievably difficult” with insufficient lab preparation as the final lab periods were spent on another project. Many students commented that the course was challenging for people with no computer science background.\r\n\r\nThere was a general consensus that the lectures were “boring” and “unnecessary,” whereas the “useful” and “awesome” lab was where the learning really took place. Students criticized Professor Griffin’s teaching skills as “absolutely terrible” and “horrible,” reflecting on her inability to communicate in an efficient and relevant manner.  \r\n\r\nMost students who took this class had no programming experience. While this course is designed for beginners, many found they had to figure the concepts out by themselves “until everything clicked.” However, overall students agreed the topics this course teaches are useful for majors and non-majors to know. \r\n", "num_students": 164, "path": "/courses/17122/sections/001/reviews/1353-JEAN-GRIFFIN", "instructor": {"path": "/instructors/1353-JEAN-GRIFFIN", "first_name": "JEAN", "last_name": "GRIFFIN", "id": "1353-JEAN-GRIFFIN", "name": "JEAN GRIFFIN"}, "num_reviewers": 150, "id": "17122-001-1353-JEAN-GRIFFIN"}]}, "credits": null, "primary_alias": "CIS-110", "path": "/courses/17122", "sections": {"path": "/courses/17122/sections", "values": [{"name": "INTRO TO COMP PROG", "sectionnum": "001", "primary_alias": "CIS-110-001", "path": "/courses/17122/sections/001", "id": "17122-001", "aliases": ["CIS-110-001"]}]}, "id": 17122, "aliases": ["CIS-110"]}