{"coursehistories": {"path": "/coursehistories/1049"}, "description": "After introducing students to the major theoretical concepts concerning law and society, significant controversial societal issues that deal with law and the legal systems both domestically and internationally will be examined. Class discussions will focus on issues involving civil liberties, the organization of courts, legislatures, the legal profession and administrative agencies. Although the focus will be on law in the United States, law and society in other countries of Africa, Asia, Europe and Latin America will be covered in a comparative context. Readings included research reports, statutes and cases. \n\n", "semester": "2010C", "name": "LAW & SOCIETY", "reviews": {"path": "/courses/23792/reviews", "values": [{"ratings": {"rAmountLearned": "2.35", "rDifficulty": "2.04", "rStimulateInterest": "2.40", "rRecommendMajor": "2.83", "rCourseQuality": "2.18", "rWorkRequired": "1.70", "rInstructorAccess": "2.98", "rReadingsValue": "2.55", "rRecommendNonMajor": "2.61", "rCommAbility": "2.40", "rInstructorQuality": "2.54"}, "section": {"name": "LAW & SOCIETY", "sectionnum": "401", "primary_alias": "SOCI-135-401", "path": "/courses/23792/sections/401", "id": "23792-401", "aliases": ["SOCI-135-401", "AFRC-135-401"]}, "comments": "This course introduces students to the major theoretical concepts concerning law and society, and then examines significant controversial societal issues that deal with law and the legal systems both domestically and internationally. Class discussions focus on issues involving civil liberties, the organization of courts, legislatures, the legal profession and administrative agencies. Although the focus is on law in the US, law and society in other countries of Africa, Asia, Europe and Latin America is covered in a comparative context. Readings include research reports, statutes and cases.\r\n\r\nOverall, students found the course material “relevant” and “thought-provoking.” Much class time was spent on “lively debates on current events,” which were received with mixed reviews. While some students felt that they “improved the quality of the course,” others thought that they were “usually one sided” and lamented the fact that course content “was not always the key element of the lecture.”\r\n\r\nStudents called Professor Fetni “entertaining” and “awesome,” appreciating that he was “very accessible and open to discuss questions on exams and papers.” One student wrote that it was evident Professor Fetni “really cares” about the class, while another felt he “really made an effort to get to know the students.”\r\n\r\nSeveral students were concerned that although the course was “very reading intensive,” lectures “strayed from textbook material frequently.” Others felt that this was not a problem, as the course’s reasonable expectations allowed them to “truly appreciate” what they were learning. Several recommended the class to anyone interested in law and society.\r\n", "num_students": 64, "path": "/courses/23792/sections/401/reviews/1011-HOCINE-FETNI", "instructor": {"path": "/instructors/1011-HOCINE-FETNI", "first_name": "HOCINE", "last_name": "FETNI", "id": "1011-HOCINE-FETNI", "name": "HOCINE FETNI"}, "num_reviewers": 58, "id": "23792-401-1011-HOCINE-FETNI"}]}, "credits": null, "primary_alias": "SOCI-135", "path": "/courses/23792", "sections": {"path": "/courses/23792/sections", "values": [{"name": "LAW & SOCIETY", "sectionnum": "401", "primary_alias": "SOCI-135-401", "path": "/courses/23792/sections/401", "id": "23792-401", "aliases": ["SOCI-135-401", "AFRC-135-401"]}]}, "id": 23792, "aliases": ["SOCI-135", "AFRC-135"]}