{"coursehistories": {"path": "/coursehistories/872"}, "description": "This is an introductory course in modern political philosophy. Political philosophy addresses the justification and legitimate purposes of political power; the basic rights of individuals; the justification of property; capitalism vs. socialism vs. the welfare state; economic justice and the fair distribution of income and wealth; the constitutional requirements of a democracy; and the meaning of the freedom and equality of citizens. These are the kinds of questions we will investigate. The course is organized around the social contract tradition in political philosophy and the utilitarian response to it. Our primary focus is the works of the major social contract philosophers--Thomas Hobbes, John Locke, Jean Jacques Rousseau, and John Rawls--and the major utilitarian philosophers--David Hume, Adam Smith, Jeremy Benthams, and John Stuart Mill. Karl Marx is discussed as a critic of capitalism and constitutional democracy. \n\n", "semester": "2012A", "name": "THE SOCIAL CONTRACT", "reviews": {"path": "/courses/27985/reviews", "values": [{"ratings": {"rAmountLearned": "2.87", "rDifficulty": "2.62", "rStimulateInterest": "2.00", "rRecommendMajor": "3.50", "rCourseQuality": "2.64", "rWorkRequired": "2.67", "rInstructorAccess": "2.61", "rReadingsValue": "2.96", "rRecommendNonMajor": "2.20", "rCommAbility": "2.99", "rInstructorQuality": "2.76"}, "section": {"name": "THE SOCIAL CONTRACT", "sectionnum": "401", "primary_alias": "PHIL-008-401", "path": "/courses/27985/sections/401", "id": "27985-401", "aliases": ["PHIL-008-401", "PPE-008-401"]}, "comments": "This was an introductory course in modern political philosophy. Political philosophy addresses the justification and legitimate purposes of political power; the basic rights of individuals; the justification of property; capitalism vs. socialism vs. the welfare state; economic justice and the fair distribution of income and wealth; the constitutional requirements of a democracy; and the meaning of the freedom and equality of citizens. These are the kinds of questions students investigated. The course was organized around the social contract tradition in political philosophy and the utilitarian response to it. The class's primary focus was the works of the major social contract philosophers--Thomas Hobbes, John Locke, Jean Jacques Rousseau, and John Rawls--and the major utilitarian philosophers--David Hume, Adam Smith, Jeremy Benthams, and John Stuart Mill. Karl Marx was discussed as a critic of capitalism and constitutional democracy.\r\n\r\nStudents’ main complaint about the course was the structure of the lectures. Some students liked how lectures explained \"the main points\" of the readings because the readings were \"very hard to understand.\" Others, however, wanted more \"detail critically analyzing the arguments and their interactions with other ideas in philosophy.\" Because the lectures were summaries of the readings, some students found the lectures superfluous, while others found the readings unnecessary.\r\n\r\nStudents admired Professor Freeman's \"unbelievable knowledge of philosophy.\" One student called Professor Freeman \"a sage of wisdom\" and someone who \"commands respect from his classes.\" Others thought he was \"fair\" and \"informative.\" Some class members disliked Professor Freeman's lecture style, claiming they contained \"no use of technology,\" and that he \"wrote very little on the board.\"  Moreover, students explained he did not provide \"any notes or course templates online.\" Due to his style, some students found his lectures \"monotonous,\" \"repetitive\" and \"dry.\"\r\n\r\nStudents frequently expressed a desire for fewer readings, \"not for the sake of the workload\" but instead \"for the opportunity to internalize the depth of some of these works.\" Many students noted that by \"taking very meticulous notes\" in lecture, class members could have enough material to \"write the papers and take the tests,\" both of which were \"straightforward and easy to write.\" Students thought \"the assignments (two papers and a final) accurately assessed students' understanding of the topics.\"", "num_students": 147, "path": "/courses/27985/sections/401/reviews/947-SAMUEL-R--FREEMAN", "instructor": {"path": "/instructors/947-SAMUEL-R--FREEMAN", "first_name": "SAMUEL R.", "last_name": "FREEMAN", "id": "947-SAMUEL-R--FREEMAN", "name": "SAMUEL R. FREEMAN"}, "num_reviewers": 142, "id": "27985-401-947-SAMUEL-R--FREEMAN"}, {"ratings": {"rAmountLearned": "3.17", "rDifficulty": "3.00", "rStimulateInterest": "2.75", "rRecommendMajor": "3.42", "rCourseQuality": "3.00", "rWorkRequired": "2.75", "rInstructorAccess": "3.08", "rReadingsValue": "3.17", "rRecommendNonMajor": "2.58", "rCommAbility": "3.25", "rInstructorQuality": "3.14"}, "section": {"name": "SOCIAL CONTRACT", "sectionnum": "601", "primary_alias": "PHIL-008-601", "path": "/courses/27985/sections/601", "id": "27985-601", "aliases": ["PHIL-008-601", "PPE-008-601"]}, "comments": "", "num_students": 16, "path": "/courses/27985/sections/601/reviews/4704-JEROME-M--NANCE", "instructor": {"path": "/instructors/4704-JEROME-M--NANCE", "first_name": "JEROME M.", "last_name": "NANCE", "id": "4704-JEROME-M--NANCE", "name": "JEROME M. NANCE"}, "num_reviewers": 14, "id": "27985-601-4704-JEROME-M--NANCE"}]}, "credits": null, "primary_alias": "PHIL-008", "path": "/courses/27985", "sections": {"path": "/courses/27985/sections", "values": [{"name": "THE SOCIAL CONTRACT", "sectionnum": "401", "primary_alias": "PHIL-008-401", "path": "/courses/27985/sections/401", "id": "27985-401", "aliases": ["PHIL-008-401", "PPE-008-401"]}, {"name": "SOCIAL CONTRACT", "sectionnum": "601", "primary_alias": "PHIL-008-601", "path": "/courses/27985/sections/601", "id": "27985-601", "aliases": ["PHIL-008-601", "PPE-008-601"]}]}, "id": 27985, "aliases": ["PHIL-008", "PPE-008"]}