{"coursehistories": {"path": "/coursehistories/3834"}, "description": "How do you program computers to accomplish tasks? How do you break down a complex task into simpler ones? CIS 110 is a \"Java lite\" course that covers the fundamentals of object-oriented programming such as objects, classes, state, methods, loops, arrays, inheritance, and recursion using the Java programming language. \n\n", "semester": "2009A", "name": "INTRO TO COMP PROG", "reviews": {"path": "/courses/15496/reviews", "values": [{"ratings": {"rAmountLearned": "2.89", "rDifficulty": "2.50", "rStimulateInterest": "1.70", "rRecommendMajor": "3.37", "rCourseQuality": "2.31", "rWorkRequired": "3.06", "rInstructorAccess": "2.06", "rReadingsValue": "1.96", "rRecommendNonMajor": "2.38", "rCommAbility": "1.66", "rInstructorQuality": "1.67"}, "section": {"name": "INTRO TO COMP PROG", "sectionnum": "001", "primary_alias": "CIS-110-001", "path": "/courses/15496/sections/001", "id": "15496-001", "aliases": ["CIS-110-001"]}, "comments": "How do you program computers to accomplish tasks? How do you break down a complex task into simpler ones? CSE 110 is a \\\"Java lite\\\" course that covers the fundamentals of object-oriented programming such as objects, classes, state, methods, loops, arrays, inheritance, and recursion using the Java programming language.\r\n\r\nStudents described this course as “difficult” yet “fun.” More than one student said that they “learned a lot,” although most of that was “because of the homework and labs.” Students wrote that they “didn\\'t learn much from the lecture or the lecture slides.”\r\n\r\nStudents overall found that Professor Griffin did not “stimulate the students’ interest” and is “out of touch.” One student noted that Professor Griffin “is largely unavailable outside of class.”\r\n\r\nThere is weekly homework and “consistently it was the most difficult homework in any class.” Students agreed that the homework takes a lot of time. “There’s no textbook” and the “course has no assigned readings.” Midterms were taken on “pencil and paper” and one student felt, “The exam grading is a little unfair.” “This class is an excellent introductory programming course,” but “CIS 110 is difficult.”", "num_students": 119, "path": "/courses/15496/sections/001/reviews/1353-JEAN-GRIFFIN", "instructor": {"path": "/instructors/1353-JEAN-GRIFFIN", "first_name": "JEAN", "last_name": "GRIFFIN", "id": "1353-JEAN-GRIFFIN", "name": "JEAN GRIFFIN"}, "num_reviewers": 114, "id": "15496-001-1353-JEAN-GRIFFIN"}]}, "credits": null, "primary_alias": "CIS-110", "path": "/courses/15496", "sections": {"path": "/courses/15496/sections", "values": [{"name": "INTRO TO COMP PROG", "sectionnum": "001", "primary_alias": "CIS-110-001", "path": "/courses/15496/sections/001", "id": "15496-001", "aliases": ["CIS-110-001"]}]}, "id": 15496, "aliases": ["CIS-110"]}