[{"ratings": {"rAmountLearned": "2.88", "rDifficulty": "3.44", "rStimulateInterest": "2.53", "rRecommendMajor": "2.97", "rCourseQuality": "2.61", "rWorkRequired": "3.79", "rInstructorAccess": "3.32", "rReadingsValue": "1.94", "rRecommendNonMajor": "1.41", "rCommAbility": "2.56", "rInstructorQuality": "2.94"}, "section": {"name": "STOCH SYS ANALYSIS SIMUL", "sectionnum": "001", "primary_alias": "ESE-303-001", "path": "/courses/17311/sections/001", "id": "17311-001", "aliases": ["ESE-303-001"]}, "comments": "Stochastic systems analysis and simulation (ESE 303) is a class that explores stochastic systems which we could loosely define as anything random that changes in time. Stochastic systems are at the core of a number of disciplines in engineering, for example communication systems and machine learning. The goal of the class is to learn how to model, analyze and simulate stochastic systems.\r\n\r\nStudents found the course to be challenging, but extremely rewarding in terms of the content covered. One student noted that the course “literally changed the way I view the world.” Students stated that the amount of knowledge gained was “tremendous.”\r\n\r\nStudents greatly enjoyed having Professor Ribeiro as their instructor. They stated that not only was he enthusiastic and passionate, but also a scholar in the field who was extremely knowledgeable. Students also appreciated his “genuine sincerity and willingness to help,” along with his availability.\r\n\r\nThe course was found by many students to be extremely difficult and time consuming. Students were frustrated that the 13 homeworks, taking several hours to complete, did not aid their grades. They felt that the grade distribution was tough and that the expectations placed upon them were “unrealistic.” \r\n", "num_students": 37, "path": "/courses/17311/sections/001/reviews/4320-ALEJANDRO-RIBEIRO", "instructor": {"path": "/instructors/4320-ALEJANDRO-RIBEIRO", "first_name": "ALEJANDRO", "last_name": "RIBEIRO", "id": "4320-ALEJANDRO-RIBEIRO", "name": "ALEJANDRO RIBEIRO"}, "num_reviewers": 36, "id": "17311-001-4320-ALEJANDRO-RIBEIRO"}]