{"coursehistories": {"path": "/coursehistories/4996"}, "description": "This course explores the ways in which the marketing actions of firms can have an impact on society (positive or negative). Of particular interest are the actions that are central to the main products and services delivered by the firm (e.g., the development of products and brands, pricing, advertising, and distribution). There is also a focus on how the consideration of social issues can be integrated into broader marketing strategies and how companies, pro-social organizations, and government agencies can develop joint strategies (e.g., cause-related marketing) and credible metrics and reporting practices for assessing social impact. \n\nThe course proceeds in two phases. The first phase covers important background material, such as definitions of social impact, the aggregate marketing system and how it affects society, relationships to branding and marketing strategy, different approaches to measuring social impact, and how to conduct thorough social impact analyses of specific companies, products, and the marketing actions that support them. The second phase is a \"drill down\" into four problem areas: impact on the environment, impact on health and well-being (physical and mental), impact on culture (including innovation and creativity), and impact on poverty and economic development. In each area, we will identify marketing-related social issues and assess current knowledge and controversies surrounding those issues. In addition to lectures, cases, and guest speakers, students will conduct analyses of social impact and present their findings in class. \n\n", "semester": "2012C", "name": "SOCIAL IMPACT OF MKTG", "reviews": {"path": "/courses/29308/reviews", "values": [{"ratings": {"rAmountLearned": "2.15", "rDifficulty": "2.23", "rStimulateInterest": "2.31", "rRecommendMajor": "2.23", "rCourseQuality": "2.06", "rWorkRequired": "2.38", "rInstructorAccess": "2.77", "rReadingsValue": "2.23", "rRecommendNonMajor": "2.38", "rCommAbility": "2.69", "rInstructorQuality": "2.50"}, "section": {"name": "SOCIAL IMPACT OF MKTG", "sectionnum": "402", "primary_alias": "MKTG-233-402", "path": "/courses/29308/sections/402", "id": "29308-402", "aliases": ["MKTG-233-402", "MKTG-733-402"]}, "comments": "", "num_students": 26, "path": "/courses/29308/sections/402/reviews/828-JOHN-W-HUTCHINSON", "instructor": {"path": "/instructors/828-JOHN-W-HUTCHINSON", "first_name": "JOHN W", "last_name": "HUTCHINSON", "id": "828-JOHN-W-HUTCHINSON", "name": "JOHN W HUTCHINSON"}, "num_reviewers": 17, "id": "29308-402-828-JOHN-W-HUTCHINSON"}]}, "credits": null, "primary_alias": "MKTG-233", "path": "/courses/29308", "sections": {"path": "/courses/29308/sections", "values": [{"name": "SOCIAL IMPACT OF MKTG", "sectionnum": "402", "primary_alias": "MKTG-233-402", "path": "/courses/29308/sections/402", "id": "29308-402", "aliases": ["MKTG-233-402", "MKTG-733-402"]}]}, "id": 29308, "aliases": ["MKTG-233", "MKTG-733"]}