{"coursehistories": {"path": "/coursehistories/5632"}, "description": "Every human culture that has ever been described makes some form of music. The musical traditions of different cultures cover a wide range of styles, but alsodisplay fascinating similarities, and a number of features are shared by even the most disparate musical traditions. Within our own culture, music is inescap-able. There are very few individuals who do not listen to some form of music everyday, and far more who listens music virtually all day long. Appreciation of music comes very early. newborns prefer music to normal speech and parents all over the world sing to their babies, in a fundamentally similar way. And yet, despite this seeming ubiquity the real origin and purpose of music remainsunknown. Music is obviously related to language, but how? why do so many cultures make music in such a fundamentally similar ways? What goes into the formation of musical \"taste\" and preferences? What is the nature of musical ability, and how do musicians differ from non-musicians? Does music have survival value, either for the individual or for the group, or is it merely \"auditory cheeese- cake\", a superfluous byproduct of evolution? In this course, wwe will look for answers by looking at the brain. Almost 200 years of scientific research into brain mechanisms underlying the production and appreciation of music are begin-ing to shed light on these and other \n\nthe sciences and the arts are often seen as entirely separate or even in oppositon, studying the brain is actually telling us a lot about music, and studying music is telling us just as much about the brain. \n\n", "semester": "2013A", "name": "MUSIC & THE BRAIN", "reviews": {"path": "/courses/29940/reviews", "values": [{"ratings": {"rDifficulty": "1.53", "rStimulateInterest": "3.27", "rCourseQuality": "2.81", "rWorkRequired": "1.33", "rInstructorQuality": "3.13", "rCommAbility": "3.13", "rInstructorAccess": "3.47"}, "section": {"name": "MUSIC & THE BRAIN", "sectionnum": "301", "primary_alias": "BIBB-060-301", "path": "/courses/29940/sections/301", "id": "29940-301", "aliases": ["BIBB-060-301"]}, "comments": "", "num_students": 19, "path": "/courses/29940/sections/301/reviews/2877-MICHAEL-KAPLAN", "instructor": {"path": "/instructors/2877-MICHAEL-KAPLAN", "first_name": "MICHAEL", "last_name": "KAPLAN", "id": "2877-MICHAEL-KAPLAN", "name": "MICHAEL KAPLAN"}, "num_reviewers": 16, "id": "29940-301-2877-MICHAEL-KAPLAN"}]}, "credits": null, "primary_alias": "BIBB-060", "path": "/courses/29940", "sections": {"path": "/courses/29940/sections", "values": [{"name": "MUSIC & THE BRAIN", "sectionnum": "301", "primary_alias": "BIBB-060-301", "path": "/courses/29940/sections/301", "id": "29940-301", "aliases": ["BIBB-060-301"]}]}, "id": 29940, "aliases": ["BIBB-060"]}