{"coursehistories": {"path": "/coursehistories/1257"}, "description": "How might we think about the legal, political, economic, historical, and \"cultural\" considerations that shape what we watch on TV, read in books, stare at in billboards? What ideas are relevant for examining the enormous changes in the mass media system and the consequences of those changes? The aim of this course is to begin to answer these questions by acquainting you with the workings of American mass media as an integral part of American society. \n\n", "semester": "2011A", "name": "MASS MEDIA & SOC", "reviews": {"path": "/courses/21495/reviews", "values": [{"ratings": {"rAmountLearned": "2.32", "rDifficulty": "2.82", "rStimulateInterest": "2.01", "rRecommendMajor": "2.87", "rCourseQuality": "2.05", "rWorkRequired": "2.36", "rInstructorAccess": "2.25", "rReadingsValue": "2.26", "rRecommendNonMajor": "1.63", "rCommAbility": "2.38", "rInstructorQuality": "2.32"}, "section": {"name": "MASS MEDIA & SOC", "sectionnum": "001", "primary_alias": "COMM-130-001", "path": "/courses/21495/sections/001", "id": "21495-001", "aliases": ["COMM-130-001"]}, "comments": "This course focuses on the workings of American mass media as an integral part of American society. The course focuses around questions such as how might we think about the legal, political, economic, historical, and \"cultural\" considerations that shape what we watch on TV, read in books, and stare at in billboards and what ideas are relevant for examining the enormous changes in the mass media system and the consequences of those changes? &#8232;&#8232;Students felt that this course was “very informational”. However, most students felt that exams focused on minute details and specifics of the reading, rather than on the over-arching concepts. Students claimed that class lectures were “one-sided” and repeated the information and perspective of the assigned reading. &#8232;&#8232;Students’ opinions of Professor Turow were sharply divided. Some heaped praise of him and wrote that his teaching style was “interesting” and “engaging”. Some students reported that Professor Turow was inaccessible outside of class and encouraged students to meet with their TA’s instead.&#8232;&#8232;Many wrote that averages on exams were unexpectedly low. This course may be used to satisfy the Society Sector requirement.", "num_students": 118, "path": "/courses/21495/sections/001/reviews/287-JOSEPH-G--TUROW", "instructor": {"path": "/instructors/287-JOSEPH-G--TUROW", "first_name": "JOSEPH G.", "last_name": "TUROW", "id": "287-JOSEPH-G--TUROW", "name": "JOSEPH G. TUROW"}, "num_reviewers": 109, "id": "21495-001-287-JOSEPH-G--TUROW"}]}, "credits": null, "primary_alias": "COMM-130", "path": "/courses/21495", "sections": {"path": "/courses/21495/sections", "values": [{"name": "MASS MEDIA & SOC", "sectionnum": "001", "primary_alias": "COMM-130-001", "path": "/courses/21495/sections/001", "id": "21495-001", "aliases": ["COMM-130-001"]}]}, "id": 21495, "aliases": ["COMM-130"]}