{"coursehistories": {"path": "/coursehistories/1131"}, "description": "This seminar focuses on two main questions: 1) How have US schools and urban ones in particular continued to reproduce inequalities rather than ameliorating them? 2) In the informational age, how do the systems affecting education need to change to create more successful and equitable outcomes? The course is designed to bridge the divide between theory and practice. There are no class sessions focusing on theory alone, nor any focusing solely on practice. Each class session looks at issues of equity in relation to an area of practice (e.g. lesson design, curriculum planning, fostering positive student identities, classroom management, school funding, policy planning...), while bringing theoretical frames to bear from the fields of education, sociology, anthropology and psychology. \n\nAmong the theoretical frames students will learn will be the tools of systems thinking (Bertalanffy, 1968). While most of us have internalized the key lesson of the industrial revolution-that to understand something we must break it into its parts; systems thinking, in contrast, is about understanding the parts in relation to whole. The power of systems thinking is that each point of connection also serves as a point of intervention. By showing the importance of decisions of those within classrooms and those outside of them, this course is well-suited to students of education, but also for students of business, the social sciences, humanities, architecture, communications, pre- medicine, and pre-law -- in sum any who seek a role in creating a more just society. \n\n", "semester": "2013A", "name": "URBAN EDUCATION", "reviews": {"path": "/courses/31097/reviews", "values": [{"ratings": {"rDifficulty": "1.94", "rStimulateInterest": "3.13", "rCourseQuality": "2.69", "rWorkRequired": "2.75", "rInstructorQuality": "2.50", "rCommAbility": "3.25", "rInstructorAccess": "2.69"}, "section": {"name": "URBAN EDUCATION", "sectionnum": "401", "primary_alias": "URBS-202-401", "path": "/courses/31097/sections/401", "id": "31097-401", "aliases": ["URBS-202-401", "EDUC-202-401"]}, "comments": "", "num_students": 18, "path": "/courses/31097/sections/401/reviews/5188-AMY-J-BACH", "instructor": {"path": "/instructors/5188-AMY-J-BACH", "first_name": "AMY J", "last_name": "BACH", "id": "5188-AMY-J-BACH", "name": "AMY J BACH"}, "num_reviewers": 16, "id": "31097-401-5188-AMY-J-BACH"}]}, "credits": null, "primary_alias": "URBS-202", "path": "/courses/31097", "sections": {"path": "/courses/31097/sections", "values": [{"name": "URBAN EDUCATION", "sectionnum": "401", "primary_alias": "URBS-202-401", "path": "/courses/31097/sections/401", "id": "31097-401", "aliases": ["URBS-202-401", "EDUC-202-401"]}]}, "id": 31097, "aliases": ["URBS-202", "EDUC-202"]}