{"coursehistories": {"path": "/coursehistories/2979"}, "description": "Although the performance concept is not new, and is inherently a basic component in building design, its application to the building envelope and structure that is represented in \"high performance\" buildings is relatively recent. Buildings embodying the notion of \"integration\" or \"high performance\" concepts are developed through highly interactive relations between architects and engineers. The integration is influenced primarily by the \"process\" of collaboration. This process has been imbued by advancements in computational technology that narrowed the gap between the design actors, including architects and engineers. \n\nThrough a unique opportunity working with a community organization, this cours e will provide a strong understanding of issues related to energy conservation through the use of solar energy and sustainable building materials using computers. Throughout the semester students will work with a nonprofit community development corporation to apply the knowledge gained int he course to design energy passive solar energy efficient single-family housing units. This opportunity to work with a community organization will enable students to put their work to use in the real world. \n\nKnowledge in basic principles of building performance measures, code check requirements, thermal storage systems and passive heating and cooling concepts will be introduced. Students will use and become familiar with techniques in interactive computerized solar geometry and several passive solar analysis programs used in the market. A familiarity of these programs will give students and understanding of the computer technology available to assist architects in making design decisions and provide them with an opportunity to apply it in design. At the end of the course, students working with the client will be able to apply the material covered to design, analyze performance, select materials and develop construction drawings for passive solar homes. \n\n", "semester": "2006A", "name": "BUILDING PERFORMANCE", "reviews": {"path": "/courses/7327/reviews", "values": [{"ratings": {"rAmountLearned": "3.50", "rDifficulty": "2.63", "rStimulateInterest": "3.50", "rRecommendMajor": "3.63", "rCourseQuality": "3.50", "rWorkRequired": "2.50", "rInstructorAccess": "3.50", "rReadingsValue": "3.17", "rRecommendNonMajor": "2.00", "rCommAbility": "3.63", "rInstructorQuality": "3.75"}, "section": {"name": "BUILDING PERFORMANCE", "sectionnum": "001", "primary_alias": "ARCH-438-001", "path": "/courses/7327/sections/001", "id": "7327-001", "aliases": ["ARCH-438-001"]}, "comments": "", "num_students": 16, "path": "/courses/7327/sections/001/reviews/2856-ALI-M--MALKAWI", "instructor": {"path": "/instructors/2856-ALI-M--MALKAWI", "first_name": "ALI M.", "last_name": "MALKAWI", "id": "2856-ALI-M--MALKAWI", "name": "ALI M. MALKAWI"}, "num_reviewers": 8, "id": "7327-001-2856-ALI-M--MALKAWI"}]}, "credits": null, "primary_alias": "ARCH-438", "path": "/courses/7327", "sections": {"path": "/courses/7327/sections", "values": [{"name": "BUILDING PERFORMANCE", "sectionnum": "001", "primary_alias": "ARCH-438-001", "path": "/courses/7327/sections/001", "id": "7327-001", "aliases": ["ARCH-438-001"]}]}, "id": 7327, "aliases": ["ARCH-438"]}