{"coursehistories": {"path": "/coursehistories/900"}, "description": "An intermediate course in the statics and dynamics of particles and rigid bodies. Langrangian dynamics, central forces, non-inertial reference frames, and rigid bodies. \n\n", "semester": "2012A", "name": "ANALYTICAL MECHANICS", "reviews": {"path": "/courses/28010/reviews", "values": [{"ratings": {"rAmountLearned": "3.14", "rDifficulty": "2.93", "rStimulateInterest": "3.11", "rRecommendMajor": "3.50", "rCourseQuality": "3.17", "rWorkRequired": "2.82", "rInstructorAccess": "3.00", "rReadingsValue": "3.18", "rRecommendNonMajor": "1.64", "rCommAbility": "3.32", "rInstructorQuality": "3.33"}, "section": {"name": "ANALYTICAL MECHANICS", "sectionnum": "001", "primary_alias": "PHYS-351-001", "path": "/courses/28010/sections/001", "id": "28010-001", "aliases": ["PHYS-351-001"]}, "comments": "This an intermediate course in the statics and dynamics of particles and rigid bodies, langrangian dynamics, central forces, noninertial reference frames, and rigid bodies. \r\n\r\n Students thought this was a fun class, especially in regards to the homework. Students came away very comfortable with a working knowledge of classical mechanics, but not much insight beyond that. A majority of students described the material as being very interesting.\r\n\r\nProfessor Johnson's lectures are well organized, and his homework problems are interesting and rewarding.  Professor Johnson did a very good job of breaking down complicated systems into manageable step-by-step processes.  Students appreciated the very algorithmic nature of his teaching style. Students thought Professor Johnson's lectures were clear and interesting. They also said he is very accessible by email and office hours. A student wrote that Professor Johnson truly is a very naturally talented professor. He can be condescending at times, but always with good-natured humor.\r\n\r\nThe prerequisites for this course include: PHYS 150/151 or PHYS 170/171, MATH 104/114, and MATH 240, or permission of instructor. Students said the tests were very consistent with homework level, which was good because it was very clear what students should study. There were very few surprises on the exams.  All assignments were challenging but manageable.", "num_students": 31, "path": "/courses/28010/sections/001/reviews/974--ALAN-T--JOHNSON", "instructor": {"path": "/instructors/974--ALAN-T--JOHNSON", "first_name": ",ALAN T.", "last_name": "JOHNSON", "id": "974--ALAN-T--JOHNSON", "name": ",ALAN T. JOHNSON"}, "num_reviewers": 30, "id": "28010-001-974--ALAN-T--JOHNSON"}]}, "credits": null, "primary_alias": "PHYS-351", "path": "/courses/28010", "sections": {"path": "/courses/28010/sections", "values": [{"name": "ANALYTICAL MECHANICS", "sectionnum": "001", "primary_alias": "PHYS-351-001", "path": "/courses/28010/sections/001", "id": "28010-001", "aliases": ["PHYS-351-001"]}]}, "id": 28010, "aliases": ["PHYS-351"]}