{"coursehistories": {"path": "/coursehistories/3970"}, "description": "During the last 500 years, science has emerged as a central and transformative force that continues to reshape everyday life in countless ways. This introductory course will survey the emergence of the scientific world view fromthe Renaissance through the end of the 20th century. By focusing on the life, work and cultural contexts of those who created modern science, we will explore their core ideas and techniques, where they came from, what problems they solved, what made them controversial and exciting and how they related to contemporary religious beliefs, politics, art, literature, and music. The course is organized chronologically and thematically. In short, this is a \"Western Civ\" course with a difference, open to students at all levels. \n\n", "semester": "2009C", "name": "EMERGENCE OF MODERN SCI", "reviews": {"path": "/courses/18126/reviews", "values": [{"ratings": {"rAmountLearned": "2.62", "rDifficulty": "2.66", "rStimulateInterest": "2.68", "rRecommendMajor": "3.24", "rCourseQuality": "2.59", "rWorkRequired": "2.05", "rInstructorAccess": "2.42", "rReadingsValue": "2.08", "rRecommendNonMajor": "2.54", "rCommAbility": "3.08", "rInstructorQuality": "2.84"}, "section": {"name": "EMERGENCE OF MODERN SCI", "sectionnum": "401", "primary_alias": "STSC-001-401", "path": "/courses/18126/sections/401", "id": "18126-401", "aliases": ["STSC-001-401", "HSOC-001-401"]}, "comments": "This introductory course surveys the emergence of the scientific world view from the Renaissance through the end of the 20th century. Focusing on the life, work, and cultural contexts of the creators of modern science, students explore their core ideas and techniques, where they came from, what problems they solved, what made them controversial and exciting, and how they related to contemporary religious beliefs, politics, art, literature, and music. The course is organized chronologically and thematically. &#8232;\r\n&#8232;Overall, students enjoyed the content of the course but felt that the breadth of material covered was overwhelming. As one student put it, the course “tries to take too much of a bite out of history.” Due to the limited lecture time (two hours a week) and inaccessibility of lecture slides, many students felt rushed and unable to fully grasp the lecture material. On the other hand, some students deemed the breadth of material consistent with other introductory courses, and reported that the course provided “good cultural background for science majors.” \r\n&#8232;Students described Professor Adams as a “great,” “knowledgeable,” and “interesting” lecturer. Some students wished that he was more accommodating to students’ need to access course content outside of class, such as posting the lecture slides and class handouts online. One student reported that Professor Adams was “inflexible” about students’ special circumstances, and many students disliked his emphasis on “specific dates and names, and not broader themes.” &#8232;&#8232;\r\nGrading is based on two exams, five assignments, and class participation in recitation. Overall, students felt that exams focused too much on “rote memorization,” rather than overarching concepts. Many wished that multiple smaller quizzes were given in recitation to reinforce material learned in lecture. This course has no prerequisites, and is a core requirement for the STSC Major. It also fulfills the Humanities and Social Sciences or the Natural Sciences and Mathematics sector requirements.\r\n", "num_students": 78, "path": "/courses/18126/sections/401/reviews/663-MARK-B-ADAMS", "instructor": {"path": "/instructors/663-MARK-B-ADAMS", "first_name": "MARK B", "last_name": "ADAMS", "id": "663-MARK-B-ADAMS", "name": "MARK B ADAMS"}, "num_reviewers": 71, "id": "18126-401-663-MARK-B-ADAMS"}]}, "credits": null, "primary_alias": "STSC-001", "path": "/courses/18126", "sections": {"path": "/courses/18126/sections", "values": [{"name": "EMERGENCE OF MODERN SCI", "sectionnum": "401", "primary_alias": "STSC-001-401", "path": "/courses/18126/sections/401", "id": "18126-401", "aliases": ["STSC-001-401", "HSOC-001-401"]}]}, "id": 18126, "aliases": ["STSC-001", "HSOC-001"]}