[{"ratings": {"rAmountLearned": "3.26", "rDifficulty": "2.40", "rStimulateInterest": "3.58", "rRecommendMajor": "3.89", "rCourseQuality": "3.19", "rWorkRequired": "2.37", "rInstructorAccess": "3.26", "rReadingsValue": "2.47", "rRecommendNonMajor": "2.95", "rCommAbility": "3.79", "rInstructorQuality": "3.55"}, "section": {"name": "INTRO ROMAN ARCHAEOLOGY", "sectionnum": "401", "primary_alias": "CLST-274-401", "path": "/courses/27188/sections/401", "id": "27188-401", "aliases": ["CLST-274-401", "ARTH-274-401"]}, "comments": "This course offers a chronological introduction to the archaeology of the Roman world from its origins as a village on the Tiber River to its eventual collapse as a world empire. It considers great monuments like the Coliseum and Nero's palace, to brothels and peasant huts. It will examine what Romans ate and how died, Roman economic systems, transportation, religion and other aspects of Roman material culture.\r\n\r\nStudents genuinely enjoyed this course.  Nearly all participants noted that they came away from the course with a wealth of knowledge, unfamiliar to them at the start of the course.  Students commented that each course was “thoughtfully planned.”  A few wished the lecture slides had contained more of the information, but almost all found the material “interesting” and “well-communicated.”\r\n\r\nProfessor Bowes was praised as “very passionate” about the material equally “knowledgeable.”  Students appreciated the careful manner in which she explained the material, and facilitated class discussion.  Several students noted that Professor Bowes was “willing and eager to discuss the material and address questions” outside the classroom.  \r\n\r\nStudents considered both the workload and assessments “reasonable, for anyone who regularly attended class.”  Tests were generally described as easier than take-home assignments, however the grading was fair for both.  Nearly all reviewers had some prior experience in classics or archaeology, but almost all found the material “exciting” nonetheless.  This class was widely recommended.", "num_students": 23, "path": "/courses/27188/sections/401/reviews/5323-KIMBERLY-D--BOWES", "instructor": {"path": "/instructors/5323-KIMBERLY-D--BOWES", "first_name": "KIMBERLY D.", "last_name": "BOWES", "id": "5323-KIMBERLY-D--BOWES", "name": "KIMBERLY D. BOWES"}, "num_reviewers": 22, "id": "27188-401-5323-KIMBERLY-D--BOWES"}]