{"coursehistories": {"path": "/coursehistories/5554"}, "description": "Italian 201 will focus on a recent movie by Italian director Tullio Giordana, La meglio gioventu(2002), which will be used as a point of departure to explore contemporary Italian culture following its development since the 1960s. Another recent movie, Mio fratello e figlio unico (2007), will be viewed and analyzed at the conclusion of the course as compared to La meglio gioventu. Pertinent literary texts, newspaper articles, as well as material in other media will complement the analysis of the film and allow an in-depth discussion of the most important topics. The cultural material explored in the course will be also used as a basis for a review of the most difficult grammar structures, with an emphasis on those necessary to express opinion and formulate hypothesis. \n\nAudiovisual materials and readings have been carefully chosen to develop student's comprehension and production in Italian, and to enable them to function in an academic setting in which competence at the advanced level is required. Class work will center primarily on conversation to improve students' fluency, vocabulary, and accuracy in speaking in the formal register. Homework will consist primarily, but not exclusively, of paragraph- length blog entries and 1.5-2 page compositions to improve students' ability to express themselves correctly and elegantly in written Italian. Additionally, students will be required to prepare two five 5 minute in-class or video presentation on one or parts of an assigned sequence, and on a social or cultural issue. In place of a final exam, students will write a final essay of 5-6 pages comparing La meglio gioventu to another recent Italian movie, Mio fratello e figlio unico, that will be introduced in class during the last week of the semester. \n\n", "semester": "2012C", "name": "ADVANCED ITALIAN I", "reviews": {"path": "/courses/29139/reviews", "values": [{"ratings": {"rTAQuality": "4.00", "rAbilitiesChallenged": "2.80", "rStimulateInterest": "3.18", "rHomeworkValuable": "2.55", "rCourseQuality": "2.82", "rWorkRequired": "0.64", "rClassPace": "1.64", "rInstructorAccess": "3.50", "rReadingsValue": "2.60", "rNativeAbility": "3.00", "rInstructorQuality": "3.58", "rInstructorEffective": "3.36"}, "section": {"name": "ADVANCED ITALIAN I", "sectionnum": "301", "primary_alias": "ITAL-201-301", "path": "/courses/29139/sections/301", "id": "29139-301", "aliases": ["ITAL-201-301"]}, "comments": "", "num_students": 15, "path": "/courses/29139/sections/301/reviews/3995-LILLYROSE-VENEZIANO-BROCCIA", "instructor": {"path": "/instructors/3995-LILLYROSE-VENEZIANO-BROCCIA", "first_name": "LILLYROSE", "last_name": "VENEZIANO BROCCIA", "id": "3995-LILLYROSE-VENEZIANO-BROCCIA", "name": "LILLYROSE VENEZIANO BROCCIA"}, "num_reviewers": 12, "id": "29139-301-3995-LILLYROSE-VENEZIANO-BROCCIA"}]}, "credits": null, "primary_alias": "ITAL-201", "path": "/courses/29139", "sections": {"path": "/courses/29139/sections", "values": [{"name": "ADVANCED ITALIAN I", "sectionnum": "301", "primary_alias": "ITAL-201-301", "path": "/courses/29139/sections/301", "id": "29139-301", "aliases": ["ITAL-201-301"]}]}, "id": 29139, "aliases": ["ITAL-201"]}