{"coursehistories": {"path": "/coursehistories/3058"}, "description": "International monetary economics with emphasis on economic policy in an open economy. Topics covered in the course include: balance-of-payments adjustment, theories of exchange rate determinaton, the effects of exchange rate devaluation, macroeconomic policy under fixed and floating exchange rates, the Euro-dollar market, currency and balance of payments crises. \n\n", "semester": "2009C", "name": "INTERNATIONAL FINANCE", "reviews": {"path": "/courses/17219/reviews", "values": [{"ratings": {"rAmountLearned": "2.66", "rDifficulty": "2.91", "rStimulateInterest": "2.72", "rRecommendMajor": "3.22", "rCourseQuality": "2.56", "rWorkRequired": "2.67", "rInstructorAccess": "2.83", "rReadingsValue": "2.47", "rRecommendNonMajor": "1.63", "rCommAbility": "2.62", "rInstructorQuality": "2.83"}, "section": {"name": "INTERNATIONAL FINANCE", "sectionnum": "001", "primary_alias": "ECON-252-001", "path": "/courses/17219/sections/001", "id": "17219-001", "aliases": ["ECON-252-001"]}, "comments": "ECON 252 International Finance focuses on international monetary economics with emphasis on economic policy in an open economy. Topics covered in the course include: balance-of-payments adjustment, theories of exchange rate determination, the effects of exchange rate devaluation, macroeconomic policy under fixed and floating exchange rates, the Euro-dollar market, currency and balance of payments crises.\r\n\r\nStudents agreed that the course was “very informative and interesting.” One student even commented that this course was “one of the better classes I have taken in the economics department.”\r\n\r\nStudents praised Professor Azzimonti, commenting that she was “excellent”, “enthusiastic”, and “interesting.” Students also appreciated that Professor Azzimonti was extremely accessible and wanted her students to master the material. A minor frustration students expressed was difficulty in reading Professor Azzimonti’s handwriting and would have preferred “more structured notes.”\r\n\r\nAcross the board, students found the course “tough” and “difficult.” Students agreed the problem sets were “challenging” but were also “fair” and “valuable.” Students also agree the exams were “very, very, very hard.” Overall, one student commented that while they’re “not expecting an A by any stretch of the imagination, I feel as if I mastered elements of economic theory and practice that I can translate into understanding real-world events.” \r\n", "num_students": 108, "path": "/courses/17219/sections/001/reviews/4785-MARINA-D--AZZIMONTI", "instructor": {"path": "/instructors/4785-MARINA-D--AZZIMONTI", "first_name": "MARINA D.", "last_name": "AZZIMONTI", "id": "4785-MARINA-D--AZZIMONTI", "name": "MARINA D. AZZIMONTI"}, "num_reviewers": 106, "id": "17219-001-4785-MARINA-D--AZZIMONTI"}]}, "credits": null, "primary_alias": "ECON-252", "path": "/courses/17219", "sections": {"path": "/courses/17219/sections", "values": [{"name": "INTERNATIONAL FINANCE", "sectionnum": "001", "primary_alias": "ECON-252-001", "path": "/courses/17219/sections/001", "id": "17219-001", "aliases": ["ECON-252-001"]}]}, "id": 17219, "aliases": ["ECON-252"]}