{"coursehistories": {"path": "/coursehistories/4312"}, "description": "This is an honors version of Math 240 which explores the same topics but with greater mathematcal rigor. \n\n", "semester": "2012A", "name": "HONORS CALCULUS II", "reviews": {"path": "/courses/27711/reviews", "values": [{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "2.83", "rStimulateInterest": "2.76", "rRecommendMajor": "3.76", "rCourseQuality": "2.42", "rWorkRequired": "2.93", "rInstructorAccess": "3.41", "rReadingsValue": "2.69", "rRecommendNonMajor": "1.86", "rCommAbility": "2.90", "rInstructorQuality": "2.91"}, "section": {"name": "HONORS CALCULUS II", "sectionnum": "001", "primary_alias": "MATH-260-001", "path": "/courses/27711/sections/001", "id": "27711-001", "aliases": ["MATH-260-001"]}, "comments": "This is an honors version of Math 240 that explores the same topics but with greater mathematical rigor. The course material covers linear algebra: vectors, matrices, systems of linear equations, eigenvalues and eigenvectors.  Vector calculus: functions of several variables, vector fields, line and surface integrals, Green's, Stokes' and divergence theorems. The course also addresses series solutions of ordinary differential equations, Laplace transforms and systems of ordinary differential equations. The course also emphasizes the use of symbolic manipulation and graphics software. \r\n\r\nStudents enjoyed the content of this “decent” course, although at times they felt like the course only briefly touched on many topics, never to revisit them again. One student mentioned that the textbook was an “atrocity” and didn't match the rigor of the first semester material. A student also thought the course was very disorganized, “too quickly exploring multi-variable calculus.” A student wrote how this made it hard to follow the overall structure of the course.\r\n\r\nStudents said Professor Kazdan was good at explaining the very difficult topics in this class. He is very accessible and is always willing to answer questions and problems. He is also happy to offer extra office hours if students need help. Students thought he generally had a very good feel for where the class was, though he occasionally seemed to underestimate the knowledge of the class. Besides being knowledgeable, some students commented on his humor which made the class more enjoyable.\r\n\r\nThe prerequisite for this course is Math 114.  One student felt that the tests in this course were a little too basic making people who didn't fully understand the material still do well. The weekly homework problem sets could be very challenging, but not impossible, and the grading was fair. The problem sets were good at “guiding [students] to reach insights about the material.", "num_students": 35, "path": "/courses/27711/sections/001/reviews/756-JERRY-L-KAZDAN", "instructor": {"path": "/instructors/756-JERRY-L-KAZDAN", "first_name": "JERRY L", "last_name": "KAZDAN", "id": "756-JERRY-L-KAZDAN", "name": "JERRY L KAZDAN"}, "num_reviewers": 34, "id": "27711-001-756-JERRY-L-KAZDAN"}]}, "credits": null, "primary_alias": "MATH-260", "path": "/courses/27711", "sections": {"path": "/courses/27711/sections", "values": [{"name": "HONORS CALCULUS II", "sectionnum": "001", "primary_alias": "MATH-260-001", "path": "/courses/27711/sections/001", "id": "27711-001", "aliases": ["MATH-260-001"]}]}, "id": 27711, "aliases": ["MATH-260"]}