{"coursehistories": {"path": "/coursehistories/897"}, "description": "This course parallels and extends the content of PHYS 151, at a somewhat higher mathematical level. Recommended for well-prepared students in engineering and the physical sciences, and particularly for those planning to major in physics. Electric and magnetic fields; Coulomb's, Ampere's, and Faraday's laws; special relativity; Maxwell's equations, electromagnetic radiation. \n\n", "semester": "2012A", "name": "HONORS PHYSICS II", "reviews": {"path": "/courses/28007/reviews", "values": [{"ratings": {"rAmountLearned": "3.57", "rDifficulty": "3.62", "rStimulateInterest": "3.43", "rRecommendMajor": "3.90", "rCourseQuality": "3.76", "rWorkRequired": "3.67", "rInstructorAccess": "3.57", "rReadingsValue": "3.43", "rRecommendNonMajor": "1.81", "rCommAbility": "3.76", "rInstructorQuality": "3.76"}, "section": {"name": "HONORS PHYSICS II", "sectionnum": "301", "primary_alias": "PHYS-171-301", "path": "/courses/28007/sections/301", "id": "28007-301", "aliases": ["PHYS-171-301"]}, "comments": "This course parallels and extends the content of PHYS 151, at a somewhat higher mathematical level.  Recommended for well-prepared students in engineering and the physical sciences, and particularly for those planning to major in physics.  The course focuses on electric and magnetic fields; Coulomb's, Ampere's, and Faraday's laws; special relativity; Maxwell's equations and electromagnetic radiation.\r\n\t\r\nThe course increased students’ interest in electromagnetism and in modern physics.  The material is really interesting and is treated at a high level. \r\n\r\nProfessor Kane was a very clear speaker.  His enthusiasm for the subject matter was transparent and infectious.  Students thought that Professor Kane really knew the material well, and he was great at transmitting it. He had an excellent command of the blackboard and of the classroom. They commented that he explained everything very well, and was patient with and receptive to questions. He made “potentially confusing ideas seem natural.” One student described him as a phenomenal professor.\r\n\r\n\r\nThis course fulfills the Physical World Sector requirement. The prerequisites for this course include: MATH 114 and PHYS 150 or PHYS 170, or permission of instructor.  The corequisites for this course are MATH 240 or permission of instructor.  Students said the class was hard, but “worth every second.” ", "num_students": 21, "path": "/courses/28007/sections/301/reviews/966-CHARLES-L--KANE", "instructor": {"path": "/instructors/966-CHARLES-L--KANE", "first_name": "CHARLES L.", "last_name": "KANE", "id": "966-CHARLES-L--KANE", "name": "CHARLES L. KANE"}, "num_reviewers": 21, "id": "28007-301-966-CHARLES-L--KANE"}]}, "credits": null, "primary_alias": "PHYS-171", "path": "/courses/28007", "sections": {"path": "/courses/28007/sections", "values": [{"name": "HONORS PHYSICS II", "sectionnum": "301", "primary_alias": "PHYS-171-301", "path": "/courses/28007/sections/301", "id": "28007-301", "aliases": ["PHYS-171-301"]}]}, "id": 28007, "aliases": ["PHYS-171"]}