[{"ratings": {"rAmountLearned": "2.76", "rDifficulty": "3.10", "rStimulateInterest": "1.83", "rRecommendMajor": "2.85", "rCourseQuality": "2.54", "rWorkRequired": "3.02", "rInstructorAccess": "3.41", "rReadingsValue": "2.98", "rRecommendNonMajor": "0.98", "rCommAbility": "2.15", "rInstructorQuality": "2.56"}, "section": {"name": "NUM & FIN ELE MTHDS", "sectionnum": "401", "primary_alias": "MEAM-527-401", "path": "/courses/24727/sections/401", "id": "24727-401", "aliases": ["MEAM-527-401", "ENM-427-401"]}, "comments": "This course introduces common kinematic, dynamic, and computational\r\nprinciples and practical examples that are representative of today’s robotic systems. The\r\nthree main topics are coordinate system transformations and kinematics, control of\r\nmobile robots, and motion planning of robotic systems. The laboratory component\r\nincludes simulation exercises, programming, and numerical modeling using effective\r\nalgorithms with applications to problems in engineering, science, and mathematics.\r\nOther topics include interpolation and curve fitting, numerical integration, introduction to\r\nthe solution of ordinary and partial differential equations by finite difference, and finite\r\nelement methods.\r\nThe majority of the students felt that this course was overall difficult, abstract,\r\nand “involved a lot of math” but that eventually they learnt a lot. Yet some noted that the\r\ntopics were interesting and the course was helpful for students majoring in MEAM. One\r\nstudent thought that the lack of a proper textbook and relevant tutors was a noticeable\r\nproblem.\r\nProfessor Hu was described as “excellent in accessibility and willingness to\r\ndiscuss with students when they encounter problems.” His notes were regarded as “very\r\nuseful.” Students praised that Professor Hu “incorporated several real-world example\r\nproblems” in class but hoped that he could give clearer presentations.\r\nStudents should be prepared to put in a good deal of work for this course. This\r\ncourse serves as an elective for MEAM majors.", "num_students": 43, "path": "/courses/24727/sections/401/reviews/4164-HOWARD-H--HU", "instructor": {"path": "/instructors/4164-HOWARD-H--HU", "first_name": "HOWARD H.", "last_name": "HU", "id": "4164-HOWARD-H--HU", "name": "HOWARD H. HU"}, "num_reviewers": 41, "id": "24727-401-4164-HOWARD-H--HU"}]