{"coursehistories": {"path": "/coursehistories/2097"}, "description": "Changes in behavior resulting from past experience. The acquisition, maintenance, and elimination of behavior, and the effects of previous experience on responses to new situations. \n\n", "semester": "2010C", "name": "LEARNING", "reviews": {"path": "/courses/23697/reviews", "values": [{"ratings": {"rAmountLearned": "3.29", "rDifficulty": "3.43", "rStimulateInterest": "3.39", "rRecommendMajor": "3.47", "rCourseQuality": "3.24", "rWorkRequired": "2.39", "rInstructorAccess": "3.35", "rReadingsValue": "2.12", "rRecommendNonMajor": "1.84", "rCommAbility": "3.42", "rInstructorQuality": "3.64"}, "section": {"name": "LEARNING", "sectionnum": "001", "primary_alias": "PSYC-121-001", "path": "/courses/23697/sections/001", "id": "23697-001", "aliases": ["PSYC-121-001"]}, "comments": "This course looks at changes in behavior resulting from past experience. Additionally, it examines the acquisition, maintenance, and elimination of behavior, and the effects of previous experience on responses to new situations.\r\n\r\nOverall, students enjoyed the class, noting that they “learned a lot.” They described the lectures as “interesting and to the point” and felt that the “organization of the course was impeccable.” Another point that students appreciated was that the material was “important in everyday psychology” as it gave real insight into how research experiments are created. The course was therefore “very applicable and useful.” However, students overwhelmingly reported the difficulty of the course, though many qualified their statements by saying they did not regret taking it.\r\n\r\nProfessor Rescorla was described as “a legend.” Students were impressed by his deep and thorough knowledge of the material. Some found that because of his depth of knowledge his lectures were at times “difficult to follow,” though many also praised his ability to clearly explain the information. Students found him to be a very demanding professor who did not hold back from criticizing both students and other branches of psychology. While he did not hold office hours, he did have lunch once a week with students in order to answer general questions.\r\n\r\nOne student found that “while the amount of material is not overwhelming, experiment design, one of the focuses of this course, is not easy.” However, most students agreed that the material was extremely difficult and that it required “extensive reading and outside of class work.” Some students were unclear about what would be on the exams and many students found that the grading standards were extremely high. Students recommended this course for majors or students who want to go into research. The only prerequisite for this course is PSYC 001.\r\n", "num_students": 64, "path": "/courses/23697/sections/001/reviews/1039-ROBERT-A-RESCORLA", "instructor": {"path": "/instructors/1039-ROBERT-A-RESCORLA", "first_name": "ROBERT A", "last_name": "RESCORLA", "id": "1039-ROBERT-A-RESCORLA", "name": "ROBERT A RESCORLA"}, "num_reviewers": 61, "id": "23697-001-1039-ROBERT-A-RESCORLA"}]}, "credits": null, "primary_alias": "PSYC-121", "path": "/courses/23697", "sections": {"path": "/courses/23697/sections", "values": [{"name": "LEARNING", "sectionnum": "001", "primary_alias": "PSYC-121-001", "path": "/courses/23697/sections/001", "id": "23697-001", "aliases": ["PSYC-121-001"]}]}, "id": 23697, "aliases": ["PSYC-121"]}