{"coursehistories": {"path": "/coursehistories/3092"}, "description": "The course focuses on financial tools, techniques, and best practices used in buyouts (financial buyers) and acquisitions (strategic buyers). While it will touch upon various strategic, organizational, and general management issues, the main lens for studying these transactions will be a financial one. It will explore how different buyers approach the process of finding, evaluating, and analyzing opportunities in the corporate-control market; how they structure deals and how deal structure affects both value creation and value division; how they add value after transaction completion; and how they realizetheir ultimate objectives (such as enhanced market position or a profitable exit). The course is divided into two broad modules. The first module covers buyouts by private equity partnerships, and the second one studies mergers and acquisitions. \n\n", "semester": "2009C", "name": "FNCE OF BUYOUTS & ACQS", "reviews": {"path": "/courses/17378/reviews", "values": [{"ratings": {"rAmountLearned": "2.65", "rDifficulty": "2.59", "rStimulateInterest": "2.62", "rRecommendMajor": "3.12", "rCourseQuality": "2.60", "rWorkRequired": "2.65", "rInstructorAccess": "3.15", "rReadingsValue": "2.50", "rRecommendNonMajor": "1.53", "rCommAbility": "2.65", "rInstructorQuality": "2.74"}, "section": {"name": "FNCE OF BUYOUTS & ACQS", "sectionnum": "001", "primary_alias": "FNCE-251-001", "path": "/courses/17378/sections/001", "id": "17378-001", "aliases": ["FNCE-251-001"]}, "comments": "The focus of FNCE 251 is on buying (or acquiring controlling stakes in) firms. The main topics to be covered are mergers and friendly acquisitions, hostile takeovers and buyouts. Using case studies, the course surveys the drivers of success in the transactions. While issues regarding motive and strategy will be discussed, financial theory would be the main lens used to view these control acquiring transactions. The objective is two-fold: (1) develop a concept and translate that idea into a proposal through deal design; and (2) analyze to form opinions about proposed deals. The course should be of interest to students interested in pursuing careers as private equity investors, advisors in investment banking and corporate managers that deal with these issues. This course will be demanding and assumes familiarity with valuation analysis.\r\n\r\nStudents agreed that they got a lot out of FNCE 251, especially in the “whys” behind mergers and acquisitions. Some commented that they found themselves “looking forward to go to class.” However, some thought that the class was more of a discussion of current events while the exams were more quantitative, which “required some work outside of the classroom.”\r\n\r\nProfessor Savor was “extremely engaging, interesting and intelligent.” He was also “available outside of class.”\r\n\r\nStudents found this course “very hard, but worth it”. There is a steep learning curve but the professor is always available outside of class. \r\n", "num_students": 42, "path": "/courses/17378/sections/001/reviews/3968-PAVEL-G--SAVOR", "instructor": {"path": "/instructors/3968-PAVEL-G--SAVOR", "first_name": "PAVEL G.", "last_name": "SAVOR", "id": "3968-PAVEL-G--SAVOR", "name": "PAVEL G. SAVOR"}, "num_reviewers": 40, "id": "17378-001-3968-PAVEL-G--SAVOR"}]}, "credits": null, "primary_alias": "FNCE-251", "path": "/courses/17378", "sections": {"path": "/courses/17378/sections", "values": [{"name": "FNCE OF BUYOUTS & ACQS", "sectionnum": "001", "primary_alias": "FNCE-251-001", "path": "/courses/17378/sections/001", "id": "17378-001", "aliases": ["FNCE-251-001"]}]}, "id": 17378, "aliases": ["FNCE-251"]}