[{"ratings": {"rAmountLearned": "3.30", "rDifficulty": "2.87", "rStimulateInterest": "3.78", "rRecommendMajor": "3.48", "rCourseQuality": "3.32", "rWorkRequired": "3.00", "rInstructorAccess": "3.83", "rReadingsValue": "3.39", "rRecommendNonMajor": "3.39", "rCommAbility": "3.35", "rInstructorQuality": "3.52"}, "section": {"name": "CHURCH & URBAN CHALLENGE: Religion, Social Justice & Urban Development", "sectionnum": "601", "primary_alias": "URBS-405-601", "path": "/courses/16557/sections/601", "id": "16557-601", "aliases": ["URBS-405-601", "RELS-439-601", "AFRC-405-601", "HIST-405-601"]}, "comments": "Urban development has been influenced by religious conceptions of social and economic justice. Progressive traditions within Judaism, Christianity, Islam, Buddhism, and Humanism have yielded: (1) powerful critiques of oppression and hierarchy as well as (2) alternative economic frameworks for ownership, governance, production, labor, and community. Historical and contemporary case studies from the Americas, Europe, Africa, Asia, and the Middle East will be considered, as we examine the ways in which religious responses to poverty, inequality, and ecological destruction have generated new forms of urban development.\r\n\r\nIn general, students thoroughly enjoyed Professor Lamas’s class. Many commented, “I may have learned more in this course alone than all my other Penn courses combined.” Many students thought the lectures and discussions were outstanding, and one student went as far as to say that he “has walked out of every class felling alive, awakened and wishing that I could do this all day long and every day.” However, some students did wish that fewer topics had been covered, with a handful of topics being explored more in-depth. In addition, others wanted a “more detailed course description that accurately describes the course.”\r\n\r\nThe class unanimously loved Professor Lamas. One student noted that Professor Lamas “is a phenomenal teacher distinguished by his ability to concretize the subject matter for his students as it is relevant to our lives and the decisions we make.” Time after time, students remarked on Professor Lamas’s dedication and accessibility. Not a single student had something negative to say about Professor Lamas.\r\n\r\nStudents generally enjoyed the readings and felt that they were relevant both to class and to their everyday lives. Most students would recommend this class to anyone interested in Urban Studies, regardless of their major.", "num_students": 25, "path": "/courses/16557/sections/601/reviews/1202-ANDREW-T--LAMAS", "instructor": {"path": "/instructors/1202-ANDREW-T--LAMAS", "first_name": "ANDREW T.", "last_name": "LAMAS", "id": "1202-ANDREW-T--LAMAS", "name": "ANDREW T. LAMAS"}, "num_reviewers": 25, "id": "16557-601-1202-ANDREW-T--LAMAS"}]