[{"ratings": {"rAmountLearned": "2.43", "rDifficulty": "2.37", "rStimulateInterest": "2.44", "rRecommendMajor": "2.98", "rCourseQuality": "2.52", "rWorkRequired": "2.47", "rInstructorAccess": "3.14", "rReadingsValue": "2.42", "rRecommendNonMajor": "1.93", "rCommAbility": "2.95", "rInstructorQuality": "2.93"}, "section": {"name": "TISSUE ENG/PR/MTHD/APP", "sectionnum": "001", "primary_alias": "BE-553-001", "path": "/courses/24042/sections/001", "id": "24042-001", "aliases": ["BE-553-001"]}, "comments": "Tissue engineering demonstrates enormous potential for improving human health.\r\nWhile there is an extensive body of literature discussing the state of the art of tissue\r\nengineering, the majority of this literature is descriptive and does little to address the\r\nprinciples that govern the success or failure of an engineering tissue. This course explores\r\nprinciples of tissue engineering, drawing upon diverse fields such as developmental\r\nbiology, immunology, cell biology, physiology, transport phenomena, material science,\r\nand polymer chemistry. Current and developing methods of tissue engineering as well as\r\nspecific applications are discussed in the context of these principles.\r\nOverall, students “enjoyed the course” and felt that “it covered a lot of content.”\r\nStudents had to “read a lot of papers” for the class, and one of the exams was focused on\r\n“10 research that were presented in class.” The final project in the class was to develop a\r\nbusiness plan.\r\nThe class was said to be “well structured.” However, there was no textbook or\r\n“notes posted online.”\r\nSome students found the final exam difficult because it tested “minute details,”\r\nbut the class was fair; students were tested on “material that we learned in class.”", "num_students": 46, "path": "/courses/24042/sections/001/reviews/5290-CHELSEA-N-SALINAS", "instructor": {"path": "/instructors/5290-CHELSEA-N-SALINAS", "first_name": "CHELSEA N", "last_name": "SALINAS", "id": "5290-CHELSEA-N-SALINAS", "name": "CHELSEA N SALINAS"}, "num_reviewers": 46, "id": "24042-001-5290-CHELSEA-N-SALINAS"}]