[{"ratings": {"rAmountLearned": "1.91", "rDifficulty": "3.37", "rStimulateInterest": "1.11", "rRecommendMajor": "2.20", "rCourseQuality": "1.61", "rWorkRequired": "2.91", "rInstructorAccess": "1.86", "rReadingsValue": "2.00", "rRecommendNonMajor": "0.70", "rCommAbility": "1.66", "rInstructorQuality": "1.36"}, "section": {"name": "GEN.PHYS.:EM,OPTICS,MODP", "sectionnum": "001", "primary_alias": "PHYS-102-001", "path": "/courses/24973/sections/001", "id": "24973-001", "aliases": ["PHYS-102-001"]}, "comments": "This course is a continuation of PHYS 101, emphasizing an introduction to\r\nclassical electricity and magnetism, relativity theory, optics, and the quantum theory of\r\nmatter. It requires a background in calculus.\r\nOverall students were unhappy with this course, but this sentiment was generally a\r\nreflection of the professor. One student noted that the class is a “good survey of second\r\nsemester physics concepts,” and another reported enjoying the subject matter, but very\r\nfew other students provided qualitative feedback about the course content. Students were\r\nunpleasantly surprised by the amount of calculus required for this intro level physics\r\ncourse.\r\nStudents were rather displeased with Professor Durian. Students described his\r\nlecture style as “boring,” “consistently dull” and “uninspiring.” They noted that he was\r\nboth unable to keep students interested, and he was also a very poor communicator of the\r\nmaterial. Students complained that Professor Durian failed to communicate with the TAs\r\nto ensure that quizzes corresponded to what students should expect on exams. Several\r\nstudents noted that he was “condescending” to students who asked questions in and out of\r\nclass. Many reported that they did not find him a fit instructor for an intro level class.\r\nThis course fulfills the Physical World Sector requirement. Physics 101 is a\r\nprerequisite for the course, and students must also take a Physics 102 lab concurrently\r\nwith this course. This course was suggested by the department for students in a prehealth\r\nprogram. Exams were described by many students as “much too difficult for an\r\nintro physics course” and “not the least bit straightforward.” A majority of students\r\ncomplained that the content and difficulty of exams did not at all correspond to the\r\nhomework problems or quizzes and also did not reflect the content that was covered in\r\nclass or the assigned readings. In addition, lectures focused on theory, while the exams\r\nwere largely problems-based. As such, students felt very unprepared for exams.\r\nStudents also disliked that there was “no leniency with grading,” such as dropped quizzes\r\nor tests or opportunities for extra credit. In addition, solutions to past exams were only\r\nposted a few days in advance, which “left many students scrambling.”\r\n*Nine students submitted qualitative comments for this course", "num_students": 43, "path": "/courses/24973/sections/001/reviews/2652-DOUGLAS-J--DURIAN", "instructor": {"path": "/instructors/2652-DOUGLAS-J--DURIAN", "first_name": "DOUGLAS J.", "last_name": "DURIAN", "id": "2652-DOUGLAS-J--DURIAN", "name": "DOUGLAS J. DURIAN"}, "num_reviewers": 38, "id": "24973-001-2652-DOUGLAS-J--DURIAN"}]