{"coursehistories": {"path": "/coursehistories/2515"}, "description": "This course has two parts. The first looks at market and government failures and discusses the need for public policies as well as limits to their effectiveness including the evaluation of public projects using cost benefit analysis. The second part focuses on the economic analysis of taxation, including the economic incidence and efficiency of taxes. \n\n", "semester": "2008A", "name": "PUBLIC FINANCE", "reviews": {"path": "/courses/20023/reviews", "values": [{"ratings": {"rAmountLearned": "2.47", "rDifficulty": "2.15", "rStimulateInterest": "3.22", "rRecommendMajor": "3.45", "rCourseQuality": "2.83", "rWorkRequired": "1.97", "rInstructorAccess": "3.03", "rReadingsValue": "2.48", "rRecommendNonMajor": "2.28", "rCommAbility": "3.35", "rInstructorQuality": "3.32"}, "section": {"name": "PUBLIC FINANCE", "sectionnum": "001", "primary_alias": "ECON-231-001", "path": "/courses/20023/sections/001", "id": "20023-001", "aliases": ["ECON-231-001"]}, "comments": "Public Finance is separated into two parts. The first looks at market and government failures, the need for sound public policies, the limits of policy effectiveness, and the evaluation of public projects using cost benefit analysis. The second part focuses on the economic analysis of taxation, including the economics incidence and efficiency of taxes. \r\n\t\r\nStudents loved the way that the course material was applied to real world situations calling it “interesting and thought provoking. What a real college class should be.” Several students mentioned that it was unlike any other economics course they had taken: “It was the first time I had to write a paper for an Economics class,” said one student. Another mentioned, “I found the course very informative and less abstract than many other Econ classes.” Despite the unique way the material was presented, some students claimed that there was virtually no new material covered that wasn’t learned in Econ101 and 102, saying that “at times it felt like a repeat of previous classes.” \r\n\t\r\nStudents loved Professor Eekhout. Many mentioned that they “enjoyed the professor’s anecdotes and connections to the real world.”  Students commented that they “were never bored in class,” and that “it was so refreshing to have a professor who is so passionate and stimulating.”\r\n\t\r\nStudents felt the material discussed in class did not always correlate to the exam questions.  The class was mostly Economics majors since ECON 101, MATH 104 and MATH 114 or MATH 115 are prerequisites to taking this class. Also, ECON 103 is recommended and credit cannot be received for both ECON 030 and 231.", "num_students": 110, "path": "/courses/20023/sections/001/reviews/1369-JAN-EECKHOUT", "instructor": {"path": "/instructors/1369-JAN-EECKHOUT", "first_name": "JAN", "last_name": "EECKHOUT", "id": "1369-JAN-EECKHOUT", "name": "JAN EECKHOUT"}, "num_reviewers": 75, "id": "20023-001-1369-JAN-EECKHOUT"}]}, "credits": null, "primary_alias": "ECON-231", "path": "/courses/20023", "sections": {"path": "/courses/20023/sections", "values": [{"name": "PUBLIC FINANCE", "sectionnum": "001", "primary_alias": "ECON-231-001", "path": "/courses/20023/sections/001", "id": "20023-001", "aliases": ["ECON-231-001"]}]}, "id": 20023, "aliases": ["ECON-231"]}