{"coursehistories": {"path": "/coursehistories/4591"}, "description": "This course focuses on health and healing in the colonial and post-colonial world. We give special attention to local healing under condition of domination, to definitions of the body and the person in biomedicine and in non-European healing traditions, and to th epolitical and cultural place of medicine in regions which have experienced colonial rule. \n\n", "semester": "2012A", "name": "COMPARATIVE MEDICINE", "reviews": {"path": "/courses/27601/reviews", "values": [{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "2.79", "rStimulateInterest": "2.50", "rRecommendMajor": "3.15", "rCourseQuality": "2.73", "rWorkRequired": "2.94", "rInstructorAccess": "2.72", "rReadingsValue": "2.88", "rRecommendNonMajor": "2.42", "rCommAbility": "2.65", "rInstructorQuality": "2.93"}, "section": {"name": "COMPARATIVE MEDICINE", "sectionnum": "401", "primary_alias": "HSOC-145-401", "path": "/courses/27601/sections/401", "id": "27601-401", "aliases": ["HSOC-145-401", "HIST-146-401", "STSC-145-401"]}, "comments": "This course focuses on health and healing in the colonial and post-colonial world.  We give special attention to local healing under condition of domination, to definitions of the body and the person in biomedicine and in non-European healing traditions, and to the political and cultural place of medicine in regions which have experienced colonial rule.\r\n\r\nA majority of students seemed to enjoy this “interesting” and “engaging” course, although some students felt the material was oftentimes “confusing” and “rushed.” The course required a lot of work, but most students felt it was enjoyable and had a great time doing the outside readings and assignments.\r\n\r\nMost students remarked upon how organized Professor Feierman was and what an enjoyable lecturer he was to listen to. He was described as “extremely passionate.” Students could tell that he “definitely cared about his lectures and students.”\r\n\r\nThis course fulfills the History and Tradition requirement, and while students remarked upon the fact that it required a lot of work for a general requirement, it was worth it. They suggested it for anybody with an interest in global healthcare.", "num_students": 48, "path": "/courses/27601/sections/401/reviews/666-STEVEN-FEIERMAN", "instructor": {"path": "/instructors/666-STEVEN-FEIERMAN", "first_name": "STEVEN", "last_name": "FEIERMAN", "id": "666-STEVEN-FEIERMAN", "name": "STEVEN FEIERMAN"}, "num_reviewers": 40, "id": "27601-401-666-STEVEN-FEIERMAN"}]}, "credits": null, "primary_alias": "HSOC-145", "path": "/courses/27601", "sections": {"path": "/courses/27601/sections", "values": [{"name": "COMPARATIVE MEDICINE", "sectionnum": "401", "primary_alias": "HSOC-145-401", "path": "/courses/27601/sections/401", "id": "27601-401", "aliases": ["HSOC-145-401", "HIST-146-401", "STSC-145-401"]}]}, "id": 27601, "aliases": ["HSOC-145", "HIST-146", "STSC-145"]}