[{"ratings": {"rAmountLearned": "2.90", "rDifficulty": "2.18", "rStimulateInterest": "2.78", "rRecommendMajor": "3.34", "rCourseQuality": "2.70", "rWorkRequired": "2.46", "rInstructorAccess": "3.10", "rReadingsValue": "3.06", "rRecommendNonMajor": "2.79", "rCommAbility": "2.58", "rInstructorQuality": "2.75"}, "section": {"name": "HISTORY OF MODERN CHINA", "sectionnum": "401", "primary_alias": "HIST-097-401", "path": "/courses/26184/sections/401", "id": "26184-401", "aliases": ["HIST-097-401", "EALC-047-401"]}, "comments": "This course offered an overview of the upheavals that “Greater China” has experienced from the late Qing to the Post-Mao era, interspersed with personal perspectives revealed in primary source readings such as memoirs, novels, and oral accounts. The survey course focused on three main themes: 1) the repositioning of China in the new East Asian and world orders; 2) the emergence of a modern Chinese state and nationalistic identity shaped and reshaped by a series of cultural crises; and finally, 3) the development and transformation of Chinese modernity. \r\n\r\nStudents were for the most part very pleased with HIST097401. They frequently described it as “interesting” and “engaging,” and said the course gave them a new understanding of Chinese culture. The readings were held in high acclaim, especially Spence's The Search for Modern China, and several students felt that they learned more from the readings than from lectures.\r\n\r\nWhile Professor Fei's lectures were “a joy to attend,” a common complaint was that at times her accent made her hard to understand. The lectures were often “disorganized” and occasionally felt like a “repeat of the material” that was covered in readings, but “enjoyable” nevertheless. Professor Fei “addresses the student's needs very well” and “is willing to meet with students whenever.”\r\n\r\nThere are no prerequisites for HIST097, and aside from the occasional frustration, there were no complaints about the course-load, though one student called the assigned reading “realistically...impossible to do all the time.” As a warning, sometimes the class stretches past 50 minutes, but students highly recommend the course to both majors and non-majors. The course fulfills the History and Tradition Sector.\r\n", "num_students": 92, "path": "/courses/26184/sections/401/reviews/2997-SI-YEN-FEI", "instructor": {"path": "/instructors/2997-SI-YEN-FEI", "first_name": "SI-YEN", "last_name": "FEI", "id": "2997-SI-YEN-FEI", "name": "SI-YEN FEI"}, "num_reviewers": 85, "id": "26184-401-2997-SI-YEN-FEI"}]