{"coursehistories": {"path": "/coursehistories/250"}, "description": "Basic concepts and principles of chemistry and their applications in chemistry and closely-related fields. The first term emphasizes the understanding of chemical reactions through atomic and molecular structure. This is a university level course, treating the material in sufficient depth so that students can solve chemical problems and can understand the principles involved in their solution. It includes an introduction to condensed matter. This course is suitable for majors or non-majors and is recommended to satisfy either major or preprofessional requirements for general chemistry. This course is presented for students with high school chemistry and calculus. Students with a lesser background than this should take Chemistry 100. \n\n", "semester": "2011A", "name": "GENERAL CHEMISTRY I", "reviews": {"path": "/courses/21394/reviews", "values": [{"ratings": {"rAmountLearned": "2.63", "rDifficulty": "3.27", "rStimulateInterest": "2.01", "rRecommendMajor": "3.44", "rCourseQuality": "2.27", "rWorkRequired": "2.78", "rInstructorAccess": "2.73", "rReadingsValue": "2.36", "rRecommendNonMajor": "1.32", "rCommAbility": "2.41", "rInstructorQuality": "2.48"}, "section": {"name": "GENERAL CHEMISTRY I", "sectionnum": "001", "primary_alias": "CHEM-101-001", "path": "/courses/21394/sections/001", "id": "21394-001", "aliases": ["CHEM-101-001"]}, "comments": "CHEM 101 covers basic concepts and principles of chemistry and their applications in chemistry and closely-related fields. The first term emphasizes the understanding of chemical reactions through atomic and molecular structure. This is a university level course, treating the material in sufficient depth so that students can solve chemical problems and can understand the principles involved in their solution. This course is suitable for majors or non-majors and is recommended to satisfy either major or pre-professional requirements for general chemistry. It also fulfills the Physical World Sector requirement. This course is presented for students with high school chemistry and calculus. Students with a lesser background than this should take Chemistry 100.\r\n\r\nStudents generally found CHEM 101 to be an “interesting” and “relatively enjoyable” course. The class moves quickly and can be difficult, but it is also “well structured” and “organized.”\r\n\r\nProfessor Graves was generally described as an “excellent teacher” with a real passion for chemistry. While some students found that Professor Graves was very helpful outside of class during office hours, other students were turned off by his “intimidating” manner, and felt that he talked down to students. Students were also concerned that Professor Graves often assumed students had knowledge of subjects outside of the course, especially in his use of terminology. \r\n\r\nStudents felt that the exams were often too long and could be very difficult, with “unwelcome surprises.” With four midterms and a final, as well as weekly problem sets and reading, this course requires a lot of work.\r\n", "num_students": 121, "path": "/courses/21394/sections/001/reviews/4762-CHRISTOPHER-R--GRAVES", "instructor": {"path": "/instructors/4762-CHRISTOPHER-R--GRAVES", "first_name": "CHRISTOPHER R.", "last_name": "GRAVES", "id": "4762-CHRISTOPHER-R--GRAVES", "name": "CHRISTOPHER R. GRAVES"}, "num_reviewers": 104, "id": "21394-001-4762-CHRISTOPHER-R--GRAVES"}]}, "credits": null, "primary_alias": "CHEM-101", "path": "/courses/21394", "sections": {"path": "/courses/21394/sections", "values": [{"name": "GENERAL CHEMISTRY I", "sectionnum": "001", "primary_alias": "CHEM-101-001", "path": "/courses/21394/sections/001", "id": "21394-001", "aliases": ["CHEM-101-001"]}]}, "id": 21394, "aliases": ["CHEM-101"]}