{"coursehistories": {"path": "/coursehistories/2551"}, "description": "Model Building and Linear Programming: Graphical Methods and The Simplex Method, the LINDO and LINGO Computer Packages, Degeneracies, Minimization and the BigM and the Two-Phase Methods, and Goal Programming. Sensitivity Analysis: Geometric and Algebraic Approaches, The Computer and Sensitivity Analysis, The Dual of An LP Problem, The Dual Theorem, Shadow Prices, Complementary Slackness, The Dual Simplex Method, and The Revised Simplex Method. Integer Programming: The Branch and Bound Method, Enumeration Methods, and the Cutting Plane Method. Nonlinear Programming: Review of Differential Calculus, Convex and Concave Functions, Solving NLP Problems with One Variable, Uncontraint Nonlinear Optimization with Several Variables, Lagrange Multipliers and Constraint Nonlinear Optimization with Several Variables, The Kuhn-Tucker Conditions and Quadratic Programming. \n\n", "semester": "2010C", "name": "OPTIMIZATION OF SYSTEMS", "reviews": {"path": "/courses/23028/reviews", "values": [{"ratings": {"rAmountLearned": "2.50", "rDifficulty": "2.68", "rStimulateInterest": "2.10", "rRecommendMajor": "3.05", "rCourseQuality": "2.74", "rWorkRequired": "2.55", "rInstructorAccess": "3.20", "rReadingsValue": "2.79", "rRecommendNonMajor": "2.05", "rCommAbility": "2.80", "rInstructorQuality": "2.91"}, "section": {"name": "OPTIMIZATION OF SYSTEMS", "sectionnum": "001", "primary_alias": "ESE-304-001", "path": "/courses/23028/sections/001", "id": "23028-001", "aliases": ["ESE-304-001"]}, "comments": "This class covers model building and linear programming, from graphical methods to the simplex method and from the LINDO to the LINGO Computer. By the end of the semester, students can expect to have a solid grasp in packages, degeneracies, minimization and the BigM and the Two-Phase Methods, and Goal Programming. Sensitivity Analysis and Shadow Prices are also covered, along with numerous programming methods (the branch and bound method, enumeration methods, and cutting plane method). A review of differential calculus and an introduction to nonlinear optimization are also major components of the class syllabus. \r\n\r\nA majority of students found this class to be enjoyable, noting that many aspects had “real-world applications.” Students generally highly praised Professor Carchidi’s notes, saying that they “serve as a replacement for the textbook.” One student commented that the professor was “not sure how necessary class attendance really was, as the notes are extremely comprehensive.”\r\n\r\nOverall, students seemed to agree that Professor Carchidi was an “excellent” professor – one who “did an excellent job of taking the time to ensure that all students were comfortable with the material.” Although students tended to find his lectures “dry” and sometimes “boring,” many commented on how Professor Carchidi’s office hours “were so numerous [that] it was fairly easy to get in contact with him to discuss the problems.” Students generally wished that his lectures were more “engaging;” however, most believed that Professor Carchidi taught the material well and felt that they had learned something by the end of the course. \r\n\r\nThe class notes supplied by Professor Carchidi were very “helpful” and “beneficial,” according to some students. One student stated, “concepts in examinations are easy, but computations are sometimes tedious and lengthy. Thus, a student's grade on any particular examination [is determined] by how good he/she is at performing numerous arithmetic operations in a short amount of time instead of by his/her overall knowledge of the material.” The class had a “high learning curve” and the homework assignments were usually based off the previous chapter. Overall, students believed that “exams were not too bad if you can understand the homework assignments, since they followed the same format.”\r\n", "num_students": 25, "path": "/courses/23028/sections/001/reviews/774-MICHAEL-A--CARCHIDI", "instructor": {"path": "/instructors/774-MICHAEL-A--CARCHIDI", "first_name": "MICHAEL A.", "last_name": "CARCHIDI", "id": "774-MICHAEL-A--CARCHIDI", "name": "MICHAEL A. CARCHIDI"}, "num_reviewers": 24, "id": "23028-001-774-MICHAEL-A--CARCHIDI"}]}, "credits": null, "primary_alias": "ESE-304", "path": "/courses/23028", "sections": {"path": "/courses/23028/sections", "values": [{"name": "OPTIMIZATION OF SYSTEMS", "sectionnum": "001", "primary_alias": "ESE-304-001", "path": "/courses/23028/sections/001", "id": "23028-001", "aliases": ["ESE-304-001"]}]}, "id": 23028, "aliases": ["ESE-304"]}