{"coursehistories": {"path": "/coursehistories/771"}, "description": "This course provides an introduction to the fundamental concepts of Materials Science through an examination of the structure, property, performance relationship for synthetic and biologic structural materials with a focus on surgical implants and medical devices. Consideration is given to issues of biocompatibility, degradation of materials by the biologic systems, and biologic response to artificial materials. Particular attention will be given to the materials of total hip and knee prostheses and their relationship to the long term outcomes in hip and knee arthroplasty. \n\n", "semester": "2011C", "name": "STRUCTURAL MATERIALS", "reviews": {"path": "/courses/24799/reviews", "values": [{"ratings": {"rAmountLearned": "3.20", "rDifficulty": "2.27", "rStimulateInterest": "2.57", "rRecommendMajor": "3.70", "rCourseQuality": "3.00", "rWorkRequired": "2.67", "rInstructorAccess": "3.07", "rReadingsValue": "3.00", "rRecommendNonMajor": "2.37", "rCommAbility": "2.79", "rInstructorQuality": "2.76"}, "section": {"name": "STRUCTURAL MATERIALS", "sectionnum": "001", "primary_alias": "MSE-220-001", "path": "/courses/24799/sections/001", "id": "24799-001", "aliases": ["MSE-220-001"]}, "comments": "This course provides an introduction to the fundamental concepts of materials\r\nscience through an examination of the structure, property, and performance relationship\r\nfor synthetic and biologic structural materials with a focus on surgical implants and\r\nmedical devices. Consideration is given to issues of biocompatibility, degradation of\r\nmaterials by the biologic systems, and biologic response to artificial materials. Particular\r\nattention is given to the materials of total hip and knee prostheses and their relationship to\r\nthe long-term outcomes in hip and knee arthroplasty.\r\nStudents for the most part felt that they “gained a lot” from taking this course. A\r\nlot of material was covered, but students felt that it was “extremely useful” knowledge\r\nfor all engineers.\r\nStudents were generally satisfied with Professor Winey. They also raved about\r\ntheir teaching assistant Skyler Silverman, claiming that he “beats any TA.”\r\nThough this class covered a lot of material, students felt that it was manageable.\r\nDaily quizzes meant that students had to stay on top of the course. One student\r\nrecommended the course to all engineer majors. The prerequisites for this course are\r\nknowledge of basic calculus and chemistry.", "num_students": 36, "path": "/courses/24799/sections/001/reviews/842-KAREN-I--WINEY", "instructor": {"path": "/instructors/842-KAREN-I--WINEY", "first_name": "KAREN I.", "last_name": "WINEY", "id": "842-KAREN-I--WINEY", "name": "KAREN I. WINEY"}, "num_reviewers": 34, "id": "24799-001-842-KAREN-I--WINEY"}]}, "credits": null, "primary_alias": "MSE-220", "path": "/courses/24799", "sections": {"path": "/courses/24799/sections", "values": [{"name": "STRUCTURAL MATERIALS", "sectionnum": "001", "primary_alias": "MSE-220-001", "path": "/courses/24799/sections/001", "id": "24799-001", "aliases": ["MSE-220-001"]}]}, "id": 24799, "aliases": ["MSE-220"]}