[{"ratings": {"rAmountLearned": "3.21", "rDifficulty": "2.46", "rStimulateInterest": "3.49", "rRecommendMajor": "3.57", "rCourseQuality": "3.13", "rWorkRequired": "2.54", "rInstructorAccess": "3.31", "rReadingsValue": "2.74", "rRecommendNonMajor": "3.09", "rCommAbility": "3.29", "rInstructorQuality": "3.23"}, "section": {"name": "MANAGEMENT INFO SYSTEMS", "sectionnum": "001", "primary_alias": "OPIM-210-001", "path": "/courses/24930/sections/001", "id": "24930-001", "aliases": ["OPIM-210-001"]}, "comments": "Operations and Information Management 210 is an introduction to the management of information technology focusing on technology, organization, and strategy. The goal of this course is to equip students with the knowledge and tools to utilize information systems to pursue a firm's strategic and organizational goals. \r\n\r\nMany students found this class to be “rewarding” and “amazing.” Students considered the course content to be full of “valuable lessons that are applicable in the lives of everyone.”\r\n\r\nGenerally students commented that Professor Clemons was an “entertaining ” and “passionate” teacher. Many students liked Professor Clemons, as he “had a great wealth of personal stories, many of which are hilarious, but all of which add context to the course material.”\r\n\r\nSome students complained that “the readings seemed disconnected and that there were indeed a little too many cases to analyze.”  Students also suggested that “the final project had little to do with the course content.” This class is recommended for students who are interested in “learning more about business, entrepreneurship, or information economics.” There are no prerequisites for the course other than a general interest in the applications of information technology.\r\n", "num_students": 44, "path": "/courses/24930/sections/001/reviews/4075-ERIC-K-CLEMONS", "instructor": {"path": "/instructors/4075-ERIC-K-CLEMONS", "first_name": "ERIC K", "last_name": "CLEMONS", "id": "4075-ERIC-K-CLEMONS", "name": "ERIC K CLEMONS"}, "num_reviewers": 41, "id": "24930-001-4075-ERIC-K-CLEMONS"}]