[{"ratings": {"rAmountLearned": "3.50", "rDifficulty": "2.22", "rStimulateInterest": "3.39", "rRecommendMajor": "3.67", "rCourseQuality": "3.39", "rWorkRequired": "2.44", "rInstructorAccess": "3.39", "rReadingsValue": "3.22", "rRecommendNonMajor": "3.44", "rCommAbility": "3.50", "rInstructorQuality": "3.56"}, "section": {"name": "PHILANTHROPY & THE CITY", "sectionnum": "601", "primary_alias": "URBS-404-601", "path": "/courses/23888/sections/601", "id": "23888-601", "aliases": ["URBS-404-601"]}, "comments": "This course will focus on how urban communities are shaped by the nonprofit sector and the billions of philanthropic dollars that fuel their work. By bridging theory and practice, the class explores what dynamics are at play to deliver vital services or programs in healthcare, education, the arts, community development, and other issues. The course will also focus on these important questions: (1) Whose responsibility is the public good? How is that responsibility shared by the public, private, and nonprofit sectors? and (2) Given that responsibility for the public good, which individuals and groups make the decisions about how to serve the public good? How are these decisions made, and who benefits from these decisions? Students will consider these questions in an interdisciplinary context that will bring a historical and philosophical perspective to the examination of the values and institutions that characterize the contemporary philanthropy and the nonprofit sector.\r\n\r\nStudents universally raved about the course. The class “bridges the gap between theory and practice.” Students appreciated the “very well planned” course and excellent guest speakers. They were especially impressed with the site visits, which one student claimed were “where [he] learned the most.” The field trips, readings, and discussions “all contributed immensely” to the students’ understanding of the material and the ‘third sector.’ \r\n\r\nProfessor Goldman was considered “amazing” and a “leader in the field.” He was praised for “[demonstrating] the ability to be open to all points of view” and for his” “wealth of experience and intelligence that is unmatchable.” His skill at “facilitating discussion in the classroom” was also admired.\r\n\r\nSome students found the papers enjoyable to write, while others wished that the “directions for paper” had “been clearer.” There was “significant reading” for some weeks, however, it was considered to be carefully chosen. Overall, the course was recommended to “anyone interested in the third sector in general” as well as both majors and non-majors.\r\n", "num_students": 20, "path": "/courses/23888/sections/601/reviews/1765-GREG-H--GOLDMAN", "instructor": {"path": "/instructors/1765-GREG-H--GOLDMAN", "first_name": "GREG H.", "last_name": "GOLDMAN", "id": "1765-GREG-H--GOLDMAN", "name": "GREG H. GOLDMAN"}, "num_reviewers": 18, "id": "23888-601-1765-GREG-H--GOLDMAN"}, {"ratings": {"rAmountLearned": "3.50", "rDifficulty": "2.22", "rStimulateInterest": "3.56", "rRecommendMajor": "3.67", "rCourseQuality": "3.39", "rWorkRequired": "2.44", "rInstructorAccess": "3.67", "rReadingsValue": "3.22", "rRecommendNonMajor": "3.44", "rCommAbility": "3.78", "rInstructorQuality": "3.78"}, "section": {"name": "PHILANTHROPY & THE CITY", "sectionnum": "601", "primary_alias": "URBS-404-601", "path": "/courses/23888/sections/601", "id": "23888-601", "aliases": ["URBS-404-601"]}, "comments": "This course will focus on how urban communities are shaped by the nonprofit sector and the billions of philanthropic dollars that fuel their work. By bridging theory and practice, the class explores what dynamics are at play to deliver vital services or programs in healthcare, education, the arts, community development, and other issues. The course will also focus on these important questions: (1) Whose responsibility is the public good? How is that responsibility shared by the public, private, and nonprofit sectors? and (2) Given that responsibility for the public good, which individuals and groups make the decisions about how to serve the public good? How are these decisions made, and who benefits from these decisions? Students will consider these questions in an interdisciplinary context that will bring a historical and philosophical perspective to the examination of the values and institutions that characterize the contemporary philanthropy and the nonprofit sector.\r\n\r\nStudents unanimously raved about the course. The class “bridges the gap between theory and practice.” Students appreciated the “very well planned” course and excellent guest speakers. They were especially impressed with the site visits, which one student claimed were “where [he] learned the most”. The field trips, readings, and discussions “all contributed immensely” to the students’ understanding of the material and the ‘third sector.’ \r\n\r\nProfessor Bauer was considered “amazing” and a “leader in the field”. He was praised for “[demonstrating] the ability to be open to all points of view” and for his” “wealth of experience and intelligence that is unmatchable.” His skill at “facilitating discussion in the classroom” was also highly admired.\r\n\r\nSome students found the papers enjoyable to write, while others wished that the “directions for the paper” had “been clearer”. There was “significant reading” for some weeks, however, it was considered to be carefully chosen. Overall, the course was recommended to “anyone interested in the third sector in general” as well as both majors and non-majors.\r\n", "num_students": 20, "path": "/courses/23888/sections/601/reviews/2375-DOUGLAS-B--BAUER", "instructor": {"path": "/instructors/2375-DOUGLAS-B--BAUER", "first_name": "DOUGLAS B.", "last_name": "BAUER", "id": "2375-DOUGLAS-B--BAUER", "name": "DOUGLAS B. BAUER"}, "num_reviewers": 18, "id": "23888-601-2375-DOUGLAS-B--BAUER"}]