[{"ratings": {"rAmountLearned": "3.17", "rDifficulty": "2.87", "rStimulateInterest": "3.23", "rRecommendMajor": "3.50", "rCourseQuality": "3.21", "rWorkRequired": "3.23", "rInstructorAccess": "3.60", "rReadingsValue": "2.90", "rRecommendNonMajor": "0.93", "rCommAbility": "3.40", "rInstructorQuality": "3.58"}, "section": {"name": "SEPARATION PROCESSES", "sectionnum": "001", "primary_alias": "CBE-371-001", "path": "/courses/25727/sections/001", "id": "25727-001", "aliases": ["CBE-371-001"]}, "comments": "Separations Processes focuses on industrial methods for separating mixtures, such as distillation, liquid-liquid extraction, absorption and adsorption, separation using membranes, etc. Pre-requisites for this course include CBE 230 (Material and Energy Balances) and CBE 231 (Thermodynamics of Fluids).\r\n\r\nStudents gave mixed reviews for the course. While some complained that it was “difficult and boring,\" others said they “thoroughly enjoyed” it. According to one student, “A student's ability to perform the analysis taught was regarded with appropriate value, as opposed to placing sole emphasis on simply generating a [correct] numeric value.” The students appreciated the use of ASPEN (computer program) in their homework (it was “a great way to practically apply the theoretical knowledge [taught in class]”), and they also reported to have enjoyed the guest lectures. Some students felt that the content of the course needs adjusting. One student said it would have been better to have spent “more time on membrane separation rather than crystallization,\" while another said “too much time is spent on distillation, rederiving similar equations over and over.\" They felt it would be preferable to “go faster through the material and cover more processes,\" because “so little content is covered, exams must be made very long to produce a curve.\" Students also complained about the textbook which presented the material in a “completely random and illogical way that is very difficult to follow when trying to study.\" They said that the homework assignments were too long (but enough time was given), and called for weighting the homework problems in a fairer manner. Some students complained that the exams were too long, but others thought they were “well-designed,\" “challenging”, and “assessed fairly.\"\r\n\r\nProfessor Lee, in one word, was “excellent.\" His lectures were “very organized;\" his teaching style and course structure was “conducive to both student learning and student success;\" he “[connected] with [the] students,\" showed them “a high level of respect;\" and he was “knowledgeable and able to convey the material in an efficient manner.\" Students also described him to be “accessible and approachable,\" “helpful and enthusiastic.\" Many claimed he was their favorite CBE teacher. The only complained voiced was that his lectures were “very fast paced.\"\r\n\r\nThis course is a general requirement for CBE majors, and the students wouldn’t recommend it to non-majors.\r\n\r\nThis review was based on 12 comments. ", "num_students": 37, "path": "/courses/25727/sections/001/reviews/4269-DAEYEON-LEE", "instructor": {"path": "/instructors/4269-DAEYEON-LEE", "first_name": "DAEYEON", "last_name": "LEE", "id": "4269-DAEYEON-LEE", "name": "DAEYEON LEE"}, "num_reviewers": 35, "id": "25727-001-4269-DAEYEON-LEE"}]