{"coursehistories": {"path": "/coursehistories/5620"}, "description": "'Hellenistic' names the age of Mediterranean culture from the generation of Alexander the Great and his father Philip of Macedon to the defeat of Cleopatra of Egypt at the end of the Roman Republic, mid 4th- late 1st c. BCE This course probes the arts and visual displays of that world, from marble monuments to jewelry, from the yachts and parades of the Ptolemies to the Roman triumph. Though we stard with Greek and Macedonian culture we'll look too to Hellenistic-style international elegance across multiple regions and people-- N. African Numidia and Etrusco-Roman italy in the West, and Anatolia, mesopotamia and Central Asia in the East. The explosive expansion of the Macedonian empires across Greece, and into the Persian empire of Egypt, the Middle East and Asia coincided with a wave of experimentalism in the look and the kinds of Greek arts. That was marked by individualism, cosmopolitanism, the exuberant embrace of kaleidoscope of styles and generic inventiveness, and the new passion for copy/replica; art settings expanded from civic and religious spheres to house and palace. \n\nThe socio-cultural context was a move towards the creations of fusion cultures between Greeks and other peoples, in a new historical self-consciousness, the celebrity cult of the master artist, and the onset of art markets and museums within a proto-global economy. We'll exploit, in translations, the Hellenistic inventions of new modes of art cirticism and art history, and of the praise of art and artworks in historical, literary and technical writing; for this course aims not least to reconstruct Hellenistic visuality, and the roles of patron, maker, and viewer in it, to complement our understanding of the art and artifacts that have survived til today. \n\nThe course uses a mixed lecture/seminar format for a once-weekly meeting. Not prerequisits. A 400-level course counts automatically for graduate credit; undergraduates are recommended to have reached junior year. Of special interest to students in ARTH, AAMW, ANCH, CLST, NELC, VLST \n\n", "semester": "2013A", "name": "HELLENISTIC ARTS/SPECT", "reviews": {"path": "/courses/29888/reviews", "values": [{"ratings": {"rDifficulty": "3.50", "rStimulateInterest": "3.33", "rCourseQuality": "3.50", "rWorkRequired": "3.33", "rInstructorQuality": "3.50", "rCommAbility": "2.83", "rInstructorAccess": "3.50"}, "section": {"name": "HELLENISTIC ARTS/SPECT", "sectionnum": "401", "primary_alias": "ARTH-428-401", "path": "/courses/29888/sections/401", "id": "29888-401", "aliases": ["ARTH-428-401", "AAMW-428-401"]}, "comments": "", "num_students": 7, "path": "/courses/29888/sections/401/reviews/1265-ANN-L--KUTTNER", "instructor": {"path": "/instructors/1265-ANN-L--KUTTNER", "first_name": "ANN L.", "last_name": "KUTTNER", "id": "1265-ANN-L--KUTTNER", "name": "ANN L. KUTTNER"}, "num_reviewers": 6, "id": "29888-401-1265-ANN-L--KUTTNER"}]}, "credits": null, "primary_alias": "ARTH-428", "path": "/courses/29888", "sections": {"path": "/courses/29888/sections", "values": [{"name": "HELLENISTIC ARTS/SPECT", "sectionnum": "401", "primary_alias": "ARTH-428-401", "path": "/courses/29888/sections/401", "id": "29888-401", "aliases": ["ARTH-428-401", "AAMW-428-401"]}]}, "id": 29888, "aliases": ["ARTH-428", "AAMW-428"]}