[{"ratings": {"rAmountLearned": "2.39", "rDifficulty": "3.77", "rStimulateInterest": "2.30", "rRecommendMajor": "2.88", "rCourseQuality": "1.81", "rWorkRequired": "3.31", "rInstructorAccess": "1.31", "rReadingsValue": "1.94", "rRecommendNonMajor": "0.65", "rCommAbility": "2.32", "rInstructorQuality": "2.23"}, "section": {"name": "CELLULAR BIOLOGY AND BIOCHEMISTRY", "sectionnum": "001", "primary_alias": "BIOL-202-001", "path": "/courses/17027/sections/001", "id": "17027-001", "aliases": ["BIOL-202-001"]}, "comments": "This biochemistry course introduces students to both the structure and function of cells. Specific topics include enzymes, membrane structure, signal transduction, motility, and the cell cycle. Previous biology coursework is required, and prior knowledge of basic chemistry is strongly recommended. This course also has a recitation component, which is optional but highly recommended. This course was co-taught by Professor Svitkina.\r\n\r\nAlthough students thought the course was interesting, many felt there was too much emphasis placed on experiments and the experimental history of biochemistry. One student noted that exams focused on experiments, procedures and results over theory, which may put students with limited lab experience at a disadvantage. Others commented that for an introductory course, the material was too “expansive,” “dense” and “difficult.” Readings did not correlate well with material from lecture and did not help students prepare for exams. As a result, many students felt the best strategy for success was rout memorization. Students complained about various administrative aspects of the course, including poor coordination between professors, insufficient communication between professors and TAs, and the lack of an answer key to practice exams and midterms. Students also commented that recitations could have been made more useful.\r\n\r\nMost students enjoyed Dr. Shultz's lectures and enthusiasm for the material, and they how he would ask students questions to ensure they were engaged. However many felt he made little effort to help students outside the classroom. Some pointed out that he was \"unapproachable,” even “rude” at times, and would refer students’ questions to the TAs.\r\n\r\nStudents found the course to be very difficult, and many felt that the exam questions were not a fair representation of what was learned in class. One student pointed out that \"the level of detail that was required took the emphasis away from gaining an understanding of the subject matter and placed it on memorizing less-important details.\" Several students expressed concern with the fact that students received a 45 on average for one of the midterms.", "num_students": 80, "path": "/courses/17027/sections/001/reviews/198-RICHARD-M-SCHULTZ", "instructor": {"path": "/instructors/198-RICHARD-M-SCHULTZ", "first_name": "RICHARD M", "last_name": "SCHULTZ", "id": "198-RICHARD-M-SCHULTZ", "name": "RICHARD M SCHULTZ"}, "num_reviewers": 71, "id": "17027-001-198-RICHARD-M-SCHULTZ"}, {"ratings": {"rAmountLearned": "2.39", "rDifficulty": "3.77", "rStimulateInterest": "1.50", "rRecommendMajor": "2.88", "rCourseQuality": "1.81", "rWorkRequired": "3.31", "rInstructorAccess": "1.83", "rReadingsValue": "1.94", "rRecommendNonMajor": "0.65", "rCommAbility": "1.82", "rInstructorQuality": "1.84"}, "section": {"name": "CELLULAR BIOLOGY AND BIOCHEMISTRY", "sectionnum": "001", "primary_alias": "BIOL-202-001", "path": "/courses/17027/sections/001", "id": "17027-001", "aliases": ["BIOL-202-001"]}, "comments": "This biochemistry course introduces students to both the structure and function of cells. Specific topics include enzymes, membrane structure, signal transduction, motility, and the cell cycle. Previous biology coursework is required, and prior knowledge of basic chemistry is strongly recommended. This course also has a recitation component, which is optional but highly recommended.\r\nThis course was co-taught by Professor Schultz.\r\n\r\nAlthough students thought the course was interesting, many felt there was too much emphasis placed on experiments and the experimental history of biochemistry. One student noted that exams focused on experiments, procedures and results over theory, which may put students with limited lab experience at a disadvantage. Others commented that for an introductory course, the material was too “expansive,” “dense” and “difficult.” Readings did not correlate well with material from lecture and did not help students prepare for exams. As a result, many students felt the best strategy for success was rout memorization. Students complained about various administrative aspects of the course, including poor coordination between professors, insufficient communication between professors and TAs, and the lack of an answer key to practice exams and midterms. Students also commented that recitations could have been made more useful.\r\n\r\nStudents found Dr. Svitkina talked \"too rapidly,\" which made it hard to keep up. Although some students liked that she taught from the textbook and lecture slides with little deviation, others felt this made her lectures “dry.” Students also felt she had trouble expressing the material of the course.\r\n\r\nStudents found the course to be very difficult, and many felt that the exam questions were not a fair representation of what was learned in class. One student pointed out that \"the level of detail that was required took the emphasis away from gaining an understanding of the subject matter and placed it on memorizing less-important details.\" Several students expressed concern with the fact that students received a 45 on average for one of the midterms.", "num_students": 80, "path": "/courses/17027/sections/001/reviews/2416-TATYANA-M--SVITKINA", "instructor": {"path": "/instructors/2416-TATYANA-M--SVITKINA", "first_name": "TATYANA M.", "last_name": "SVITKINA", "id": "2416-TATYANA-M--SVITKINA", "name": "TATYANA M. SVITKINA"}, "num_reviewers": 71, "id": "17027-001-2416-TATYANA-M--SVITKINA"}, {"ratings": {"rAmountLearned": "2.55", "rDifficulty": "3.22", "rStimulateInterest": "2.66", "rRecommendMajor": "2.76", "rCourseQuality": "2.31", "rWorkRequired": "3.16", "rInstructorAccess": "2.87", "rReadingsValue": "2.34", "rRecommendNonMajor": "1.61", "rCommAbility": "2.55", "rInstructorQuality": "2.56"}, "section": {"name": "CELL. BIOL. & BIOCHEM.", "sectionnum": "601", "primary_alias": "BIOL-202-601", "path": "/courses/17027/sections/601", "id": "17027-601", "aliases": ["BIOL-202-601"]}, "comments": "This biochemistry course introduces students to both the structure and function of cells. Specific topics include enzymes, membrane structure, signal transduction, motility, and the cell cycle. Previous biology coursework is required, and prior knowledge of basic chemistry is strongly recommended. This section was a Liberal and Professional Studies course meeting once a week.\r\n\r\nStudents found the course to be interesting but \"too research-based.\" Students also felt that there was simply too much material to cover, which detracted from the quality of the course and proved overwhelming. While some students called for a greater focus on bigger concepts or choosing fewer topics to cover but in greater detail, one student commented learning more in this course than in most other sciences classes taken at Penn.\r\n\r\nStudents felt that Professor Laakso was \"interesting\" and “engaging” as well as easy to understand. One student declared that she was \"one of the most engaging professors I have had at Penn.\" Students enjoyed her lectures, which were \"very easy to understand\", though many thought they were too fast-paced would have liked \"greater emphasis placed on the main ideas.\" She was also reported to be approachable and \"open to questions.”\r\n\r\nMany students found the second and third midterms to be \"difficult\" and the information tested \"overwhelming\". Some students also had complaints that exams focused too much on research and experimentation for an introductory biochemistry course.", "num_students": 58, "path": "/courses/17027/sections/601/reviews/4756-MARGARET-LAAKSO", "instructor": {"path": "/instructors/4756-MARGARET-LAAKSO", "first_name": "MARGARET", "last_name": "LAAKSO", "id": "4756-MARGARET-LAAKSO", "name": "MARGARET LAAKSO"}, "num_reviewers": 39, "id": "17027-601-4756-MARGARET-LAAKSO"}]