[{"ratings": {"rAmountLearned": "3.62", "rDifficulty": "3.00", "rStimulateInterest": "3.90", "rRecommendMajor": "3.67", "rCourseQuality": "3.73", "rWorkRequired": "2.86", "rInstructorAccess": "3.43", "rReadingsValue": "3.17", "rRecommendNonMajor": "3.24", "rCommAbility": "3.86", "rInstructorQuality": "3.91"}, "section": {"name": "CHAOT DYNAM ELEC & BIOL", "sectionnum": "001", "primary_alias": "ESE-412-001", "path": "/courses/24368/sections/001", "id": "24368-001", "aliases": ["ESE-412-001"]}, "comments": "This class covers an introduction to non-linear dynamics, chaos, bifurcation, and\r\nqualitative analysis of continuous and discrete dynamical systems and their use in\r\nunderstanding complex behavior of systems. Emphasis is placed on understanding\r\nqualitative features of models of electrical, mechanical, and biological systems.\r\nThis course was an awesome course in the opinion of many students; some even\r\nfound it the best class they had taken at Penn: \"The best course I've had in the ESE\r\ndepartment.\" Students found that they learned much information in class that was actually\r\nvery applicable. You learn how to solve problems in different ways. Information can be\r\ndry, but the professor makes lectures interesting.\r\nProfessor Ghirst was highly liked by his students. \"I heard wonderful things about\r\nGhrist, the professor, which is why I decided to take this course” said one student. “Those\r\nratings were true to fact and made this the most pleasant engineering course that I've\r\ntaken at Penn.\" Another student said: \"Dr. Ghrist clearly communicates the core content.\r\nHe understands the truly amazing implications of some of the ideas in the course and\r\ndoesn't fail to highlight their wonderful applications and philosophical issues relating to\r\nthem.\" Dr. Ghrist's lectures were exciting and engaging and actively taught students.\r\nProblem sets were bi-weekly and there was one midterm, and were thought to be\r\nchallenging. There were more computer projects than exams, which seemed refreshing to\r\nsome students. In addition, the students felt that the professor did not put much emphasis\r\non homework, which made things less stressful. Overall, this course is enjoyable and\r\nhighly recommended. Prerequisites for this class are MATH240 and PHYS150.\r\nStudents in the past recommended taking MATH240, MATH312, and ESE210.", "num_students": 26, "path": "/courses/24368/sections/001/reviews/4413-ROBERT-W--GHRIST", "instructor": {"path": "/instructors/4413-ROBERT-W--GHRIST", "first_name": "ROBERT W.", "last_name": "GHRIST", "id": "4413-ROBERT-W--GHRIST", "name": "ROBERT W. GHRIST"}, "num_reviewers": 23, "id": "24368-001-4413-ROBERT-W--GHRIST"}]