{"coursehistories": {"path": "/coursehistories/3055"}, "description": "This course examines the political and economic determinants of government policies. The course presents economic arguments for government action in the private economy. How government decides policies via simple majority voting, representative legislatures, and executive veto and agenda-setting politics will be studied. Applications include government spending and redistributive policies. \n\n", "semester": "2012A", "name": "POLITICAL ECONOMY", "reviews": {"path": "/courses/27269/reviews", "values": [{"ratings": {"rAmountLearned": "3.04", "rDifficulty": "2.20", "rStimulateInterest": "3.38", "rRecommendMajor": "3.78", "rCourseQuality": "3.40", "rWorkRequired": "1.91", "rInstructorAccess": "3.27", "rReadingsValue": "2.50", "rRecommendNonMajor": "2.14", "rCommAbility": "3.67", "rInstructorQuality": "3.63"}, "section": {"name": "POLITICAL ECONOMY", "sectionnum": "401", "primary_alias": "ECON-232-401", "path": "/courses/27269/sections/401", "id": "27269-401", "aliases": ["ECON-232-401", "PPE-232-401"]}, "comments": "This course examines the political and economic determinants of government policies.  The course presents economic arguments for government action in the private economy.  How government decides policies via simple majority voting, representative legislatures, and executive veto and agenda setting politics will be studied.  Applications include government spending and redistributive policies.\r\n\r\nStudents mentioned that this was the “best economics class I have ever taken at Penn” and “very straightforward.” The “lectures were fascinating,” although they usually exceeded the time allotted for the class and would “run over.” Another student commented that “the homework assignments and in-class examples help clarify how to do the problems and are very good practice for exams.”\r\n\r\nOverall, students were enthusiastic about Professor Merlo’s teaching. They mentioned that he was a “great communicator” and that he “makes a potentially dry subject very exciting.” He is “an awesome lecturer” and “you can tell how passionate he is about the subject matter.” Professor Merlo, according to one student, is “the only Economics professor I've had at Penn who truly lives up to the incredible reputation of this institution.”\r\n\r\nThe course does not have assigned readings and is referred to by one of the students as having “very little work: just two midterms and a final.” The prerequisites are ECON 101; MATH 104 and MATH 114 or MATH 115. ECON 103 is recommended. This is an LPS 200-level course, which will not count for Economics Majors unless you are officially registered as an LPS student.", "num_students": 60, "path": "/courses/27269/sections/401/reviews/344-ANTONIO-M--MERLO", "instructor": {"path": "/instructors/344-ANTONIO-M--MERLO", "first_name": "ANTONIO M.", "last_name": "MERLO", "id": "344-ANTONIO-M--MERLO", "name": "ANTONIO M. MERLO"}, "num_reviewers": 54, "id": "27269-401-344-ANTONIO-M--MERLO"}]}, "credits": null, "primary_alias": "ECON-232", "path": "/courses/27269", "sections": {"path": "/courses/27269/sections", "values": [{"name": "POLITICAL ECONOMY", "sectionnum": "401", "primary_alias": "ECON-232-401", "path": "/courses/27269/sections/401", "id": "27269-401", "aliases": ["ECON-232-401", "PPE-232-401"]}]}, "id": 27269, "aliases": ["ECON-232", "PPE-232"]}