[{"ratings": {"rAmountLearned": "3.31", "rDifficulty": "2.63", "rStimulateInterest": "3.31", "rRecommendMajor": "3.67", "rCourseQuality": "3.29", "rWorkRequired": "2.69", "rInstructorAccess": "3.50", "rReadingsValue": "3.31", "rRecommendNonMajor": "3.06", "rCommAbility": "3.56", "rInstructorQuality": "3.56"}, "section": {"name": "GENDER & SEXUALITY JAPAN", "sectionnum": "401", "primary_alias": "EALC-259-401", "path": "/courses/21531/sections/401", "id": "21531-401", "aliases": ["EALC-259-401", "EALC-659-401", "GSOC-259-401", "GSOC-659-401"]}, "comments": "This course examines a variety of texts--historical, biographical, autobiographical, fictional, non-fictional, visual, cinematic, analytical, and theoretical--in order to better understand the complexity of gender and sexuality within Japanese society and culture. \r\n\r\nEalc 259 received universal acclaim, and students all thoroughly enjoyed their time in the course. Lectures benefited from excellent direction from Dr. Kano and from inspired student discussion. One student stated that the course “brought together many different issues in a clear, organized and interesting way.” Another pointed out that the course was engaging enough to make the Friday afternoon meeting time a non-issue.\r\n\r\nDr. Kano can be credited for much of the praise given to the course. Students noted that they respected him/her, and felt he/she was a great professor who “explained everything well.” As such, they were “able to learn a lot.”\r\n\r\nStudents enrolled in Ealc 259 recommended the course to anyone interested in Japan or East Asian cultures, regardless of background on the subject. Readings were considered “relevant and interesting” and the workload was very manageable.\r\n\r\nThis review is based on the 7 student comments that were submitted.\r\n", "num_students": 20, "path": "/courses/21531/sections/401/reviews/51-AYAKO-KANO", "instructor": {"path": "/instructors/51-AYAKO-KANO", "first_name": "AYAKO", "last_name": "KANO", "id": "51-AYAKO-KANO", "name": "AYAKO KANO"}, "num_reviewers": 17, "id": "21531-401-51-AYAKO-KANO"}]