{"coursehistories": {"path": "/coursehistories/2805"}, "description": "An introduction to interfacing real-world sensors and actuators to embedded microprocessor systems. Concepts needed for building electronic systems for real-time operation and user interaction, such as digital input/outputs, interrupt service routines, serial communications, and analog-to-digital conversion will be covered. The course will conclude with a final project where student-designed projects are featured in presentations and demonstrations. \n\n", "semester": "2011A", "name": "EMBED SYS/MICROCONT LAB", "reviews": {"path": "/courses/21659/reviews", "values": [{"ratings": {"rAmountLearned": "3.71", "rDifficulty": "3.29", "rStimulateInterest": "3.29", "rRecommendMajor": "3.57", "rCourseQuality": "3.31", "rWorkRequired": "3.86", "rInstructorAccess": "2.93", "rReadingsValue": "2.15", "rRecommendNonMajor": "2.36", "rCommAbility": "2.86", "rInstructorQuality": "3.24"}, "section": {"name": "EMBED SYS/MICROCONT LAB", "sectionnum": "001", "primary_alias": "ESE-350-001", "path": "/courses/21659/sections/001", "id": "21659-001", "aliases": ["ESE-350-001"]}, "comments": "&#8232;This class is an introduction to interfacing real-world sensors and actuators to embedded microprocessor systems. Concepts needed for building electronic systems for real-time operation and user interaction, such as digital input/outputs, interrupt service routines, serial communications, and analog-to-digital conversion are covered. The course concludes with a final project where student-designed projects are featured in presentations and demonstrations. &#8232;&#8232;Students generally felt that the class material was potentially very interesting and even “fun,” but was not explained in an engaging manner. Many felt that the course was extremely disorganized; there was a lack of guidelines for the labs, exams, and final project. Example problems were considered by some to be useless because “the professor intentionally makes mistakes” to prevent “copy[ing].” However, students did feel a sense of accomplishment from working on the final project. &#8232;&#8232;Students generally found it difficult to understand Professor Mangharam’s lectures, adding that he “provides very little motivation” to do so. One student felt that Professor Mangharam assumed too much on what students already knew and were interested in “without ever evaluating these assumptions.” Many sections were “very under-explained”, and exam material was not covered well. &#8232;&#8232;Students commented on the unreasonable workload, which included spending over 10 hours outside of class time a week to complete labs. Even more time was required for the final project, described by some as “thoroughly ambitious.” This course is required for majors and is not recommended for non-majors. &#8232;&#8232;This course review was based on the 8 student comments submitted.", "num_students": 22, "path": "/courses/21659/sections/001/reviews/4798-RAHUL-MANGHARAM", "instructor": {"path": "/instructors/4798-RAHUL-MANGHARAM", "first_name": "RAHUL", "last_name": "MANGHARAM", "id": "4798-RAHUL-MANGHARAM", "name": "RAHUL MANGHARAM"}, "num_reviewers": 19, "id": "21659-001-4798-RAHUL-MANGHARAM"}]}, "credits": null, "primary_alias": "ESE-350", "path": "/courses/21659", "sections": {"path": "/courses/21659/sections", "values": [{"name": "EMBED SYS/MICROCONT LAB", "sectionnum": "001", "primary_alias": "ESE-350-001", "path": "/courses/21659/sections/001", "id": "21659-001", "aliases": ["ESE-350-001"]}]}, "id": 21659, "aliases": ["ESE-350"]}