[{"ratings": {"rAmountLearned": "2.83", "rDifficulty": "2.75", "rStimulateInterest": "3.13", "rRecommendMajor": "3.10", "rCourseQuality": "2.86", "rWorkRequired": "2.61", "rInstructorAccess": "3.50", "rReadingsValue": "3.00", "rRecommendNonMajor": "2.71", "rCommAbility": "3.33", "rInstructorQuality": "3.34"}, "section": {"name": "INTRO TO HUMAN EVOLUTION", "sectionnum": "601", "primary_alias": "ANTH-003-601", "path": "/courses/21251/sections/601", "id": "21251-601", "aliases": ["ANTH-003-601"]}, "comments": "This course examines the emergence, development, and diversification of the human species. This course begins with an overview of evolutionary theory, proceeds to examine non-human primates for insight into human evolutionary past, and concludes with an examination of the scientific evidence for human evolution. Students have the opportunity to participate in hands-on exercises working with data analysis and fossil casts.&#8232;&#8232;Students praised this course for adeptly striking a balance between scientific rigor and approachability. The materials proved, “fascinating and often challenging, but all very well explained.” Some students nevertheless cautioned that “there is a lot of material covered during this course,” and that “the curriculum is a bit episodic.”&#8232;&#8232;Most students were enthusiastic about Professor Selinsky’s teaching. One student assured that, “I cannot overstate her ability to stimulate student interest or bring to life the course material.” Students assured that Professor Selinsky was, “enthusiastic about the material” and, “really listens to her students.” Multiple students noted, however, that Professor Selinsky tended to speak quickly during lectures, which hampered efforts to take notes.&#8232;&#8232;Many of the students for this course did not have a scientific background in the subject before taking the course. Although most students felt that they were given proper resources on Blackboard and in lectures to prepare for exams, some expressed disappointment that so much weight was given to one midterm and a final exam. Despite this criticism, students were still willing to recommend this course to others.", "num_students": 30, "path": "/courses/21251/sections/601/reviews/5282-PAGE-SELINSKY", "instructor": {"path": "/instructors/5282-PAGE-SELINSKY", "first_name": "PAGE", "last_name": "SELINSKY", "id": "5282-PAGE-SELINSKY", "name": "PAGE SELINSKY"}, "num_reviewers": 29, "id": "21251-601-5282-PAGE-SELINSKY"}]