{"coursehistories": {"path": "/coursehistories/714"}, "description": "Syllabus for MATH 370-371: an introduction to the basic concepts of modern algebra. Linear algebra, eigenvalues and eigenvectors of matrices, groups, rings and fields. MATH 502-503 is a masters level version of this course. \n\n", "semester": "2009C", "name": "ALGEBRA", "reviews": {"path": "/courses/17649/reviews", "values": [{"ratings": {"rAmountLearned": "2.81", "rDifficulty": "3.86", "rStimulateInterest": "1.81", "rRecommendMajor": "3.00", "rCourseQuality": "2.24", "rWorkRequired": "3.81", "rInstructorAccess": "2.48", "rReadingsValue": "1.79", "rRecommendNonMajor": "0.62", "rCommAbility": "2.00", "rInstructorQuality": "2.29"}, "section": {"name": "ALGEBRA", "sectionnum": "001", "primary_alias": "MATH-370-001", "path": "/courses/17649/sections/001", "id": "17649-001", "aliases": ["MATH-370-001"]}, "comments": "This course offers an introduction to the basic concepts of modern algebra, including linear algebra, eigenvalues and eigenvectors of matrices, groups, rings and fields.\r\n\r\nThis course was taught with a heavy emphasis on abstract concepts, which some students enjoyed thoroughly whereas others would have preferred more real life examples. One student said the class was interesting, although admitted that “as a core class for the math major, I expected more.” Many students complained that the pace was very fast and that homework assignments were often confusing and cumbersome, taking on average 10 to 20 hours per week. Another student wrote that “the course is structured around lots of little findings instead of a few major theorems.” This made it difficult for some to synthesize the material from week to week and increased the amount of work required, especially because lectures did not follow the textbook. One student wrote the despite feeling lost the first half of the semester, “the material gets easier as you go along.” Many students emphasized the helpfulness of the TA and the recitations.\r\n\r\nStudents gave mixed reviews for Professor Chai. Many agreed that he was extremely knowledgeable, although many expressed difficulty following his lectures and desired greater organization and structure. Some felt he did not communicate the material clearly enough or to a level appropriate for the course.", "num_students": 25, "path": "/courses/17649/sections/001/reviews/759-CHING-LI-CHAI", "instructor": {"path": "/instructors/759-CHING-LI-CHAI", "first_name": "CHING-LI", "last_name": "CHAI", "id": "759-CHING-LI-CHAI", "name": "CHING-LI CHAI"}, "num_reviewers": 22, "id": "17649-001-759-CHING-LI-CHAI"}]}, "credits": null, "primary_alias": "MATH-370", "path": "/courses/17649", "sections": {"path": "/courses/17649/sections", "values": [{"name": "ALGEBRA", "sectionnum": "001", "primary_alias": "MATH-370-001", "path": "/courses/17649/sections/001", "id": "17649-001", "aliases": ["MATH-370-001"]}]}, "id": 17649, "aliases": ["MATH-370"]}