{"coursehistories": {"path": "/coursehistories/1198"}, "description": "Human evolutionary studies is a composite product of the fieldwork of both Paleolithic archaeology and human paleontology (or what we refer to as \"stones and bones\"). This marriage of two subdisciplines of anthropology produces a unique set of data that is intellectually managed and driven by theories within anthropology as a whole and even beyond -- to fields such as biology, psychology, and primate ethology, as we try to understand the origins of language, culture, and our unique physical characteristics. In this course, two archaeologists and one physical anthropologist will jointly discuss and debate the actual evidence of human evolution, describing what the actual evidence is and exploring how far can we take these interpretations. \n\n", "semester": "2011A", "name": "BECOMING HUMAN", "reviews": {"path": "/courses/21256/reviews", "values": [{"ratings": {"rAmountLearned": "2.38", "rDifficulty": "2.06", "rStimulateInterest": "2.29", "rRecommendMajor": "3.09", "rCourseQuality": "2.51", "rWorkRequired": "2.06", "rInstructorAccess": "3.18", "rReadingsValue": "2.18", "rRecommendNonMajor": "2.32", "rCommAbility": "3.06", "rInstructorQuality": "2.98"}, "section": {"name": "BECOMING HUMAN", "sectionnum": "301", "primary_alias": "ANTH-122-301", "path": "/courses/21256/sections/301", "id": "21256-301", "aliases": ["ANTH-122-301"]}, "comments": "Human evolutionary studies is a composite product of the fieldwork of both Paleolithic archaeology and human paleontology. This marriage of two subdisciplines of anthropology produces a unique set of data that is intellectually managed and driven by theories within anthropology as a whole and even. In this course, two archaeologists and one physical anthropologist jointly discuss and debate the actual evidence of human evolution, describing what the actual evidence is and exploring how far can we take these interpretations.&#8232;&#8232;Overall, students felt that the course material was “very interesting.” Several mentioned that thorough study guides provided by the professor ensured that the amount of material covered did not become overwhelming.&#8232;&#8232;Reviews of Professor Olszewski were unanimously positive, with several students calling her “extremely passionate about the subject material” and “kind.” Many also praised her organizational abilities. One student commented, “her slides are interesting and complement the lectures—nothing is redundant.” &#8232;&#8232;The majority of students who provided comments felt that the class was “very fair,” as the syllables, lectures, and course material were organized in an “easy-to-follow manner.” Students recommended this course to anyone, regardless of major.", "num_students": 49, "path": "/courses/21256/sections/301/reviews/86-DEBORAH-IRENE-OLSZEWSKI", "instructor": {"path": "/instructors/86-DEBORAH-IRENE-OLSZEWSKI", "first_name": "DEBORAH IRENE", "last_name": "OLSZEWSKI", "id": "86-DEBORAH-IRENE-OLSZEWSKI", "name": "DEBORAH IRENE OLSZEWSKI"}, "num_reviewers": 46, "id": "21256-301-86-DEBORAH-IRENE-OLSZEWSKI"}]}, "credits": null, "primary_alias": "ANTH-122", "path": "/courses/21256", "sections": {"path": "/courses/21256/sections", "values": [{"name": "BECOMING HUMAN", "sectionnum": "301", "primary_alias": "ANTH-122-301", "path": "/courses/21256/sections/301", "id": "21256-301", "aliases": ["ANTH-122-301"]}]}, "id": 21256, "aliases": ["ANTH-122"]}