[{"ratings": {"rAmountLearned": "1.83", "rDifficulty": "2.06", "rStimulateInterest": "1.86", "rRecommendMajor": "2.38", "rCourseQuality": "1.74", "rWorkRequired": "2.50", "rInstructorAccess": "2.62", "rReadingsValue": "1.92", "rRecommendNonMajor": "0.56", "rCommAbility": "2.32", "rInstructorQuality": "2.11"}, "section": {"name": "NURSING IN THE COMMUNITY: THEORY", "sectionnum": "001", "primary_alias": "NURS-340-001", "path": "/courses/23533/sections/001", "id": "23533-001", "aliases": ["NURS-340-001"]}, "comments": "", "num_students": 80, "path": "/courses/23533/sections/001/reviews/3430-LISA-M--LEWIS", "instructor": {"path": "/instructors/3430-LISA-M--LEWIS", "first_name": "LISA M.", "last_name": "LEWIS", "id": "3430-LISA-M--LEWIS", "name": "LISA M. LEWIS"}, "num_reviewers": 76, "id": "23533-001-3430-LISA-M--LEWIS"}, {"ratings": {"rAmountLearned": "1.83", "rDifficulty": "2.06", "rStimulateInterest": "2.35", "rRecommendMajor": "2.38", "rCourseQuality": "1.74", "rWorkRequired": "2.50", "rInstructorAccess": "2.85", "rReadingsValue": "1.92", "rRecommendNonMajor": "0.56", "rCommAbility": "2.52", "rInstructorQuality": "2.36"}, "section": {"name": "NURSING IN THE COMMUNITY: THEORY", "sectionnum": "001", "primary_alias": "NURS-340-001", "path": "/courses/23533/sections/001", "id": "23533-001", "aliases": ["NURS-340-001"]}, "comments": "This course provides an introduction to community health nursing within the context of public health. There is a wide range of topics that this course touches upon, which include: the history of public health, the core public health sciences, environmental and occupational health, oral health, global health and the social determinants of health, health promotion, as well as prevention and intervention approaches to chronic and infectious diseases and injuries. Please note that NURS-341 is a co-requisite of this course and requires students to perform clinical rounds within a community setting.\r\n\r\nMost students found the course to have great potential, but thought that its execution could have been improved. Many students reported that the topics engaged in the class were of great interest to them, but they found themselves wishing that the course’s structure would allow for greater exploitation of their enthusiasm.\r\n\r\nStudents generally believed that lectures given by both Professors Lewis and Bonaduce were “adequate” and “informative,” but were also “somewhat boring” and gave little incentive for them to attend lecture.\r\n\r\nThis course had a majority of upperclassmen and was not recommended for freshmen. Some students believed that this course had too much “busy work” with short, weekly reaction papers, for an upper-division class. A number of students also reported that the 15-page research paper assigned was too much work for a 7-week class. Furthermore, some students also noted the lack of clinical options offered during the evening, making it difficult to fulfill this aspect of the class. Lastly, a number of students noted that they felt various elements of the course (i.e. the 15 page paper, reaction papers, quizzes) were weighted unfairly.\r\n", "num_students": 80, "path": "/courses/23533/sections/001/reviews/3859-JUDITH-BONADUCE", "instructor": {"path": "/instructors/3859-JUDITH-BONADUCE", "first_name": "JUDITH", "last_name": "BONADUCE", "id": "3859-JUDITH-BONADUCE", "name": "JUDITH BONADUCE"}, "num_reviewers": 76, "id": "23533-001-3859-JUDITH-BONADUCE"}]