[{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "2.85", "rStimulateInterest": "2.77", "rRecommendMajor": "3.38", "rCourseQuality": "2.94", "rWorkRequired": "2.15", "rInstructorAccess": "2.85", "rReadingsValue": "2.23", "rRecommendNonMajor": "2.69", "rCommAbility": "3.08", "rInstructorQuality": "3.07"}, "section": {"name": "INTRO TO DECISION THEORY", "sectionnum": "601", "primary_alias": "PPE-110-601", "path": "/courses/22307/sections/601", "id": "22307-601", "aliases": ["PPE-110-601"]}, "comments": "&#8232;&#8232;This course provides an introduction to models of how humans make decisions. This course aims to introduce a set of tools to help students translate qualitative uncertainty into quantitative data. Much of the course will detail the theory of rational choice in the face of uncertainty. Students will examine examples of human decision making from the fields of economics, finance, political science, law, and others. Alternatives to rational choice theory are also discussed. &#8232;&#8232;Students considering the course content to be both demanding and rewarding. The material covered in the course proved to be, “very difficult material but also very interesting.”&#8232;&#8232;Students generally favored Professor Sen’s teaching. Students described Professor Sen as “entertaining and cheerful” and assured that, “Dr. Sen… does a very good job of involving all of the students.” Some cautions were raised, however, regarding Professor Sen’s tendencies to teach, “rapidly” and rely on class participation in too many cases.&#8232;&#8232;This course was taken both for major requirements and as an elective. This course does not have any math perquisites. While students considered this course, “challenging,” many would recommend it to others. The course is open to both college freshmen and upperclassmen.", "num_students": 22, "path": "/courses/22307/sections/601/reviews/3150-SUMANTRA-SEN", "instructor": {"path": "/instructors/3150-SUMANTRA-SEN", "first_name": "SUMANTRA", "last_name": "SEN", "id": "3150-SUMANTRA-SEN", "name": "SUMANTRA SEN"}, "num_reviewers": 17, "id": "22307-601-3150-SUMANTRA-SEN"}]