{"coursehistories": {"path": "/coursehistories/3838"}, "description": "You know how to program, but do you know how computers really work? How do millions of transistors come together to form a complete computing system? This bottom-up course begins with transistors and simple computer hardware structures, continues with low-level programming using primative machine instructions, and finishes with an introduction to all aspects of computer systems architecture and serves as the foundation for subsequent computer systems courses, such as Digital Systems Organization and Design (CIS 371), Computer Operating Systems (CIS 380), and Compilers and Interpreters (CIS 341). \n\nThe course will consider the SPARC architecture, boolean logic, number systems,and computer arithmetic; macro assembly language programming and subroutine linkages; the operating system interface and input/output; understanding the output of the C compiler; the use of the C programming language to generate specific assembly language instructions. \n\n", "semester": "2010C", "name": "INTRO TO COMP SYSTEMS", "reviews": {"path": "/courses/22825/reviews", "values": [{"ratings": {"rAmountLearned": "3.19", "rDifficulty": "3.22", "rStimulateInterest": "2.59", "rRecommendMajor": "3.55", "rCourseQuality": "2.72", "rWorkRequired": "3.55", "rInstructorAccess": "2.66", "rReadingsValue": "2.04", "rRecommendNonMajor": "1.30", "rCommAbility": "3.04", "rInstructorQuality": "3.07"}, "section": {"name": "INTRO TO COMP SYSTEMS", "sectionnum": "001", "primary_alias": "CIS-240-001", "path": "/courses/22825/sections/001", "id": "22825-001", "aliases": ["CIS-240-001"]}, "comments": "CIS 240 begins with transistors and simple computer hardware structures, continues with low-level programming using primitive machine instructions, and finishes with an introduction to all aspects of computer systems architecture and serves as the foundation for subsequent computer systems courses. \r\n\r\nStudents found this course to be “challenging” and “very difficult,” yet many felt that they “learned a lot in the course.” Although the material was “hard,” the course was described as “great,” “interesting,” “fascinating,” and “necessary.” Many students found the assignments to be “tricky and time-consuming” and complained about the lack of time given for harder assignments. Several students suggested revising the assignment due dates to give more time for harder projects. The assignments, however, were described as “effective at communicating key concepts.” \r\n\r\nStudents generally gave Professor Taylor rave reviews. Professor Taylor was described as “very accessible” and “an excellent teacher” who “communicates subject matter very clearly.” Students called the professor “passionate,” and they also noted that he was “friendly, funny, and overall seemed to enjoy teaching.” His “unparalleled enthusiasm” “made the material interesting and engaging.” \r\n\r\nAlthough many students called this course “difficult and time consuming,” many also mentioned that it was one of the best classes they have taken at Penn. Students considered the material to be “extremely important” for any CIS major.\r\n", "num_students": 139, "path": "/courses/22825/sections/001/reviews/309-CAMILLO-JOSE-TAYLOR", "instructor": {"path": "/instructors/309-CAMILLO-JOSE-TAYLOR", "first_name": "CAMILLO JOSE", "last_name": "TAYLOR", "id": "309-CAMILLO-JOSE-TAYLOR", "name": "CAMILLO JOSE TAYLOR"}, "num_reviewers": 124, "id": "22825-001-309-CAMILLO-JOSE-TAYLOR"}]}, "credits": null, "primary_alias": "CIS-240", "path": "/courses/22825", "sections": {"path": "/courses/22825/sections", "values": [{"name": "INTRO TO COMP SYSTEMS", "sectionnum": "001", "primary_alias": "CIS-240-001", "path": "/courses/22825/sections/001", "id": "22825-001", "aliases": ["CIS-240-001"]}]}, "id": 22825, "aliases": ["CIS-240"]}