[{"ratings": {"rAmountLearned": "2.63", "rDifficulty": "2.88", "rStimulateInterest": "2.55", "rRecommendMajor": "2.98", "rCourseQuality": "2.52", "rWorkRequired": "2.49", "rInstructorAccess": "3.29", "rReadingsValue": "2.45", "rRecommendNonMajor": "1.75", "rCommAbility": "3.00", "rInstructorQuality": "3.20"}, "section": {"name": "MOLECULAR IMAGING", "sectionnum": "401", "primary_alias": "BE-483-401", "path": "/courses/22687/sections/401", "id": "22687-401", "aliases": ["BE-483-401", "BE-583-401"]}, "comments": "This course provides a comprehensive survey of modern medical imaging modalities with an emphasis on the emerging field of molecular imaging. The basic principles of X-ray, computed tomography, nuclear imaging, magnetic resonance imaging, and optical tomography will be reviewed. The emphasis of the course, however, will focus on the concept of contrast media and targeted molecular imaging. Topics that are covered include the chemistry and mechanisms of various contrast agents, approaches to identifying molecular markers of disease, ligand screening strategies, and the basic principles of toxicology and pharmacology relevant to imaging agents.\r\n\r\nAccording to many students, the course covered numerous topics and provided a “very good overview of medical imaging.” One student feared that “there would be too much explicit physics, but Dr. T. did a very good job of presenting the material in sufficient depth but without too much complexity.”\r\n\r\nStudents reported that throughout the semester, many guest lecturers spoke to the class. Most students believed that “bringing in the experts of each field was really nice,” but that “a lot of the guest lecturers were not at the same level [as Professor Tsourkas].” Many commented that the course would be better without the guest lecturers, as “it was difficult to adjust to the different guest lecturer's teaching styles.” However, it was unanimous among students that Professor Tsourkas was an “excellent professor” and that his slides were “well written and very organized.” Another student commented that “there was a lot of information to get through, and I think that Dr. Tsourkas did a good job of communicating the basics of each modality.” Most students “enjoyed the class” and some were inspired to “take more advanced imaging courses in the future.”\r\n\r\nGrades for the course were based on four exams and four homework assignments, each of which coverd a different imaging modality. “There ended up being a lot of material for each exam because one had to go through Professor Tsourkas' notes for one lecture as well as the guest lectures' notes,” one student noted. \r\n\r\nStudents generally found that “neither the exams nor the homework were very hard” and that they learned a lot of new material overall. One student summed it up when he said, “this felt like one of the first BE classes that taught applicable and useful information.”\r\n", "num_students": 59, "path": "/courses/22687/sections/401/reviews/2869-ANDREW-TSOURKAS", "instructor": {"path": "/instructors/2869-ANDREW-TSOURKAS", "first_name": "ANDREW", "last_name": "TSOURKAS", "id": "2869-ANDREW-TSOURKAS", "name": "ANDREW TSOURKAS"}, "num_reviewers": 55, "id": "22687-401-2869-ANDREW-TSOURKAS"}]