{"coursehistories": {"path": "/coursehistories/484"}, "description": "The focus of this course is on the valuation of companies. Topics discussed include discounted cash flow techniques and valuation using alternative valuation techniques such as price multiples. Emphasis is on developing the required information for valuation from financial statements and other information sources. \n\n", "semester": "2009C", "name": "CORPORATE VALUATION", "reviews": {"path": "/courses/17373/reviews", "values": [{"ratings": {"rAmountLearned": "3.54", "rDifficulty": "3.83", "rStimulateInterest": "2.71", "rRecommendMajor": "3.63", "rCourseQuality": "3.20", "rWorkRequired": "3.89", "rInstructorAccess": "3.02", "rReadingsValue": "2.78", "rRecommendNonMajor": "1.41", "rCommAbility": "3.25", "rInstructorQuality": "3.23"}, "section": {"name": "CORPORATE VALUATION", "sectionnum": "001", "primary_alias": "FNCE-207-001", "path": "/courses/17373/sections/001", "id": "17373-001", "aliases": ["FNCE-207-001"]}, "comments": "The focus of Finance 207 is on the valuation of companies. Topics discussed include discounted cash flow techniques and valuation using alternative valuation techniques such as price multiples. Emphasis is on developing the required information for valuation from financial statements and other information sources.\r\n\r\nWhile many students mentioned that the class was very challenging and entailed an immense amount of work, most also explained that they learned quite a lot. According to one student, the course was an “excellent, exhaustive approach to financial modeling and valuation,” and according to another, it was, simply, “legendary.” Opinion on the applicability of the course to real-world financial valuation was varied. One student noted that the course was “not great if you are looking for practical experience,” whereas another student explained, “Coming from a summer internship in investment banking, I felt that this course truly complemented what I learned over the summer,” and a third affirmed, “I’m going into banking next year and feel like I really have a leg up after taking this course.” \r\n\r\nAlmost all student feedback about Professor Holthausen was strongly positive. One student avowed that Professor Holthausen was “the best professor I’ve had, this being my 7th semester at Penn.” Professor Holthausen “expects a lot from his students,” one student commented, but “this is ok with me: he’s got a very sought after class, and so he needs to make it difficult.” At least one student thought that the pace of lectures was too fast. \r\n\r\nAccording to some students, the course required a strong previous exposure to accounting. It was also highly recommended for anyone going into investment banking, private equity, and other similar fields of finance. As one student put it, “If you want to work in finance, you must take this class, with this professor. End of story.” \r\n", "num_students": 75, "path": "/courses/17373/sections/001/reviews/1431-ROBERT-W--HOLTHAUSEN", "instructor": {"path": "/instructors/1431-ROBERT-W--HOLTHAUSEN", "first_name": "ROBERT W.", "last_name": "HOLTHAUSEN", "id": "1431-ROBERT-W--HOLTHAUSEN", "name": "ROBERT W. HOLTHAUSEN"}, "num_reviewers": 72, "id": "17373-001-1431-ROBERT-W--HOLTHAUSEN"}]}, "credits": null, "primary_alias": "FNCE-207", "path": "/courses/17373", "sections": {"path": "/courses/17373/sections", "values": [{"name": "CORPORATE VALUATION", "sectionnum": "001", "primary_alias": "FNCE-207-001", "path": "/courses/17373/sections/001", "id": "17373-001", "aliases": ["FNCE-207-001"]}]}, "id": 17373, "aliases": ["FNCE-207"]}