{"coursehistories": {"path": "/coursehistories/1286"}, "description": "The advanced women's studies course in the department, focusing on a particular aspect of literature by and about women. Topics might include: \"Victorian Literary Women\"; \"Women, Politics, and Literature\"; \"Feminist Literary Theory\";and similar foci. \n\nSee the English Department's website at www.english.upenn.edu for a description of the current offerings. \n\n", "semester": "2008A", "name": "TPCS: GENDR/SEXUALTY/LIT: BURDEN OF REPRESENTATION", "reviews": {"path": "/courses/20103/reviews", "values": [{"ratings": {"rAmountLearned": "3.38", "rDifficulty": "2.48", "rStimulateInterest": "3.62", "rRecommendMajor": "3.76", "rCourseQuality": "3.62", "rWorkRequired": "2.67", "rInstructorAccess": "3.76", "rReadingsValue": "3.76", "rRecommendNonMajor": "3.38", "rCommAbility": "3.71", "rInstructorQuality": "3.76"}, "section": {"name": "TPCS: GENDR/SEXUALTY/LIT: BURDEN OF REPRESENTATION", "sectionnum": "401", "primary_alias": "ENGL-390-401", "path": "/courses/20103/sections/401", "id": "20103-401", "aliases": ["ENGL-390-401", "CINE-308-401", "GSOC-390-401"]}, "comments": "This course is an interdisciplinary Benjamin Franklin seminar that explores the representation of difference through film, literature, photography, social science, and medicine. The course considers how stigma attaches to particular bodies and the modern regimes of representation that organize the perception of these figures. Topics that guide discussion include the history of the human sciences, embodiment and stigma, the concept of deviance, the dynamics of objectification, colonial modernity, the skin as signifier of difference, and poverty and shame. Texts include work by Michel Foucault, Erving Goffman, Georges Canguilhem, Frantz Fanon, W.E.B. Du Bois, Daphne Brooks, Irving Zola, Rosemary Garland Thomson, Howard Becker, Kenji Yoshino, Roderick Ferguson, Susan Seizer, Charles Baudelaire, Ralph Ellison, Toni Morrison, and Jean Genet. Films are also analyzed by Douglas Sirk, Agnes Varda, Frederick Wiseman, Lars von Trier, Forugh Farrokhzad, and others. Coursework consists of some short writing assignments, a class presentation, and a final seminar paper.\r\n\r\nStudents unanimously praised the course, saying that the only weakness was in the words of one student, “too much good material, too little time”.  All students praised the readings as “excellent”, with particular exultation to the graphic novels. Every student stated that they “enjoyed the course”, and nearly all praised the “diversity of media”, saying that as a result of the course, they were encouraged to “think outside of the box” and to “open their minds”.\r\n\r\nStudents had nothing but admiration for Professor Love, calling her “amazing” and “scarily intelligent”. Most students lamented the fact that they had only taken one or two classes with Professor Love, and thanked her for the experience. As one student said, “she was without a doubt the best professor I’ve had at Penn”.\r\n\r\nAll students praised the readings as “excellent”, with particular exultation to the graphic novels. Many also commented on the reasonable work load. This class was taken mostly by seniors and was strongly recommended to both majors and non-majors.", "num_students": 25, "path": "/courses/20103/sections/401/reviews/2120-HEATHER-K--LOVE", "instructor": {"path": "/instructors/2120-HEATHER-K--LOVE", "first_name": "HEATHER K.", "last_name": "LOVE", "id": "2120-HEATHER-K--LOVE", "name": "HEATHER K. LOVE"}, "num_reviewers": 21, "id": "20103-401-2120-HEATHER-K--LOVE"}]}, "credits": null, "primary_alias": "ENGL-390", "path": "/courses/20103", "sections": {"path": "/courses/20103/sections", "values": [{"name": "TPCS: GENDR/SEXUALTY/LIT: BURDEN OF REPRESENTATION", "sectionnum": "401", "primary_alias": "ENGL-390-401", "path": "/courses/20103/sections/401", "id": "20103-401", "aliases": ["ENGL-390-401", "CINE-308-401", "GSOC-390-401"]}]}, "id": 20103, "aliases": ["ENGL-390", "CINE-308", "GSOC-390"]}