[{"ratings": {"rAmountLearned": "3.25", "rDifficulty": "1.83", "rStimulateInterest": "3.57", "rRecommendMajor": "3.75", "rCourseQuality": "3.44", "rWorkRequired": "2.13", "rInstructorAccess": "3.58", "rReadingsValue": "3.25", "rRecommendNonMajor": "3.58", "rCommAbility": "3.38", "rInstructorQuality": "3.48"}, "section": {"name": "ADV JAPANESE POP CULTURE", "sectionnum": "401", "primary_alias": "EALC-169-401", "path": "/courses/15568/sections/401", "id": "15568-401", "aliases": ["EALC-169-401", "EALC-569-401"]}, "comments": "This course examines the nexus between Japanese music and manga (graphic novel) industries and the consequent symbiotic relationships among animation (anime), live-action TV dramas and film, popular literature, and advertising in contemporary Japan. Students analyze the poetics and aesthetics of the Japanese popular music used as opening and ending theme songs for anime and live-action dramas. The curriculum considers the distinct features of each genre and medium of stories such as “Moribito: Guardian of the Spirit” and “Fullmetal Alchemist.”\r\nStudents commented that this course was “one of the most provoking classes” at Penn. The students enjoyed the fact that the material related to not only Japanese culture but also music, literature, anthropology, and even marketing. Readings were valuable and insightful, but some students found that not enough class time was spent discussing the readings. However, the class was thought to be “academically rigorous and intellectually stimulating.”\r\nAccording to students, Professor Harrington’s willingness to discuss contents out of the class was “unprecedented.” Students claiming that Professor Harrington was their “favorite teacher at Penn” stated that he was “truly passionate about his subject matter.”\r\nThe pre-requisites for this class include either EALC 002 or EALC 069. Students may also seek permission from the instructor. Because the course covers such a wide variety of topics, students recommended this class to anyone interested in Japanese culture.", "num_students": 28, "path": "/courses/15568/sections/401/reviews/2043-LEWIS-E-HARRINGTON", "instructor": {"path": "/instructors/2043-LEWIS-E-HARRINGTON", "first_name": "LEWIS E", "last_name": "HARRINGTON", "id": "2043-LEWIS-E-HARRINGTON", "name": "LEWIS E HARRINGTON"}, "num_reviewers": 25, "id": "15568-401-2043-LEWIS-E-HARRINGTON"}]