{"coursehistories": {"path": "/coursehistories/4223"}, "description": "This course examines the nexus between the Japanese music and manga (graphic novel) industries and the consequent symbiotic relationship between animation (anime), live-action TV drama and film, popular literature, and advertising in contemporary Japan. Through the consideration of such relationships, we will come to engage with larget questions of artistic autonomy versus the commodified production of art, connecting them to an understanding of the history of literary and artistic production in Japan and elsewhere. We will analyze the poetics and aesthetics of the Japanese popular music that is used as opening and ending theme songs for anime and live-action dramas. What is the significance of the fact that on any given week it is not uncommon for nearly half of the songs in the Top 10 chart to be theme songs for not only anime and TV dramas, but even for weekly TV sports shows or advertising selling anything from fleeces to station wagons? In addition to examining the relationship, or lack thereof, between the music and the shows, by tracing the life-cycle of stories such \"Moribito: Guardian of the Spirit\" and \"Fullmetal Alchemist\" through their incarnations as popular literature or serialized graphic novels, animation, cinema, etc. students will be guided to consider the distinct features of each genre and medium, as well as the aesthetic \n\nprinciples involved in adaptation from one genre/medium to another. As the semester progresses students will acquire skills of close reading and analysis of various kinds of texts, focusing on their narrative, poetic, visual, and musical components. Throughout the semester we will also engage in a literature review of the expanding body of academic publications on Japanese popular culture. Pre-requisites: EALC 002 or EALC 069 or permission from the instructor. \n\n", "semester": "2009A", "name": "ADV JAPANESE POP CULTURE", "reviews": {"path": "/courses/15568/reviews", "values": [{"ratings": {"rAmountLearned": "3.25", "rDifficulty": "1.83", "rStimulateInterest": "3.57", "rRecommendMajor": "3.75", "rCourseQuality": "3.44", "rWorkRequired": "2.13", "rInstructorAccess": "3.58", "rReadingsValue": "3.25", "rRecommendNonMajor": "3.58", "rCommAbility": "3.38", "rInstructorQuality": "3.48"}, "section": {"name": "ADV JAPANESE POP CULTURE", "sectionnum": "401", "primary_alias": "EALC-169-401", "path": "/courses/15568/sections/401", "id": "15568-401", "aliases": ["EALC-169-401", "EALC-569-401"]}, "comments": "This course examines the nexus between Japanese music and manga (graphic novel) industries and the consequent symbiotic relationships among animation (anime), live-action TV dramas and film, popular literature, and advertising in contemporary Japan. Students analyze the poetics and aesthetics of the Japanese popular music used as opening and ending theme songs for anime and live-action dramas. The curriculum considers the distinct features of each genre and medium of stories such as “Moribito: Guardian of the Spirit” and “Fullmetal Alchemist.”\r\nStudents commented that this course was “one of the most provoking classes” at Penn. The students enjoyed the fact that the material related to not only Japanese culture but also music, literature, anthropology, and even marketing. Readings were valuable and insightful, but some students found that not enough class time was spent discussing the readings. However, the class was thought to be “academically rigorous and intellectually stimulating.”\r\nAccording to students, Professor Harrington’s willingness to discuss contents out of the class was “unprecedented.” Students claiming that Professor Harrington was their “favorite teacher at Penn” stated that he was “truly passionate about his subject matter.”\r\nThe pre-requisites for this class include either EALC 002 or EALC 069. Students may also seek permission from the instructor. Because the course covers such a wide variety of topics, students recommended this class to anyone interested in Japanese culture.", "num_students": 28, "path": "/courses/15568/sections/401/reviews/2043-LEWIS-E-HARRINGTON", "instructor": {"path": "/instructors/2043-LEWIS-E-HARRINGTON", "first_name": "LEWIS E", "last_name": "HARRINGTON", "id": "2043-LEWIS-E-HARRINGTON", "name": "LEWIS E HARRINGTON"}, "num_reviewers": 25, "id": "15568-401-2043-LEWIS-E-HARRINGTON"}]}, "credits": null, "primary_alias": "EALC-169", "path": "/courses/15568", "sections": {"path": "/courses/15568/sections", "values": [{"name": "ADV JAPANESE POP CULTURE", "sectionnum": "401", "primary_alias": "EALC-169-401", "path": "/courses/15568/sections/401", "id": "15568-401", "aliases": ["EALC-169-401", "EALC-569-401"]}]}, "id": 15568, "aliases": ["EALC-169", "EALC-569"]}