[{"ratings": {"rAmountLearned": "2.93", "rDifficulty": "3.39", "rStimulateInterest": "2.77", "rRecommendMajor": "3.20", "rCourseQuality": "2.66", "rWorkRequired": "2.42", "rInstructorAccess": "3.16", "rReadingsValue": "2.38", "rRecommendNonMajor": "1.49", "rCommAbility": "2.75", "rInstructorQuality": "2.94"}, "section": {"name": "FIXED INCOME SECURITIES", "sectionnum": "001", "primary_alias": "FNCE-235-001", "path": "/courses/26065/sections/001", "id": "26065-001", "aliases": ["FNCE-235-001"]}, "comments": "FNCE 235, or Fixed Income Securities, is a rigorous study of fixed income securities, including default-free bonds, floating rate notes, and corporate bonds. Closely related financial instruments such as forwards and futures on fixed income securities, bond options, and interest rate swaps are also examined. In addition to analyzing specific types of fixed income securities, there will be an examination of the tools used in bond portfolio management. The two prerequisites are FNCE100 and FNCE101.\r\n\r\nStudents were overall happy with the presentation of FNCE 235. The course was “very stimulating” and “fascinating.” Students called the class “very structured and easy to follow.” Students especially liked the real-world applications and examples, which followed theoretical lectures. \r\n\r\nProfessor Dieckmann is lauded as “excellent,” “one of the best at Penn” and also “very knowledgeable and passionate” about his subject. Students enjoy that he was quick to respond to emails and approachable about course questions. \r\n\r\nStudents explain the course is “an ideal Wharton course” because attendance in class is not mandatory, but helpful nonetheless. Two exams (described as “hard but fair”) and a final project make up the grade, with no participation points. The grading accurately reflects what students were expected to know from the course material. Others mention that this course has a lot of focus on work with derivatives.", "num_students": 77, "path": "/courses/26065/sections/001/reviews/5616-STEPHAN-DIECKMANN", "instructor": {"path": "/instructors/5616-STEPHAN-DIECKMANN", "first_name": "STEPHAN", "last_name": "DIECKMANN", "id": "5616-STEPHAN-DIECKMANN", "name": "STEPHAN DIECKMANN"}, "num_reviewers": 75, "id": "26065-001-5616-STEPHAN-DIECKMANN"}]