[{"ratings": {"rAmountLearned": "2.63", "rDifficulty": "3.21", "rStimulateInterest": "3.11", "rRecommendMajor": "3.05", "rCourseQuality": "2.42", "rWorkRequired": "2.63", "rInstructorAccess": "3.16", "rReadingsValue": "2.21", "rRecommendNonMajor": "1.89", "rCommAbility": "2.58", "rInstructorQuality": "2.84"}, "section": {"name": "PROBABILITY", "sectionnum": "401", "primary_alias": "STAT-510-401", "path": "/courses/25166/sections/401", "id": "25166-401", "aliases": ["STAT-510-401", "STAT-430-401"]}, "comments": "*Statistics 510 is a probability course that covers elements of matrix algebra, discrete and continuous random variables and their distributions, moments and moment generating functions, joint distributions, functions and transformations of random variables, law of large numbers and the central limit theorem, point estimation: sufficiency, maximum likelihood, minimum variance, and confidence intervals. \r\n\r\nStudents learned \"a tremendous amount\" and left the class looking at the world in different ways and with a \"deep appreciation for statistics and stochastic processes.\" Some found the material interesting enough to discuss with friends outside of class. \r\n\r\nDr. Foster made the material \"fun and interesting.\" He has a passion for probability that he shares with students. However, he can be somewhat disorganized and some students criticize his lack of course structure. At times, he would be unsure of how to finish formulas he began to write on the board.\r\n\r\nThe material was challenging and abstract, especially that covered in lecture. However, the tests were fair and easy to pass. A year of calculus is a perquisite. \r\n\r\n*This review was based on 7 student comments.\r\n", "num_students": 22, "path": "/courses/25166/sections/401/reviews/1742-DEAN-P--FOSTER", "instructor": {"path": "/instructors/1742-DEAN-P--FOSTER", "first_name": "DEAN P.", "last_name": "FOSTER", "id": "1742-DEAN-P--FOSTER", "name": "DEAN P. FOSTER"}, "num_reviewers": 19, "id": "25166-401-1742-DEAN-P--FOSTER"}]