{"coursehistories": {"path": "/coursehistories/4553"}, "description": "This course will provide an introduction to computation and data analysis using MATLAB - an industry standard programming and visualization environment. The course will cover the fundamentals of computing including: variables, functions, flow control, iteration and recursion. These concepts will be illustrated through examples and assignments which show how computing is applied to various scientific and engineering problems. Examples will be drawn from the simulation of physical and chemical systems, the analysis of experimental data, Monte Carlo numerical experiments, image and audio processing, and control of sensors and actuators. This course does not assume any prior programming experience but will make use of basic concepts from calculus and Newtonian physics. \n\n", "semester": "2011A", "name": "INTRO SCIENTIFIC COMP", "reviews": {"path": "/courses/21534/reviews", "values": [{"ratings": {"rAmountLearned": "2.81", "rDifficulty": "2.25", "rStimulateInterest": "1.28", "rRecommendMajor": "3.08", "rCourseQuality": "2.21", "rWorkRequired": "2.61", "rInstructorAccess": "2.81", "rReadingsValue": "1.72", "rRecommendNonMajor": "1.94", "rCommAbility": "1.69", "rInstructorQuality": "2.06"}, "section": {"name": "INTRO SCIENTIFIC COMP", "sectionnum": "001", "primary_alias": "EAS-105-001", "path": "/courses/21534/sections/001", "id": "21534-001", "aliases": ["EAS-105-001"]}, "comments": "This course introduces computation and data analysis using MATLAB. The course covers the fundamentals of computing including: variables, functions, flow control, iteration, and recursion. These concepts are illustrated through examples and assignments. This course does not assume any prior programming experience.&#8232;&#8232;Students generally found this course to be “interesting” and “a great introduction to programming.” Many came into the course with no programming experience, but left feeling confident about their MATLAB abilities. &#8232;&#8232;Although many students found Professor Hu to be “dry” and “difficult to understand,” they appreciated his accessibility and willingness to help. Students tended to agree that he was very good “one-on-one” but that his lectures were “rather uninteresting” and “deadly boring.”&#8232;&#8232;This course is open to both freshman and upperclassman. Students reported that assignments were easy but that the final project was rushed and “disproportionately harder.”", "num_students": 54, "path": "/courses/21534/sections/001/reviews/4164-HOWARD-H--HU", "instructor": {"path": "/instructors/4164-HOWARD-H--HU", "first_name": "HOWARD H.", "last_name": "HU", "id": "4164-HOWARD-H--HU", "name": "HOWARD H. HU"}, "num_reviewers": 49, "id": "21534-001-4164-HOWARD-H--HU"}]}, "credits": null, "primary_alias": "EAS-105", "path": "/courses/21534", "sections": {"path": "/courses/21534/sections", "values": [{"name": "INTRO SCIENTIFIC COMP", "sectionnum": "001", "primary_alias": "EAS-105-001", "path": "/courses/21534/sections/001", "id": "21534-001", "aliases": ["EAS-105-001"]}]}, "id": 21534, "aliases": ["EAS-105"]}