{"coursehistories": {"path": "/coursehistories/2493"}, "description": "Intro to Drug Discovery; Overview of Pharmaceutical Industry and Drug Development Costs, Timelines; High Throughput Screening (HTS): Assay Design and Sensitivity Solid Phase Synthesis and Combinatorial Chemistry; Enzyme Kinetics; Fluorescence, Linearity, Inner-filter effect, quenching; Time dynamics of a Michaelis-Menton Reaction; Competitive Inhibitor; FLINT, FRET, TRF, FP, SPA, alpha-screen; Enzyme HTS (protease); Cell based screening; Fura-2 ratio, loading signaling; Gfp-calmodulin-gfp integrated calcium response; Estrogen/ERE-Luc HTS; Problems with cell based screening (toxicity, permeability, nonspecificity); Instrumentation, Robotics/Automation; Z-factor; SAR, Positioning Scanning; Microarray HTS; IC50, % Conversion in HTS and IC50, Assay Optimization. \n\n", "semester": "2012A", "name": "DRUG DISCOVERY & DEVELOP", "reviews": {"path": "/courses/27088/reviews", "values": [{"ratings": {"rAmountLearned": "2.92", "rDifficulty": "2.76", "rStimulateInterest": "2.81", "rRecommendMajor": "2.99", "rCourseQuality": "2.93", "rWorkRequired": "2.29", "rInstructorAccess": "1.90", "rReadingsValue": "2.36", "rRecommendNonMajor": "2.20", "rCommAbility": "2.95", "rInstructorQuality": "2.96"}, "section": {"name": "DRUG DISCOVERY & DEVELOP", "sectionnum": "401", "primary_alias": "CBE-562-401", "path": "/courses/27088/sections/401", "id": "27088-401", "aliases": ["CBE-562-401", "BE-562-401"]}, "comments": "Intro to Drug Discovery; Overview of Pharmaceutical Industry and Drug Development Costs, Timelines; High Throughput Screening (HTS): Assay Design and Sensitivity Solid Phase Synthesis and Combinatorial Chemistry; Enzyme Kinetics; Fluorescence, Linearity, Inner-filter effect, quenching; Time dynamics of a Michaelis-Menton Reaction; Competitive Inhibitor; FLINT, FRET, TRF, FP, SPA, alpha-screen; Enzyme HTS (protease); Cell based screening; Fura-2 ratio, loading signaling; Gfp- calmodulin-gfp integrated calcium response; Estrogen/ERE-Luc HTS; Problems with cell based screening (toxicity, permeability, nonspecificity); Instrumentation, Robotics/Automation; Z-factor; SAR, Positioning Scanning; Microarray HTS; IC50, % Conversion in HTS and IC50, Assay Optimization.\r\n\r\nStudents overall found the course to be “great” with “interesting content.” The majority of students agreed that they “learned a great deal.”\r\n\r\nStudents enjoyed how Professor Diamond “brought together many concepts.” However, one student commented that Professor Diamond “did not go into much detail for certain subject matters.”\r\n\r\nOne student “liked that there were group presentations.” Overall, students found the homework “fair” and the tests “a mix of fair and difficult questions.” Students highly recommend this course for “a student interested in the pharmaceutical industry.”\r\n", "num_students": 87, "path": "/courses/27088/sections/401/reviews/221-SCOTT-L--DIAMOND", "instructor": {"path": "/instructors/221-SCOTT-L--DIAMOND", "first_name": "SCOTT L.", "last_name": "DIAMOND", "id": "221-SCOTT-L--DIAMOND", "name": "SCOTT L. DIAMOND"}, "num_reviewers": 84, "id": "27088-401-221-SCOTT-L--DIAMOND"}]}, "credits": null, "primary_alias": "CBE-562", "path": "/courses/27088", "sections": {"path": "/courses/27088/sections", "values": [{"name": "DRUG DISCOVERY & DEVELOP", "sectionnum": "401", "primary_alias": "CBE-562-401", "path": "/courses/27088/sections/401", "id": "27088-401", "aliases": ["CBE-562-401", "BE-562-401"]}]}, "id": 27088, "aliases": ["CBE-562", "BE-562"]}