[{"ratings": {"rAmountLearned": "2.16", "rDifficulty": "3.29", "rStimulateInterest": "1.69", "rRecommendMajor": "2.40", "rCourseQuality": "1.64", "rWorkRequired": "3.63", "rInstructorAccess": "2.64", "rReadingsValue": "1.25", "rRecommendNonMajor": "0.54", "rCommAbility": "1.36", "rInstructorQuality": "1.94"}, "section": {"name": "INTRO TO DYNAMIC SYSTEMS", "sectionnum": "001", "primary_alias": "ESE-210-001", "path": "/courses/24357/sections/001", "id": "24357-001", "aliases": ["ESE-210-001"]}, "comments": "This first course in systems modeling focuses on linear discrete-time systems.\r\nThroughout this course, necessary mathematical tools are developed, drawing on a set of\r\nexamples that demonstrate the breadth of systems models; these examples are drawn\r\nfrom engineering, the biological sciences, and economics. MATLAB is used extensively.\r\nStudents had mixed feelings regarding the course content. Some thought that it\r\nwas interesting, with “some real world connections.” One student called it “an excellent\r\nintroduction to the broad concepts of recursion and dynamic systems.” Another student,\r\nhowever, pointed out that the course was so abstract that he would not know “how to\r\napply these concepts to the real world.” A majority of the class complained about the\r\nhomework, which wasn’t “necessarily difficult”, but “impossible to answer” without TA\r\nhelp due to “extremely convoluted” and ambiguous wording.\r\nSeveral students were full of praise for the “wonderful” and “responsive” TAs,\r\nwhose help was essential in completing the homework. Regarding Professor\r\nKoditschek’s teaching, one student commented that he “may have tried too hard to make\r\nthe beginning understandable and thus spent too much time on it.” As a result, a few\r\nothers noted that later topics were not covered in depth.\r\nMany students indicated that they put a lot of effort into the class, but not all felt\r\nthat the time improved their understanding of the material. One respondent called it “a\r\ngood way for students to start with the basics of systems.”", "num_students": 77, "path": "/courses/24357/sections/001/reviews/2951-DANIEL-E--KODITSCHEK", "instructor": {"path": "/instructors/2951-DANIEL-E--KODITSCHEK", "first_name": "DANIEL E.", "last_name": "KODITSCHEK", "id": "2951-DANIEL-E--KODITSCHEK", "name": "DANIEL E. KODITSCHEK"}, "num_reviewers": 68, "id": "24357-001-2951-DANIEL-E--KODITSCHEK"}]