{"coursehistories": {"path": "/coursehistories/774"}, "description": "The course provides an in-depth experimental introduction to key concepts in materials and the relationships between nanoscale structure, the properties and performance. The use of laboratory methods to examine the structure of materials, to measure the important properties, and to investigate the relationship between structure and properties is covered. Emphasis is placed on a complete exposure of Nano and Materials science as a field. Most experiments require multiple laboratory sessions, with priority given to experiments in which students explore the entire range of materials science, from the synthesis of materials and the characterization of structure, thermodynamics and composition, to the measurement of properties and discussion of applications. Students are able to realize working devices as an end product of the key laboratories in this course. Practice in oral and written communication is realized through course assignments. \n\n", "semester": "2012A", "name": "NANO-SCALE MATERIALS LAB", "reviews": {"path": "/courses/27817/reviews", "values": [{"ratings": {"rAmountLearned": "3.14", "rDifficulty": "3.48", "rStimulateInterest": "3.19", "rRecommendMajor": "3.43", "rCourseQuality": "2.48", "rWorkRequired": "3.90", "rInstructorAccess": "3.43", "rReadingsValue": "2.29", "rRecommendNonMajor": "0.67", "rCommAbility": "3.40", "rInstructorQuality": "3.43"}, "section": {"name": "NANO-SCALE MATERIALS LAB", "sectionnum": "001", "primary_alias": "MSE-250-001", "path": "/courses/27817/sections/001", "id": "27817-001", "aliases": ["MSE-250-001"]}, "comments": "The course provides an in-depth experimental introduction to key concepts in materials and the relationships between nanoscale structure, the properties and performance. The use of laboratory methods to examine the structure of materials, to measure the important properties, and to investigate the relationship between structure and properties is covered. Emphasis is placed on a complete exposure of Nano and Materials science as a field. Most experiments require multiple laboratory sessions, with priority given to experiments in which students explore the entire range of materials science, from the synthesis of materials and the characterization of structure, thermodynamics and composition, to the measurement of properties and discussion of applications. Students are able to realize working devices as an end product of the key laboratories in this course.\r\n\r\nStudents thought the class was a great learning experience albeit an excess of out of class work.  One student summarized a generally agreed upon opinion, “The class was very interesting and we did a lot of really cool things in lab. It taught us how to write effective lab reports well and about how materials engineering works in general. However, there is a ton of work for this class.”\r\n\r\nOverall, students thought Prof. Gianola did a good job teaching the class and being accessible outside of class. However, students complained that it was tough to know how they were doing in the class because assignments were not returned in a timely manner.  One student suggested that a rubric would be extremely helpful and another student stated, “Generally, this class has excellent labs and procedures in place with great TAs. But with better organization the students could spend less time trying to decipher both our data and what is expected of us, and instead focus on drawing intelligent conclusions and improving our technical writing.”\r\n\r\nThis class is intended for MSE majors in their sophomore year, with MSE 220 being the prerequisite class. There was a strong consensus among students that this class took a lot of work. However, as one student put it, “the MSE curriculum would not be complete without this course.”\r\n", "num_students": 23, "path": "/courses/27817/sections/001/reviews/5442-DANIEL-SANTIAGO-GIANOLA", "instructor": {"path": "/instructors/5442-DANIEL-SANTIAGO-GIANOLA", "first_name": "DANIEL SANTIAGO", "last_name": "GIANOLA", "id": "5442-DANIEL-SANTIAGO-GIANOLA", "name": "DANIEL SANTIAGO GIANOLA"}, "num_reviewers": 21, "id": "27817-001-5442-DANIEL-SANTIAGO-GIANOLA"}]}, "credits": null, "primary_alias": "MSE-250", "path": "/courses/27817", "sections": {"path": "/courses/27817/sections", "values": [{"name": "NANO-SCALE MATERIALS LAB", "sectionnum": "001", "primary_alias": "MSE-250-001", "path": "/courses/27817/sections/001", "id": "27817-001", "aliases": ["MSE-250-001"]}]}, "id": 27817, "aliases": ["MSE-250"]}