{"coursehistories": {"path": "/coursehistories/2568"}, "description": "This rapidly moving course provides a rigorous development of fundamental ideas in probability theory and random processes. This course is a prerequisitefor subsequent courses in communication theory and telecommunications such as ESE 576 and TCOM 501. The course is also suitable for students seeking a rigorous graduate level exposure to probabilistic ideas and principles with applications in diverse settings. We will focus on discrete and continuous probability spaces. \n\nThe topics covered are drawn from: abstract probability spaces; combinatorial probabilities; conditional probability; Bayes's rule and the theorem of total probability; independence; connections with the theory of numbers, Borel's normal law; rare events, Poisson laws, and the Lovasz local lemma; arithmetic and lattice distributions arising from the Bernoulli scheme; limit laws and characterizations of the binomial and Poisson distributions; continuous distributions in one and more dimensions; the uniform, exponential, normal, and related distributions and their characterizations and applications; random variables, distribution functions; random number generation and statistical tests of randomness; measures of central tendency -- mean, median, mode; mathematical expectation and the Lebesgue theory; expectations of functions, key properties, moments, convolutions; operator methods and distributional convergence, the central limit theorem, selection principles; conditional expectation; tail inequalities, concentration; convergence in probability and almost surely, the law of large numbers, the law of the iterated logarithm; Poisson approximation, Janson's inequality, the Stein-Chen method; moment generating functions, renewal theory; characteristic functions. \n\n", "semester": "2008C", "name": "ELMTS PROB THRY/RNDM PRO", "reviews": {"path": "/courses/18651/reviews", "values": [{"ratings": {"rAmountLearned": "3.23", "rDifficulty": "3.54", "rStimulateInterest": "3.46", "rRecommendMajor": "3.31", "rCourseQuality": "3.23", "rWorkRequired": "3.54", "rInstructorAccess": "3.69", "rReadingsValue": "3.15", "rRecommendNonMajor": "1.38", "rCommAbility": "3.62", "rInstructorQuality": "3.85"}, "section": {"name": "ELMTS PROB THRY/RNDM PRO", "sectionnum": "001", "primary_alias": "ESE-530-001", "path": "/courses/18651/sections/001", "id": "18651-001", "aliases": ["ESE-530-001"]}, "comments": "", "num_students": 14, "path": "/courses/18651/sections/001/reviews/1177-SANTOSH-S-VENKATESH", "instructor": {"path": "/instructors/1177-SANTOSH-S-VENKATESH", "first_name": "SANTOSH S", "last_name": "VENKATESH", "id": "1177-SANTOSH-S-VENKATESH", "name": "SANTOSH S VENKATESH"}, "num_reviewers": 13, "id": "18651-001-1177-SANTOSH-S-VENKATESH"}]}, "credits": null, "primary_alias": "ESE-530", "path": "/courses/18651", "sections": {"path": "/courses/18651/sections", "values": [{"name": "ELMTS PROB THRY/RNDM PRO", "sectionnum": "001", "primary_alias": "ESE-530-001", "path": "/courses/18651/sections/001", "id": "18651-001", "aliases": ["ESE-530-001"]}]}, "id": 18651, "aliases": ["ESE-530"]}