[{"ratings": {"rAmountLearned": "2.20", "rDifficulty": "2.82", "rStimulateInterest": "1.98", "rRecommendMajor": "2.71", "rCourseQuality": "2.05", "rWorkRequired": "2.46", "rInstructorAccess": "2.56", "rReadingsValue": "1.81", "rRecommendNonMajor": "1.28", "rCommAbility": "1.94", "rInstructorQuality": "2.33"}, "section": {"name": "EVOLUTIONARY BIOLOGY", "sectionnum": "001", "primary_alias": "BIOL-230-001", "path": "/courses/21351/sections/001", "id": "21351-001", "aliases": ["BIOL-230-001"]}, "comments": "Evolutionary Biology concentrates on the theories and mechanisms of evolution, with emphasis on the genetic basis of evolutionary change. The course includes 3 exams, a 15 page scientific paper, and recitation every week. BIOL 101 and BIOL 102 or BIOL 121 are pre-requisites.\r\n\r\nStudents felt that the course was very interesting and thought-provoking, with one student going as far as to say that the course changed his “perspective on life on our planet.” It was strongly recommended for biology majors and anyone interested in organismal biology and evolution. However, students were concerned that the topic of evolution is so broad that the course tried to cover too much unsuccessfully. They also felt that the recitation sections needed to reinforce the material more, rather than introduce new material. \r\n\r\nProfessor Schmidt was described as “accessible,” though a somewhat dry lecturer. His command of the subject was described as not only impressive, but also “humbling.” While the material in the course is “straightforward,” students felt that Professor Schmidt’s lectures were often hard to keep up with and “disorganized.” There were also concerns that the TA’s grading was too “nitpicky.”\r\n\r\nStudents all emphasized that this class requires a lot of work, with one student saying that the final paper requires at least 60+ hours of work in order to do well. Students also felt that it was difficult to anticipate what a complete answer on an exam was, and that some final questions were “overly philosophical.” There were mixed reviews regarding the textbook, with some students finding it “unnecessary,” and others describing it as “fantastic.”\r\n", "num_students": 66, "path": "/courses/21351/sections/001/reviews/191-PAUL-STUTZ-SCHMIDT", "instructor": {"path": "/instructors/191-PAUL-STUTZ-SCHMIDT", "first_name": "PAUL STUTZ", "last_name": "SCHMIDT", "id": "191-PAUL-STUTZ-SCHMIDT", "name": "PAUL STUTZ SCHMIDT"}, "num_reviewers": 57, "id": "21351-001-191-PAUL-STUTZ-SCHMIDT"}]