{"coursehistories": {"path": "/coursehistories/2525"}, "description": "In 1815 in the wake of the battle of Waterloo, Great Britain controlled a staggering quarter of the world's landmass and half of its gross national product. This course will begin with the Napoleonic Wars and this Regency aftermath to survey a century of British literature -- from Romanticism through the revolutions of 1848 and the Victorian and Edwardian periods to the beginning of the first World War. Most versions of this course will read both novels and poetry, often focusing on the relation between the two and their function within nineteenth century culture. Others may incorporate drama and non-fiction prose. \n\nSee the English Department's website at www.english.upenn.edu for a description of the current offerings. \n\n", "semester": "2012A", "name": "19th Century British Literature:  The Novel of Development", "reviews": {"path": "/courses/27287/reviews", "values": [{"ratings": {"rAmountLearned": "3.24", "rDifficulty": "1.96", "rStimulateInterest": "3.42", "rRecommendMajor": "3.76", "rCourseQuality": "3.46", "rWorkRequired": "2.72", "rInstructorAccess": "3.72", "rReadingsValue": "3.58", "rRecommendNonMajor": "3.08", "rCommAbility": "3.64", "rInstructorQuality": "3.65"}, "section": {"name": "19th Century British Literature:  The Novel of Development", "sectionnum": "001", "primary_alias": "ENGL-051-001", "path": "/courses/27287/sections/001", "id": "27287-001", "aliases": ["ENGL-051-001"]}, "comments": "The focus of this course was the classic English novel of education, but because the questions that animate those novels appear in other genres, students also read some poetry, a memoir and a play as well.  The course began with Jane Austen’s Persuasion, a novel that shows a young woman’s quiet struggle against the friends and family who thwart her attempts at independence. Students then read Jane Eyre and Great Expectations to see how the pattern of growing up varies by gender. Students continued with George Eliot’s massive and marvelous novel, Middlemarch whose heroine is devoted to the notion of duty. The course did not rush through but instead took its time and appreciate its intricate structures and passionate intelligence. Because the Victorians took the question of religious belief very seriously, the course read a memoir, Father and Son by Edmund Gosse, sections of Tennyson’s poem In Memoriam, both of which trace the changes in a young man’s faith. Students also read Shaw’s play St. Joan, whose life and death pose serious questions about development. The course concluded with one of the greatest 20th century novels of development, Virginia Woolf’s To the Lighthouse.\r\n\r\nOverall, students enjoyed the material of the course and felt that they \"learned a lot and emerged better equipped to analyze specific passages in tracing the development of characters.\" Another student noted that this course made him or her \"a better critical reader and a better analytical writer.” The course incorporated \"a lecture and a seminar\" which included \"open discussions of the works,\" though some students wanted \"more opportunities to interact with peers\" and more film clips integrated in the course.\r\n\r\nStudents strongly praised Professor Burnham, calling her \"fantastic,\" \"kind,\" \"amazing,\" \"fair,\" and \"knowledgeable.\" Class members enjoyed Professor Burnham's accessibility; she made herself available \"during office hours as well as by telephone.\" Students also liked how the professor shared \"her passion for literature with her students.\" \r\n\r\nA few students noted, in terms of the workload, that the course contained \"a huge amount of reading.\" However, students could succeed if they stayed \"on top of the readings\" and completed \"the small assignments,\" such as \"short one page discussion papers each day and one final paper.\" The small writing assignments \"were not too overwhelming,\" especially in a class with so much reading, and the discussion papers prompted students to complete reading, which they found \"worthwhile\" despite its magnitude. Students had \"opportunities to revise, if necessary.” Though the course was an English class, it was appropriate for \"English majors, but also non-majors who are looking to read the classics of British literature.\"", "num_students": 31, "path": "/courses/27287/sections/001/reviews/437-DEBORAH-S-BURNHAM", "instructor": {"path": "/instructors/437-DEBORAH-S-BURNHAM", "first_name": "DEBORAH S", "last_name": "BURNHAM", "id": "437-DEBORAH-S-BURNHAM", "name": "DEBORAH S BURNHAM"}, "num_reviewers": 26, "id": "27287-001-437-DEBORAH-S-BURNHAM"}]}, "credits": null, "primary_alias": "ENGL-051", "path": "/courses/27287", "sections": {"path": "/courses/27287/sections", "values": [{"name": "19th Century British Literature:  The Novel of Development", "sectionnum": "001", "primary_alias": "ENGL-051-001", "path": "/courses/27287/sections/001", "id": "27287-001", "aliases": ["ENGL-051-001"]}]}, "id": 27287, "aliases": ["ENGL-051"]}