{"coursehistories": {"path": "/coursehistories/5011"}, "description": "The course provides the student with a number of tools and concepts necessary for creating and managing product development processes.The course consists of two interwoven parts. First, it presents the basic steps that are necessary for moving from a \"cool idea\" to a product sufficiently mature to launch an entrepreneurial start-up. This includes cases, lectures, and exercises on topics like identifying customer needs, developing a product concept as well as effective prototyping strategies. The capstone of this first part is a real project in which student teams conceptualize and develop a new product or service up to the completion of a fully functional prototype. \n\nSecond, the course discusses a number of challenges related to product development as encountered by management consultants, members of cross-functional development teams as well as general managers. We will analyze several cases related to, among others, resource allocation in R&D organizations, organizational forms of product development teams, as well as managing development projects across large geographic distances. \n\n", "semester": "2012A", "name": "PRODUCT DESIGN&DEVEL", "reviews": {"path": "/courses/27969/reviews", "values": [{"ratings": {"rAmountLearned": "2.10", "rDifficulty": "1.35", "rStimulateInterest": "3.00", "rRecommendMajor": "2.50", "rCourseQuality": "2.46", "rWorkRequired": "1.95", "rInstructorAccess": "2.78", "rReadingsValue": "1.80", "rRecommendNonMajor": "2.20", "rCommAbility": "2.90", "rInstructorQuality": "2.82"}, "section": {"name": "PRODUCT DESIGN&DEVEL", "sectionnum": "001", "primary_alias": "OPIM-654-001", "path": "/courses/27969/sections/001", "id": "27969-001", "aliases": ["OPIM-654-001"]}, "comments": "", "num_students": 40, "path": "/courses/27969/sections/001/reviews/5506-DAVID-ROBERTSON", "instructor": {"path": "/instructors/5506-DAVID-ROBERTSON", "first_name": "DAVID", "last_name": "ROBERTSON", "id": "5506-DAVID-ROBERTSON", "name": "DAVID ROBERTSON"}, "num_reviewers": 31, "id": "27969-001-5506-DAVID-ROBERTSON"}, {"ratings": {"rAmountLearned": "3.29", "rDifficulty": "2.34", "rStimulateInterest": "3.51", "rRecommendMajor": "3.63", "rCourseQuality": "3.38", "rWorkRequired": "2.83", "rInstructorAccess": "3.45", "rReadingsValue": "2.70", "rRecommendNonMajor": "3.34", "rCommAbility": "3.54", "rInstructorQuality": "3.51"}, "section": {"name": "PRODUCT DESIGN&DEVEL: San Francisco Intensive Workshop on Development of Web-Based Services", "sectionnum": "751", "primary_alias": "OPIM-654-751", "path": "/courses/27969/sections/751", "id": "27969-751", "aliases": ["OPIM-654-751"]}, "comments": "Product Design and Development: Design of Web-Based Products and Services is held at the Wharton San Francisco Campus from 9am to 5pm Monday through Thursday in first week in January, plus evening activities Monday through Wednesday. OPIM 654 is run in an intensive workshop format. About 10-20 hours of preparation will be required in December before the start of class (in generating ideas for web-based product and service opportunities). Otherwise, all requirements for the course will be completed by 5pm on Thursday. Workshop participants will be responsible for arranging their own transportation and lodging. \r\n\r\nStudents described OPIM 654 as “excellent,” “fantastic,” and “interesting.” Multiple students said that this was “the best course” they have taken at Wharton. Students thoroughly enjoyed this course because of the “tremendous” amount they learned. One student reported that OPIM 654 was a “very good demonstration of how quickly one can go from idea to prototype.” Another student said that the course was helpful in knowing “how to start your own business and what to look for in business start-ups.” Most students appreciated the structure of the course as a workshop where students worked together in teams. However, a few students wished that more time were spent on concrete examples of successful web-based products. Nevertheless, students “learned a huge amount” from OPIM 654.\r\n\r\n\tStudents unanimously had nothing but high regards for Professor Ulrich. They described him as “engaging,” “dedicated,” and “inspirational.” Students reported that his knowledge of the subject helped to “stimulate student interest.” Additionally, Professor Ulrich invited a few guest speakers to the class, who each had distinct backgrounds and provided new perspectives. Many students also complimented him on his teaching style that combined conceptual ideas with real world examples.\r\n\r\nThe workload of OPIM 654 was reported as relatively light. However, many students had issues with the grading system, which was based on student voting. Furthermore, multiple students reported that there was a “discrepancy in technical understanding,” and that the course required “mechanical engineering or IPD experience.” Nevertheless, the majority of students highly recommended the course to those interested in business start-ups. OPIM 654 is open to any Wharton MBA student (East/West, WEMBA or full-time).\r\n", "num_students": 45, "path": "/courses/27969/sections/751/reviews/1924-KARL-T--ULRICH", "instructor": {"path": "/instructors/1924-KARL-T--ULRICH", "first_name": "KARL T.", "last_name": "ULRICH", "id": "1924-KARL-T--ULRICH", "name": "KARL T. ULRICH"}, "num_reviewers": 38, "id": "27969-751-1924-KARL-T--ULRICH"}]}, "credits": null, "primary_alias": "OPIM-654", "path": "/courses/27969", "sections": {"path": "/courses/27969/sections", "values": [{"name": "PRODUCT DESIGN&DEVEL", "sectionnum": "001", "primary_alias": "OPIM-654-001", "path": "/courses/27969/sections/001", "id": "27969-001", "aliases": ["OPIM-654-001"]}, {"name": "PRODUCT DESIGN&DEVEL: San Francisco Intensive Workshop on Development of Web-Based Services", "sectionnum": "751", "primary_alias": "OPIM-654-751", "path": "/courses/27969/sections/751", "id": "27969-751", "aliases": ["OPIM-654-751"]}]}, "id": 27969, "aliases": ["OPIM-654"]}