[{"ratings": {"rAmountLearned": "2.80", "rDifficulty": "2.52", "rStimulateInterest": "2.32", "rRecommendMajor": "3.20", "rCourseQuality": "2.40", "rWorkRequired": "3.48", "rInstructorAccess": "3.52", "rReadingsValue": "1.86", "rRecommendNonMajor": "0.92", "rCommAbility": "3.24", "rInstructorQuality": "2.96"}, "section": {"name": "LECTURE", "sectionnum": "001", "primary_alias": "MEAM-247-001", "path": "/courses/13545/sections/001", "id": "13545-001", "aliases": ["MEAM-247-001"]}, "comments": "MEAM 247 is the sophomore laboratory course in the Mechanical Engineering and Applied Mechanics major that is completed over the fall and spring semesters. It emphasizes concepts taught in other MEAM courses that students should be completing concurrently with the lab. Statics and strength of materials are taught in the fall, and thermodynamics and dynamics are the focus of the spring semester.\r\n\r\nStudents generally enjoyed this course. Many reported that they “liked the experiments” and found them “very interesting.” Others noted that the class taught them proper lab report writing skills, which would prove useful in future classes. The lab was very relevant to the other courses that MEAM students were taking and “useful for the MEAM major” in general.\r\n\r\nOverall, Professor Carpick supervised the course well. Students indicated that he was good at communicating the instructions of the labs and always willing to discuss problems associated with reports.\r\n\r\nThis class is designed for MEAM sophomores. To take MEAM 247, students should be enrolled in MEAM 210 in the fall and MEAM 203 and MEAM 211 in the spring to facilitate learning the material. Many students remarked that the lab reports were “long and tedious” and “a bit overwhelming.” A great number also explained that this course demands quite a bit of work for being only a half credit.", "num_students": 33, "path": "/courses/13545/sections/001/reviews/4017-ROBERT-W--CARPICK", "instructor": {"path": "/instructors/4017-ROBERT-W--CARPICK", "first_name": "ROBERT W.", "last_name": "CARPICK", "id": "4017-ROBERT-W--CARPICK", "name": "ROBERT W. CARPICK"}, "num_reviewers": 25, "id": "13545-001-4017-ROBERT-W--CARPICK"}]