[{"ratings": {"rAmountLearned": "2.16", "rDifficulty": "1.84", "rStimulateInterest": "2.08", "rRecommendMajor": "2.45", "rCourseQuality": "2.00", "rWorkRequired": "1.69", "rInstructorAccess": "2.80", "rReadingsValue": "2.08", "rRecommendNonMajor": "2.22", "rCommAbility": "2.18", "rInstructorQuality": "2.39"}, "section": {"name": "LAW & SOCIETY", "sectionnum": "401", "primary_alias": "SOCI-135-401", "path": "/courses/25117/sections/401", "id": "25117-401", "aliases": ["SOCI-135-401", "AFRC-135-401"]}, "comments": "Sociology 135 introduces students to the major theoretical concepts concerning law and society, and examines significant controversial societal issues that deal with law and the legal systems both domestically and internationally. Class discussions will focus on issues involving civil liberties, the organization of courts, legislatures, the legal profession and administrative agencies. Although the focus of the course is on law in the United States, law and society in other countries of Africa, Asia, Europe and Latin America are also covered in a comparative context. Readings for this class include research reports, statutes and cases.\r\n\r\nStudents that took this course often did so out of an interest in law and politics. Therefore, many of them found the course to be interesting. It is taught in a lecture style, but the professor often opens up the floor to students to hear opinions. Many of these discussions were prompted by current events.  Some students said they wished that there was more time for open discussion, as this was more engaging than pure lecture, though often lecture took the center stage. There were a couple divergences in opinions, as one student found the class “a bit disappointing,” but overall the consensus was positive. \r\n\r\nProfessor Fetni was well liked because of his friendliness and support for his students. However, many students found him to be quite biased in they way he presented material. He often was thought to be making “left wing” statements that many students did not agree with. Despite this, he was thought of as helpful and inspiring to the students. Some students complained that Professor Fetni was quite slow in responding to emails. His tangents, though seemingly unrelated, were both interesting and aimed at helping students understand concepts in the context of life and not just for tests. He was described as a “fantastic professor.”  \r\n\r\nThis course has a relatively light course load and there are minimal quizzes and tests. However, this caused some concern over the grading process, as many students did not know where they stood. The course is recommended for majors and non-majors alike.   \r\n", "num_students": 63, "path": "/courses/25117/sections/401/reviews/1011-HOCINE-FETNI", "instructor": {"path": "/instructors/1011-HOCINE-FETNI", "first_name": "HOCINE", "last_name": "FETNI", "id": "1011-HOCINE-FETNI", "name": "HOCINE FETNI"}, "num_reviewers": 57, "id": "25117-401-1011-HOCINE-FETNI"}]