{"coursehistories": {"path": "/coursehistories/2968"}, "description": "Since its birth, the discipline of anthropology has played a significant role (for better or for worse) in influencing popular perceptions of \"the arts.\" As \"objects\" of study, artifacts, as well as visual and performing arts of non-western cultures have fascinated and preoccupied those within the discipline. Early social thinkers and anthropologists have used various material and visual cultural manifestations of people's culture (inclusive of dance, music, museum and visual arts) to construct evolutionary models and to develop theories of culture purporting to both describe and explain. In this course we will review historically how ethnocentric biases against \"other\" people's artistic creativity have led to dichotomizations such as high/low culture, fine/primitive art, and classic/folk art and music--that invariably place Euro-western art forms at th e pinnacle of refinement and taste. We will also look at how gender plays a role in how artistic culture is ranked. \n\nInformed by interdisciplinary critical analyses of theory, we next turn the lens inward at ourselves to investigate where, when, how and for what purpose contemporary consumption of art and music takes place. We question when and why various forms of art and music become symbolic in and out of the context in which they were created. Aside from their aesthetic dimension, we will analyze how various arts have been marketed, and how they are implicated in consumption habits which become associated with certain social classes and different categories of \"taste.\"The semester will be divided into two parts, Part I will be devoted to the visual arts, and Part II will concentrate on performing arts and musi c. In addition to what we learn from lectures, readings, research assignments, field trips, guest speakers and films, each participant will develop, research, and present on a particular topic of interest. \n\n", "semester": "2006A", "name": "ANTHRO OF MUSIC & ART", "reviews": {"path": "/courses/7310/reviews", "values": [{"ratings": {"rAmountLearned": "2.60", "rDifficulty": "2.00", "rStimulateInterest": "3.20", "rRecommendMajor": "2.80", "rCourseQuality": "2.40", "rWorkRequired": "1.80", "rInstructorAccess": "2.80", "rReadingsValue": "2.80", "rRecommendNonMajor": "2.60", "rCommAbility": "3.00", "rInstructorQuality": "2.60"}, "section": {"name": "ANTHRO OF MUSIC & ART", "sectionnum": "601", "primary_alias": "ANTH-333-601", "path": "/courses/7310/sections/601", "id": "7310-601", "aliases": ["ANTH-333-601", "WSTD-333-601"]}, "comments": "", "num_students": 7, "path": "/courses/7310/sections/601/reviews/2850-MARILYNNE-DIGGS-THOMPSON", "instructor": {"path": "/instructors/2850-MARILYNNE-DIGGS-THOMPSON", "first_name": "MARILYNNE", "last_name": "DIGGS-THOMPSON", "id": "2850-MARILYNNE-DIGGS-THOMPSON", "name": "MARILYNNE DIGGS-THOMPSON"}, "num_reviewers": 5, "id": "7310-601-2850-MARILYNNE-DIGGS-THOMPSON"}]}, "credits": null, "primary_alias": "ANTH-333", "path": "/courses/7310", "sections": {"path": "/courses/7310/sections", "values": [{"name": "ANTHRO OF MUSIC & ART", "sectionnum": "601", "primary_alias": "ANTH-333-601", "path": "/courses/7310/sections/601", "id": "7310-601", "aliases": ["ANTH-333-601", "WSTD-333-601"]}]}, "id": 7310, "aliases": ["ANTH-333", "WSTD-333"]}