
{
  "result_data" : [ {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will investigate epigenetic phenomena: heritable alternative states of gene activity that do not result from altered nucleotide sequence. Recent findings suggest an important role of these phenomena in normal development, as well as in oncogenesis. Many, but not all, epigenetic phenomena are based on the fact that in the organism DNA is organized into a higher order structure, the chromatin. We will therefore first discuss the implications of chromatin for gene activity. We will then investigate epigenetic phenomena such as DNA methylation, genomic imprinting, RNA interference, silencing, and co-suppression. This course is a combination of lecture and discussion using current scientific literature.",
    "course_id" : "CAMB483",
    "course_level" : "2",
    "course_level_description" : "Intermediate",
    "course_notes" : "",
    "course_number" : "483",
    "course_title" : "Epigenetics",
    "crosslistings" : [ {
      "course_id" : "483",
      "section_id" : "",
      "subject" : "BIOL"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Wagner",
    "prerequisites" : "BIOL 221",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Cells in complex organisms are required to adapt rapidly in a changing enviro nment. Maintaining homeostasis while performing specialized functions requires that cells respond to extracellular signals as well as fluctuations in a host of intracellular metabolites. This course will cover selected topics and general principles related to signal transduction and the control of metabolic flux in living cells. The course format will include student-led discussion sessions both providing an overview of a topic as well as focusing on important papers from the primary literature. Students will be evaluated on their presentations and participation, as well as problem sets. Offered alternatelyin the spring sememster with CAMB 691.",
    "course_id" : "CAMB692",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "We encourage participation by non-CAMB students.",
    "course_number" : "692",
    "course_title" : "Advanced Topics in Cell Biology and Physiology II: Cell Signaling",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "M.  Lemmon, J.  Baur",
    "prerequisites" : "BIOM 600 or a similar survey course in cell biology, or the permission of the instructor.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "K",
    "terms_offered_description" : "Course offered spring; odd-numbered years"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will introduce students to diverse basic principles that contribute to viral pathogenesis. We will use HIV as a model to illustrate specific elements that relate to disease development, emphasizing a) pathogenesis, b) immunology, c) retroviral replication cycle, and d) vaccine development. Offered spring semester. One 1.5 to 2 hour class weekly for the course of the semester.The first class will include two 45-minute introductory lectures given by the course instructors. Each week, a student will lead the class in the dissection and discussion of published papers on a specific topic. The format that we will follow will be a 20-minute introduction presented by the student followed by the analysis of one to two articles, which will be presented by the student and discussed by the class.",
    "course_id" : "CAMB546",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "546",
    "course_title" : "HIV Pathogenesis",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "R.  Collman and D.  Weissman",
    "prerequisites" : "Strong background in cell biology, immunology or virology fulfilled by 1st yr CAMB (previous BGS courses) or Module 1 of med school curriculum.  Course is limited to graduate students.  Instructor permission required for non-CAMB graduate students.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "J",
    "terms_offered_description" : "Course offered spring; even-numbered years"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Genetic analysis involves use of induced mutations and natural variation to study biological processes. This course presents the logic and technology of this approach in four model organisms (Drosophila, C. elegans, mouse, Arabidopsis) and humans.",
    "course_id" : "CAMB541",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "541",
    "course_title" : "Genetic Analysis",
    "crosslistings" : [ {
      "course_id" : "540",
      "section_id" : "",
      "subject" : "BIOL"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Poethig",
    "prerequisites" : "A college-level introductory course in genetics / molecular biology.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This is a required course of the Genetics and Gene Regulation Program and is designed to provide students with a comprehensive overview of genetic concepts and methodology. The course is organized into three parts: I Fundamental genetic concepts; II Genetics of model organisms (with a focus on worms, flies and mice); III Human genetics and disease. Each week there will be two lectures and one associated discussion/problem-solving session. Discussions emphasize practical aspects of generating and interpreting genetic data. Offered spring semester.",
    "course_id" : "CAMB550",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Open to all PhD students in BGS, priority given to CAMB and GCB students. Students outside of BGS or in non-PhD programs require permission from the course director to register.",
    "course_number" : "550",
    "course_title" : "Genetic Principles",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Sundaram, M. & Grant, S.",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The course will meet once weekly for student presentations and lectures. The goal of the course will be to give students a better understanding of the abrogation of normal cellular metabolism and stress signaling during cancer and how these interplay with each other to create/maintain a malignant state. Besides student presentations the course will include 4 lectures devoted to metabolomics methodologies.",
    "course_id" : "CAMB704",
    "course_level" : "4",
    "course_level_description" : "Graduate",
    "course_notes" : "Permission to enroll is required from course directors, preference is given to second year CAMB students in the Cancer Biology Program.",
    "course_number" : "704",
    "course_title" : "Stress Responses and Metabolism in Cancer",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "J.  Alwine, C.  Simon, & K.  Wellen",
    "prerequisites" : "Must have taken first year CAMB courses",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The course objective is to introduce the students to important and current concepts in Cancer Biology and Cancer Genetics. The lectures are organized into 4 broad thematic groups: A) Cell-Autonomous Mechanisms (e.g., tumor suppressor and oncogene function, DNA repair pathways, senescence, apoptosis); B) Non Cell-Autonomous Mechanisms (e.g., tumor microenvironment, hypoxia, angiogenesis); C) Organ Systems (e.g., pancreatic cancer, hematopoetic malignancies); and D) Therapeutic Approaches (e.g. protein kinase inhibitors, immunotherapy, radiation therapy). The organizers, along with faculty from the School of Medicine, the Wistar Institute and CHOP, with expertise in the corresponding areas provide lectures for the course. The students are expected to present, and participate in discussions of one or more key recent papers at Journal Clubs that are held at the end of each thematic group. There will be mid-term and final exams of short essays relevant to the lectures.",
    "course_id" : "CAMB512",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Non-CAMB students must contact the course director prior to registration. Students are permitted to audit this class for non-credit with the permission of the course director.",
    "course_number" : "512",
    "course_title" : "Cancer Biology and Genetics",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Todd Ridky and Yi Fan",
    "prerequisites" : "BIOM600 or course director permission.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This graduate course, which will include lectures and readings from the literature, is designed to provide a foundation in the principles of developmental biology. Topics covered will include: fertilization and cleavage, pattern formation, gastrulation, germ layer formation, tissue specification, morphogenesis, tissue differentiation, organogenesis, stem cell biology, and developmental evolution. The use of modern molecular biology, genetics, and embryological manipulations will be discussed in the context of the analysis of developmental mechanisms.",
    "course_id" : "CAMB511",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "NON-BGS students require permission from course directors to register.",
    "course_number" : "511",
    "course_title" : "Principles of Development",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "M.  Mullins",
    "prerequisites" : "Previous courses in molecular and cellular biology are recommended.  Undergrad background in cell biology and molecular biology required.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course is designed for beginning graduate students and advanced undergraduate students with a particular enthusiasm for Cell Biology. CAMB/BIOL 480 does not attempt to cover all aspects of cell biology, and is therefore not appropriate for students seeking a lecture course that provides a comprehensive survey of the field. Rather, the primary objective of this course is to teach those students considering a career in the biomedical sciences how to read, discuss, and question research papers effectively. Intensive classroom discussions focus on the experimental methods used, results obtained, interpretation of these results in the context of cell structure and function, and implications for further studies. There is no assigned text; students learn to critically evaluate current literature by reading original papers on selected topics in modern cell biology. Accordingly, class participation/discussion is essential and the grade will be determined significantly by that. In addition, there will be two exams including answering short questions and an assay critiquing an original paper that is selected on a topic in Cell Biology.",
    "course_id" : "CAMB480",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "480",
    "course_title" : "Advanced Cell Biology",
    "crosslistings" : [ {
      "course_id" : "480",
      "section_id" : "",
      "subject" : "BIOL"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Wei Guo",
    "prerequisites" : "College level biochemistry and cell biology",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The goal of this course is to introduce graduate students to the field of stem cell biology through lectures and reviews of important contributions from the literature. Topics include stem cell niche biology, epigenetics and reprogramming, tissue specific stem cells such as hematopoietic and epithelial stem cells, tissue regeneration, tissue engineering, and ethical and legal issues of stem cell and regeneration biology. The future potential and challenges in stem cell and regeneration biology will be discussed. Important aspects of stem cell identification and characterization utilizing multiple model systems will also be a focus. Offered Spring Semester. Limited to 14 students.",
    "course_id" : "CAMB697",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Graduate students only.  NO undergraduates.  Students other than CAMB will need permits.  CAMB students receive priority seating.",
    "course_number" : "697",
    "course_title" : "Biology of Stem Cells",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "P.  Gadue, C.  Lengner",
    "prerequisites" : "BGS Core Courses.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Life depends on the propagation of genetic material from one generation to next through cycles of genome replication and cell division. The genome is copied by the parent, and one exact copy is inherited by each daughter cell. We will treat chromosomes as discrete entities, rather than collections of genes, that are replicated and divided with high fidelity to ensure that the genome remains stable over many generations. By reading selected primary literature covering several decades, we will build an understanding of the cell cycle by focusing on chromosomes and the associated molecular machinery. We will explore mechanisms that underlie replication and division, particularly control mechanism that maintain genome integrity and are critical to prevent disease. The goal of the course is to develop a picture of the cell cycle by examining some of the key experiments and insights that have led to our current understanding. There is no textbook for the course. Readings from the primary literature will be assigned for each meeting and provided as pdf files. Presentations of these papers and class participation, including questions and critical evaluation, are an essential part of the course. Grading will be based on a final paper in the form of a research proposal (50%) and on class participation (50%).",
    "course_id" : "CAMB486",
    "course_level" : "4",
    "course_level_description" : "Graduate",
    "course_notes" : "",
    "course_number" : "486",
    "course_title" : "Chromosomes and the Cell Cycle",
    "crosslistings" : [ {
      "course_id" : "486",
      "section_id" : "",
      "subject" : "BIOL"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Lampson, M.",
    "prerequisites" : "The course section is limited to PhD students only.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will present a survey of the physiology of most of the major organ systems. It will integrate knowledge of cellular and molecular mechanisms into an understanding of function at the tissue, organ, and organism levels. It will begin with a brief review of membrane physiology, followed by electrophysiology and signaling in nerve. Then, after a brief outline of neural control systems and their role in homeostasis, it will present motility and muscle, the cardiovascular system, respiration, the renal and gastrointestinal systems, and selected topics from the endocrine system, and the reproductive systems. As well as providing a basis of integrative physiology for students in fields such as physiology, bioengineering and pharmacology, it should be of interest to students of cellular and molecular biology and genetic engineering who will need to appreciate the roles of specific systems and molecules at higher levels of organization.",
    "course_id" : "CAMB532",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "532",
    "course_title" : "Human Physiology",
    "crosslistings" : [ {
      "course_id" : "532",
      "section_id" : "",
      "subject" : "PHRM"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Kevin Foskett",
    "prerequisites" : "Although not a formal prerequisite, a good foundation in cell biology at the level of BIOM/CAMB 600 (or an equivalent upper level undergraduate course) is strongly recommended.  A general understanding of the chemistry and biochemistry of macromolecules, and of basic molecular biology will also be assumed.  This course is primarily designed for 2nd year BGS students; 1st year students in BGS or other programs will require the permission of the instructor.  This course is not open to undergraduates.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The goal of this course is to examine the principles underlying nervous system development. Rather, the course will focus on selected topics, for which we will discuss the genetic, molecular and cellular strategies employed to study these problems in different model organisms. Emphasis is on how to interpret and critically evaluate experimental data. Spring 2014 Topics: Specification and generation of Neuronal Diversity; Axon and Dendrite Tiling and Self-Avoidance; Axon Guidance at the Midline; Synapse Formation; Wiring the Olfactory System, Axon Degeneration and Regeneration, Stem Cell Replacement Strategies for Neural Repair. Textbooks: No specific textbooks are required. The following texts are useful resources. Developmental Biology by Scott Gilbert; Development of the Nervous Syustem by Sanes, Reh, and Harris; and Molecular and Cellular Approaches to Neural Development edited by Cowan, Jessell, and Zipursky Format: Each class is 1.5 hours in length. During the first hour, an assigned paper will be discussed in detail. During the last 20-30 minutes, faculty will introduce methods, concepts, and background information pertinent to the paper that will be discussed at the following meeting.",
    "course_id" : "CAMB597",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "597",
    "course_title" : "Neural Development and Regeneration",
    "crosslistings" : [ {
      "course_id" : "597",
      "section_id" : "",
      "subject" : "NGG"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Greg J.  Bashaw and Michael Granato",
    "prerequisites" : "Cell 600.  Course reserved for NGG and CAMB graduates students.  All others by by permission only",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LAB",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "V",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "CAMB899",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "899",
    "course_title" : "Pre-Dissertation Lab Rot",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "MD",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LAB",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "V",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "CAMB699",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "699",
    "course_title" : "Lab Rotation",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Staff",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "MD",
    "terms_offered_code" : "D",
    "terms_offered_description" : "Two terms. student may enter either term."
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "DIS",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "CAMB995",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "995",
    "course_title" : "Dissertation",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This seminar course is designed to provide students with a cohesive understanding of virology and immunology of gene therapy. Three major themes will be covered: vectors, vector immunology and gene therapy of genetic and acquired diseases. The topics to be covered are viewed as an extension of topics covered in CAMB 610 (Molecular Basis of Gene Therapy), although CAMB 610 is not an absolute prerequisite for this seminar. Each class will consist of a brief introduction by an instructor, reviewing background information related to the theme discussion. The topics are explored through discussions, led by assigned students, of seminal research articles. Students are expected to have thoroughly reviewed the assigned articles and be able to present and discuss various aspects of the papers. Regular attendance and active participationin the discussions, which focus on critical evaluation of experimental design, data presentation and interpretation, is essential. Student evaluation will be based on attendance, in-class presentation (for 50% of the letter grade), and a take-home exam (for another 50% of the grade).",
    "course_id" : "CAMB637",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "BGS Students only",
    "course_number" : "637",
    "course_title" : "Gene Therapy: Vectors, Immunology, and Disease",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "J.  Riley",
    "prerequisites" : "Background in molecular biology, virology and immunology.  BGS Students only",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "J",
    "terms_offered_description" : "Course offered spring; even-numbered years"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "CB students get first priority followed by other CAMB students.",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Course Content: This 15-week course is designed for second year (and up) graduate students interested in learning about the tumor microenvironment. Thecourse will cover the main players of the tumor microenvironment field, (stroma, vasculature and immune cells) and emphasize the connections between the basic biology of the tumor microenvironment to potential therapeutic intervention. The goals of this course are to enrich scientific culture, train for clear and concise oral presentations, improve grant-writing skills, and develop critical thinking, professional composure and discussion skills. The course will be divided into 3 broad topic areas. At the beginning of each block, faculty members will present a 1 hour didactic lecture and overview of the topic followed by questions and discussions by students. Each week's session will be led by two students. One will prepare and present a didactic background lecture regarding the salient points of that week's topic, while the other student will lead discussion of a primary research paper including specific technical background needed for the paper, presenting the data in the paper, leading discussion on the data and conclusions drawn from the paper. Each student will present one background and one paper throughout the course. Students will be guided in choosing the appropriate depth of background and topic area and in giving formal presentations and constructive criticism of scientific data. Additionally each student will write a specific aim for a grant using one of his or her two presentations as \"preliminary data\". Evaluation: Students will be evaluated on their participation in class (40%), their presentations (40%) and their written assignment (20%). Students will be given feedback immediately after their presentations and at the end of the second block on their in-class participation.",
    "course_id" : "CAMB701",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "701",
    "course_title" : "Tumor Microenvironment",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "S.  Ryeom, E.  Pure, & D.  Feldser",
    "prerequisites" : "First year CAMB core courses must be completed.  Course is for 2nd year graduate students and beyond.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "MD",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "CAMB484",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "484",
    "course_title" : "Cell Motility and Cyto",
    "crosslistings" : [ {
      "course_id" : "484",
      "section_id" : "",
      "subject" : "BIOL"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course, together with its companion CAMB 692, offers an advanced, in depth analysis of selected topics in cell biology and physiology. CAMB 691 and 692 are complementary courses that focus on different aspects of cell biology; these courses are offered on an alternating basis in the spring semester. The courses can be taken in either order, but require BIOM 600 or an equivalent background in basic cell biology. CAMB 691 will focus on key issues at the forefront of research in the areas of (1) channels and transporters, (2) protein trafficking through cellular pathways, and (3) cytoskeletal dynamics and molecular motors. The course format pairs faculty presentations with student-led discussion sessions highlighting important papers from the primary literature. Students will be evaluated on their presentations, their participation in class discussions, and weekly problem sets. Offered alternately in the spring semester with CAMB 692.",
    "course_id" : "CAMB691",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Advanced undergrads must contact instructor to confirm qualifications.",
    "course_number" : "691",
    "course_title" : "Advanced Topics in Cell Biology & Physiology",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "E.  Grishchuk",
    "prerequisites" : "BIOM 600 or a similar survey course in cell biology.  Permission needed for all non-CAMB students.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "J",
    "terms_offered_description" : "Course offered spring; even-numbered years"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "A focused study of genomic, biochemical, cellular, and molecular aspects of RNA. Topics of study will include RNA structure, RNA processing and turnover, splicing, ribozymes and riboswitches, RNA editing and modification, RNA interference, endogenous eukaryotic RNA silencing pathways, small RNA biology, computational methodologies for studying RNA biology, and RNA viruses. Lectures, student presentations, and discussions will be based on readings from the primary literature.",
    "course_id" : "CAMB485",
    "course_level" : "3",
    "course_level_description" : "Advanced",
    "course_notes" : "Graduate students will have satisfied prerequisites in their undergraduate studies",
    "course_number" : "485",
    "course_title" : "The RNA World: A Functional and Computational Analysis.",
    "crosslistings" : [ {
      "course_id" : "485",
      "section_id" : "",
      "subject" : "BIOL"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "B.  Gregory",
    "prerequisites" : "BIOL 221 required.  BIOL 421 strongly recommended.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "J",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Advanced seminar on current topics in human genomics and human evolution. Topics include the methods used for mapping and sequencing genomes; phylogenetic and population genetic analysis; and detecting variation in the human genome. This course is designed for graduate students but advanced undergraduates with a strong background in genetics are also welcome.",
    "course_id" : "CAMB522",
    "course_level" : "4",
    "course_level_description" : "Graduate",
    "course_notes" : "",
    "course_number" : "522",
    "course_title" : "Human Evolutionary Genomics",
    "crosslistings" : [ {
      "course_id" : "522",
      "section_id" : "",
      "subject" : "BIOL"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "S.  Tishkoff",
    "prerequisites" : "Permission of director",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "J",
    "school_code" : "MD",
    "terms_offered_code" : "J",
    "terms_offered_description" : "Course offered spring; even-numbered years"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Topics are selected by course instructors and student participants. Course instructors vary yearly. The goal of this course is to provide students with an opportunity to analyze, present, and discuss significant research papers in the field of cell and molecular biology in small group settings. The sections are taught by faculty from the different programs within the Graduate Group. This is a required course for CAMB PhD students. Other BGS students are eligible, space permitting.",
    "course_id" : "CAMB605",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "605",
    "course_title" : "CAMB First Year Seminar",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "John Seykora",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Vaccination is perhaps the most successful medical technological intervention. The goal of this course is to expand on students' general understanding of the immune system and to focus this understanding towards the application of vaccination and immune therapies for the 21 century. Furthermore, the course will give the student a sense of how these principles are applied to vaccine and immune therapeutic development. The course covers basic science as well as the clinical, regulatory, ethical, and political issues and implications of modern vaccines and world health. Initial lectures review immune mechanisms believed to be responsible for vaccine induced protection from disease. Subsequent lectures build on this background to explore the science of vaccines for diverse pathogens, including agents of bioterrorism as well as vaccines for cancer. An appreciation for the application of laboratory science to the clinical development and studies of vaccines is provided in the next section of the course along with lectures, which focus on the regulatory, safety, and ethical implications of vaccines in different world situations. The financial implications of specific vaccines on global health is one focus of the course. The course is lecture style with many, many guest lecturers who are experts in their particular area of vaccine development. There are required readings to provide the student context and background for the diverse lectures topic. Students are graded on course participation, and a final project/exam. The project is to design in a PowerPoint report a vaccine strategy for a current disease or pathogen of importance that does not as yet have an effective vaccine or immune therapy. Strategies used should build on the material presented in the class lectures. The course is intended for graduate students or medical students in various MS, Ph.D., or MD/Ph.D. programs on the campus, as well as local scientists and professionals in the community. As a prerequisite students should have taken biology, biochemistry, or immunology courses at the advanced college level.",
    "course_id" : "CAMB609",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Not limited to CAMB students, however first options are to CAMB students",
    "course_number" : "609",
    "course_title" : "Vaccines and Immunization Therapy",
    "crosslistings" : [ {
      "course_id" : "609",
      "section_id" : "",
      "subject" : "IMUN"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "David Weiner, Ph.D., Jean Boyer, Ph.D., Paul Offit, M.D.",
    "prerequisites" : "Biology, biochemistry at the advanced college level, college level immunology is recommended",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "IND",
      "credit" : "3"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "V",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "CAMB999",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "999",
    "course_title" : "Independent Study",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Staff",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "MD",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "TiMM is planned as a once-weekly seminar course whose goal is to introduce students to the ways in which biomedical research can provide new insights into clinical medicine and, conversely, how knowledge of clinical disease impacts scientific discovery. There are two sections for the course -- 401 and 402. Section 401 is for first year MD/PhD students only and section 402 is for VMD/PhD and PhD students.",
    "course_id" : "CAMB542",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "542",
    "course_title" : "Topics in Molecular Medicine",
    "crosslistings" : [ {
      "course_id" : "542",
      "section_id" : "",
      "subject" : "PHRM"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Section 401: Stanger, Kholi Section 402: Atchison, Mason",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "An advanced seminar course emphasizing the molecular biology and molecular gene expression in eukaryotes. Based on the current literature, the presentations and discussions will familiarize the student with present day technology and developing principles.",
    "course_id" : "CAMB608",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Non-CAMB students need approval from course instructors.",
    "course_number" : "608",
    "course_title" : "Regulation of Eukaryotic Gene Transcription",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Z.  Zhou, S.  Liebhaber, D.  Epstein",
    "prerequisites" : "BIOM 555 or equivalent (exception=MD/PhD students).  Students are expected to bring their laptops to class.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This 7-week course is designed to introduce students to basic scientific writing skills and is ideal for second year graduate students preparing for qualifying examinations. Participants will review the general principles of clear, persuasive writing, and will apply these principles to writing for a scientific audience. Particular emphasis will be placed on conveying the significance of your research, outlining the aims, and discussing the results for scientific papers and grant proposals. The course will also provide an overview of the structure and style of research grant proposals and scientific manuscripts. Classes are highly interactive, and the majority of class time will be spent discussing student scientific writing. Evaluation: The goal of the course is to encourage active and open interaction among students. Ideal endpoints include improved self-editing, and development of effective strategies for offering and receiving editorial recommendations among peers. Grading will be predominantly based on class attendance, participation, and timely submission of assignments-not on the quality of the writing itself.",
    "course_id" : "CAMB695",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Preference for enrollment in CAMB 695 is given to CAMB students with highest priority given to second-year students.  Students from graduate groups other than CAMB may be enrolled if space permits.",
    "course_number" : "695",
    "course_title" : "Scientific Writing",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "J.  Katz, J.  Lok",
    "prerequisites" : "BIOM 600, BIOM 555 and CAMB 605",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course is geared towards first and second year graduate students in BGS/CAMB and SEAS/BE with an interest in the interface of extracellular matrix (ECM) cell biology and biomechanics. Students will learn about the ECM and adhesion receptors and their impact on the cytoskeleton and signaling, as well as fundamental concepts in biomechanics and engineered materials. We will discuss how these topics can inform the study of cell biology, physiology and disease. An additional objective of the course is to give students experience in leading critical discussions and writing manuscript reviews. Invited outside speakers will complement the strengths of the Penn faculty.",
    "course_id" : "CAMB703",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "703",
    "course_title" : "The ECM, adhesion receptor signaling, and translational biomechanics",
    "crosslistings" : [ {
      "course_id" : "640",
      "section_id" : "",
      "subject" : "BE"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "R.  Assoian, R.  Wells",
    "prerequisites" : "BIOM 600",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "MD",
    "terms_offered_code" : "J",
    "terms_offered_description" : "Course offered spring; even-numbered years"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This seminar course will focus on molecular and biochemical events that regulate cell cycle transitions and genome maintenance and will explore their relevance to human cancer. The course topics are chosen to familiarize the student with the key principles, the most productive experimental systems, and the seminal studies from the past twenty years of cell cycle and DNA damage/repair research. Primary literature will be used to illustrate the impact of perturbations in both cell cycle regulation and genome surveillance mechanisms on neoplastic growth. The topics unfold by focusing on major classes of cell cycle regulatory, mechanisms of their regulation, critical cell cycle transitions and their importance for normal cell proliferation. We will subsequently consider the checkpoint and DNA repair mechanisms that are activated by perturbation in genome integrity and examine how they in turn impact the cell cycle.",
    "course_id" : "CAMB530",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "530",
    "course_title" : "The Cell Cycle, Genome Integrity and Cancer",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Brown, Eric and Jordan-Sciutto, Kelly",
    "prerequisites" : "Prerequisite of CAMB 512 and/or BIOM 600 or equivalent graduate level advanced cell biology course.  Anyone without BIOM600 or equivalent must obtain instructor permission.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "An advanced seminar course emphasizing genetic research in model organisms and how it informs modern medicine. Each week a student will present background on a specific human disease. This is followed by an intense discussion by the entire class of ~2 recent papers in which model organisms have been used to address the disease mechanism and/or treatment. As a final assignment, students will have the opportunity to write, edit, and publish a \"News & Views\" style article in the journal \"Disease Models and Mechanisms\". Offered spring semester.",
    "course_id" : "CAMB534",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Priority for enrollment will be given to CAMB graduate students.  Class not open to Master or undergraduate students.",
    "course_number" : "534",
    "course_title" : "Seminar on current genetic research: Modeling Human Disease in Diverse Genetic Systems",
    "crosslistings" : [ {
      "course_id" : "534",
      "section_id" : "",
      "subject" : "NGG"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "T.  Lamitina",
    "prerequisites" : "CAMB 605 or CAMB 542 or permission of the instructor.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course, \"Cell control by signal transduction pathways\", will examine how various signal transduction mechanisms influence cell functions including replication, growth, transcription, translation and intracellular trafficking. The primary signal transduction pathways to be examined include those mediate by Notch, TGF-?, TNF-a, Ras, and Rho. We will also discuss intracellular signaling in response to DNA damage and explore in depth some of the key classes of enzymes involved in transmitting signals including kinases and phosphatases. In the first half of the course, invited faculty members will pick 2 relatively recent papers from their field that aren't necessarily definitive, but are interesting and could lead to new potential questions/areas for future investigation. Each paper will be assigned to a student, who will meet with the faculty mentor prior to the class to discuss the paper and their presentation. During the class, students will present each paper for approximately 45 minutes with time for discussion. Students will present the important background, break down the paper, look for strengths and weakness and come up with a plan of what the next set of experiments could or should be. In the second half of the course, students will independently pick a signal transduction paper for in-class presentation and will also write a short \"News and Views\" style article based on the paper they have chosen. The goal is that the course will lead students to think more about experimental design and interpretation rather than re-iteration of the biology they have learned as undergraduates.",
    "course_id" : "CAMB632",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Priority given to PhD students.  Class is limited to CAMB, PHARM, IMUN and other graduate students.  Masters will go on waiting list.",
    "course_number" : "632",
    "course_title" : "Cell Control by Signal Transduction Pathways",
    "crosslistings" : [ {
      "course_id" : "632",
      "section_id" : "",
      "subject" : "PHRM"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "X.  Hua, J.  Field, , A.  Resnick, and W.  Pear",
    "prerequisites" : "BIOM 600, Molecular and Cell Biology Courses",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course focuses on the use of genetic techniques to study the molecular and cellular bases of behavior. Particular emphasis will be given to the role of genetic approaches in understanding the biological processes underlying memory storage, circadian rhythms, and neurological and psychiatric disorders. Reverse genetic approaches utilizing gene knockout and transgenic technologies, as well as forward genetic approaches using mutagenesis and quantitative genetic techniques will be discussed.",
    "course_id" : "CAMB578",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "578",
    "course_title" : "Advanced Topics in Behavioral Genetics",
    "crosslistings" : [ {
      "course_id" : "488",
      "section_id" : "",
      "subject" : "BIOL"
    }, {
      "course_id" : "578",
      "section_id" : "",
      "subject" : "NGG"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Abel/Bucan",
    "prerequisites" : "Permission of Instructor",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "J",
    "terms_offered_description" : "Course offered spring; even-numbered years"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Building on the foundations of the Human Genome and HapMap projects, as well as parallel efforts in model organisms, research in human genetics and genomics is progressing rapidly. Our understanding of basic concepts in genetics, and Mendelian and non-Mendelian human genetic disease is proceeding at an unprecedented pace. This course will provide students with an overview approaches to understanding current problems and techniques in human genetics. The format will be an advanced seminar course, with directed reading and students presentations. Every week, students are expected to participate in a 2-hour class session, and two students will present recent publications in human genetics and disease. After each session, instructors will meet with presenting students for 30 min. to provide individual feedback. Course directors will attend each class, and guest preceptor with relevant scientific expertise may also participate. Students will be assigned readings for the first half of the course, and then select their own papers for the second half of the course. Presentations will be prepared in consultation with course directors. Students must meet with instructors at least one to two weeks prior to the presentation date. In class, the student discussion leaders will i) present background information necessary to understand the assigned paper (10-15 min.), ii) lead discussion of the paper, focusing on critical evaluation of the methods and results, and iii) talk about the future directions for this research. A short written assignment will be due by the end of the course. This written work will be in the form of a review piece or \"news and views\" format commonly seen in scientific journals. The topic of this review can be based on one of the two topics the student presents in class, or on a separate topic approved by the instructors. The review should be approximately 1,000 words or less (no more than 4 double-spaced pages). Grading: Students will be evaluated based on class participation (25%), their first presentation (25%) and their second presentation (25%), and the written assignment (25%).",
    "course_id" : "CAMB630",
    "course_level" : "4",
    "course_level_description" : "Graduate",
    "course_notes" : "",
    "course_number" : "630",
    "course_title" : "Topics in Human Genetics and Disease",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "E.  Shore, M.  Devoto, S.  Grant",
    "prerequisites" : "CAMB graduate students having taken CAMB550, or students in MD/PhD, veterinary,genetic counseling or nursing programs with equivalent courses. Must have directors permission to register.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "H",
    "terms_offered_description" : "Course offered fall; even-numbered years"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The goal of this seminar course is to foster discussion about general strategies used by cells and organisms to solve fundamental problems during development. This is not a survey course in Developmental Biology. Rather, we focus on an overarching theme for the semester (see below), enabling us to define the issues central to that theme, and explore attempts to uncover solutions using different model systems. Primary research papers are assigned for discussion, and all students are expected to contribute thoughtfully and energetically to the discussion each week. Prior years' topics have been: \"Cell migration in Development\", \"Evolutionary Development\", \"Developmental links to Disease\", \"Cell Biology in Development\", \"Stem Cells\", \"Rulers, Clocks & Oscillators in Development\", \"Cell Biological Mechanisms in Development. Offered fall semester.",
    "course_id" : "CAMB620",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "620",
    "course_title" : "Thematic Concepts in Developmental Biology",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "DiNardo, S., Speck, N.",
    "prerequisites" : "BIOM 600 (CELL 600); Gene Regulation; a developmental biology course (CAMB 511 or equivalent) is suggested not required.  CAMB students have priority",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This is a team-taught, survey course that focuses on the basic science relevant to achieving efficient and effective gene transfer in animal models and humans for the treatment of disease. The course includes a unit devoted to a variety of vectors useful for gene transfer, with the remainder of the course devoted to the study of current gene therapy approaches using specific diseases as models. Prior background in biochemistry, cell biology, and molecular biology is essential. Aspects of organ system anatomy and physiology, virology, and immunology that are relevant to the course material are included in the course. Because of rapid movement in this field, specific topics vary somewhat from year to year. Offered every fall.",
    "course_id" : "CAMB610",
    "course_level" : "4",
    "course_level_description" : "Graduate",
    "course_notes" : "",
    "course_number" : "610",
    "course_title" : "Molecular Basis of Gene Therapy",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "James Wilson, M.D, Ph.D.",
    "prerequisites" : "Background in biochemistry, cell biology and molecular biology.  Any student notenrolled in a BGS graduate program who wishes to take this course must get permission in advance from Dr.  Wilson.  Students should send their undergraduate and graduate transcripts (including spring semester) along with their request to Dr.  Wilson via email: wilsonjm@mail.med.upenn.edu and copy Robin Hartley: hartleyr@exchange.upenn.edu.This class is not accepting Non-BG S masters students.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "In this course we will discuss the identification and characterization of genetic diversity in the human genome, the genetic basis of normal variable traits, and the genetic basis of human disease. The study of the human genome increasingly impacts almost every aspect of our society, from medicine to law enforcement to how we view ourselves. The focus of this course will be to apply concepts and methods of genetics and genomics analysis (gene mapping, genome sequencing, epigenetics, gene expression) to better understand the genetic basis of both normal variable traits as well as disease for Mendelian (those traits influenced by a single gene) and complex (those traits influenced by multiple genes and environment) traits. We will discuss how to distinguish the evolutionary and demographic forces (i.e. mutation, migration, selection, population size) that influence genotypic and phenotypic variation within and among human populations. We will discuss how genomics and population genetics methodologies are being applied to study modern human origins, analysis of ancient DNA, ancestry, and population history. We will also discuss the implications of these studies for personalized medicine. An ability to understand human genetic and genomics analyses will serve you well since in your lifetime you are almost certain to be faced with a major decision involving your heredity; and society will be forced to make major reforms in medicine, business, and law because of increasing genomics data. By the end of this class you should have a better understanding of the science behind the study of the human genome.",
    "course_id" : "CAMB422",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "422",
    "course_title" : "Genomics of Human Disease and Evolution",
    "crosslistings" : [ {
      "course_id" : "422",
      "section_id" : "",
      "subject" : "BIOL"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "S.  Tishkoff",
    "prerequisites" : "BIOL 221",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "MD",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Protein misfolding and aggregation has been associated with over 40 human diseases, including Alzheimer's disease, Parkinsons disease, amytrophic lateral sclerosis, prion diseases, alpha (1)-antitrypsin deficiency, inclusion body myopathy, and systemic amyloidoses. This course will include lectures, directed readings and student presentations to cover seminal and current papers on the cell biology of conformational diseases including topics such as protein folding and misfolding, protein degradation pathways, effects of protein aggregation on cell function, model systems to study protein aggregation and novel approaches to prevent protein aggregation. Target audience is primarily 1st year CAMB, other BGS graduate students, or students interested in acquiring a cell biological perspective on the topic. MD/PhDs and Postdoc are welcome. MS and undergraduate students must obtain permission from course directors. Class size is limited to 14 students.",
    "course_id" : "CAMB615",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "615",
    "course_title" : "Protein Conformation Diseases",
    "crosslistings" : [ {
      "course_id" : "518",
      "section_id" : "",
      "subject" : "BMB"
    }, {
      "course_id" : "615",
      "section_id" : "",
      "subject" : "NGG"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Yair Argon;Harry Ischiropoulos",
    "prerequisites" : "BIOM 600 or equivalent",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "Prerequisite must be confirmed before student can register",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The course is a seminar format, specifically a journal club format, targeted to graduate students and MD/PhD students interested in ion channels. It meets for one hour, once a week for graduate students and once every other week for the entire group with formal presentation. On alternate weeks a faculty member meets with students to discuss and review the contents of each selected article for the subsequent week's presentation. This is an elective course meant to excite and intellectually enlighten students regarding the latest advances in ion channel research. It includes a wide range of ion channel topics from basic biophysics, structure, and physiology to cell biology and clinical applications. It is attended by faculty, students, and postdocs from the departments of Physiology, Pathology, Neuroscience, Pharmacology, Biochemistry & Biophysics, Psychiatry. We require a written critique of each paper presented by other participants during the semester, submitted prior to the formal presentation of the paper. This critique will be graded by a faculty member, as will the student's participation in both the preparatory sessions and formal presentation sessions. A final grade would be based on both of these components.",
    "course_id" : "CAMB518",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "518",
    "course_title" : "Current Topics in Ion Channels",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Deutsch, C.",
    "prerequisites" : "Basic knowledge of ion channels, BIOM 600 or equivalent.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Participation in the \"Dr. George W. Raiziss Biochemical Rounds\", a weekly seminar program sponsored by the Department of Biochemistry and Biophysics. Program deals with a wide range of modern biochemical and biophysical topics presented by established investigators selected from our faculty, and by leading scientists from other institutions.",
    "course_id" : "CAMB702",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "702",
    "course_title" : "Current Biochemical Topics",
    "crosslistings" : [ {
      "course_id" : "650",
      "section_id" : "",
      "subject" : "BMB"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Black, B. & Shorter, J.",
    "prerequisites" : "Course is limited to BGS graduate students and undergrads from the Vagelos Scholars Program.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "MST",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "CAMB990",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "990",
    "course_title" : "Masters Thesis",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "MD",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This seminar course covers current topics and important concepts in virology. Students will read selected papers on various topics in virology. Each subject will be illustrated by ground-breaking classic papers and innovative recent articles. Students will present a seminar under the guidance of a faculty member. Grades will be based on the guidance of a faculty member. Grades will be based on the quality of the seminar(s) and participation in discussion.",
    "course_id" : "CAMB601",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Non-CAMB students must obtain instructor approval.",
    "course_number" : "601",
    "course_title" : "Advanced Virology Seminar",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "P.  Bates and N.  Fraser",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The evolution of multicellularity required that cells be able to both send and communication between cells. Consequences of inappropriate or anomalous signaling include development abnormalities and cancer. This class will examine mechanisms of cell-to-cell signaling between plant and animal cells with an emphasis on the cell biology of development. For Spring 2015, particular attention will be given to signaling in stem cell niches.",
    "course_id" : "CAMB482",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "482",
    "course_title" : "Cell Signaling",
    "crosslistings" : [ {
      "course_id" : "482",
      "section_id" : "",
      "subject" : "BIOL"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "K.  Gallagher",
    "prerequisites" : "BIOL 202, BIOL 221 or permission of instructor.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "A",
    "school_code" : "MD",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The course aims to introduce principles of current experimental techniques used in modern biology.",
    "course_id" : "CAMB526",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "526",
    "course_title" : "Experimental Principles in Cell and Molecular Biology",
    "crosslistings" : [ {
      "course_id" : "526",
      "section_id" : "",
      "subject" : "BIOL"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "K.  Gallagher",
    "prerequisites" : "This course section is limited to BGS/PhD students only.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This is a paper-based seminar course. Each week a student is assigned a recent seminal paper related to parasitology research. The papers are chosen by guest faculty. Students are required to provide concise but comprehensive background and present the paper in a journal club style format. A principal aim of the course is to develop the ability think outside of the box and to cultivate the skills necessary for developing the ability to critically appraise one's own research and that of others. The ability to present and review work will be tested.",
    "course_id" : "CAMB696",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "696",
    "course_title" : "Contemporary Topics in Parasitology Research",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "J.  Lok, C.  Lengner, and M.  Povelones",
    "prerequisites" : "CAMB 549-001, Parasites and Parasitism",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "CAMB493",
    "course_level" : "3",
    "course_level_description" : "Advanced",
    "course_notes" : "",
    "course_number" : "493",
    "course_title" : "Epigenetics of Human Hea",
    "crosslistings" : [ {
      "course_id" : "493",
      "section_id" : "",
      "subject" : "BIOL"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "A",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The purpose of this course is to provide a thorough grounding in immunology to Cell and Molecular Biology graduate students, with an emphasis on the role of the immune system in combating infectious and neoplastic diseases, and its rolein immunopathological states such as autoimmunity and allergy. This is a required course for CAMB students in the Microbiology, Virology and Parasitology program and the Vaccine and Gene Therapy program, replacing IMMU 506 (Immune Mechanisms). It may also be used as an elective by CAMB students in other programs such as those from the Cancer Biology program and Cell Biology and Physiology program. The course is divided into two parts. The first deals with innate and adaptive immune mechanisms, the structure, function, and molecular biology of antigen receptors and major histocompatibility complex molecules, and the development, activation, and differentiation of lymphocytes and other hematopoietic cells involved in immunity. The second part will cover the immune response in infection by bacteria, viruses, and parasites, and in pathological states such as cancer, allergy, and autoimmunity. The course is comprised of two 1.5-hour lectures per week. EXAMS: There will be two exams. The first will be taken after part I, and the second after part II of the course. Both will be open book, in-class exams. The exam will consist of essay or brief answer questions based on experimental design and/or data. Each exam is weighed equally in determining the final letter grades of students. The grades are based solely on the exams.",
    "course_id" : "CAMB510",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Priority given to students in the MVP & GTV programs of CAMB.  Second priority to CAMB students in other programs.  If slots remain, then Ph.D. students from other graduate groups by permit only.  Ph.D. students only.",
    "course_number" : "510",
    "course_title" : "Immunology",
    "crosslistings" : [ {
      "course_id" : "510",
      "section_id" : "",
      "subject" : "IMUN"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "A.  Wells",
    "prerequisites" : "BIOM 600 or instructor permit",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "A physician from just 25 years ago would not recognize two of today's most pressing public health problems, AIDS and Hepatitis C, nor be familiar with many other infectious diseases or agents including Ebola virus, Hantaanvirus, HTLV-1, HHV-8 and Borrelia burgdorferi. Such a physician might also be dismayed to learn that old enemies such as tuberculosis, malaria, diphtheria, West Nile virus, meningococcal meningitis, Yellow fever, and Dengue have become more (or rather less) prevalent due to antibiotic resistance and other factors. In addition, bioterrorism, long a theoretical possibility, is now part of today's reality and could result in the deliberate introduction of anthrax or other biological agents into the civilian population or the food supply. Thus, with the beginning of the new millennium, the medical profession, the veterinary profession, and the biomedical research establishment are faced with the triple-threat of emerging infectious diseases, reemerging infectious diseases, and bioterrorism. These topics are covered in this course, with an emphasis on student's participation in the discussion. Emerging Infectious Diseases will cover emerging viral, bacterial and parasitic organisms, with lectures being given by faculty from the Schools of Medicine, Veterinary Medicine, Dental Medicine, and Arts and Sciences, and outside lecturers. Epidemiology, immune responses to infection, vaccine and an timicrobial agents, and pathogenesis all will be discussed. The course format will include short lectures by various faculty members to provide background information on each topic, followed by extensive discussion by students as well as separate review and discussion sessions. Classes will run from 10am to 11:30AM on Mondays and Wednesdays in Johnson 209. Evaluation will be based on a writing assignment (TBD) and participation in discussion sessions.",
    "course_id" : "CAMB617",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Course open to graduate students only, while senior undergraduate students may take it with permission by course directors.",
    "course_number" : "617",
    "course_title" : "Emerging Infectious Diseases",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "H.  Shen.  S.  Hensley, P.  Bates",
    "prerequisites" : "BIOM 600 (CELL 600) is required.  First year MVP courses or permission by course directors.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "MD",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will be a focused study of genomes, genomic techniques, and how these approaches are and will be used in diagnosing and treating human disease. Topics will include genome sequencing, analysis of sequences and microarrays, and new techniques including high-throughput sequencing and reverse genetic analysis with a focus on genome-wide mutant collections.",
    "course_id" : "CAMB431",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Graduate students do not need permits or prerequisites as those will have been taken in undergraduate studies",
    "course_number" : "431",
    "course_title" : "Genome Sciences and Genomic Medicine",
    "crosslistings" : [ {
      "course_id" : "431",
      "section_id" : "",
      "subject" : "BIOL"
    } ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "B.  Gregory",
    "prerequisites" : "BIOL 221; BIOL 421 strongly recommended",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "MD",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Parasites infect over one quarter of the world's population and parasitic diseases are a leading cause of death globally. \"Parasites and Parasitism\" is to be offered to first and second year MVP students over a seven-week block in the fall semester. The course will begin with an introduction to the major protozoan and helminth pathogens of humans, their geographic distribution and the diseases they cause. Subsequent lectures will emphasize a variety of topics from the current research literature using specific parasitic pathogens as examples. These will include how various protozoans enter cells and adapt to different intracellular habitats or how helminths utilize different strategies to survive within the GI tract. Malaria and schistosomiasis will serve as examples for how parasites cause disease while trypanosomes and leishmaniasis will be discussed as models for how parasites survive or evade immune elimination. Finally, several helminth and protozoan systems will be used to demonstrate the intimate association between parasite and vector that leads to efficient transmission. In addition to lectures, weekly discussion sessions will provide an opportunity for students to review papers or research specific topics and present their findings to their colleagues.",
    "course_id" : "CAMB549",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Permission needed from course director for non-CAMB students",
    "course_number" : "549",
    "course_title" : "Parasites and Parasitism",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Hunter, C. & Lok, J.",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "IND",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "V",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "CAMB799",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "799",
    "course_title" : "Thesis Research",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "MD",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This year's Advanced Seminar in Gene Therapy will cover controversial topics in the field. It will meet on Wednesdays from 4:30 - 6:30pm. The goal of this seminar is to provide graduate students with an understanding of the challenges, both experimentally and practical, that face the gene delivery field. At least two sessions will deal with ethical issues. With the exception of the first class meeting, each of the weekly, two-hour sessions will be devoted to a discussion of two recent papers. All students are to have read the papers. Evaluation will be based on attendance (required), active participation, and preparation of reviews of papers. Students will be introduced to the process of manuscript review and will be asked to provide critical reviews for two manuscripts. Students who are not in CAMB need to request permission from the course director, Dr. James Wilson, via email: wilsonjm@mail.med.upenn.edu.",
    "course_id" : "CAMB633",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "633",
    "course_title" : "Advanced Seminar in Gene Therapy",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Dr.  James M.  Wilson.",
    "prerequisites" : "Background in biochemistry, cell biology, molecular biology, and immunology.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "MD",
    "terms_offered_code" : "K",
    "terms_offered_description" : "Course offered spring; odd-numbered years"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This is a seminar course in the molecular mechanisms underlying the organization, dynamics and signaling through cell adhesion and the cytoskeleton. The course will cover the basic principles and biology of the molecules involved in cell-cell and cell-matrix adhesion and their interface with the cytoskeleton. This is an advanced seminar course. Students will present papers that will be selected to highlight classical and emerging methods including genetic screens, pharmacological studies, physical approaches, and genomic approaches. The issues addressed include regulation of cell adhesion, control of cell motility, and roles of adhesion and adhesion signaling in cancer and cardiovascular disease. Students will also present one paper of their own choosing. All presentations will be prepared in consultation with a faculty member with expertise in the specific area. The course requires a minimum of seven registered students to be offered.",
    "course_id" : "CAMB631",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Limited to BGS, SAS, and Engineering graduate group students.  Others by permit only.",
    "course_number" : "631",
    "course_title" : "Cell Adhesion and the Cytoskeleton",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Dave Boettiger, Jeff Field",
    "prerequisites" : "BIOM600 or similar course in molecular cell biology.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course is designed for second year students in the MVP program, and focuses on pathogen-host interactions. Students make a presentation designed for 30 minutes on a topic of their choice. The topic can be something that they are working on, or simply something that they are interested in. They are requested to provide sufficient background, discuss what is known and what is not known about the topic, and then frame two to three Specific Aims. The success of the course rests entirely upon the quality of the faculty and students involved. In past years, the class have been very interactive, with each of the 11 classes lasting about 1.5 hours. The discussions are deliberately wide-ranging, and review recent literature, techniques, and how to construct a grant. Generally, two faculty will be in attendance.",
    "course_id" : "CAMB700",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "700",
    "course_title" : "Topics in Microbiology",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "S.  Cherry",
    "prerequisites" : "Permission from instructor required.  Student must have taken Immunology and 2 MVP pathogen classes.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "MD",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The course provides an introduction to virology aimed at graduate students in the biomedical sciences.",
    "course_id" : "CAMB547",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "547",
    "course_title" : "Fundamental Virology",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Nigel Fraser and Matthew Weitzman",
    "prerequisites" : "Prior coursework in molecular or cellular biology.  First Priority to MVP students, then CAMB students, then GCB students.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The format of this course will be two lectures and one student presentation/paper discussion per section. The course will begin by introducing molecular mechanisms in bacterial replication, then cover detailed studies of host-bacterial interactions. The course will cover the general concepts and recent advance of how bacterial pathogens prepare to infect the host, the successful strategies bacteria used to infect the host, and how they survive after the infection.",
    "course_id" : "CAMB548",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Priority given to MVP graduate students",
    "course_number" : "548",
    "course_title" : "Bacteriology",
    "crosslistings" : [ ],
    "department" : "CAMB",
    "department_of_record" : "CAMB",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Zhu, J; Bushman, R.",
    "prerequisites" : "none",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "MD",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  } ],
  "service_meta" : {
    "current_page_number" : 1,
    "error_text" : "",
    "next_page_number" : 1,
    "number_of_pages" : 1,
    "previous_page_number" : 1,
    "results_per_page" : 999
  }
}
