HTTP/1.1 200 OK
http.status: 200
Date: Thu, 04 Dec 2014 03:48:29 +0000
Content-Length: 73725
Content-Type: application/json
Server: Jetty(8.1.13.v20130916)
Set-Cookie: BIGipServermule_pool_8091=3525579948.39711.0000; expires=Thu, 04-Dec-2014 09:48:29 GMT; path=/

{
  "result_data" : [ {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will familiarize students with methods used to assess the quality of hospital or provider health care using outcomes data, and to understand and evaluate studies involving health care outcomes. Students are exposed to the mechanics of hospital quality evaluation and challenged to evaluate the medical and health services research literature on health care evaluation, as well as to make inferences regarding hospital quality and the comparison or rankings of hospitals or providers. Topics will include the history of health care outcomes analysis; the conceptual framework for outcome studies; consumer demand for information; an overview of medical data and data collection systems; a description of outcome statistics and severity adjstments currently in use; the study of excess variation in outcomes; and the use of guidelines to assess outcomes. By the end of the course, students will have developed a thorough appreciation of the current methods used by policy makers, researchers, and health care providers to evaluate medical outcomes, as well as those used by consumers to choose hospitals and providers.",
    "course_id" : "HCMG212",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "212",
    "course_title" : "Health Care Quality and Outcomes: Measurement and Management",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Silber",
    "prerequisites" : "Introductory Statistics or permission of instructor",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "A",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course provides an overview of the evolution, structure and current issues in the health care system. It examines the unique features of health care as a product, and the changing relationships between patients, physicians, hospitals, insurers, employers, communities, and government. The course examines three broad segments of the health care industry: payors, providers and suppliers. Within the payor segment, the course examines the sources and destinations of spending, managed care (HMOs, PPOs),employer based health insurance, technology assessment, payor strategy, and efforts to pay for the elderly, the poor & the medically indigent. Within the provider segment, the course examines the impact of cost containment and competition on hospitals and integrated delivery systems, long term care and disease management, and the important role of epedemiology in assessing population health needs and risks. Within the supplier segment, the course will examine developments in the biotechnology, pharmaceutical, medical devices, genomics and IT industries. NOTE: This is a required course for Wharton Graduate Health Care Management majors; it counts as an elective course for all other Wharton Graduate students. It is also open to Law School and Nursing School students with a joint Wharton Program. Please note that during the Wharton Pre-term program, there are three additional sessions that serve as important background material for this course. The instructor presumes you know this material when the regular course begins.",
    "course_id" : "HCMG841",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Lectures and cases.  Weekly reading assignments.",
    "course_number" : "841",
    "course_title" : "Health Services System",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Burns",
    "prerequisites" : "HCMG 603, offered during the Wharton Pre-Term program, serves as important background material for this course.  The instructor presumes you know this materialwhen the regular course begins.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course is aimed at students interested in better understanding an increasingly complex market environmnent for Healthcare product development and commercialization. Across the entirety of the class we will explore the facts and clarify the implications of five ongoing thematic changes - the 5 D's - that are fundamentally transforming commercial decision making in health care markets from insurance and care delivery to pharmaceuticals, biotechnology, and devices: (1) Dispersion (of choice): Healthcare product/service choice has dispersed from a physician-centric world to include patients, payors, governments, advocacy groups, purchasing organizations, pharmacies, and hospitals. (2) Data (explosion of): How organizations understand and leverage the immense availability of data and shepherd its conversion into insights will be key driver of future competitive differentiation. (3) Disruption (technological avalanche): The multiplicity of channels within which is gathered, shared andexploited has caused much confusion in an industry that often feels hampered by regulatory oversight. How can a commercialization/marketing executive maintain control over information and brand identity in such an age? (4) Division (of responsibilities): Companies are most often organized in multiple customer-facing and/or functional silos (e.g., Customer Marketing, ProfessionalPromotion, Managed Markets, Early Development, Data Managements).In a world where these organizational functions have converged how is commercialization and marketing best managed? (5) Dollars (economic implications): Each stakeholder within this newly dispersed set has different concerns and interacts in different ways, at different points of the value chain, with different incentives! Understanding the collective impact of the interplays across these differences is a competence that any Healthcare marketer needs to develop in order to craft and deliver market-perceived value.",
    "course_id" : "HCMG858",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "This course explores these challenges in detail, always concentrating on what is different - and what is not- about marketing in health care relative to other industries.  This broad coverage lays the foundation for the course project-where students develop a plan and forecast for marketing a new health care product.  Lectures and case discussions will provide a mix of strategic and toolkit content, and guest lectures from a variety of industry executives will provide additional real-life, real-time perspectives.",
    "course_number" : "858",
    "course_title" : "Health Care Marketing",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Mahadevan/Grennan",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This advanced PhD seminar will explore topics in the industrial organization of health care and structural econometric approaches in health economics. The focus in this course is the development of advanced econometric tools. The topics covered include health insurance and hospital demand estimation, the analysis of hospital competition, insurer competition, quality competition, technology adoption, models of entry and exit and dynamic models. The readings will focus on recent advances in economics. Students are required to present recent research from the field and write an empirical research paper that broadly based on the topics covered in the course. With the permission of the instructor, the seminar is open to doctoral students from departments other than Health Care Systems.",
    "course_id" : "HCMG902",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "902",
    "course_title" : "Special Topics in Health Services Research: Industrial Organization of Health Care",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Town",
    "prerequisites" : "",
    "register_subgroup_one" : "01",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course examines the structure of health care systems in different countries, focusing on financing, reimbursement, delivery systems and adoption of new technologies. We study the relative roles of private sector and public sector insurance and providers, and the effect of system design on cost, quality, efficiency and equity of medical services. Some issues we address are normative: Which systems and which public/private sector mixes are better at achieving efficiency and equity? Other issues are positive: How do these different systems deal with tough choices, such as decisions about new technologies? Our main focus is on the systems in four large, prototypical OECD countries--Germany, Canada, Japan, and the United Kingdom--and then look at other countries with interesting systems- including Italy, Chile, Singapore, Brazil, China and India. We draw lessons for the U.S. from foreign experience and vice versa.",
    "course_id" : "HCMG204",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "204",
    "course_title" : "Comparative Health Care Systems",
    "crosslistings" : [ {
      "course_id" : "859",
      "section_id" : "",
      "subject" : "HCMG"
    } ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Danzon",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "IND",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "V",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "HCMG099",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "099",
    "course_title" : "Independent Study",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The course focuses on the creation, funding, and management of biotechnology and health services enterprises. The course is designed to supplement other offerings in the Health Care Systems and Management Departments for those students with entrepreneurial interest in such ventures, and will focus on special issues surrounding the conceptualization, planning, diligence and capitalization, launch, compensation and management of these ventures. In addition, course offers methods for self-assessment & development of business models and plans, techniques for technology assessment and strategy, develops foundation for capitalization and partnering strategies, and creates a basis for best practices in company launch and plan execution. Students must apply to take this course. Please see the Health Care Management Department for the application.",
    "course_id" : "HCMG867",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "867",
    "course_title" : "Health Care Entrepreneurship",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Kurtzman & Libson",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "IND",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "V",
    "course_credit_type" : "CU",
    "course_description" : "Arranged with members of the Faculty of the Health Care Systems Department. For further information contact the Department office, Room 204, Colonial Penn Center, 3641 Locust Walk, 898-6861.",
    "course_id" : "HCMG899",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "899",
    "course_title" : "INDEPENDENT STUDY",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course focuses on health care organizations' financial decisions in the changing health care landscape. Upon completion of the course, students will be able to utilize a range of financial tools and techniques for making value-added financial decisions in a variety of important contexts in the health care sector. The course involves case analyses and lectures, including presentations by practitioners with extensive real world experience. The course is organized around cases dealing with publicly-traded health care company valuation, valuation and return on investment of biopharmaceutical and medical technology development projects, valuation and deal structure for startup and early stage health care organizations, health plan pricing and finance, and health care provider risk-sharing arrangements. Each case is accompanied by background on tools, methods, institutions, and markets. Students seeking careers in health care finance and financial decision making. Students with more background will extend and enhance their analytical skills in a variety of important areas.",
    "course_id" : "HCMG849",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Lecture and cases.  Students work in teams to complete 4-5 case write-ups and an oral case presentation.  There is also a written exam.",
    "course_number" : "849",
    "course_title" : "Financial Management of Health Institutions",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Harrington",
    "prerequisites" : "Finance 611 or equivalent coursework or experience",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course, co-taught with Brad Fluegel (former Executive VP of Wellpoint, Inc and current Chief Strategy Officer at Walgreens) will focus on two interrelated topics: managed care and market structure. The section on managed care will cover strategic planning and marketing of managed care services, operational issues in developing a managed care network, actuarial issues, and the management of physician behavior. The section on health care market structure will analyze strategies of vertical integration and horizontal integration (M+As), and their attempt to alter the balance of power in local healthcare markets. The section will also analyze the operational issues in managing cost and quality in an integrated system, integration along the supply chain, and the performance of these systems, and the bargaining and negotiation between hospitals, physicians, and health plans.",
    "course_id" : "HCMG845",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Lectures, cases, exam, and orally presented term project.",
    "course_number" : "845",
    "course_title" : "Managed Care and the Industrial Organization of Health Care",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Starc/Fluegel",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "HCMG297",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "297",
    "course_title" : "Study Abroad",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "WH",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The purpose of this course is to apply economics to an analysis of the health care industry, with special emphasis on the unique characteristics of the US healthcare markets, from pre-hospital to post-acute care. This course focuses on salient economic features of health care delivery, including: the role of nonprofit providers, the effects of regulation and antitrust activity on hospitals, the degree of input substitutability within hospitals, the nature of competition in home health care, public versus private provision of emergency medical services, the effect of specialty hospitals and ambulatory surgery centers, defining and improving medical performance in hospitals, specialization and investment in physical and human capital, shifting of services between inpatient and outpatient settings and its effect on health care costs and quality, and innovation in primary care from retail clinics to patient-centered medical homes and retainer-based medicine. .",
    "course_id" : "HCMG852",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Written exam and student presentation.",
    "course_number" : "852",
    "course_title" : "Health Services Delivery: A Managerial Economic Approach",
    "crosslistings" : [ {
      "course_id" : "352",
      "section_id" : "",
      "subject" : "HCMG"
    } ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "David",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Delivering basic health care advances worldwide and continuing to increase lifespan and quality (in an affordable manner) represent some of the major societal challenges of our time. Addressing these challenges will require innovation in both medical technology and the ways in which health services are delivered. Through readings, cases, guest lectures, and your own entrepreneurial work outside of class, we will examine the environment facing prospective health care entrepreneurs: (1) sources of health care innovation; (2) the many \"customers\" in health care: patients, doctors, hospitals, insurers, and regulators; (3) the powerful established firms with developed clinical and sales expertise; (4) the investing community. Along the way we will develop a framework for thinking about what is different (and what is not) about the challenges of health care entrepreneurship.",
    "course_id" : "HCMG391",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "391",
    "course_title" : "Health Care Entrepreneurship",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "HCMG392",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "392",
    "course_title" : "Asp:Mgmt of Discovery",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "WH",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "0"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "HCMG603",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "603",
    "course_title" : "Health Care Management",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will introduce students to the main components of Health Information Technology (HIT) and how HIT currently effects, and in the future, may change health care operating models. Although it will not prepare students for primary technology management positions, it will help them understand the role of information technology in the success of the delivery system and other important healthcare processes. It will provide a foundation that will prepare them as managers, investors and consultants to rely upon or manage information technology to accomplish delivery system objectives. The course will give special attention to key health care processes, and topics such as the drive for provider quality and cost improvements, the potential ability to leverage clinical data for care improvement and product development, the growth of new information technologies for consumer directed healthcare and telemedicine, the strategies and economics of individual HIT companies and the role of government. The course relies heavily on industry leaders to share their ideas and experiences with students.",
    "course_id" : "HCMG866",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "866",
    "course_title" : "E-Health: Business Models and Impact",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Glaser/Kolstad",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will explore the effects of the changing health care environment on the physician, patient and health care manager. It is intended for any undergraduate with an interest in how 1/6th of the American economy is organized as well as those planning careers as health care providers and managers. The course complements other health care courses (that take a societal perspective) by focusing on the individuals who participate in the health care enterprise. There are no prerequisites, as the course will stand on its own content. The course will be divided into modules that focus on the participants of the health care process and the process itself. We will analyze the patient, the doctor, and manager in light of the patient-doctor interaction, the turbulent health care marketplace, expensive new technologies,resource allocation, and ethics.",
    "course_id" : "HCMG203",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "203",
    "course_title" : "Clinical Issues in Health Care Management: Doctors, Patients and Managers in Modern Society",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Asch",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "A",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The purpose of this doctoral level course is to investigate the theory and practice of cost-benefit and cost-effectiveness analysis as applied to health care. The three techniques to be examined are cost-effectiveness analysis with single dimensional outcomes, cost effectiveness analysis with multiple attributes (especially in the form of Quality Adjusted Life Years), and economic cost-benefit analysis. Valuation of mortality and morbidity relative to other goods will be emphasized. Students will be expected to develop written critiques of articles in the literature, and to design a new application of one of the techniques as a term project.",
    "course_id" : "HCMG901",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "901",
    "course_title" : "Seminar in Health Care Cost Benefit and Cost Effectiveness Analysis",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Pauly",
    "prerequisites" : "",
    "register_subgroup_one" : "01",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course provides an overview of the management, economic and policy issues facing the pharmaceutical, biotechnology and medical device industries. The course perspective is global, but with emphasis on the U.S. as the largest and most profitable market. Critical issues we will examine include: R&D intensive cost structure with regulation and rapid technological change; strategic challenges of biotechnology startups; a complex global marketplace in which prices are regulated in most countries and customers include governments and insurers, as well as physicians, and consumers; intense and evolving M&A, joint ventures, and complex alliances; thriving generics industry in the US and globally. We use Wharton and industry experts from various disciplines to address these issues.",
    "course_id" : "HCMG863",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "863",
    "course_title" : "Management and Economics of Pharmaceutical, Biotech and Medical Device Industries",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Danzon",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course examines the structure of health care systems in different countries, focusing on financing, reimbursement, delivery systems and adoption of new technologies. We study the relative roles of private sector and public sector insurance and providers, and the effect of system design on cost, quality, efficiency and equity of medical services. Some issues we address are normative: Which systems and which public/private sector mixes are better at achieving efficiency and equity? Other issues are positive: How do these different systems deal with the tough choices, such as decisions about new technologies? Our focus first on the systems in four large, prototypical OECD countries- Germany, Canada, Japan, and the United Kingdom -and then look at other developed and emerging countries with interesting systems - including Italy, Chile, Singapore, Brazil, China and India. We will draw lessons for the U.S. from foreign experience and vice versa.",
    "course_id" : "HCMG859",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "859",
    "course_title" : "Comparative Health Care Systems",
    "crosslistings" : [ {
      "course_id" : "204",
      "section_id" : "",
      "subject" : "HCMG"
    } ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Danzon",
    "prerequisites" : "Format: HCMG or ECON course",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "IND",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "V",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "HCMG999",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "999",
    "course_title" : "Independent Study",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "MST",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "HCMG990",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "990",
    "course_title" : "Masters Registration",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "WH",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course focuses on leadership and management issues in health care organizations while providing students with a practice setting to examine and develop their own management skills. Each team acts as a consultant to a local healthcare organization which has submitted a project proposal to the course. The teams define the issue and negotiate a contract with the client organization. By the end of the semester, teams present assessments and recommendations for action to their clients and share their experience with the class in a series of workshops and cross-team consultations.",
    "course_id" : "HCMG653",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Seminar and workshop, a written and oral presentation of the team management study and an individual paper.",
    "course_number" : "653",
    "course_title" : "Health Care Field Application Project",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "HCMG 841.  Health Care Management MBA students only.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "DIS",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "HCMG995",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "995",
    "course_title" : "Dissertation",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This introductory course takes a policy and politics angle to health care's three persistent issues - access, cost and quality. The roles of patients, physicians, hospitals, insurers, and pharmaceutical companies will be established. The interaction between the government and these different groups will also be covered. Current national health care policy initiatives and the interests of class members will steer the specific topics covered in the course. The course aims to provide skills for critical and analytical thought about the U.S. health care system and the people in it.",
    "course_id" : "HCMG101",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "101",
    "course_title" : "Health Care Systems",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Harrington/Polsky",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "A",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course presents an overview of the business of health and how a variety of health care organizations have gained, sustained, and lost competitive advantage amidst intense competition, widespread regulation, high interdependence, and massive technological, economic, social and political changes. Specifically, we evaluate the challenges facing health care organizations using competitive analysis, identify their past responses, and explore the current strategies they are using to manage these challenges (and emerging ones) more effectively. Students will develop generalized skills in competitive analysis and the ability to apply those skills in the specialized analysis of opportunities in producer (e.g. biopharmaceutical, medical product, information technology), purchaser (e.g. insurance), and provider (e.g. hospitals, nursing homes, physician) organizations and industry sectors. The course is organized around a number of readings, cases, presentations, and a required project.",
    "course_id" : "HCMG213",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "213",
    "course_title" : "Health Care Strategy and Management: the Business of Health Care",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Kimberly",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "A",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course applies basic economic concepts to analyze the health care market and evaluate health policies. The course begins with an analysis of the demand for health, the derived demand for medical care and the demand for health insurance. The second part of the course examines the supply of medical care by physicians and hospitals, medical technology, and the role of managed care organizations. The implication of adverse selection, moral hazard, externalities, and asymmetric information will be explored. The third part of the course examines the rationale for government intervention in medical markets as well as the effectiveness and efficiency of various health policies, including: Medicare, Medicaid, price regulation of hospitals, physician payment reform, medical malpractice, uncompensated care, and physician manpower planning.",
    "course_id" : "HCMG903",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "903",
    "course_title" : "Economics of Health Care and Policy",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Town",
    "prerequisites" : "",
    "register_subgroup_one" : "01",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Issues surrounding global health have captivated the attention of the public sector and foundations for many decades. Many of their initiatives are realizing progress on the health-related Millennium Development Goals. The private sector has been less engaged in global health, but has a significant role to play in providing resources and in building infrastructure, human resource capacity and sustainability. This course explores entrepreneurial and other private sector solutions for health services and access to medicines and technologies in the developing world and other underserved areas. The course also encompasses study of creative programs to engage the private sector in development of vaccines and medicines for tropical and neglected diseases. Furthermore, the course addresses novel care systems and therapeutic strategies for the rapidly growing burden of chronic, non-communicable diseases in the developing world. In short, the course builds on the content of conventional global health courses from a managerial and entrepreneurial perspective. Learning is driven through readings, class discussion and a series of guest speakers representing a wide range of global health issues. Evaluation is largely based on a student group project.",
    "course_id" : "HCMG868",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "868",
    "course_title" : "Private Sector Role in Global Health",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Sammut",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will provide students a broad overview of the current U.S. healthcare system. The course will focus on the challenges facing the health care system, an in-depth understanding of the Affordable Care Act (ACA) and of its potential impact upon health care access, delivery, cost, and quality as well as its effect on firms within the health care sector. The course will examine potential reforms, including those offered by liberals and conservatives and information that can be extracted from health care systems in other developed countries. The course will also explore key facets of the ACA, including improving access to care and health insurance exchanges, improving quality and constraining costs through health care delivery system reforms, realigning capacity through changes in the health care workforce and in medical education, the potential impact on biomedical and other innovations, and the impact on economic outcomes such as employment, wage growth, and federal budget deficits. The course will also examine the political context and process of passing major legislation in general and health care legislation in particular, including constitutional arguments surrounding the Affordable Care Act. Throughout the course, the key lessons will integrate the disciplines of health economics, health and social policy, law and political science to elucidate key principles.",
    "course_id" : "HCMG850",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "850",
    "course_title" : "Health Policy: Health Care Reform and the Future of the American Health System",
    "crosslistings" : [ {
      "course_id" : "575",
      "section_id" : "",
      "subject" : "BIOE"
    }, {
      "course_id" : "250",
      "section_id" : "",
      "subject" : "HCMG"
    } ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Emanuel",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "V",
    "course_credit_type" : "CU",
    "course_description" : "This mini course is designed to provide students with an appreciation of the good, the bad and the ugly of how our current health care system cares for one of our nation's most precious resources - our seniors! This course will review care provided to seniors within a variety of institutional settings (hospitals, nursing facilities, various senior housing levels) as well as outpatient and home care services. Special attention will be paid to nursing homes and senior housing options and their past, present and future role within the overall health care system in the United States. The course will start with an overview of the senior population with special attention to theirhealth and social needs. Several classes will be held off campus at selected nursing facilities and senior housing complexes. In addition, a broad range of special programs and services will be reviewed such as sub-acute care, long term care insurance, Medicare Risk Programs, elderly housing, adult day care, managed care, Medicare Part D, case management, hospice and other recent developments. Throughout the course, emphasis will be placed on entrepreneurial opportunities to serve the senior market at all levels. Students are required to produce a paper for this course that focuses on a specific area impacting the senior market. This is a wonderful opportunity for students to select an area of personal interest and conduct an in depth review of that area including making direct contact with national experts within the topic selected. All student topics must be approved during the first two weeks of class and the depth of research required agreed upon by the by the student and the instructor.Interested students not in the HCMG major are urged to speak to the instructor before enrolling in the course.",
    "course_id" : "HCMG855",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "855",
    "course_title" : "Management of Health Care for the Elderly",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Whitman",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The course provides an application of economic models to demand, supply, and their interaction in the medical economy. Influences on demand, especially health status, insurance coverage, and income will be analyzed. Physician decisions on the pricing and form of their own services, and on the advice they offer about other services, will be considered. Competition in medical care markets, especially for hospital services, will be studied. Special emphasis will be placed on government as demander of medical care services. Changes in Medicare and regulation of managed care are among the public policy issues to be addressed.",
    "course_id" : "HCMG202",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "202",
    "course_title" : "The Economics and Financing of Health Care Delivery",
    "crosslistings" : [ {
      "course_id" : "039",
      "section_id" : "",
      "subject" : "ECON"
    } ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Kolstad/Starc",
    "prerequisites" : "Economics 1 or consent of instructor.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "A",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The purpose of this course is to apply economics to an analysis of the health care industry, with special emphasis on the unique characteristics of the US healthcare markets, from pre-hospital to post-acute care. This course focuses on salient economic features of health care delivery, including: the role of nonprofit providers, the effects of regulation and antitrust activity on hospitals, the degree of input substitutability within hospitals, the nature of competition in home health care, public versus private provision of emergency medical services, the effect of specialty hospitals and ambulatory surgery centers, the economics of direct-to-consumer advertising and its effect on drug safety, defining and improving medical performance in hospitals, specialization and investment in physical and human capital, and shifting of services between inpatient and outpatient settings and its effect on health care costs and quality. Students who take HCMG 352 may not also take HCMG 302 (ECON 236) for credit.",
    "course_id" : "HCMG352",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "352",
    "course_title" : "HEALTH SERVICES DELIVERY: A MANAGERIAL ECONOMIC APPROACH",
    "crosslistings" : [ {
      "course_id" : "852",
      "section_id" : "",
      "subject" : "HCMG"
    } ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "DAVID",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "There are three ASP Seminars: HCMG 890-001 Management of Health Care Service Businesses; HCMG 890-002 Medical Devices; HCMG 890-003 Health Business and Policy HCMG 890-001: This course examines issues related to managing or investing in Health Care Services Businesses. Defined as companies that manage, distribute or provide health care services, the Health Care Services sector touches almost every other portion of the health care system. We will study the key managementissues related to a number of different health care services businesses with a focus on common challenges related to reimbursement, regulatory, margin, growth, and competitive issues. We will make extensive use of outside speakers who will be current industry leaders within different sectors of the health care services industry and will address the current management issues they face in running their businesses. We will also hear from Private Equity professionals and people involved legislatively in Washington with health care services. Students will then be asked to develop a plan to both buyout and subsequently manage a specific health services businesses. Students will present their plans to a panel of leading Health Care Private Equity investors. The prerequisite for this course is HCMG 841. HCMG 890-002: Successful medical devices are an amalgamation of creative and innovative thinking, clinical expertise, and engineering know-how that endures intense regulatory and reimbursement scrutiny. This course will provide a foundation for understanding the nuances of the medical device industry. It will cover topics ranging from device design and discovery, regulatory issues, marketing, reimbursement, management, and strategy. Classroom activities will be supplemented with optional tours of hospitals, research and manufacturing facilities, and hands-on demonstrations of devices. Though the course is intended primarily for MBA students, it will be open to medical and engineering students as well as to hospital house staff. HCMG 890-003: This course will discuss how healthcare businesses(life sciences, health plans, and providers) and businesses providing health benefits are affected by government policies. Such actions include changes in the government's role as a payer, rules about insurance coverage for workers and dependents, and regulations dealing with workplace health and product safety. They also include regulations, subsidies, taxes, and public payments for health care goods and services supplied by organizations including for profit corporations, professional firms, and nonprofit entities. Finally they include organizations created by businesses and others to affect (lobby) government actions concerning health, health care, or health spending. Rather than ask the usual policy question about what business behaviors and reactions mean to the government's health policy, the course will ask what government health policy means to business. Methods of health policy analysis (which explores the equity and efficiency consequences of alternative policies) will be used, along with positive (descriptive) models of political economy (median voter, interest groups) and the public budget. Evaluation will involve written policy analyses, mock testimony, and policy critiques.",
    "course_id" : "HCMG890",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "890",
    "course_title" : "Advanced Study Project Seminar",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "HCMG 890-001 Present, HCMG 890-002 Town/Solomon, HCMG 890-003 Pauly/Mendelson",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "DAB",
      "credit" : "3"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "HCMG996",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "996",
    "course_title" : "Dissertation Abroad.",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "WH",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course offers a current and historical overview of the regulation of health care delivery and financing in the US. It examines principles and practical applications of the laws that affect the operational decisions of health care providers, payors, and managers and that impact development of markets for health care products and services. Also considered are the social and ethical issues encountered in trying to balance the interests, needs and rights of individual citizens against those of society. For part of the term, the class will divide into two groups so that students can focus on their choice of (1) health care management (antitrust law, and regulation of the drug and medical device industry) or (2) selected issues of patients' rights (e.g. abortion, treatment of terminal patients, etc.)",
    "course_id" : "HCMG211",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "211",
    "course_title" : "Legal Aspects of Health Care",
    "crosslistings" : [ {
      "course_id" : "854",
      "section_id" : "",
      "subject" : "HCMG"
    }, {
      "course_id" : "211",
      "section_id" : "",
      "subject" : "LGST"
    }, {
      "course_id" : "811",
      "section_id" : "",
      "subject" : "LGST"
    } ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Rosoff/Field",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course offers a current and historical overview of the legal oversight and regulation of health care delivery in the U.S. It examines principles and practicalapplications of the laws that affect the operational decisions of health care providers, payors, and managers and that impact development of markets for health care products and services. Also considered are the social , moral, and ethical issues encountered in trying to balance the interests, needs and rights of individuals against those of the larger society. For part of the term, the class will divide into two groups so that students can focus on their choice of (a) health care management or (b) selected issues of patients' rights. Cross-listed with LGST 811.",
    "course_id" : "HCMG854",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Lecture and group discussion.  The setting is informal and members of the class are expected to participate actively; participation counts 10% of the grade.  The course includes periodic quizzes (20%), the student's choice of a midterm exam or legal research paper (either counting 30%), and a final exam (40%).  The course serves a mix of graduate and undergraduate students, including: Healthcare Management majors (MBA & UG), pre-med undergrads, Health & Society majors, pre-med students, nursing and social work students, and bioethics and law students.  Background knowledge of health care systems is helpful for full appreciation of the issues covered but is not required.  No prior study or background in law is required.  Grading is carefully handled to assure that no category of students is at a relative disadvantage.",
    "course_number" : "854",
    "course_title" : "Legal Aspects of Health Care",
    "crosslistings" : [ {
      "course_id" : "211",
      "section_id" : "",
      "subject" : "HCMG"
    }, {
      "course_id" : "211",
      "section_id" : "",
      "subject" : "LGST"
    }, {
      "course_id" : "811",
      "section_id" : "",
      "subject" : "LGST"
    } ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Rosoff/Field",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will provide students a broad overview of the current U.S. healthcare system. The course will focus on the challenges facing the health care system, an in-depth understanding of the Affordable Care Act (ACA) and of its potential impact upon health care access, delivery, cost, and quality as well as its effect on firms within the health care sector. The course will examine potential reforms, including those offered by liberals and conservatives and information that can be extracted from health care systems in other developed countries. The course will also explore key facets of the ACA, including improving access to care and health insurance exchanges, improving quality and constraining costs through health care delivery system reforms, realigning capacity through changes in the health care workforce and in medical education, the potential impact on biomedical and other innovations, and the impact on economic outcomes such as employment, wage growth, and federal budget deficits. The course will also examine the political context and process of passing major legislation in general and health care legislation in particular, including constitutional arguments surrounding the Affordable Care Act. Throughout the course, the key lessons will integrate the disciplines of health economics, health and social policy, law and political science to elucidate key principles.",
    "course_id" : "HCMG250",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "250",
    "course_title" : "Health Policy: Health Care Reform and the Future of the American Health System",
    "crosslistings" : [ {
      "course_id" : "575",
      "section_id" : "",
      "subject" : "BIOE"
    }, {
      "course_id" : "850",
      "section_id" : "",
      "subject" : "HCMG"
    } ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Emanuel",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course combines the insights of health economics with a strategic perspective on the business of health. The first section will consider the costs and benefits of medical interventions, while the second considers insurance theory and places special emphasis on the challenges facing firms in the face of the rising costs of health benefits as well as opportunities for private insurers operating in publically financed markets. The third section will analyze strategies of vertical and horizontal integration and their effect on the balance of power in local healthcare markets. Finally, the course will cover the effects of reform on firm incentives. The course will be taught using a mix of lectures and cases.",
    "course_id" : "HCMG216",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "216",
    "course_title" : "Health Insurance and Health Care Strategy",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "STARC",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course provides an overview of the management, economic and policy issues facing the pharmaceutical, biotechnology, and medical device industries. The course perspective is global, but with emphasis on the U.S. as the largest and and most profitable market. Critical issues we will examine include: R&D intensive cost structure and rapid technological change; biotechnology and genomics startups and alliances with the pharma industry; a complex global marketplace in which prices are regulated in most countries and customers include governments and insurers, as well as physicians, pharmacists and consumers; intense and evolving M&A, including mergers, joint ventures, and complex alliances; government regulation of every business function, including R&D, pricing and promotion; and global products and multinational firms. We use Wharton and industry experts from various disciplines to address these issues.",
    "course_id" : "HCMG215",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "215",
    "course_title" : "Management and Economics of Pharmaceutical, Biotech, and Medical Device Industries",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Danzon",
    "prerequisites" : "One undergraduate Health Care Management course or Economics course",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This seminar will explore empirical methods in health care research with an emphasis on applications in health care economics and finance. The methods covered include estimation with panel data, program evaluation models, qualitative and limited dependent variable models, stochastic frontier models, estimation with count data, and duration models. The readings consist of a blend of classic and recent empirical studies, including articles on the demand for health care and health insurance, tests for moral hazard and adverse selection, and estimation of provider cost functions. Students are required to conduct an econometric analysis of some issue within the health care field. With the permission of the instructor, the seminar is open to doctoral students from departments other than Health Care Systems.",
    "course_id" : "HCMG900",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "900",
    "course_title" : "Proseminar in Health Services Research",
    "crosslistings" : [ ],
    "department" : "HCMG",
    "department_of_record" : "HCMG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Harrington",
    "prerequisites" : "",
    "register_subgroup_one" : "01",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  } ],
  "service_meta" : {
    "current_page_number" : 1,
    "error_text" : "",
    "next_page_number" : 1,
    "number_of_pages" : 1,
    "previous_page_number" : 1,
    "results_per_page" : 999
  }
}
