HTTP/1.1 200 OK
http.status: 200
Date: Thu, 04 Dec 2014 03:48:11 +0000
Content-Length: 54965
Content-Type: application/json
Server: Jetty(8.1.13.v20130916)
Set-Cookie: BIGipServermule_pool_8091=3525579948.39711.0000; expires=Thu, 04-Dec-2014 09:48:11 GMT; path=/

{
  "result_data" : [ {
    "activities_and_credits" : [ {
      "activity_code" : "STU",
      "credit" : "2"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The focus of this foundation studio is to explore ways of recording and representing landscape - with an emphasis on material, space, rhythm and measure - through a range of drawings and constructions. The studio attempts to create a sensibility toward landscape where the act of surveying a site is as much an imaginative endeavor as is the crafting of an artifact or the construction of a path in a landscape. Emphasis is placed on visual and manual skills in two-dimensional and three-dimensional constructions (drawing, fabrications, model-making, etc.), while developing ways to \"see\" landscape. The studio is structured around the themes of wetness/dryness and enclosure/disclosure, and works with one or more sites in the Philadelphia region. In the past, the studio has focused on a territory around Martha's Furnace in the Pine Barrens, NJ; a part of the Meadowlands in northern NJ; an anthracite strip-mine in part of Pennsylvania's Appalachian Mountains; the Wissahickon Creek and the Schuylkill River Trail in Philadelphia; and Great Falls in Paterson, NJ. Projects involve the making of pathways in these otherwise undesigned environments.",
    "course_id" : "LARP501",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "501",
    "course_title" : "Studio I",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Mathur/da Cunha",
    "prerequisites" : "",
    "register_subgroup_one" : "01",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "IND",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "V",
    "course_credit_type" : "CU",
    "course_description" : "An independent studio may be undertaken in the final semester but is not required. The independent studio is intended to provide highly motivated students who have demonstrated their ability to work independently with the opportunity to pursue topics that extend the boundaries of the profession. For permission, students must prepare a written proposal in the preceding semester and apply for approval from the faculty. Details available in Landscape Architecture department office.",
    "course_id" : "LARP796",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "796",
    "course_title" : "Independent Studio",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Faculty",
    "prerequisites" : "",
    "register_subgroup_one" : "02",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "STU",
      "credit" : "2"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "These advanced elective studios provide opportunities for focused exploration of particular themes in contemporary landscape architecture. Important emerging and accomplished designers, often from divergent points-of-view, interests and backgrounds, are invited to run these studios. Collaborative options (between Landscape and the Departments of Architecture or City Planning) are sometimes offered across the School. In addition to our own faculty who offer some of these studios (Corner, Gouverneur, Marcinkoski, Mathur, M'Closkey, Olin, Sanders, Tomlin), visitors have included Paolo B?rgi (Switzerland), Peter Latz (Munich), Bernard Lassus (Paris), Margie Ruddick (Philadelphia), Chris Reed (Boston), Peter Beard (London), Nicholas Quennell (New York), Ken Smith (New York), Raymond Gastil (New York), Alessandro Tagliolini (Italy), Ignacio Bunster (Philadelphia), Perry Kulper (Los Angeles),James Wines (New York), Lee Weintraub (New York), Charles Waldheim (Chicago), Stanislaus Fung (Australia), Dennis Wedlick (New York), Sandro Marpillero (New York), Peter Connolly (Australia), and former associate professor Anita Berrizbeitia. More recent visitors have been Catherine Mosbach (Paris), Nanako Umemoto/Neil Cook (New York), Valerio Morabito (Italy), Carol and Colin Franklin (Philadelphia), Keith Kaseman (Philadelphia), Silvia Benedito (New York), Claudia Taborda (Lisbon), Mark Thomann (New York), Jerry Van Eyck (New York), and Martin Rein-Cano (Berlin).",
    "course_id" : "LARP701",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "701",
    "course_title" : "Studio V",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Faculty",
    "prerequisites" : "",
    "register_subgroup_one" : "01",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This workshop explores a sequence of sites extending from the Atlantic Ocean to the Appalachian Mountains that illustrates the changing geology and topography of the regional physiographic provinces including the Atlantic Coastal Plain, Piedmont, and Valley and Ridge. In moving westward along the transect, field trips to natural areas and constructed sites will highlight the diversity of regional plant communities ranging from primary dune to salt marsh, serpentine Virginia pine-oak forest to seepage wetland, and more. Analysis of the inter-connections between the underlying geology, topography, hydrology, soils, vegetation, wildlife, and human interventions will reveal patterns reflecting process and demonstrate key ecological and cultural systems and processes through the production of field notebooks as well as large-scale measured drawings. Ultimately students will develop a vocabulary (recognition, identification and nomenclature) of the materials of landscape, its substance, its ecology, and its changing nature owing to place and time. NOTE: COURSE MEETS IN ASSIGNED CLASSROOM FROM 9-1PM. CLASS MEETING FROM 2-5PM IS DEDICATED TO FIELD WORK.",
    "course_id" : "LARP511",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "511",
    "course_title" : "Workshop I: Ecology and Materials",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Willig and Popowsky",
    "prerequisites" : "",
    "register_subgroup_one" : "01",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "STU",
      "credit" : "2"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This foundation design studio explores the relationship among sites, drawings, models and the making of landscape architectural projects. The studio site is typically located on vacant or abandoned land in North Philadelphia along the Delaware River. Such sites are fairly large in size and present a complex set of issues, including fragmentation, lack of access, and contamination. Through the design of a park, students test and refine the relationship among project concept, modes of visualization, and project formation (organizational and material). As a precursor to site work, students experiment with methods and materials for making organization and form in two and three dimensions. In the early part of the semester, we explore techniques of imaging that generate multiples (scenarios), serial progressions (transformations of a sort), and iterations (transformations of another). Through various grafting techniques, we use the resultant drawings and models as analogous structures in order to imagine possible future organizations and uses for the site. These studies occur in conjunction with site interpretations ranging from photographs and sketches, to measured drawings and diagrams. The objective for the studio is to develop an informed and imaginative response to the site in order to create new relationships among the site, its immediate edges and the larger neighborhood or region.",
    "course_id" : "LARP502",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "502",
    "course_title" : "Studio II",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "M'Closkey/Faculty",
    "prerequisites" : "LARP 501: Studio I",
    "register_subgroup_one" : "01",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "IND",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "V",
    "course_credit_type" : "CU",
    "course_description" : "An independent study may be taken for elective credit at any point during the degree program for a letter grade. For permission, students must prepare a written proposal in the preceding semester and obtain a Landscape Architecture faculty advisor to oversee their work. Details are available in the Landscape Architecture department office.",
    "course_id" : "LARP999",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "999",
    "course_title" : "Independent Study",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Faculty",
    "prerequisites" : "",
    "register_subgroup_one" : "02",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "STU",
      "credit" : "2"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This studio is the fourth and final studio in the core sequence and is designed to introduce students to essential competencies related to contemporary problems in urban design. The studio operates in what have been referred to as \"global cities\" - contexts in which there are significant pressures on the physical form of a metropolis from substantial population and economic growth (both ongoing and projected). These pressures induce considerable demands for the development of new contexts. The studio is focused on managing and megotiating these pressures through landscape-driven strategies capable of guiding and organizing this urbanization. Students develop individual design strategies through a process of mapping, modeling, scenario building and fieldwork that lead to both conceptual and physical proposals for the development of new urban districts and metropolitan agendas.",
    "course_id" : "LARP602",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "602",
    "course_title" : "Studio IV",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Marcinkoski/Faculty",
    "prerequisites" : "Students in the 3-yr MLA program must complete LARP 501: Studio I, LARP 502: Studio II and LARP 601: Studio III prior to beginning LARP 602: Studio IV.",
    "register_subgroup_one" : "01",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "STU",
      "credit" : "2"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "These advanced elective studios provide opportunities for focused exploration of particular themes in contemporary landscape architecture. Important emerging and accomplished designers, often from divergent points-of-view, interests and backgrounds, are invited to run these studios. Collaborative options (between Landscape and the Departments of Architecture or City Planning) are sometimes offered across the School. In addition to our own faculty who offer some of these studios (Corner, Gouverneur, Marcinkoski, Mathur, M'Closkey, Olin, Sanders, Tomlin), visitors have included Paolo B?rgi (Switzerland), Peter Latz (Munich), Bernard Lassus (Paris), Margie Ruddick (Philadelphia), Chris Reed (Boston), Peter Beard (London), Nicholas Quennell (New York), Ken Smith (New York), Raymond Gastil (New York), Alessandro Tagliolini (Italy), Ignacio Bunster (Philadelphia), Perry Kulper (Los Angeles),James Wines (New York), Lee Weintraub (New York), Charles Waldheim (Chicago), Stanislaus Fung (Australia), Dennis Wedlick (New York), Sandro Marpillero (New York), Peter Connolly (Australia), and former associate professor Anita Berrizbeitia. More recent visitors have been Catherine Mosbach (Paris), Nanako Umemoto/Neil Cook (New York), Valerio Morabito (Italy), Carol and Colin Franklin (Philadelphia), Keith Kaseman (Philadelphia), Silvia Benedito (New York), Claudia Taborda (Lisbon), Mark Thomann (New York), Jerry Van Eyck (New York), and Martin Rein-Cano (Berlin).",
    "course_id" : "LARP702",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "702",
    "course_title" : "Studio VI",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Faculty",
    "prerequisites" : "",
    "register_subgroup_one" : "01",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    }, {
      "activity_code" : "LAB",
      "credit" : "0"
    } ],
    "corequisites" : "Summer Field Ecology Laboratory/Willig",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Workshop II combines two of the most elemental tools in the practice of landscape architecture: landform and planting design. Grading - the shaping and sculpting of the landform - is both art and science, and thus Workshop II aims to provide an appreciation of landform as an evocative component in the design vocabulary as well as a critical tool in solving difficult design problems. The basic techniques and strategies of grading design (slopes, terraces, water management, grade change devices) will be introduced, practiced and reinforced, so that grading design becomes an integral part of the students' design approach. Lecture, field trips, modeling, in-class exercises, and group projects will be used. The Planting component provides students with a working overview of the principles and processes of planting design. Plants will be considered both as individual elements and as part of larger dynamic systems. The natural distribution of plants, concepts of plant community and successional patterns, and the relationship of planting an topography will be used as the initial framework for planting design. Planting design typologies will be examined as an outgrowth of these \"natural\" patterns. The role of plants as a key element in the structural design of the landscape will be explored through a combination of modeling, plan and section drawing, temporal studies, writing, field trips and case studies. Emphasis will be placed on process and evolution: the temporality of planting (daily, seasonal and annual changes), establishment and maintenance of plantings, and the process of planting design. During the first week of May, a five-day field ecology course focuses on techniques of urban revitalization, sustainable land use, reclamation, and restoration. The field trips offer insight into the diversity of approaches to using plants to promote positive environmental change.",
    "course_id" : "LARP512",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "512",
    "course_title" : "Workshop II: Landform and Planting Design",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Olgyay",
    "prerequisites" : "LARP 511: Workshop I",
    "register_subgroup_one" : "01",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "These courses offer advanced instruction in the uses and applications of various digital media, including Geographical Information Systems, 3-D modeling, video, animation, and web-design. These courses are open to all interested School of Design students who already have a working knowledge of basic digital graphic techniques and with permission of the instructor. Recent topics have been: Non-Static Representation: Video, Animation, and Interactive Media (fall 2012), instructor: Todd Montgomery; Interoperable Terrains (fall annually since 2008), instructor: Keith Kaseman; Digital Fabrication (spring annually), instructor: Keith VanDerSys; Kino-Eye: Intro to Spatial Filmmaking (fall 2011, 2010), instructor: Richie Gelles; Geometry Clouds, Fluid Landscapes (fall 2002-2006), instructor: David Ruy; Tactical Surfaces / Topographic Modeling (fall 2002), instructor: Charles McGloughlin.",
    "course_id" : "LARP740",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "740",
    "course_title" : "Topics in Digital Media",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Faculty",
    "prerequisites" : "LARP-543, MEDIA III",
    "register_subgroup_one" : "02",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "These courses explore relevant topics in construction, horticulture and planting design as they relate to contemporary landscape architecture. The aim is to supplement fundamental skills and ideas explored in the core curriculum workshops with more advanced, cutting-edge research, technology and case studies. The teaching faculty are leading practitioners and researchers in the field. These courses are open to all interested School of Design students. Recent topics have been: Detailing New Urban Landscapes (spring 2012, 2011), instructor: Tom Ryan; Building New Urban Landscapes, Construction, and Planting Design (fall 2009, 2008), instructor: Tom Ryan; Urban Horticulture and Planting Design (fall annually since 2009), instructor: David Ostrich; Urban Horticulture: Designing and Managing Landscape Plantings in Stressful Environments (1998-2003), instructor: Paul Meyer; Advanced Planting Design, instructors: Rodney Robinson (2003-2009), Dennis McGlade (fall 2006), Sheila Brady; and Sustainable Large Scale Planting of Trees, Shrubs, Perennials and Grasses (fall 2001), instructor: Wolfgang Oehme.",
    "course_id" : "LARP750",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "750",
    "course_title" : "Topics in Construction, Horticulture and Planting Design",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Faculty",
    "prerequisites" : "",
    "register_subgroup_one" : "02",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "These advanced seminars explore advanced ideas in contemporary landscape architectural design and theory. A special link is made between the analysis of built work and text to design practice and the making of projects. Topics include the intersections of art, nature and creativity; practices of analysis and criticism; ideas of urbanism and infrastructure; collaborative ventures and cross-disciplinarity; vision and visuality; and representational structures, both verbal and visual. These courses fulfill the Landscape Architecture Theory III requirement and are open to all interested School of Design students. Recent topics have been: Designed Ecologies (fall 2012, 2011), instructor: Ellen Neises; Environment Regimes (spring 2013, fall 2011, 2010, 2009, spring 2007, 2006), instructor: Dilip da Cunha; Case Studies in Urbanism, Landscape and Design (spring annually) instructor: David Gouverneur; Landscape Production and Visual Culture (spring 2009), instructor: Claudia Taborda; Landscape and Globalization (spring 2010), instructor: Claudia Taborda; Concepts & Theories in Contemporary Landscape Architecture (fall 2008, 2007, 2006, 2004, 2003), instructor: Anita Berrizbeitia; Paradoxical Spaces (spring 2008), instructors: Linda Pollak and Sandro Marpillero; Contemporary European Landscape Architecture (fall 2007),instructor: Joseph Disponzio; Metropolitan Landscapes: Design, Leisure, and Regeneration (spring 2004), instructor: Ray Gastil; Max Ernst's Liminal Nature (spring 2005), instructors: Linda Pollak and Sandro Marpillero; Active Time in Cinema and Landscape (fall 2006, 2005, 2004, 2003), instructor: Ed Keller; Land, Art and Criticism (fall 2003), instructor: Sebastien Marot; Landscape Architecture and the Art of Hope (fall 2002), instructor: Sebastien Marot; Nature, Society and Cities (spring 2003), instructor: Neil Smith; Organizational Ecologies: Emergent Forms and Practices in Complex Landscapes (fall 2002),instructor: James Corner.",
    "course_id" : "LARP780",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "780",
    "course_title" : "Topics in Theory and Design",
    "crosslistings" : [ {
      "course_id" : "535",
      "section_id" : "",
      "subject" : "LARP"
    } ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Faculty",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course is the third in the media sequence and is required of all MLA students at the 600 level. This course engages the generative potential of the dynamic and temporal attributes of the landscape medium. Time-based visualizations are used to investigate landscape organizations shaped through the dynamic interplay of varying processes and their spatial consequences. Emphasis will parallel the LARP 601 on urban ecology and landscape systems.",
    "course_id" : "LARP543",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "543",
    "course_title" : "Media III: Flows: Linear / Non-Linear",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "VanDerSys",
    "prerequisites" : "Students in the 3-yr MLA program must complete LARP 533: Media I and LARP 542 Media II prior to beginning LARP 543: Media III",
    "register_subgroup_one" : "01",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course explores the nature and use of raster-oriented (i.e. image-based) Geographic Information Systems (GIS) for the analysis and synthesis of spatial patterns and processes. Previous experience in GIS is not required.",
    "course_id" : "LARP741",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "741",
    "course_title" : "Modeling Geographic Space",
    "crosslistings" : [ {
      "course_id" : "632",
      "section_id" : "",
      "subject" : "CPLN"
    } ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Tomlin",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Continuing the sequence of the Landscape Architecture media classes, this course will provide students with the techniques to explore and examine precision surface profiles and land forming strategies, in both physical and digital models. These models provide a basis to speculate on what processes and programs might be engendered or instigated. The course will begin by introducing 2-D digital presentation techniques, primarily as afforded by AutoCAD and the more fluid Adobe Illustrator. Students will then progress to working with some advanced imaging techniques in Adobe Photoshop. The final section of the course will concentrate on working fluently and in an integrated way amongst each of these three programs, developing imaginative potentials within each.",
    "course_id" : "LARP542",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "542",
    "course_title" : "Media II: Digital Visualization",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Faculty",
    "prerequisites" : "LARP 533: Media I",
    "register_subgroup_one" : "01",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course unfolds several contemporary issues that shape the profession, such as giving form to environmental values, balancing science and art, ecology and design, reconsidering the need for the beautiful vis-a-vis the many sites challenged by pollution and abuse. Among the topics of discussion, this course will also take into account how recent phenomena such as the late twentieth-century increase in world population, sprawl, and environmental pollution, and how these have changed the reality described by the very word \"nature\" and have contributed to expand the domain of landscape architecture. The discussion of topics will integrate contemporary ideas and their roots in earlier theoretical formulation. The past will be presented as a way to illuminate, receive, and critique the present. Course objectives are to become familiar with the social and cultural processes that inform the landscape architectural discourse and to be able to discuss in an informed manner the impact of the latter upon design trends; to be able to trace the roots of contemporary ideas in earlier theoretical formulations; and to be able to think critically and to enhance synthesis and augmentation skills.",
    "course_id" : "LARP540",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "540",
    "course_title" : "Theory II: History of Ideas and Forms in Landscape Architecture",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Fabiani Giannetto",
    "prerequisites" : "",
    "register_subgroup_one" : "01",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Landscape architecture, architecture and visual art are all mediations between nature and culture. This course is designed to help students form their own view regarding our relationship with the \"natural\" world around us in an age of ecological crisis. To achieve this, the course provides a stimulating historical and contemporary survey of ideas of nature. We explore ways \"nature\" has been understood mythically, theologically, ideologically, philosophically, scientifically, and artistically through the ages, with an emphasis on contemporary culture. We survey the way in which the polarity of culture and nature has been historically constructed and more recently, deconstructed. The pedagogical philosophy of this course is that an appreciation of the broad pattern of history and the ideas that have shaped it are foundational to living a critical and ethical life and central to the process of making contemporary art, architecture, and landscape architecture.",
    "course_id" : "LARP535",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "535",
    "course_title" : "Theory I: The Culture of Nature",
    "crosslistings" : [ {
      "course_id" : "780",
      "section_id" : "",
      "subject" : "LARP"
    } ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Weller",
    "prerequisites" : "",
    "register_subgroup_one" : "01",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "These advanced seminars explore central issues in the history and theory of landscape architecture from the Renaissance to the present day. The focus is upon the cultural context of built works, their relation to conceptual writings (contemporary with the designs as well as modern) and the dialogue between modern professional practice and historical example and method. These courses fulfill the Landscape Architecture Theory III requirement and are open to all interested students in the School of Design and elsewhere in the university. Recent topics taught by Professor Hunt have been: Place & Peacefulness (fall 2012); Texts & Topics (fall 2011); The Role of History in Contemporary Landscape Architecture (fall 2010); Understanding Venice Research Seminar (spring 2009); Sculpture Parks and Sculpture in Parks (fall 2008); Six Landscape Architects & What We Say About Them (spring 2007); Open Spaces & Open Places: The Design and Use of American Landscapes (spring 2006), co-taught with Emily Cooperman; Reception, or the After Life of Landscapes (Spring 2005), Land Art and Ian Hamilton Finlay (fall 2004), Lawrence Halprin: Theory, Practice, Context & the Archival record (spring 2004) co-taught with Emily Cooperman; French Landscape Architecture: Case Studies (spring 2003); Picturesque as Modernism (spring 2002). Recent topics taught by Professor Fabiani Giannetto have been: Villa Gardens and Villa Life: Cultural and Social Transformations (spring 2012); and American Landscape Architecture & Its Sources (spring 2011).",
    "course_id" : "LARP770",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "770",
    "course_title" : "Topics in Landscape Architecture History and Theory",
    "crosslistings" : [ {
      "course_id" : "620",
      "section_id" : "",
      "subject" : "HSPV"
    } ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Faculty",
    "prerequisites" : "",
    "register_subgroup_one" : "02",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Advanced Landscape Construction: The Art and Craft of Design Documentation and Detailing introduces students to the process of landscape documentation as means of strengthening design intent through careful material selection and articulation of form. The course builds upon Workshop III by expanding the concept of site systems to the full range of drawings, details, specifications, and contracts used by landscape designers in the creation of the man-made environment. The course features lectures, case studies and field walks, exploring documentation from initial concept through construction administration. Topics will include materials and their use in exterior environments, documentation phases and their role in a projects evolution and the art of detailing to ensure beautiful, durable landscapes that define cohesive design.",
    "course_id" : "LARP612",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "612",
    "course_title" : "Workshop IV: Advanced Landscape Construction (Module 1 and 2)",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Falck/Faculty",
    "prerequisites" : "LARP 611: Workshop III",
    "register_subgroup_one" : "01",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The Morris Arboretum of the University of Pennsylvania provides a case study in public garden management. Aspects of horticulture, landscape design, education, conservation, history, preservation, and management are considered. Work often includes seminars followed by outdoor practical sessions, many of which include plant identification sessions with the Arboretum Curator. Students will be tested on plant identification at the end of the semester. Students will be assigned an independent plant or landscape related project that they will research, design, complete and present as part of their work. This course is an internship that meets at the Morris Arboretum in the Chestnut Hill section of Philadelphia on Thursday afternoons during the Fall term. There are also some day-long field trips to other public gardens and natural areas throughout the semester. For more information contact Jan McFarlan at the Arboretum, 215-247-5777, ext 156.",
    "course_id" : "LARP755",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "755",
    "course_title" : "Issues in Arboretum Management I (internship)",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Arboretum Staff",
    "prerequisites" : "",
    "register_subgroup_one" : "02",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "STU",
      "credit" : "2"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This studio brings together both two-year and three-year MLA students for a landscape studio problem that works at a regional scale, as well as multiple design scales. LARP 601 - the Green Stimuli studio - emphasizes rigorous site analysis, the strategic organization of living material, and the potential of design to produce a wide range of effects. Studio problems are \"live\" - local leaders and experts are actively trying to solve them, there is an audience for student work outside the University, and projects have the potential to stimulate debate and new directions. The Green Stimuli studio takes on design problems where soil, terrain, geology, mineral resources, climate, water, plants, wildlife, and living systems interactions are major drivers. Studio projects explore one or more of these dimensions in depth to reach high levels of design exploration, strategic thinking, technical resolution and physical expression. The studio's topics intersect with a broader universe of practical concerns, including land use, local and regional economies, real estate development and public policy, as well as philosophical and artistic questions about nature and ecology. The intent is that designed Green Stimuli make new connections between the material of landscape and the economic, infrastructural, scientific, social, cultural and creative attributes of a region.",
    "course_id" : "LARP601",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "601",
    "course_title" : "Studio III",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Faculty",
    "prerequisites" : "Students in the 3-yr MLA program must complete LARP 501: Studio I and LARP 502: Studio II prior to beginning LARP 601: Studio III",
    "register_subgroup_one" : "01",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "These elective courses explore relevant topics in ecological design and new technologies as they relate to contemporary landscape architecture. The courses explore topics such as ecology, sustainability, habitat restoration, hydrology, green roof and green architecture technology, soil technology, and other techniques pertinent to the construction of ecologically dynamic, functioning landscapes. The teaching faculty are leading practitioners and researchers in the field. These courses are open to all interested PennDesign students. Recent topics have been: Sustainable Development: The Queen Elizabeth Olympic Park, London (fall 2012), instructor: John Hopkins; Ecological Economies and Infrastructure (spring 2012), instructor: John Hopkins; Contemporary Issues in Sustainability: The London 2012 Olympic Park and Other European Examples (fall 2011), instructor: John Hopkins; Green Roof Systems (spring 2012, 2011, 2010), instructor: Susan Weiler; Large-Scale Land Reclamation Projects, instructor: William Young (annually since 2005), James Ludwig (spring 2004); Restoration Ecology (fall 2012 2010, 2008, 2006, 2004), instructor: David Robertson; Sustainable Landscape Design for Watershed Protection (fall 2008, 2006, 2005, 2004,2003, 2002), instructor: Katrin Scholz-Barth; and Ecological Restoration in the Urban Context (spring 2002, 2001), instructor: Deborah Marton.",
    "course_id" : "LARP760",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "760",
    "course_title" : "Topics in Ecological Design",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Faculty",
    "prerequisites" : "",
    "register_subgroup_one" : "02",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Drawing is the ability to experience deeply things we see and envision. It allows us, not only to represent things or images seen, but, to discover and construct space and depth on the two dimensions of drawing surface. Expanding the tools of drawing, this course presents inquiries into applied media providing a basis for envisioning the speculative and developing an economy of expression. Work will be closely related to work in Studio I. Students will be introduced to the formal syntax of drawing (line, contour, structure, texture, chiaroscuro), graphic grammar (orthographic, oblique, perspective projection drawings and free-hand sketching) alongside exercises in material expression (collage, assemblage).",
    "course_id" : "LARP533",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "533",
    "course_title" : "Media I: Drawing and Visualization",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Mathur/da Cunha",
    "prerequisites" : "",
    "register_subgroup_one" : "01",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course introduces students to the core concepts, processes, and vocabulary of contemporary urban ecology. It aims to provide a conceptual framework and grounding in an understanding of ecological processes, in order to empower students to develop and critique the function and performance of landscape interventions. Urban ecology describes the interaction of the built and natural environment, looking at both ecology in the city, as well as ecology of the city. Lectures, case studies, critical reading and design exercises will enable students to increase their ability to analyze and interpret ecological systems and processes. By analyzing the application of ecological concepts in the design management of urban landscapes, urban ecology will be explored as a dynamic, human-influenced system. Registration is limited to MLA students in the LARP 601 studio.",
    "course_id" : "LARP761",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "761",
    "course_title" : "Urban Ecology",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Carlisle/Pevzner",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "These seminar courses explore ideas and methods in current landscape architectural practice. They include instruction in professional procedures, office management, project development, contracts, and collaborative ventures. They include visits to construction sites, professional offices and archives. These courses are open to all interested PennDesign students. Recent topics have been: Office Practice (spring annually) instructor: Lucinda Sanders.",
    "course_id" : "LARP730",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "730",
    "course_title" : "Topics in Professional Practice",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Sanders",
    "prerequisites" : "",
    "register_subgroup_one" : "02",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "V",
    "course_credit_type" : "CU",
    "course_description" : "Building upon the skills and concepts developed in Workshops I and II, this intermediate workshop focuses on technical aspects of site design, with an emphasis on landscape performance. Functional considerations related to landscapes and their associated systems - including circulation, drainage and stormwater management, site stabilization and remediation - will be explored as vital and integral components of landscape design, from concept to execution. Lectures, case studies, field trips, and focused design exercises will enable students to develop facility in the tools, processes and metrics by which landscape systems are designed, evaluated, built and maintained. In concert with the concurrent design studio, students will consider the means by which functional parameters can give rise to the conceptual, formal, and material characteristics of designed landscapes.",
    "course_id" : "LARP611",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "611",
    "course_title" : "Workshop III: Site Engineering and Water Management",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Schlatter",
    "prerequisites" : "Students in the 3-yr MLA program must complete LARP 511: Workshop I and LARP 512: Workshop II prior to beginning LARP 611: Workshop III",
    "register_subgroup_one" : "01",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "In these advanced representation courses the work extends to new ways of documenting and seeing landscape. These courses are open to all interested School of Design students who have previous drawing experience or have taken foundation studios. Recent topics have been: Seeing & Imagining Landscapes (fall annually),instructors: Valerio Morabito, Paolo Burgi; Landscape Drawing (spring annually), instructor: Laurie Olin; Landscape Drawing (spring 2008), instructors: David Gouverneur, Trevor Lee; Shifting Landscapes: A Workshop in Representation (spring 2005, 2004), instructor: Anuradha Mathur; and The Agile Pencil and Its Constructs (spring 2004) instructor: Mei Wu.",
    "course_id" : "LARP720",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "720",
    "course_title" : "Topics in Representation",
    "crosslistings" : [ ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Faculty",
    "prerequisites" : "LARP501,LARP533, LARP601, ARCH501, ARCH532 OR ARCH601",
    "register_subgroup_one" : "02",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course offers students an opportunity to work closely with faculty, staff, local practitioners, and each other in conducting independent projects that involve the development and/or application of Geographic Information System (GIS) technology. The course is open to all students who can demonstrate sufficient experience, expertise, or initiative to purse a successful term project.",
    "course_id" : "LARP745",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "745",
    "course_title" : "Advanced Topics in GIS",
    "crosslistings" : [ {
      "course_id" : "680",
      "section_id" : "",
      "subject" : "CPLN"
    } ],
    "department" : "LARP",
    "department_of_record" : "LARP",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Tomlin",
    "prerequisites" : "",
    "register_subgroup_one" : "02",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "FA",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  } ],
  "service_meta" : {
    "current_page_number" : 1,
    "error_text" : "",
    "next_page_number" : 1,
    "number_of_pages" : 1,
    "previous_page_number" : 1,
    "results_per_page" : 999
  }
}
