[{"ratings": {"rAmountLearned": "3.24", "rDifficulty": "2.64", "rStimulateInterest": "3.55", "rRecommendMajor": "3.64", "rCourseQuality": "3.59", "rWorkRequired": "2.58", "rInstructorAccess": "3.19", "rReadingsValue": "2.56", "rRecommendNonMajor": "2.64", "rCommAbility": "3.55", "rInstructorQuality": "3.76"}, "section": {"name": "BAYESIAN METH & COMP", "sectionnum": "001", "primary_alias": "STAT-542-001", "path": "/courses/28195/sections/001", "id": "28195-001", "aliases": ["STAT-542-001"]}, "comments": "STAT 542 is a course on Bayesian methods and computations. Topics covered include sophisticated tools for probability modeling, data analysis from the Bayesian perspective, hierarchical models, mixture models and Monte Carlo simulation techniques.  \r\n\r\nOverall, students had positive reviews of the class. One student mentioned that he “learned a lot more in terms of programming ability.” The pace of this class is described as “perfect” and the course is taught “in a way to appeal to a variety of people.” Students mentioned that homeworks were primarily how they learned. They also mentioned that homeworks were “fair” and “reinforced concepts well.” One part of the class that many students found difficult was HMM because the professor glossed over the topic very quickly, and they wished that more time would be allocated to this topic.\r\n\r\nProfessor Jensen had positive reviews. Students raved about his lecturing ability, with one student commenting that he was a “clear, engaging and humorous lecturer.” Students also mentioned that he was good at communicating difficult information in an easy-to-understand way.\r\n\r\nOverall, STAT 542 is recommended for majors and nonmajors alike, although the class is very quantitative so students should have a strong quantitative background. \r\n", "num_students": 41, "path": "/courses/28195/sections/001/reviews/3512-SHANE-T--JENSEN", "instructor": {"path": "/instructors/3512-SHANE-T--JENSEN", "first_name": "SHANE T.", "last_name": "JENSEN", "id": "3512-SHANE-T--JENSEN", "name": "SHANE T. JENSEN"}, "num_reviewers": 37, "id": "28195-001-3512-SHANE-T--JENSEN"}]