{"coursehistories": {"path": "/coursehistories/3058"}, "description": "International monetary economics with emphasis on economic policy in an open economy. Topics covered in the course include: balance-of-payments adjustment, theories of exchange rate determinaton, the effects of exchange rate devaluation, macroeconomic policy under fixed and floating exchange rates, the Euro-dollar market, currency and balance of payments crises. \n\n", "semester": "2010C", "name": "INTERNATIONAL FINANCE", "reviews": {"path": "/courses/22940/reviews", "values": [{"ratings": {"rAmountLearned": "2.38", "rDifficulty": "3.10", "rStimulateInterest": "1.83", "rRecommendMajor": "2.90", "rCourseQuality": "2.12", "rWorkRequired": "2.08", "rInstructorAccess": "2.10", "rReadingsValue": "2.05", "rRecommendNonMajor": "1.33", "rCommAbility": "2.28", "rInstructorQuality": "2.20"}, "section": {"name": "INTERNATIONAL FINANCE", "sectionnum": "001", "primary_alias": "ECON-252-001", "path": "/courses/22940/sections/001", "id": "22940-001", "aliases": ["ECON-252-001"]}, "comments": "This course explores international monetary economics with an emphasis on economic policy in an open economy. Topics covered in the course include: balance-of-payments adjustment, theories of exchange rate determination, the effects of exchange rate devaluation, macroeconomic policy under fixed and floating exchange rates, the Euro-dollar market, currency and balance of payments crises.\r\n\r\nSeveral students described this class as one of the “best” and most “interesting” economic classes they have taken thus far at Penn. The course covers a lot of material in a short period of time, and is very fast-paced. The textbook used in the class was written by the professor, but students described it as very “outdated” and difficult to read and understand. Students had varied views about the practicality of the course.\r\n\r\nProfessor Ethier’s personality was generally described positively, as students complimented his “funny sense of humor” and described him as “nice” and “obviously very bright.” While students recognized that Ethier was intelligent and understood the material very well, many complained that he went over material “very fast.” The material was explained “clearly,” “efficiently,” and in a manner that stimulated interest, but the sheer speed at which it was explained made it necessary for students to resort to “struggling through” the difficult textbook in order to understand the material. Professor Ethier was not very accessible to students, and some students were disappointed that he did not offer review sessions for exams. Many students also expressed regret that Professor Ethier did not offer homework assignments or practice tests to help them better prepare for exams.\r\n\r\nThis upper-level economics class was not recommended to non-majors. It required a lot of reading, but there was no mandatory homework assigned. Students found it difficult to study off of notes they had taken in class, and no notes were made available on Blackboard. Thus, the textbook was the primary resource for studying, which was in line with exam content because it was written by the professor. Some students commented that exams were difficult, requiring very specific knowledge.\r\n", "num_students": 63, "path": "/courses/22940/sections/001/reviews/347-WILFRED-J-ETHIER", "instructor": {"path": "/instructors/347-WILFRED-J-ETHIER", "first_name": "WILFRED J", "last_name": "ETHIER", "id": "347-WILFRED-J-ETHIER", "name": "WILFRED J ETHIER"}, "num_reviewers": 53, "id": "22940-001-347-WILFRED-J-ETHIER"}]}, "credits": null, "primary_alias": "ECON-252", "path": "/courses/22940", "sections": {"path": "/courses/22940/sections", "values": [{"name": "INTERNATIONAL FINANCE", "sectionnum": "001", "primary_alias": "ECON-252-001", "path": "/courses/22940/sections/001", "id": "22940-001", "aliases": ["ECON-252-001"]}]}, "id": 22940, "aliases": ["ECON-252"]}