{"coursehistories": {"path": "/coursehistories/5495"}, "description": "This class will explore aspects of creativity in a multitude of settings. Creativity isn't just for artists and inventors. It's an integral aspect of excelling at many jobs. Its problem solving. Recent studies have pointed to creativity as an important factor for achievement in a variety of fields. Additional studies have discussed how creativity can be enhanced in people of any age. So this class will have weekly assignments to do just that, challenge you to come up with creative solutions to a series of different projects. This seminar-studio will be filled with various projects to push your creative skills. It follows the core premise that creativity is within all of us. We'll also have several guest speakers from different fields talk about how they harness and use creativity in their jobs and lives. Using architecture and urban design as a starting point, this class will explore the city for of creative solutions in design. Well take advantage of our location and explore aspects of creativity embedded into the very fabric of Philadelphia and NYC. \n\nAssignments will include short research papers, as well as sketching and design projects. No previous art experience is required. We'll cover the basics, for those without any art background. Sketching is an excellent way to strengthen your observational powers, as well as visually communicate your ideas to others. Design projects are useful to stretch your problem solving abilities. And the readings and research projects are ways to learn from existing knowledge on the subject. By the end of the class, your understanding of creativity should be deeper, and your personal creativity, enhanced. \n\n", "semester": "2012B", "name": "EXPLORING CREATIVITY", "reviews": {"path": "/courses/28465/reviews", "values": [{"ratings": {"rAmountLearned": "3.75", "rDifficulty": "1.75", "rStimulateInterest": "3.50", "rRecommendMajor": "3.00", "rCourseQuality": "3.80", "rWorkRequired": "2.25", "rInstructorAccess": "3.75", "rReadingsValue": "3.50", "rRecommendNonMajor": "3.50", "rCommAbility": "3.50", "rInstructorQuality": "3.80"}, "section": {"name": "EXPLORING CREATIVITY", "sectionnum": "910", "primary_alias": "URBS-421-910", "path": "/courses/28465/sections/910", "id": "28465-910", "aliases": ["URBS-421-910"]}, "comments": "", "num_students": 8, "path": "/courses/28465/sections/910/reviews/1195-RICHARD-WAYNE-BERMAN", "instructor": {"path": "/instructors/1195-RICHARD-WAYNE-BERMAN", "first_name": "RICHARD WAYNE", "last_name": "BERMAN", "id": "1195-RICHARD-WAYNE-BERMAN", "name": "RICHARD WAYNE BERMAN"}, "num_reviewers": 5, "id": "28465-910-1195-RICHARD-WAYNE-BERMAN"}]}, "credits": null, "primary_alias": "URBS-421", "path": "/courses/28465", "sections": {"path": "/courses/28465/sections", "values": [{"name": "EXPLORING CREATIVITY", "sectionnum": "910", "primary_alias": "URBS-421-910", "path": "/courses/28465/sections/910", "id": "28465-910", "aliases": ["URBS-421-910"]}]}, "id": 28465, "aliases": ["URBS-421"]}