[{"ratings": {"rAmountLearned": "1.44", "rDifficulty": "2.65", "rStimulateInterest": "1.22", "rRecommendMajor": "2.01", "rCourseQuality": "1.42", "rWorkRequired": "2.31", "rInstructorAccess": "1.62", "rReadingsValue": "1.17", "rRecommendNonMajor": "1.08", "rCommAbility": "1.54", "rInstructorQuality": "1.76"}, "section": {"name": "EARTH THROUGH TIME", "sectionnum": "001", "primary_alias": "GEOL-125-001", "path": "/courses/15822/sections/001", "id": "15822-001", "aliases": ["GEOL-125-001"]}, "comments": "This course explores the origin of Earth, continents, and life, as well as continental movements, changing climates, and evolving life. GEOL-125 fulfills the Physical World Sector for all classes. &#8232;&#8232;\r\n\r\nGenerally, students found the course content to be uninteresting and fairly boring. One student complained that this course was “less about geology, and more about various semi-related topics.”\r\n\r\nThe most common criticism of Professor Pfefforkorn was his inaccessibility outside of the classroom. Many students also complained about the professor not making his lecture slides accessible outside of class, as well as making it difficult to make up missed classes. Students also said that Professor Pfefforkorn’s lectures were often poorly organized, and thus sometimes difficult to follow. &#8232;&#8232;\r\n\r\nThe exams for this course were described as being “too difficult”; as a result of the lack of communication between professor and student, many students finished the course without any idea of their expected grades. The vast majority of students who took this course did so to fulfill sector requirements, were not interested in geology and finished the course without any greater level of interest in the field.", "num_students": 131, "path": "/courses/15822/sections/001/reviews/568-HERMANN-W-PFEFFERKORN", "instructor": {"path": "/instructors/568-HERMANN-W-PFEFFERKORN", "first_name": "HERMANN W", "last_name": "PFEFFERKORN", "id": "568-HERMANN-W-PFEFFERKORN", "name": "HERMANN W PFEFFERKORN"}, "num_reviewers": 124, "id": "15822-001-568-HERMANN-W-PFEFFERKORN"}]