{"coursehistories": {"path": "/coursehistories/1839"}, "description": "Analyzes financial problems corporations face that result from operating in an international environment. Major topics covered are corporate strategy and the decision to invest abroad, forecasting exchange rates, international portfolio diversification, managing exchange risk, taxation issues, cost of capital and financial structure in the multinational firm, and sources of financing. \n\n", "semester": "2011A", "name": "INTERNATIONAL CORP FINAN", "reviews": {"path": "/courses/21722/reviews", "values": [{"ratings": {"rAmountLearned": "2.53", "rDifficulty": "2.63", "rStimulateInterest": "2.05", "rRecommendMajor": "2.58", "rCourseQuality": "2.55", "rWorkRequired": "3.26", "rInstructorAccess": "3.16", "rReadingsValue": "2.53", "rRecommendNonMajor": "2.05", "rCommAbility": "2.58", "rInstructorQuality": "2.64"}, "section": {"name": "INTERNATIONAL CORP FINAN", "sectionnum": "001", "primary_alias": "FNCE-208-001", "path": "/courses/21722/sections/001", "id": "21722-001", "aliases": ["FNCE-208-001"]}, "comments": "This course analyzes financial problems corporations face that result from operating in an international environment. Major topics covered are corporate strategy and the decision to invest abroad, forecasting exchange rates, international portfolio diversification, managing exchange risk, taxation issues, cost of capital and financial structure in the multinational firm, and sources of financing. The course begins by asking how are exchange rates and financial markets related – by arbitrage and by equilibrium pricing relationships, and how can foreign exchange risk be hedged. Then the focus shifts to longer-term issues of international corporate finance. Key corporate financial issues are explored including exchange rate exposure, taxation, securities pricing, the cost of capital, and the evaluation of foreign projects. A thorough knowledge of FNCE 601/100 is assumed. &#8232;&#8232;Students overall found this course to be “enjoyable”. Students found the material and case studies to be “instructive” and that the class began at a “good pace.” However, students commented that in the latter part of the course assumed prior finance knowledge. Some students also appreciated the fact that physical attendance in the lecture was not required. &#8232;&#8232;Students commented that Professor Lewis is an “excellent professor” who is “always available”. Students agreed that Professor Lewis made a point to make sure that all students understand the material. &#8232;&#8232;Overall, students claimed to have “learned lots” from this course. However, some students remarked that “there are way too many cases” and that the class “requires way too much work from week to week.” &#8232;*Seven students submitted written reviews for this course.", "num_students": 25, "path": "/courses/21722/sections/001/reviews/4175-KAREN-KAY-LEWIS", "instructor": {"path": "/instructors/4175-KAREN-KAY-LEWIS", "first_name": "KAREN KAY", "last_name": "LEWIS", "id": "4175-KAREN-KAY-LEWIS", "name": "KAREN KAY LEWIS"}, "num_reviewers": 23, "id": "21722-001-4175-KAREN-KAY-LEWIS"}]}, "credits": null, "primary_alias": "FNCE-208", "path": "/courses/21722", "sections": {"path": "/courses/21722/sections", "values": [{"name": "INTERNATIONAL CORP FINAN", "sectionnum": "001", "primary_alias": "FNCE-208-001", "path": "/courses/21722/sections/001", "id": "21722-001", "aliases": ["FNCE-208-001"]}]}, "id": 21722, "aliases": ["FNCE-208"]}