{"coursehistories": {"path": "/coursehistories/4674"}, "description": "This is a graduate course in applied econometrics. Topics include multiple linear regression, the bootstrap, quantile regression, instrumental variables, maximum likelihood and probit regression. \n\n", "semester": "2010C", "name": "APPLIED ECONOMETRICS I", "reviews": {"path": "/courses/23840/reviews", "values": [{"ratings": {"rAmountLearned": "2.71", "rDifficulty": "2.37", "rStimulateInterest": "2.11", "rRecommendMajor": "3.08", "rCourseQuality": "2.57", "rWorkRequired": "2.26", "rInstructorAccess": "3.71", "rReadingsValue": "2.65", "rRecommendNonMajor": "2.34", "rCommAbility": "2.34", "rInstructorQuality": "2.57"}, "section": {"name": "APPLIED ECONOMETRICS I", "sectionnum": "001", "primary_alias": "STAT-520-001", "path": "/courses/23840/sections/001", "id": "23840-001", "aliases": ["STAT-520-001"]}, "comments": "This is primarily a statistical methodology course with an emphasis on regression-based techniques , including the simple linear model, multiple regression, ANOVA and ANCOVA, and related models for discrete choice data, including logistic regression. Regression techniques for Panel Data will also be presented. Real data sets will be used to demonstrate the methods and clarify the use of the techniques. At the end of the semester students are expected to be able to analyze a data set (quantitative or qualitative) wisely and conclude correctly. \r\n\r\nReviews of the course were very mixed. Some students praised the class, calling it a “good experience” and “overall a very good course,” while another wrote, “I am disappointed with this course due to the lectures and the amount of knowledge I have acquired.” \r\n\r\nStudents appreciated Professor Small’s base of knowledge and his well-prepared lecture notes, but many felt that his lecture style was “hard to follow” and “at times cryptic.” While the professor seemed like “a nice person,” several students agreed that he “was not a good communicator…during lecture,” and one reviewer felt that he spent too much time working with software during class. It was “all in all a good course,” one student noted, but he advised that students “take it only if [they] are actually interested in the material.” \r\n", "num_students": 45, "path": "/courses/23840/sections/001/reviews/2366-DYLAN-S--SMALL", "instructor": {"path": "/instructors/2366-DYLAN-S--SMALL", "first_name": "DYLAN S.", "last_name": "SMALL", "id": "2366-DYLAN-S--SMALL", "name": "DYLAN S. SMALL"}, "num_reviewers": 44, "id": "23840-001-2366-DYLAN-S--SMALL"}]}, "credits": null, "primary_alias": "STAT-520", "path": "/courses/23840", "sections": {"path": "/courses/23840/sections", "values": [{"name": "APPLIED ECONOMETRICS I", "sectionnum": "001", "primary_alias": "STAT-520-001", "path": "/courses/23840/sections/001", "id": "23840-001", "aliases": ["STAT-520-001"]}]}, "id": 23840, "aliases": ["STAT-520"]}