{"coursehistories": {"path": "/coursehistories/610"}, "description": "This course will examine the international politics of Europe in the 20th Century, the period during which Europe, beset by two devasting wars and the horrific experience of genocide, lost its dominant international position and was forced to adjust to a world dominated by extra-European forces. We wil examine the decline and (partial) recovery of Europe's international position with special attention to the contrast between international competition and transnational cooperation within Europe, the impact of the two World Wars, the ambivalent legacy of the Cold War, and Europe's developing role in the post-Cold War world. \n\n", "semester": "2008A", "name": "EURO INT'L REL SINCE WWI", "reviews": {"path": "/courses/20352/reviews", "values": [{"ratings": {"rAmountLearned": "3.65", "rDifficulty": "2.77", "rStimulateInterest": "3.58", "rRecommendMajor": "3.84", "rCourseQuality": "3.71", "rWorkRequired": "2.74", "rInstructorAccess": "3.65", "rReadingsValue": "3.03", "rRecommendNonMajor": "3.19", "rCommAbility": "3.79", "rInstructorQuality": "3.95"}, "section": {"name": "EURO INT'L REL SINCE WWI", "sectionnum": "001", "primary_alias": "HIST-421-001", "path": "/courses/20352/sections/001", "id": "20352-001", "aliases": ["HIST-421-001"]}, "comments": "This course examines the international politics of Europe in the 20th Century, the period during which Europe, beset by two devastating wars and the horrific experience of genocide, lost its dominant international position and was forced to adjust to a world dominated by extra-European forces. The course examines the decline and (partial) recovery of Europe\\'s international position with special attention to the contrast between international competition and transnational cooperation within Europe, the impact of the two World Wars, the ambivalent legacy of the Cold War, and Europe\\'s developing role in the post-Cold War world.\r\n\r\nMost students enjoyed this course, calling it “engaging,” “dynamic” and saying it was an “extraordinary experience.” Some students felt that the course went through material too quickly, but most were very impressed at the amount of in depth material covered in this survey course.\r\n\r\nStudents unanimously praised Professor Granieri on his “excellent lectures” that were “interesting and stimulating, even at 10 AM” and “always pleasurable to attend.” Students also commented on his “surprising accessibility” and “good sense of humor.” In the words of one student, “Professor Granieri was the only legitimately witty professor I’ve ever had.”\r\n\r\nSome students complained about the readings for the course, saying that they were “too long,” “dense,” while others felt that the readings were “interesting” and “useful.”", "num_students": 55, "path": "/courses/20352/sections/001/reviews/2180-RONALD-J--GRANIERI", "instructor": {"path": "/instructors/2180-RONALD-J--GRANIERI", "first_name": "RONALD J.", "last_name": "GRANIERI", "id": "2180-RONALD-J--GRANIERI", "name": "RONALD J. GRANIERI"}, "num_reviewers": 38, "id": "20352-001-2180-RONALD-J--GRANIERI"}]}, "credits": null, "primary_alias": "HIST-421", "path": "/courses/20352", "sections": {"path": "/courses/20352/sections", "values": [{"name": "EURO INT'L REL SINCE WWI", "sectionnum": "001", "primary_alias": "HIST-421-001", "path": "/courses/20352/sections/001", "id": "20352-001", "aliases": ["HIST-421-001"]}]}, "id": 20352, "aliases": ["HIST-421"]}