[{"ratings": {"rAmountLearned": "3.29", "rDifficulty": "3.94", "rStimulateInterest": "3.88", "rRecommendMajor": "3.59", "rCourseQuality": "3.15", "rWorkRequired": "3.12", "rInstructorAccess": "3.94", "rReadingsValue": "3.24", "rRecommendNonMajor": "1.41", "rCommAbility": "3.18", "rInstructorQuality": "3.80"}, "section": {"name": "MATH MDLNG APPL IN FNCE", "sectionnum": "701", "primary_alias": "OPIM-653-701", "path": "/courses/27968/sections/701", "id": "27968-701", "aliases": ["OPIM-653-701"]}, "comments": "In this course, models for hedging, asset allocation, and multi-period portfolio planning are developed, implemented, and tested. In addition, pricing models for options, bonds, mortgage-backed securities, and other derivatives are studied. The models typically require the tools of statistics, optimization, and/or simulation, and they are implemented in spreadsheets or a high-level modeling environment, MATLAB. This course is quantitative and will require extensive computer use. The objective is to provide students the necessary practical tools they will require should they choose to join the financial services industry, particularly in roles such as: derivatives, quantitative trading, portfolio management, structuring, financial engineering, risk management, etc. \r\n\r\n     Many students praised this course as “definitely worthwhile.” This course built itself “from basic concepts to real world applications and implications.” Students said the course material was “essential” and “outstanding,” and they learned a lot from this course. However, some students felt the course was very complicated and challenging, and students could easily get lost in class. They hoped the class pace could slow down a little bit and more relevant readings could be assigned.\r\n\r\n     The majority of students had nothing but high regards for Professor Katalan. Many students said Professor Katalan was their “favorite professor.” Specifically, students described Professor Katalan as “energetic” and “brilliant.” Many praised his “unparalleled passion and effort.” Students also said Professor Katalan was able to convey the course material well, and he was very willing to help the students.\r\n\r\nThis is an MBA course, and undergraduates need permission to attend this course. The course is intended for students who have strong interest in finance. Prospective students should be comfortable with quantitative methods quantitative methods, such as basic statistics and the methodologies (mathematical programming and simulation) taught in OPIM612 Business Analytics or OPIM321 Management Science (or equivalent). Students should seek permission from the instructor if the background requirements are not met.\r\n", "num_students": 33, "path": "/courses/27968/sections/701/reviews/4518-ZIV-Z-KATALAN", "instructor": {"path": "/instructors/4518-ZIV-Z-KATALAN", "first_name": "ZIV Z", "last_name": "KATALAN", "id": "4518-ZIV-Z-KATALAN", "name": "ZIV Z KATALAN"}, "num_reviewers": 20, "id": "27968-701-4518-ZIV-Z-KATALAN"}]