[{"ratings": {"rAmountLearned": "3.22", "rDifficulty": "3.13", "rStimulateInterest": "1.97", "rRecommendMajor": "3.71", "rCourseQuality": "2.74", "rWorkRequired": "3.43", "rInstructorAccess": "2.77", "rReadingsValue": "2.38", "rRecommendNonMajor": "2.33", "rCommAbility": "2.40", "rInstructorQuality": "2.33"}, "section": {"name": "PROG LANG & TECH I", "sectionnum": "001", "primary_alias": "CIS-120-001", "path": "/courses/27149/sections/001", "id": "27149-001", "aliases": ["CIS-120-001"]}, "comments": "A fast-paced introduction to the fundamental concepts of programming and software design. This course assumes some previous (non-language specific) programming experience, at the level of a high school computer science class or CIS110 (for instance Java, C, C++, VB, Python, Perl, or Scheme). Students who have never programmed before should take CIS 110 first.\r\n\r\nMost students felt that the overall quality of this course was very high, although some had suggestions for the organization. While some felt that it was “well-structured,” others had problems with the emphasis on the homeworks. Many felt that this aspect of the course “was very well-organized.”\r\n\r\nBecause of the emphasis placed on the homework, not many students addressed the quality of Professor Weirich’s teaching. One student noted that Professor Weirich’s “main functionality was preparing a basic structure for the course and answering questions.” The same student also noticed that the TA’s taught a lot of the material and that “I’m 10x the programmer now than I was when I started.”\r\n\r\nMany students noted that this course was difficult. One student described it as “ridiculously difficult for people without significant CS backgrounds.” Another student noted that the “work to value ratio [is] too high,” but another pointed out that it was “practical information” learned.\r\n", "num_students": 145, "path": "/courses/27149/sections/001/reviews/1820-STEPHANIE-WEIRICH", "instructor": {"path": "/instructors/1820-STEPHANIE-WEIRICH", "first_name": "STEPHANIE", "last_name": "WEIRICH", "id": "1820-STEPHANIE-WEIRICH", "name": "STEPHANIE WEIRICH"}, "num_reviewers": 123, "id": "27149-001-1820-STEPHANIE-WEIRICH"}]