{"coursehistories": {"path": "/coursehistories/5042"}, "description": "Just the thought of almost 4 billion people rising out of poverty and a billion of them them expected to be millionaires is exhilarating and daunting. But there is no single blue print for economic development, at least not yet. Given its natural resources, ideology, politics and cultural sensibilities, each nation experiments with various strategies of development. All we know at this point is that land reform, education, good governance, health, an access to technology and an open economy contribute heavily towards development. This course will offer the history and implications of socio-economic development in Asia. We will look at the theories of development, their applications and the results on the various nations in China and South Asia. Managing development is also a critical issue. We will examine if social development is a linear outcome of economic growth. We will also analyze topics such as democracy, equity, education, micro-finance, poverty, religions and value systems, sustainable development, intellectual property rights, issues of public health including pandemics and the effect of a rising Asia on the Asian Diaspora, especially on the Asian Americans. In the course of a socio- economic development, China and India are bidding for a world seat. \n\nThough India and Pakistan talk of an attitudinal shift towards each other they still have armies facing one another across Kashmir. Bangladesh has severe economic and political problems that affect its policies regarding India and Pakistan. And, each of these nations have internal problems of their own. There are no pre-requisite courses for this class but we will require an open mind, a liking for critical analysis and developmental issues. \n\n", "semester": "2011A", "name": "RIVALS IN A RISING ASIA", "reviews": {"path": "/courses/22413/reviews", "values": [{"ratings": {"rAmountLearned": "2.10", "rDifficulty": "1.62", "rStimulateInterest": "2.14", "rRecommendMajor": "3.00", "rCourseQuality": "2.34", "rWorkRequired": "1.70", "rInstructorAccess": "3.33", "rReadingsValue": "2.19", "rRecommendNonMajor": "2.48", "rCommAbility": "2.57", "rInstructorQuality": "2.93"}, "section": {"name": "RIVALS IN A RISING ASIA", "sectionnum": "301", "primary_alias": "SAST-280-301", "path": "/courses/22413/sections/301", "id": "22413-301", "aliases": ["SAST-280-301"]}, "comments": "", "num_students": 35, "path": "/courses/22413/sections/301/reviews/1276-SRILATA-GANGULEE", "instructor": {"path": "/instructors/1276-SRILATA-GANGULEE", "first_name": "SRILATA", "last_name": "GANGULEE", "id": "1276-SRILATA-GANGULEE", "name": "SRILATA GANGULEE"}, "num_reviewers": 32, "id": "22413-301-1276-SRILATA-GANGULEE"}]}, "credits": null, "primary_alias": "SAST-280", "path": "/courses/22413", "sections": {"path": "/courses/22413/sections", "values": [{"name": "RIVALS IN A RISING ASIA", "sectionnum": "301", "primary_alias": "SAST-280-301", "path": "/courses/22413/sections/301", "id": "22413-301", "aliases": ["SAST-280-301"]}]}, "id": 22413, "aliases": ["SAST-280"]}