{"coursehistories": {"path": "/coursehistories/1078"}, "description": "Spanish for the Professions is designed to provide advanced-level language students with a wide-ranging technical vocabulary and the enhancement of solid communicative skills within the cultural context of several developing Latin American countries. Focusing on topics such as politics, economy, society, health, environment, education, science and technology, the class will explore the realities and underlying challenges facing Latin America. Through essays, papers, articles, research, discussions, case studies, and videotapes, we shall take an in-depth look at the dynamics of Latin American societies. The course will focus on--but not be restricted to--Mexico, Cuba and Argentina. \n\n", "semester": "2009C", "name": "SP FOR PROFESSIONS I", "reviews": {"path": "/courses/18095/reviews", "values": [{"ratings": {"rInstructorRapport": "3.88", "rTAQuality": "3.50", "rAbilitiesChallenged": "3.75", "rInstructorAttitude": "3.88", "rHomeworkValuable": "3.63", "rReadingsValue": "3.75", "rInstructorConcern": "3.75", "rCourseQuality": "3.50", "rClassPace": "1.88", "rExamsConsistent": "3.75", "rInstructorAccess": "3.50", "rGradeFairness": "3.88", "rArticulateGoals": "3.38", "rOralSkills": "3.88", "rNativeAbility": "3.63", "rInstructorQuality": "3.88", "rWorkRequired": "0.75", "rStimulateInterest": "3.75", "rInstructorEffective": "4.00", "rSkillEmphasis": "3.88"}, "section": {"name": "SP FOR PROFESSIONS I", "sectionnum": "301", "primary_alias": "SPAN-215-301", "path": "/courses/18095/sections/301", "id": "18095-301", "aliases": ["SPAN-215-301"]}, "comments": "Spanish for professions is designed to provide advanced-level language students with a wide-ranging technical vocabulary and the enhancement of solid communicative skills within the cultural context of several developing Latin American countries. Focusing on topics such as politics, economy, society, health, environment, education, science and technology, the class explores the realities and underlying challenges facing Latin America. The course focuses on but is not restricted to, Mexico, Cuba and Argentina.&#8232;\r\n&#8232;Students said this was a “great” course.&#8232;\r\nStudents described Professor Carlo as brilliant” and “fascinating.” They praised the depth of his knowledge, citing his frequent references to the Hebrew, Greek, and Latin origins of Spanish words as an example of his expertise. One student called him “the best teacher I’ve ever had.”\r\n &#8232;&#8232;A prerequisite of this course is successful completion of SPAN 202, though one student suggests that “a background in Latin American history would be helpful.” Coursework includes writing papers, reading articles, performing research, discussions, and examining case studies.\r\n", "num_students": 8, "path": "/courses/18095/sections/301/reviews/3505-SENEN-E--CARLO", "instructor": {"path": "/instructors/3505-SENEN-E--CARLO", "first_name": "SENEN E.", "last_name": "CARLO", "id": "3505-SENEN-E--CARLO", "name": "SENEN E. CARLO"}, "num_reviewers": 8, "id": "18095-301-3505-SENEN-E--CARLO"}]}, "credits": null, "primary_alias": "SPAN-215", "path": "/courses/18095", "sections": {"path": "/courses/18095/sections", "values": [{"name": "SP FOR PROFESSIONS I", "sectionnum": "301", "primary_alias": "SPAN-215-301", "path": "/courses/18095/sections/301", "id": "18095-301", "aliases": ["SPAN-215-301"]}]}, "id": 18095, "aliases": ["SPAN-215"]}