[{"ratings": {"rAmountLearned": "3.35", "rDifficulty": "2.96", "rStimulateInterest": "3.46", "rRecommendMajor": "3.58", "rCourseQuality": "3.27", "rWorkRequired": "2.96", "rInstructorAccess": "3.15", "rReadingsValue": "3.20", "rRecommendNonMajor": "2.69", "rCommAbility": "3.42", "rInstructorQuality": "3.57"}, "section": {"name": "CITIES & TRANS SYSTEMS", "sectionnum": "001", "primary_alias": "ESE-555-001", "path": "/courses/26005/sections/001", "id": "26005-001", "aliases": ["ESE-555-001"]}, "comments": "Transportation systems operations; concepts, scheduling and analyses. Applications of operations research methods. Rail and bus networks, lines, branches and feeders. Timed transfer system. Fares, other revenues and costs. Organization and management. Transit planning methodology; comparison of modes. Transit financing and policy. Urban transportation problems in developed and developing countries: their origins, causes and solutions. Definition and implementation of optimal role of cars, transit, bicycles and pedestrians in cities. Balanced transportation and livable cities. Field trip.\r\n\r\nStudents thought that the course was extremely informative and interesting. For many, the highlight was the field trip to New York to discuss different forms of transit, “very helpful in practically seeing everything that was taught in class”. Some felt that the course covered way too much, with a need for “less material and more emphasis on select topics”. Little time was spent in lecture on the “numerical, qualitative aspects”, which were more difficult than the general concepts covered and “already clear from the readings”.\r\n\r\nProfessor Vuchic received high praise from students. Many said that it was “an honor and a privilege” to take his course right before he retired. He was described as “extremely experienced and knowledgeable” and passionate, and his “international interest” on the subject “added a lot of depth to the course”.\r\n\r\nA few students commented on the difficulty of the course, saying the other “half of the class had immense knowledge on the course materials”. ", "num_students": 35, "path": "/courses/26005/sections/001/reviews/1173-VUKAN-R-VUCHIC", "instructor": {"path": "/instructors/1173-VUKAN-R-VUCHIC", "first_name": "VUKAN R", "last_name": "VUCHIC", "id": "1173-VUKAN-R-VUCHIC", "name": "VUKAN R VUCHIC"}, "num_reviewers": 31, "id": "26005-001-1173-VUKAN-R-VUCHIC"}]