[{"ratings": {"rAmountLearned": "2.73", "rDifficulty": "2.12", "rStimulateInterest": "2.27", "rRecommendMajor": "2.97", "rCourseQuality": "2.45", "rWorkRequired": "2.12", "rInstructorAccess": "2.58", "rReadingsValue": "2.39", "rRecommendNonMajor": "2.03", "rCommAbility": "2.58", "rInstructorQuality": "2.58"}, "section": {"name": "PERCEPTION", "sectionnum": "401", "primary_alias": "PSYC-111-401", "path": "/courses/25029/sections/401", "id": "25029-401", "aliases": ["PSYC-111-401", "VLST-211-401"]}, "comments": "Psychology 111 focuses highly on how we interact with our world in daily life. It focuses on how the individual acquires and is guided by knowledge about objects and events in their environment. The course is heavily science based, though tries to make the material as manageable as possible. It applies to both the psychology major and minor, as well as visual studies majors and minors.  \r\n\r\nIn general students found this course exciting and stimulating. Many agreed that the material, as well as the layout of the course, was “enjoyable” and “interesting.” It was viewed overall as an “excellent” class. One student raved about the applicability of the course to everyday life because of its attention to the interaction between mind and mathematics. It was one student’s “favorite psychology class taken at Penn.” \r\n\r\nProfessor Stocker was well liked and respected by students. He was very accessible outside of class and was incredibly helpful during office hours. He gives small assignments each week to keep students on track, but students complained that Professor Stocker never posts answers online. Overall, Professor Stocker was viewed as kind, engaging, and able to stimulate interest in the material, which helped students stay motivated in class throughout the semester. \r\n\r\nThis class comes recommended almost unanimously. The workload was reported to be small and the grading forgiving. The only prerequisite is PSYC 001. \r\n", "num_students": 54, "path": "/courses/25029/sections/401/reviews/4966-ALAN-A--STOCKER", "instructor": {"path": "/instructors/4966-ALAN-A--STOCKER", "first_name": "ALAN A.", "last_name": "STOCKER", "id": "4966-ALAN-A--STOCKER", "name": "ALAN A. STOCKER"}, "num_reviewers": 43, "id": "25029-401-4966-ALAN-A--STOCKER"}]