{"coursehistories": {"path": "/coursehistories/4197"}, "description": "This course focuses on the challenges encountered in building Internet and web systems: scalability, interoperability (of data and code), security and fault tolerance, consistency models, and location of resources, services, and data. We will examine how XML standards enable information exchange; how web services support cross-platform interoperability (and what their limitations are); how to build high-performance application servers; how \"cloud computing\" services work; how to perform Akamai-like content distribution; and how to provide transaction support in distributed environments. We will study techniques for locating machines, resources, and data (including directory systems, information retrieval indexing, ranking, and web search); and we will investigate how different architectures support scalability (and the issues they face). We will also examine ideas that have been proposed for tomorrow's Web, and we will see some of the challenges, research directions, and potential pitfalls. An important goal of the course is not simply to discuss issues and solutions, but to provide hands-on experience with a substantial implementation project. \n\nThis semester's project will be a peer-to-peer implementation of a Googe-style search engine, including distributed, scalable crawling; indexing with ranking; and even PageRank. As a side-effect of the material of this course you will learn about some aspects of large-scale software development assimilating large APIs. \n\n", "semester": "2012A", "name": "INTERNET & WEB SYSTEMS", "reviews": {"path": "/courses/27165/reviews", "values": [{"ratings": {"rAmountLearned": "3.69", "rDifficulty": "3.62", "rTAQuality": "2.73", "rStimulateInterest": "2.98", "rRecommendMajor": "3.50", "rCourseQuality": "3.45", "rWorkRequired": "3.93", "rInstructorAccess": "2.98", "rReadingsValue": "3.15", "rRecommendNonMajor": "1.26", "rCommAbility": "3.03", "rInstructorQuality": "3.19"}, "section": {"name": "INTERNET & WEB SYSTEMS", "sectionnum": "401", "primary_alias": "CIS-455-401", "path": "/courses/27165/sections/401", "id": "27165-401", "aliases": ["CIS-455-401", "CIS-555-401"]}, "comments": "This course focuses on the challenges encountered in building Internet and web systems: scalability, interoperability (of data and code), security and fault tolerance, consistency models, and location of resources, services, and data. The course examines how XML standards enable information exchange; how web services support cross-platform interoperability (and what their limitations are); how to build high-performance application servers; how \"cloud computing\" services work; how to perform Akamai-like content distribution; and how to provide transaction support in distributed environments. The class will study techniques for locating machines, resources, and data (including directory systems, information retrieval indexing, ranking, and web search); and the class will investigate how different architectures support scalability (and the issues they face). The course will also examine ideas that have been proposed for tomorrow's web, and we will see some of the challenges, research directions, and potential pitfalls. An important goal of the course is not simply to discuss issues and solutions, but to provide hands-on experience with a substantial implementation project. \r\n           \t\r\nThis course is about system design and development. A student commented on how this course could be split into two sections- “scalable web systems” and “internet systems.” Many different topics are covered in this course and some students desired more time to focus on certain topics, while encountering less breadth. Students remarked that homework descriptions were often very vague.\r\n\r\nProf. Haeberlen received high marks as being an expert in the subject matter.  Students highly recommended seeing the professor or TA’s during office hours for homework assistance. Students wish there was a more defined rubric for homework grading and that that homework was weighted heavier than 25% of the total grade since it required an immense amount of time and effort.\r\n\r\nThis class is intended for upper level undergraduate students and graduate students. The graduate level version of this course is CIS 555. Strong Java programming skills along with familiarity with threads and concurrency were listed as prerequisite for this class. Students reported a very high workload and tough assignments for this class, which came with high academic payoff.  Description of this course ranged from “the hardest class I ever took at Penn,” “2.0 credits worth of work, and “the most useful course I’ll ever take.” Students extremely recommended this course but only for computer science majors.\r\n", "num_students": 88, "path": "/courses/27165/sections/401/reviews/5319-ANDREAS-HAEBERLEN", "instructor": {"path": "/instructors/5319-ANDREAS-HAEBERLEN", "first_name": "ANDREAS", "last_name": "HAEBERLEN", "id": "5319-ANDREAS-HAEBERLEN", "name": "ANDREAS HAEBERLEN"}, "num_reviewers": 64, "id": "27165-401-5319-ANDREAS-HAEBERLEN"}]}, "credits": null, "primary_alias": "CIS-455", "path": "/courses/27165", "sections": {"path": "/courses/27165/sections", "values": [{"name": "INTERNET & WEB SYSTEMS", "sectionnum": "401", "primary_alias": "CIS-455-401", "path": "/courses/27165/sections/401", "id": "27165-401", "aliases": ["CIS-455-401", "CIS-555-401"]}]}, "id": 27165, "aliases": ["CIS-455", "CIS-555"]}