[{"ratings": {"rAmountLearned": "3.28", "rDifficulty": "3.17", "rStimulateInterest": "3.50", "rRecommendMajor": "3.50", "rCourseQuality": "3.48", "rWorkRequired": "3.50", "rInstructorAccess": "3.50", "rReadingsValue": "3.33", "rRecommendNonMajor": "3.50", "rCommAbility": "3.59", "rInstructorQuality": "3.61"}, "section": {"name": "LITERATURE OF SUCCESS: Literature of Success: Ethical and Historical Perspectives", "sectionnum": "001", "primary_alias": "LGST-227-001", "path": "/courses/27668/sections/001", "id": "27668-001", "aliases": ["LGST-227-001"]}, "comments": "LGST 227 explores the history, literature, and philosophy of two age-old questions: what does it mean to be successful and how does one achieve this elusive goal? It surveys some of the classics of the \"success\" genre - from Benjamin Franklin's Autobiography in the 18th century to Dale Carnegie's How to Win Friends and Influence People and Marcus Buckingham's Now, Discover Your Strengths in the 20th and 21st centuries. Case studies of remarkable achievements in business and society and Arthur Miller's play Death of a Salesman provide additional contexts within which to reflect on the questions at the center of the course. Students will keep a personal journal and use web-based tools to examine their own character strengths, talents, and achievement orientations. Grading is based on class attendance and participation, reading response papers, personal journals on assigned topics involving self reflection, a mid-term paper on an assigned research subject related to success, and a final, longer paper exploring, based on course readings and original research, each students personal philosophy of success. There is no final exam for this course.\r\n\r\nOverall, students found that this was a “great class to take, regardless of school or major.” Students found that the course “is well structured and it is easy to understand what you are taking away each week.” One student noted that it “should be required for every senior at Penn.” Students observed that there was a lot of “sharing and discussing very personal and meaningful thoughts, feelings and stories with the rest of the class” and that it was “highly-discussion based.” \r\n\r\nMost students found that Professor Shell is “an amazing teacher” and his “knowledge of content is extraordinary.” One student noted that Professor Shell “balances the act of leading and promoting discussions well” while he “urges you to explore what you want to get out of life and how you’re going to get there.” Students thought that Professor Shell had high expectations for his students, which they noted as a positive attribute. \r\n\r\n\tMany students found that this class was “not an easy A” and that the class was “curved because it was simply a Wharton class.” Some students found that they did not like the reading, but found that the “reading is critical” to the course. Other students found that the “participation represents a high portion of the grade,” which they did not like. Another student suggested that the “manner in which the class is being graded should be reviewed.” This course is sometimes listed as a Benjamin Franklin Seminar, and it has no prerequisites. It is open to all students in all schools. \r\n", "num_students": 23, "path": "/courses/27668/sections/001/reviews/2191-G-RICHARD-SHELL", "instructor": {"path": "/instructors/2191-G-RICHARD-SHELL", "first_name": "G RICHARD", "last_name": "SHELL", "id": "2191-G-RICHARD-SHELL", "name": "G RICHARD SHELL"}, "num_reviewers": 23, "id": "27668-001-2191-G-RICHARD-SHELL"}]