{"coursehistories": {"path": "/coursehistories/1408"}, "description": "The atomic structure of condensed matter is dependent upon temperature, pressure, thermal history and other variables. In this course, the science of such structural transitions is treated. The topics discussed include introduction to statistical mechanics, theory of nucleation and growth kinetics, solidification, diffusionless solid state transformations, and microscopic theory of phase transition. \n\n", "semester": "2011A", "name": "PHASE TRANSFORMATION", "reviews": {"path": "/courses/22112/reviews", "values": [{"ratings": {"rAmountLearned": "2.81", "rDifficulty": "3.56", "rStimulateInterest": "2.56", "rRecommendMajor": "3.19", "rCourseQuality": "2.88", "rWorkRequired": "3.31", "rInstructorAccess": "3.69", "rReadingsValue": "2.88", "rRecommendNonMajor": "1.31", "rCommAbility": "2.94", "rInstructorQuality": "3.25"}, "section": {"name": "PHASE TRANSFORMATION", "sectionnum": "001", "primary_alias": "MSE-540-001", "path": "/courses/22112/sections/001", "id": "22112-001", "aliases": ["MSE-540-001"]}, "comments": "The various topics covered in this course include: Mathematical modeling of mechanical design problems for optimization. Highlights and overview of optimization methods: unconstrained optimization, unidirectional search techniques, gradient, conjugate direction, and Newton methods. Constrained optimization. KKT optimality conditions, penalty formulations, augmented Lagrangians, and others. SLP and SQP and other approximate techniques for solving practical design problems. Monotonicity analysis and modeling of optimal design problems. Optimization of structural elements including shape and topology synthesis. Variational formulation of distributed and discrete parameter structures. Design criteria for stiffness and strength. Design sensitivity analysis. This course will also include computer programs to implement the algorithms discussed and solve realistic design problems.&#8232;&#8232;Students generally described the course as “very good overall.” Students liked the fact that the professor “tied concepts into published papers” because it “[helped] them remember the material.” Students also said that the course covered a “lot of material” and that it was taught relatively quickly.&#8232;&#8232;Professor Li received mixed reviews. Many students felt that his course notes were “very helpful, well written, and organized.” He was also described as being fairly helpful. However, students complained that his classes consistently ran over time, sometimes running “over by 40 minutes.” &#8232;&#8232;In general, students enjoyed the course, but they complained that there was too much information in the lectures. This course was recommended for majors only.", "num_students": 17, "path": "/courses/22112/sections/001/reviews/4458-JU-LI", "instructor": {"path": "/instructors/4458-JU-LI", "first_name": "JU", "last_name": "LI", "id": "4458-JU-LI", "name": "JU LI"}, "num_reviewers": 16, "id": "22112-001-4458-JU-LI"}]}, "credits": null, "primary_alias": "MSE-540", "path": "/courses/22112", "sections": {"path": "/courses/22112/sections", "values": [{"name": "PHASE TRANSFORMATION", "sectionnum": "001", "primary_alias": "MSE-540-001", "path": "/courses/22112/sections/001", "id": "22112-001", "aliases": ["MSE-540-001"]}]}, "id": 22112, "aliases": ["MSE-540"]}