[{"ratings": {"rAmountLearned": "3.14", "rDifficulty": "2.60", "rStimulateInterest": "3.27", "rRecommendMajor": "3.13", "rCourseQuality": "3.07", "rWorkRequired": "2.80", "rInstructorAccess": "3.67", "rReadingsValue": "3.20", "rRecommendNonMajor": "3.00", "rCommAbility": "3.27", "rInstructorQuality": "3.27"}, "section": {"name": "BUSINESS POLICY", "sectionnum": "001", "primary_alias": "MGMT-423-001", "path": "/courses/24748/sections/001", "id": "24748-001", "aliases": ["MGMT-423-001"]}, "comments": "Management 423 is part of the Wharton Program for Working Professionals. This course studies the application of decision processes to practical business situations, using perspectives gained in previous BECP courses. The formulation of strategy and policy at executive levels is examined using case studies and action learning, in which \r\nclassroom theory is applied to participants' real-world business challenges.\r\n\r\nThough students found this course to be “informative” and “rewarding,” they also found it to be somewhat disorganized. Efforts to pull students’ real-world experiences into the context of the class often resulted in off-topic discussions, which eroded the structure of the course. Overall, students found the course to be interesting. However, they thought the disorganization of the course did not allow them to learn to their fullest potential. Students found the class to be somewhat challenging, and disliked the group projects because there was no member evaluations to prevent individual students from dodging responsibility. The expectations for the final group project were unclear, and confused most students. Many enjoyed the assigned readings and they reported that enough time was devoted to readings in class.\r\n\r\nThough students applauded Professor Pauker-Kreitzberg’s knowledge and insight, most were annoyed at her laxness in returning grades. At the point when the reviews were written, students had not received any grades back for the course, which left them unsure of how they stood in the course, and made it difficult to improve throughout the course. Additionally, though some students greatly enjoyed class discussions, the majority of students complained that Professor Pauker-Kreitzberg allowed a few students to run the discussions with unrelated outbursts. As one student summarized, “topics that should have been interesting and educational for everybody were watered down by distracting and unrelated anecdotes, which were continually voiced by the same small group of students.” They also reported that although they appreciated her easy-going attitude, she sometimes appeared “unprepared for the class” and acted more as a “facilitator” than an instructor. However, students enjoyed her case-study approach and her encouragement to think about material. They also found her to be extremely accessible for additional help. \r\n\r\nStudents were not able to evaluate their performance in the course because no graded assignments had been returned, which put them at a disadvantage going into the final. \r\n", "num_students": 18, "path": "/courses/24748/sections/001/reviews/2378-ANNE-PAUKER-KREITZBERG", "instructor": {"path": "/instructors/2378-ANNE-PAUKER-KREITZBERG", "first_name": "ANNE", "last_name": "PAUKER-KREITZBERG", "id": "2378-ANNE-PAUKER-KREITZBERG", "name": "ANNE PAUKER-KREITZBERG"}, "num_reviewers": 15, "id": "24748-001-2378-ANNE-PAUKER-KREITZBERG"}]