[{"ratings": {"rAmountLearned": "2.85", "rDifficulty": "3.03", "rStimulateInterest": "2.94", "rRecommendMajor": "3.44", "rCourseQuality": "2.79", "rWorkRequired": "2.71", "rInstructorAccess": "2.91", "rReadingsValue": "3.35", "rRecommendNonMajor": "2.36", "rCommAbility": "3.21", "rInstructorQuality": "3.26"}, "section": {"name": "LITERATURE BEFORE 1660", "sectionnum": "001", "primary_alias": "ENGL-020-001", "path": "/courses/17228/sections/001", "id": "17228-001", "aliases": ["ENGL-020-001"]}, "comments": "This course introduces students to key works of English literature written before 1660. It explores the major literary genres of this period, as well as the social and cultural contexts in which they were produced. The course examines how literature texts articulate changes in language and form, as well as in concepts of family, nation, and community during the medieval and early modern periods.\r\n\r\nStudents who have taken this course have reported learning a lot from it. One senior commented, “I count it among my top 5 favorite learning experiences at Penn.” Students enjoyed the “elements of history and culture” sprinkled into the class “that gave the material additional richness and depth,” and also appreciated the multimedia clips that often supplemented the text.\r\n\r\nProfessor Wallace received rave reviews from his students, who described him as “an excellent professor,” as well as “very informative and knowledgeable.” Students add that Professor Wallace made learning the subject matter fun and enjoyable, and they appreciated his teaching style: “He discussed the material with us rather than lecturing at us” and “engaged the entire room in creative ways.” Most students agreed that “the TAs gave him a run for his money in terms of enthusiasm and intelligence” and their help outside of class.\r\n\r\nThis course is ideal for English majors, and it fulfills two of the major’s requirements. \r\n", "num_students": 43, "path": "/courses/17228/sections/001/reviews/1399-DAVID-J--WALLACE", "instructor": {"path": "/instructors/1399-DAVID-J--WALLACE", "first_name": "DAVID J.", "last_name": "WALLACE", "id": "1399-DAVID-J--WALLACE", "name": "DAVID J. WALLACE"}, "num_reviewers": 40, "id": "17228-001-1399-DAVID-J--WALLACE"}]