{"coursehistories": {"path": "/coursehistories/2515"}, "description": "This course has two parts. The first looks at market and government failures and discusses the need for public policies as well as limits to their effectiveness including the evaluation of public projects using cost benefit analysis. The second part focuses on the economic analysis of taxation, including the economic incidence and efficiency of taxes. \n\n", "semester": "2010C", "name": "PUBLIC FINANCE", "reviews": {"path": "/courses/22931/reviews", "values": [{"ratings": {"rAmountLearned": "3.22", "rDifficulty": "2.22", "rStimulateInterest": "3.37", "rRecommendMajor": "3.70", "rCourseQuality": "3.31", "rWorkRequired": "2.30", "rInstructorAccess": "3.59", "rReadingsValue": "2.67", "rRecommendNonMajor": "2.78", "rCommAbility": "3.26", "rInstructorQuality": "3.45"}, "section": {"name": "PUBLIC FINANCE", "sectionnum": "001", "primary_alias": "ECON-231-001", "path": "/courses/22931/sections/001", "id": "22931-001", "aliases": ["ECON-231-001"]}, "comments": "The main goal of this class is to develop a set of tools for analyzing the role that government plays in the economy and the lives of its citizens. In particular, this class considers some reasons for government intervention in a market economy and study the impact of government expenditure programs and taxation systems on the welfare and behavior of its citizens. The course will cover a wide range of issues in public finance with a focus on current policy debates and issues. Topics covered will include the common use of natural resources, the environment, public goods, education, health care policy, social security, public assistance program, and taxation.\r\n\r\nStudents described this course as “fantastic,” and “one of the best Economics classes at Penn.” Students found it well-constructed; challenging, but rewarding. \r\n\r\nProfessor Fang is lauded as a “great professor” who “always has his students’ interests in mind.” Students appreciated his willingness to discuss questions and concerns about homework and tests, and found him to be “extremely accessible.”\r\n\r\nThe requirements for this course are Econ 101, Math 104, and Math 114 or 115. Econ 103 is recommended. Credit will not be given for both Econ 030 and Econ 231. The grade for the course was based on four problem sets, a paper, a midterm, and a final. Students felt well prepared for the final exam by the practice problems. Students recommend this course to anyone interested in economics.\r\n", "num_students": 32, "path": "/courses/22931/sections/001/reviews/5607-HANMING-FANG", "instructor": {"path": "/instructors/5607-HANMING-FANG", "first_name": "HANMING", "last_name": "FANG", "id": "5607-HANMING-FANG", "name": "HANMING FANG"}, "num_reviewers": 29, "id": "22931-001-5607-HANMING-FANG"}]}, "credits": null, "primary_alias": "ECON-231", "path": "/courses/22931", "sections": {"path": "/courses/22931/sections", "values": [{"name": "PUBLIC FINANCE", "sectionnum": "001", "primary_alias": "ECON-231-001", "path": "/courses/22931/sections/001", "id": "22931-001", "aliases": ["ECON-231-001"]}]}, "id": 22931, "aliases": ["ECON-231"]}