[{"ratings": {"rAmountLearned": "2.41", "rDifficulty": "2.37", "rStimulateInterest": "1.90", "rRecommendMajor": "3.06", "rCourseQuality": "2.11", "rWorkRequired": "2.07", "rInstructorAccess": "2.74", "rReadingsValue": "2.43", "rRecommendNonMajor": "1.96", "rCommAbility": "2.48", "rInstructorQuality": "2.37"}, "section": {"name": "MASS MEDIA & SOC", "sectionnum": "001", "primary_alias": "COMM-130-001", "path": "/courses/25834/sections/001", "id": "25834-001", "aliases": ["COMM-130-001"]}, "comments": "By acquainting students with the workings of American mass media as an integral part of American society, the aim of this course is to begin to consider how we might think about the legal, political, economic, historical, and “cultural” consideration that shape what we watch on TV, read in books, and stare at in billboards. The course discusses what ideas are relevant for examining the enormous changes in the mass media system and the consequences of those changes.\r\nStudents remarked that the subject matter was interesting. However, most complained that the lecture slides were “overwhelmingly dense” and could have benefited from multimedia examples of the topics being discussed. Despite the class being heavily based on textbook material, students found it difficult to prepare for the exams particularly because lecture notes were not posted online and the grading system was slightly harsh.\r\nThough Prof. Felsenthal was described by students as “nice,” the majority of the class found his teaching style to be rather lackluster. However, many students agreed that the “TA presentations and guest lecturers were interesting, informative, and were relevant to current events.”\r\nStudents warn that the lectures were fast-paced and suggest bringing a laptop to class. This course fulfills a Communications major requirement as well as the Society Sector.\r\n", "num_students": 148, "path": "/courses/25834/sections/001/reviews/5980-NORMAN-A-FELSENTHAL", "instructor": {"path": "/instructors/5980-NORMAN-A-FELSENTHAL", "first_name": "NORMAN A", "last_name": "FELSENTHAL", "id": "5980-NORMAN-A-FELSENTHAL", "name": "NORMAN A FELSENTHAL"}, "num_reviewers": 144, "id": "25834-001-5980-NORMAN-A-FELSENTHAL"}]