{"coursehistories": {"path": "/coursehistories/894"}, "description": "A continuation of PHYS 101 emphasizing an introduction to classical electricity and magnetism, relativity theory, optics, and the quantum theory of matter, requiring a background in calculus. Suggested for students in a pre-health program. \n\n", "semester": "2011A", "name": "GEN.PHYS.:EM,OPTICS,MODP: General Physics: Electromagnetism, Optics, and Modern Physics", "reviews": {"path": "/courses/22286/reviews", "values": [{"ratings": {"rAmountLearned": "2.78", "rDifficulty": "3.36", "rStimulateInterest": "2.95", "rRecommendMajor": "3.33", "rCourseQuality": "2.65", "rWorkRequired": "3.20", "rInstructorAccess": "3.29", "rReadingsValue": "2.46", "rRecommendNonMajor": "1.30", "rCommAbility": "3.28", "rInstructorQuality": "3.31"}, "section": {"name": "GEN.PHYS.:EM,OPTICS,MODP: General Physics: Electromagnetism, Optics, and Modern Physics", "sectionnum": "001", "primary_alias": "PHYS-102-001", "path": "/courses/22286/sections/001", "id": "22286-001", "aliases": ["PHYS-102-001"]}, "comments": "Part II of “General Physics,” this course offers an introduction to classical electricity and magnetism, relativity theory, optics, and the quantum theory of matter, requiring some background in calculus. Because the class is not rigorously calculus-based, it is generally suggested for pre-medical or pre-health students.\r\n\r\nOverall, students felt that the class was rewarding and offered an intuitive introduction to complex physical concepts. Because the course was designed for pre-health students, the class tested overall concepts as opposed to the rigorous math used in the course.\r\n\r\nStudents praised Professor Kikkawa as a “fantastic” instructor, and they valued his ability to “deconstruct” complex E&M concepts into more intuitive forms. Most felt that he had “effective teaching methods” and seemed to genuinely care about the class. A number of students called him the “best professor [they] have ever had at Penn.” However, some wrote that the lecture, textbook, and homework problems did not fully prepare them for the quizzes and exams.\r\n\r\nThe course demands a great deal of work as weekly quizzes force students to keep up with the material. Grades depend on performance on: one midterm; weekly quizzes that add up to the point equivalent of a midterm; and a final exam. Because the class is mostly composed of pre-health students, the curve is highly competitive.\r\n", "num_students": 134, "path": "/courses/22286/sections/001/reviews/2305-JAY-KIKKAWA", "instructor": {"path": "/instructors/2305-JAY-KIKKAWA", "first_name": "JAY", "last_name": "KIKKAWA", "id": "2305-JAY-KIKKAWA", "name": "JAY KIKKAWA"}, "num_reviewers": 115, "id": "22286-001-2305-JAY-KIKKAWA"}, {"ratings": {"rAmountLearned": "2.13", "rDifficulty": "3.11", "rStimulateInterest": "2.03", "rRecommendMajor": "1.97", "rCourseQuality": "1.77", "rWorkRequired": "2.95", "rInstructorAccess": "2.82", "rReadingsValue": "1.95", "rRecommendNonMajor": "1.22", "rCommAbility": "1.66", "rInstructorQuality": "1.93"}, "section": {"name": "General Physics: Electromagnetism, Optics, and Modern Physics", "sectionnum": "601", "primary_alias": "PHYS-102-601", "path": "/courses/22286/sections/601", "id": "22286-601", "aliases": ["PHYS-102-601"]}, "comments": "General Physics: Electromagnetism, Optics, and Modern Physics is a continuation of PHYS 101 emphasizing an introduction to classical electricity and magnetism, relativity theory, optics, and the quantum theory of matter, requiring a background in calculus. Suggested for students in a pre-health program.\r\n\r\nThe course received mixed reviews, with some students appreciating the “flow” while others finding it “not very interesting.” Some thought his lectures were unorganized and unhelpful; others “took great pleasure in class.” One student thought exams were poorly written.\r\n\r\nLikewise, Professor Martino received mixed reviews. Some found him to be very insightful and pleasant, while several students commented that he seemed “insensitive” and “mocking.” Many students wrote that he was sometimes hard to understand and that he digressed a lot. One student wrote that his teaching style “improves dramatically” when he is genuinely interested in the subject matter, while another complained that he focuses too much on theoretical knowledge rather than applications. Some thought he did not relay the material effectively and that he just repeated the textbook.\r\n\r\nOne student wrote that the course was “very difficult, mainly because it was self taught.” A prerequisite for this course is PHYS 101. Corequisites include PHYS 102 LAB. Credit is awarded for only one of the following courses: PHYS 102, PHYS 151, or PHYS 171. Students with AP or Transfer Credit for PHYS 92 or PHYS 94 who complete PHYS 102 will thereby surrender the AP or Transfer Credit. The course fulfills the Physical World Sector requirement.\r\n", "num_students": 48, "path": "/courses/22286/sections/601/reviews/5255-MATTHEW-C--MARTINO", "instructor": {"path": "/instructors/5255-MATTHEW-C--MARTINO", "first_name": "MATTHEW C.", "last_name": "MARTINO", "id": "5255-MATTHEW-C--MARTINO", "name": "MATTHEW C. MARTINO"}, "num_reviewers": 45, "id": "22286-601-5255-MATTHEW-C--MARTINO"}]}, "credits": null, "primary_alias": "PHYS-102", "path": "/courses/22286", "sections": {"path": "/courses/22286/sections", "values": [{"name": "GEN.PHYS.:EM,OPTICS,MODP: General Physics: Electromagnetism, Optics, and Modern Physics", "sectionnum": "001", "primary_alias": "PHYS-102-001", "path": "/courses/22286/sections/001", "id": "22286-001", "aliases": ["PHYS-102-001"]}, {"name": "General Physics: Electromagnetism, Optics, and Modern Physics", "sectionnum": "601", "primary_alias": "PHYS-102-601", "path": "/courses/22286/sections/601", "id": "22286-601", "aliases": ["PHYS-102-601"]}]}, "id": 22286, "aliases": ["PHYS-102"]}