[{"ratings": {"rAmountLearned": "2.81", "rDifficulty": "2.19", "rStimulateInterest": "2.97", "rRecommendMajor": "3.72", "rCourseQuality": "2.88", "rWorkRequired": "2.16", "rInstructorAccess": "3.26", "rReadingsValue": "2.22", "rRecommendNonMajor": "2.69", "rCommAbility": "3.39", "rInstructorQuality": "3.26"}, "section": {"name": "WORLD FILM HIST TO 1945", "sectionnum": "401", "primary_alias": "CINE-101-401", "path": "/courses/25782/sections/401", "id": "25782-401", "aliases": ["CINE-101-401", "ENGL-091-401", "ARTH-108-401"]}, "comments": "This course is an introduction to the history of cinema from 1895 to the present. In demonstrating how history energizes and complicates the movies, it examines numerous film cultures and historical periods, including Hollywood silent cinema, Italian neo-realism, the French New Wave, recent films from Iran, and a variety of other film movements from different historical epochs and cultures. Screenings will feature movies such as Sergei Eisenstein's The Battleship Potemkin (1925), Jean Renoir's The Grand Illusion (1937), Nicholas Ray's Rebel without a Cause (1955), Jean-Luc Godard's Contempt (1963, Spike Lee's Do the Right Thing (1989), and Sally Potter's Orlando (1992). The aim of the course is to establish a broad historical and global foundation for the understanding of film as a complex exchange between art, technology, politics, and economics. \r\n\r\nMost students remarked that the class was overall enjoyable and interesting; however, some remarked that the lectures became too “dry” after a while. Students blamed this on the large class size, and the inability of Professor Mazaj to make the class feel smaller. Overall, though, students reported enjoying the course material. One student reported that “I have never once been bored in class.”\r\n\r\nProfessor Mazaj is universally hailed as “absolutely amazing.” Many said she was the perfect person to introduce them to cinema. According to some, “she managed to make silent films interesting.” Professor Mazaj has “a great way of communicating points to her students.”\r\n\r\nSome students claimed that there was a lot of reading involved in the course, because of the numerous Blackboard readings and the weekly film that students have to watch. Many said that “the reading isn’t hard but sometimes there was a lot assigned.” Some said that the grades did not reflect the material learned. The class fulfills the Arts and Letters requirement, and many said it was even a good class for non-majors.\r\n", "num_students": 67, "path": "/courses/25782/sections/401/reviews/3224-META-MAZAJ", "instructor": {"path": "/instructors/3224-META-MAZAJ", "first_name": "META", "last_name": "MAZAJ", "id": "3224-META-MAZAJ", "name": "META MAZAJ"}, "num_reviewers": 65, "id": "25782-401-3224-META-MAZAJ"}]