{"coursehistories": {"path": "/coursehistories/1159"}, "description": "The aim of the course is to provide a general perspective on African languages and African linguistics. No background in linguistics is necessary. Students will be introduced to theoretical linguistics-its concepts, theories, ways of argumentation, data collection, data analysis, and data interpretation. The focus will be on the languages and linguistics of Africa to provide you with the knowledge and skills required to handle the language and language-related issues typical of African conditions. We will cover topics related to formal linguistics (phonology/phonetics, morphology, syntax, and semantics), aspects of pragmatics as well as the general socio-linguistic character of African countries. We will also cover language in context, language and culture, borrowing, multilingualism, and cross-cultural communication in Africa. \n\n", "semester": "2009A", "name": "AFRICAN LANG. & CULTURE", "reviews": {"path": "/courses/15291/reviews", "values": [{"ratings": {"rAmountLearned": "1.99", "rDifficulty": "1.61", "rStimulateInterest": "2.34", "rRecommendMajor": "3.09", "rCourseQuality": "2.23", "rWorkRequired": "1.52", "rInstructorAccess": "2.91", "rReadingsValue": "1.74", "rRecommendNonMajor": "2.69", "rCommAbility": "2.51", "rInstructorQuality": "2.76"}, "section": {"name": "AFRICAN LANG. & CULTURE", "sectionnum": "401", "primary_alias": "AFST-225-401", "path": "/courses/15291/sections/401", "id": "15291-401", "aliases": ["AFST-225-401", "AFRC-225-401"]}, "comments": "This class received very mixed reviews from the students. Some felt that the “class was a lighthearted way to learn about another culture with which most students were not familiar.” One student, however, remarked that she was “very frustrated with this course, more so than any other I have taken.” Students seemed to dislike that the class was inconsistent at times and some complained about the course content.\r\n\r\nProfessor Mbeje was loved by some students and disliked by others. Some remarked that she was a “fun professor who really enjoys teaching.” Other students said that “Professor Mbeje is clearly very passionate about the topic and tries to get us interested in it.” However, some others thought that the pace Professor Mbeje set for the class was too slow, complaining that she would spend “two or more classes on a presentation that was nine slides long.” Others said that she didn’t express the information clearly enough and the students often had trouble understanding it.\r\n\r\nStudents complained that the final project, which was a presentation and final essay, was changed at the last minute from a 12-page paper with a group of 6 to a 15-page paper with a group of 3. Others complained about the pop quizzes that were sprung on the class to make sure people were showing up for the lectures. Still some other students noted that “there was not much work throughout the course of the semester, and the readings were usually interesting.”", "num_students": 110, "path": "/courses/15291/sections/401/reviews/1223-AUDREY-N--MBEJE", "instructor": {"path": "/instructors/1223-AUDREY-N--MBEJE", "first_name": "AUDREY N.", "last_name": "MBEJE", "id": "1223-AUDREY-N--MBEJE", "name": "AUDREY N. MBEJE"}, "num_reviewers": 108, "id": "15291-401-1223-AUDREY-N--MBEJE"}]}, "credits": null, "primary_alias": "AFST-225", "path": "/courses/15291", "sections": {"path": "/courses/15291/sections", "values": [{"name": "AFRICAN LANG. & CULTURE", "sectionnum": "401", "primary_alias": "AFST-225-401", "path": "/courses/15291/sections/401", "id": "15291-401", "aliases": ["AFST-225-401", "AFRC-225-401"]}]}, "id": 15291, "aliases": ["AFST-225", "AFRC-225"]}