[{"ratings": {"rAmountLearned": "2.52", "rDifficulty": "1.93", "rStimulateInterest": "2.73", "rRecommendMajor": "3.28", "rCourseQuality": "2.57", "rWorkRequired": "2.07", "rInstructorAccess": "3.33", "rReadingsValue": "2.41", "rRecommendNonMajor": "2.41", "rCommAbility": "2.93", "rInstructorQuality": "2.92"}, "section": {"name": "INTRO TO SOCIOLING", "sectionnum": "001", "primary_alias": "LING-102-001", "path": "/courses/26307/sections/001", "id": "26307-001", "aliases": ["LING-102-001"]}, "comments": "This course views language from a social and historical perspective. Students use interactive computer programs, covering phonetics, phonology and morphology to trace social differences in the use of language and changing patterns of social stratification. The course focused on ongoing linguistic changes in American society, in both mainstream and minority communities, and the social problems associated with them. The course involved field projects and statistical analysis. \r\n\r\nStudents found the subject to be “interesting” and generally “enjoyable” throughout the semester. Several expressed that lectures were disorganized and could have used more structure. Overall, the class effectively encouraged the examination of “basic linguistic discourses,” which the majority of students appreciated.\r\n\r\nStudents felt that Professor Sankoff was engaging and interesting and explained that she teaches in a “clear and concise” manner that makes the material easy to understand. Many also felt she was highly accessible and praised her dedication to the course. \r\n\r\nStudents recommended this class primarily to majors and suggested that non-majors may not find the material as interesting. One commented that the workload was reasonable, while another said that the “assigned readings were too much and often not particularly useful.” This same student went on to say that the exams were unclear and poorly written. A couple of students also commented that they found a few of the projects to be repetitive. This course fulfills the Society sector and Quantitive Data Analysis requirements.\r\n", "num_students": 54, "path": "/courses/26307/sections/001/reviews/736-GILLIAN-E-SANKOFF", "instructor": {"path": "/instructors/736-GILLIAN-E-SANKOFF", "first_name": "GILLIAN E", "last_name": "SANKOFF", "id": "736-GILLIAN-E-SANKOFF", "name": "GILLIAN E SANKOFF"}, "num_reviewers": 50, "id": "26307-001-736-GILLIAN-E-SANKOFF"}]