{"coursehistories": {"path": "/coursehistories/2830"}, "description": "Natural disturbances play a fundamental role in sculpturing landscapes and structuring natural and human-based ecosystems. This course explores the natural and social science of disturbances by analyzing their geologic causes, their ecological and social consequences, and the role of human behavior in disaster reduction and mitigation. Volcanoes, earthquakes, floods, droughts, fires, and extraterrestrial impacts are analyzed and compared. \n\n", "semester": "2009A", "name": "Natural Disturbances and Human Disasters", "reviews": {"path": "/courses/15821/reviews", "values": [{"ratings": {"rAmountLearned": "1.88", "rDifficulty": "2.26", "rStimulateInterest": "1.26", "rRecommendMajor": "2.48", "rCourseQuality": "1.78", "rWorkRequired": "1.89", "rInstructorAccess": "2.36", "rReadingsValue": "1.69", "rRecommendNonMajor": "1.85", "rCommAbility": "2.20", "rInstructorQuality": "2.01"}, "section": {"name": "Natural Disturbances and Human Disasters", "sectionnum": "001", "primary_alias": "GEOL-103-001", "path": "/courses/15821/sections/001", "id": "15821-001", "aliases": ["GEOL-103-001"]}, "comments": "This course explores the natural and social science of disturbances by analyzing their geologic causes, their ecological and social consequences, and the role of human behavior in disaster reduction and mitigation. Volcanoes, earthquakes, floods, droughts, fires, and extraterrestrial impacts are analyzed and compared. This course fulfills the Natural Science & Mathematics Sector.\r\n\r\nStudents generally did not find the course material interesting or in any way relevant to their future endeavors. This course was described as being “extremely dry,” “rather repetitive,” and “boring.” &#8232;\r\n\r\nProfessor Scatena was described as being an uninspiring professor who “[read] from his slides.” While some students described him as being interested in the topic he was teaching, most did not find him engaging enough to make the course content appealing. &#8232;&#8232;\r\n\r\nThe majority of students who took this class did so to fulfill their general College requirements, and most were non-majors. The workload was not very intense and the material fairly accessible, though relatively dry. One student complained about the price of the textbook and the clicker for this course, stating that in all his four years at Penn, the combined cost for materials for a class had never been as high as for GEOL-103. The homework assignments set throughout the course were described as being fairly easy and straightforward, although exams were touted as being “surprisingly difficult.\\\"", "num_students": 106, "path": "/courses/15821/sections/001/reviews/1839-FREDERICK-N--SCATENA", "instructor": {"path": "/instructors/1839-FREDERICK-N--SCATENA", "first_name": "FREDERICK N.", "last_name": "SCATENA", "id": "1839-FREDERICK-N--SCATENA", "name": "FREDERICK N. SCATENA"}, "num_reviewers": 101, "id": "15821-001-1839-FREDERICK-N--SCATENA"}]}, "credits": null, "primary_alias": "GEOL-103", "path": "/courses/15821", "sections": {"path": "/courses/15821/sections", "values": [{"name": "Natural Disturbances and Human Disasters", "sectionnum": "001", "primary_alias": "GEOL-103-001", "path": "/courses/15821/sections/001", "id": "15821-001", "aliases": ["GEOL-103-001"]}]}, "id": 15821, "aliases": ["GEOL-103"]}