{"coursehistories": {"path": "/coursehistories/612"}, "description": "This course will examine the diplomatic origins, military course and domestic implications of World War II. \n\n", "semester": "2010A", "name": "A WORLD AT WAR", "reviews": {"path": "/courses/26221/reviews", "values": [{"ratings": {"rAmountLearned": "3.54", "rDifficulty": "2.63", "rStimulateInterest": "3.88", "rRecommendMajor": "3.85", "rCourseQuality": "3.77", "rWorkRequired": "2.77", "rInstructorAccess": "3.09", "rReadingsValue": "3.40", "rRecommendNonMajor": "3.58", "rCommAbility": "3.88", "rInstructorQuality": "3.86"}, "section": {"name": "A WORLD AT WAR", "sectionnum": "001", "primary_alias": "HIST-431-001", "path": "/courses/26221/sections/001", "id": "26221-001", "aliases": ["HIST-431-001"]}, "comments": "This course examines the diplomatic origins, military course and domestic implications of World War II. Students have a chance to study World War II in different points of views, analyzing the event in various ways.\r\n\r\nMany students mentioned that the course has “a top notch reputation for being the best,” and that “it has met” or “exceeded [their] every expectation.” The lectures, according to students, were truly exciting and gripping, while offering a comprehensive review of the conflict in all its gory detail, from internal politics, to regional controversies to big picture plans and ideology.\r\n\r\nOne student commented that Professor “Childers defines Penn’s History Department.” Students found his lecture to be funny and engaging, and many agreed that his “ability to stir student interest and to analyze the war from so many different facets [was] what [made] the course spectacular.” He was also “willing to discuss [students’] questions after class, during office hours, or whenever he [was] free.” \r\n\r\nAlthough this class was recommended for both majors and non-majors, students did state that the amount of reading for the class could be overwhelming sometimes. Some students found the reading to be repetitive from lecture or overly detailed. The workload, according to students, can be overwhelming “especially for non-majors who are not used to copious readings.” Overall, students stated that “to any student interested even vaguely in World War II, this is a great class to take.”", "num_students": 183, "path": "/courses/26221/sections/001/reviews/655-THOMAS-C-CHILDERS", "instructor": {"path": "/instructors/655-THOMAS-C-CHILDERS", "first_name": "THOMAS C", "last_name": "CHILDERS", "id": "655-THOMAS-C-CHILDERS", "name": "THOMAS C CHILDERS"}, "num_reviewers": 173, "id": "26221-001-655-THOMAS-C-CHILDERS"}]}, "credits": null, "primary_alias": "HIST-431", "path": "/courses/26221", "sections": {"path": "/courses/26221/sections", "values": [{"name": "A WORLD AT WAR", "sectionnum": "001", "primary_alias": "HIST-431-001", "path": "/courses/26221/sections/001", "id": "26221-001", "aliases": ["HIST-431-001"]}]}, "id": 26221, "aliases": ["HIST-431"]}