{"coursehistories": {"path": "/coursehistories/1040"}, "description": "As a science, sociology uses various tools to establish knowledge about the social world, as one step in the process of producing explanatory (and ideally, predictive) theory. The purpose of this course is to introduce students to different sociological methods, including survey research and associated quantitative/statistical analysis, interviewing, ethnography, historical-comparative and archival research, experimentation and computer simulatin. We will review basic mechanics for applying these methods, and discuss the assumptions behind each and the kind of insight each yields. The class is required of sociology majors, and satisfies the College quantitative data analysis requirement. \n\n", "semester": "2010A", "name": "INTRO SOC RESEARCH", "reviews": {"path": "/courses/26767/reviews", "values": [{"ratings": {"rAmountLearned": "2.07", "rDifficulty": "2.40", "rStimulateInterest": "1.63", "rRecommendMajor": "2.35", "rCourseQuality": "1.75", "rWorkRequired": "2.33", "rInstructorAccess": "2.69", "rReadingsValue": "2.06", "rRecommendNonMajor": "1.06", "rCommAbility": "1.89", "rInstructorQuality": "2.13"}, "section": {"name": "INTRO SOC RESEARCH", "sectionnum": "401", "primary_alias": "SOCI-100-401", "path": "/courses/26767/sections/401", "id": "26767-401", "aliases": ["SOCI-100-401", "HSOC-100-401"]}, "comments": "As a science, sociology uses various tools to establish knowledge about the social world, as one step in the process of producing explanatory (and ideally, predictive) theory. The purpose of this course is to introduce students to different sociological methods, including survey research and associated quantitative/statistical analysis, interviewing, ethnography, historical-comparative and archival research, experimentation, and computer simulation. We will review basic mechanics for applying these methods, and discuss the assumptions behind each, and the kind of insight each yields. Students gain hands-on experience in applying several of these methods through class assignments.\r\nStudents generally found the readings to be interesting and helpful. They also agreed that the course was well-organized.\r\nProfessor Smith was described by many students as “extremely knowledgeable, very willing to meet with students if they request assistance, and very effective in determining the most sufficient means of relaying the information to the class.” Some students disagreed, however, claiming that his style was somewhat confusing and that he sometimes made the material more confusing than was necessary. Professor Smith infused the class with many of his own research related anecdotes which some found to be helpful, while others found them to be only tangentially related to course material.\r\nSome students expressed dissatisfaction with the assignments and described the multiple choice exam format as ill-suited to the nature of the subject. Others described the assignments as somewhat ambiguous and confusing. ", "num_students": 72, "path": "/courses/26767/sections/401/reviews/2338-HERBERT-L-SMITH", "instructor": {"path": "/instructors/2338-HERBERT-L-SMITH", "first_name": "HERBERT L", "last_name": "SMITH", "id": "2338-HERBERT-L-SMITH", "name": "HERBERT L SMITH"}, "num_reviewers": 67, "id": "26767-401-2338-HERBERT-L-SMITH"}]}, "credits": null, "primary_alias": "SOCI-100", "path": "/courses/26767", "sections": {"path": "/courses/26767/sections", "values": [{"name": "INTRO SOC RESEARCH", "sectionnum": "401", "primary_alias": "SOCI-100-401", "path": "/courses/26767/sections/401", "id": "26767-401", "aliases": ["SOCI-100-401", "HSOC-100-401"]}]}, "id": 26767, "aliases": ["SOCI-100", "HSOC-100"]}