[{"ratings": {"rAmountLearned": "2.01", "rDifficulty": "1.97", "rStimulateInterest": "1.63", "rRecommendMajor": "2.50", "rCourseQuality": "1.95", "rWorkRequired": "1.82", "rInstructorAccess": "2.41", "rReadingsValue": "1.59", "rRecommendNonMajor": "2.18", "rCommAbility": "2.23", "rInstructorQuality": "2.22"}, "section": {"name": "Natural Disturbances and Human Disasters", "sectionnum": "001", "primary_alias": "GEOL-103-001", "path": "/courses/26115/sections/001", "id": "26115-001", "aliases": ["GEOL-103-001"]}, "comments": "This course studies natural disturbances, which play a fundamental role in sculpturing landscapes and structuring natural and human-based ecosystems. The course explores the natural and social science of disturbances by analyzing their geologic causes, their ecological and social consequences, and the role of human behavior in disaster reduction and mitigation. Volcanoes, earthquakes, floods, droughts, fires, and extraterrestrial impacts are analyzed and compared. This course fulfills the Physical World sector requirement.\r\n\r\nStudents gave mixed reviews for the material covered in this course, ranging from \"very interesting\" to \"boring and disorganized.\" While most students claimed the class was \"very valuable\" or \"interesting but not too technical,\" a few students did find the material \"repetitive.\"\r\n\r\nIn general, students gave positive feedback for Professor Scatena. One student praised Professor Scatena as a professor who is \"warm and interested in [students'] performance and well-being.\" Other students wrote that Professor Scatena was \"very good\" and \"interesting.\"\r\n\r\nMost students seem to take this course in order to fulfill the Physical World requirements and thus were mostly non-majors. Students found that the exams were based on pure memorization. Multiple students did point out that the book that is required for the course was barely used or not used at all.", "num_students": 159, "path": "/courses/26115/sections/001/reviews/1839-FREDERICK-N--SCATENA", "instructor": {"path": "/instructors/1839-FREDERICK-N--SCATENA", "first_name": "FREDERICK N.", "last_name": "SCATENA", "id": "1839-FREDERICK-N--SCATENA", "name": "FREDERICK N. SCATENA"}, "num_reviewers": 147, "id": "26115-001-1839-FREDERICK-N--SCATENA"}]