[{"ratings": {"rAmountLearned": "3.59", "rDifficulty": "3.06", "rStimulateInterest": "3.53", "rRecommendMajor": "3.65", "rCourseQuality": "3.50", "rWorkRequired": "2.59", "rInstructorAccess": "3.82", "rReadingsValue": "3.75", "rRecommendNonMajor": "2.35", "rCommAbility": "3.71", "rInstructorQuality": "3.72"}, "section": {"name": "WITTGENSTEIN:MIND & LANG", "sectionnum": "301", "primary_alias": "PHIL-344-301", "path": "/courses/27992/sections/301", "id": "27992-301", "aliases": ["PHIL-344-301"]}, "comments": "In this class, students engage in a close reading of Wittgenstein's major writings: the Tractatus Logico-Philosophicus and the Philosophical Investigations. Some of the main topics considered include: how language relates to the world; what philosophy is and what it can accomplish; the nature of understanding; what is involved in following a rule; and the phenomenon of seeing-as. A distinctive feature of Wittgenstein's approach to philosophy is his commitment to philosophy as an activity rather than a set of doctrines. In keeping with this, the main goal of this class is for students to learn to do philosophy: to read closely, to grapple with foundational questions, and to talk seriously with others.\r\n\r\nThis course received rave reviews across the board. Many students expressed that it was one of their favorite classes taken in the Philosophy department, and for some, in their entire career at Penn. Students seemed to find the course content truly interesting and ultimately worth the challenge that interpreting Wittgenstein sometimes posed. One student commented, “The course shifted my whole way of thinking about philosophy,” and another said, “ The course genuinely changed the way I think and conduct myself personally for the better.” \r\n\r\nLike the course, Professor Camp received unanimously stellar reviews. Several students particularly applauded Professor Camp’s ability to engage and invigorate the class, presenting the major ideas and questions but then allowing the students to, “take control over the in-class discussions and really ‘practice philosophy.’” Another reviewer added that Professor Camp was always willing and available to help her students out. \r\n\r\nA couple students explicitly said that they would recommend this course, one saying it was, “a ‘must’-take class for Philosophy majors.”  Another recommended it to anyone, majors and non-majors alike. There was, however, one student who expressed that the course may be a bit more difficult for a non-philosophy major, given the occasional discussion of philosophical fields not directly related to the course content, as well as the challenging (though not copious) reading assigned. That said, this reviewer claimed that if a non-major is “eager to read Wittgenstein in spite of these hardships,” the reviewer would highly recommend them to take this course. ", "num_students": 23, "path": "/courses/27992/sections/301/reviews/3459-ELISABETH-MAURA-CAMP", "instructor": {"path": "/instructors/3459-ELISABETH-MAURA-CAMP", "first_name": "ELISABETH MAURA", "last_name": "CAMP", "id": "3459-ELISABETH-MAURA-CAMP", "name": "ELISABETH MAURA CAMP"}, "num_reviewers": 18, "id": "27992-301-3459-ELISABETH-MAURA-CAMP"}]