[{"ratings": {"rAmountLearned": "2.73", "rDifficulty": "3.07", "rStimulateInterest": "2.67", "rRecommendMajor": "3.27", "rCourseQuality": "2.33", "rWorkRequired": "3.70", "rInstructorAccess": "2.57", "rReadingsValue": "2.07", "rRecommendNonMajor": "1.53", "rCommAbility": "2.43", "rInstructorQuality": "2.42"}, "section": {"name": "REAL TIME EMBEDDED SYS", "sectionnum": "001", "primary_alias": "ESE-519-001", "path": "/courses/24378/sections/001", "id": "24378-001", "aliases": ["ESE-519-001"]}, "comments": "The use of distributed wireless sensor networks has surged in popularity in recent\r\nyears with applications ranging from environmental monitoring, to people- and objecttracking\r\nin both cooperative and hostile environments. This course is targeted at\r\nunderstanding and obtaining hands-on experience with the state-of-the-art in such\r\nwireless sensor networks which are often composed using relatively inexpensive sensor\r\nnodes that have low power consumption, low processing power and bandwidth. The\r\ncourse spans a variety of topics ranging from radio communications, network stack,\r\nsystems infrastructure including QoS support and energy management, programming\r\nparadigms, distributed algorithms and example applications. Some guest lectures may be\r\ngiven.\r\nStudents described this course as “interesting” and “rewarding.” Many\r\nappreciated the “awesome projects,” in particular the final project. Their only complaint\r\nabout the final project was the time allotted. Exams were not given to allow for students\r\nto “concentrate on the projects.” Students found this approach to be beneficial.\r\nStudents commonly felt that the class needed more structure. Professor Manghara\r\nwas not available to answer questions. Students were “disappointed with how [the class]\r\nwas conducted.”\r\nOverall, students did not find the material too difficult, but they felt that\r\nhomework assignments were lengthy. Additionally, students noted that the lab portion of\r\nthis course required a lot of time.", "num_students": 42, "path": "/courses/24378/sections/001/reviews/4798-RAHUL-MANGHARAM", "instructor": {"path": "/instructors/4798-RAHUL-MANGHARAM", "first_name": "RAHUL", "last_name": "MANGHARAM", "id": "4798-RAHUL-MANGHARAM", "name": "RAHUL MANGHARAM"}, "num_reviewers": 33, "id": "24378-001-4798-RAHUL-MANGHARAM"}]