{"coursehistories": {"path": "/coursehistories/1044"}, "description": "This course offers a basic introduction to the application/interpretation of statistical analysis in sociology. Upon completion, you shoud be familiar with a variety of basic statistical techniques that allow examination of interesting social questions. We begin by learning to describe the characteristics of groups, followed by a discussion of how to examine and generalize about relationships between the characteristics of groups. Emphasis is placed on the understanding/interpretation of statistics used to describe and make generalizations about group characteristics. In addition to hand calculations, you will also become familiar with using PCs to run statistical tests. \n\n", "semester": "2009A", "name": "SOCIAL STATISTICS", "reviews": {"path": "/courses/16459/reviews", "values": [{"ratings": {"rAmountLearned": "2.16", "rDifficulty": "2.44", "rStimulateInterest": "0.81", "rRecommendMajor": "2.13", "rCourseQuality": "1.46", "rWorkRequired": "2.48", "rInstructorAccess": "1.94", "rReadingsValue": "2.47", "rRecommendNonMajor": "0.91", "rCommAbility": "1.13", "rInstructorQuality": "1.51"}, "section": {"name": "SOCIAL STATISTICS", "sectionnum": "001", "primary_alias": "SOCI-120-001", "path": "/courses/16459/sections/001", "id": "16459-001", "aliases": ["SOCI-120-001"]}, "comments": "Social Statistics aims to provide a basic introduction to the application and interpretation of statistical analysis in sociology. Upon completion, students should be familiar with a variety of basic statistical techniques to describe and make generalizations about group characteristics. Students will become familiar with hand calculations and PCs to run statistical tests.\r\nReviews were largely negative for this class. Students felt time in class was not well spent and what they were doing was not well explained, leaving them to figure out most of the material by themselves from their textbooks. They also agreed that class was boring. One student called lectures “consistently uninteresting and even bordering on useless.” Inability to stimulate student interest was illustrated by another student’s observation that the class was half empty for each lecture. &#8232;\r\n&#8232;Students found Professor Parrado difficult to understand and felt class material was rushed through. Their frustration was compounded by Professor Parrado’s choice not to post lecture slides online, meaning they couldn’t catch up or review material on their own. A few students noted they were left in the dark by the professor and TA, whom they felt were not very accessible or helpful: “I was thrown into the subject matter and was forced to fend for myself…rather than being taught the material.” Another student, however, called Professor Parrado “really nice and very approachable.” &#8232;&#8232;\r\nMany students found the workload exacerbated by lack of coordination between lectures and recitation and not being taught what their homework covered. One student summarized, “I found the class to be challenging, not because the material was difficult, but rather because of the lack of guidance.”", "num_students": 39, "path": "/courses/16459/sections/001/reviews/4564-EMILIO-ALBERTO-PARRADO", "instructor": {"path": "/instructors/4564-EMILIO-ALBERTO-PARRADO", "first_name": "EMILIO ALBERTO", "last_name": "PARRADO", "id": "4564-EMILIO-ALBERTO-PARRADO", "name": "EMILIO ALBERTO PARRADO"}, "num_reviewers": 36, "id": "16459-001-4564-EMILIO-ALBERTO-PARRADO"}]}, "credits": null, "primary_alias": "SOCI-120", "path": "/courses/16459", "sections": {"path": "/courses/16459/sections", "values": [{"name": "SOCIAL STATISTICS", "sectionnum": "001", "primary_alias": "SOCI-120-001", "path": "/courses/16459/sections/001", "id": "16459-001", "aliases": ["SOCI-120-001"]}]}, "id": 16459, "aliases": ["SOCI-120"]}