[{"ratings": {"rAmountLearned": "3.03", "rDifficulty": "2.72", "rStimulateInterest": "3.31", "rRecommendMajor": "3.47", "rCourseQuality": "3.21", "rWorkRequired": "2.45", "rInstructorAccess": "3.50", "rReadingsValue": "2.34", "rRecommendNonMajor": "2.44", "rCommAbility": "3.13", "rInstructorQuality": "3.35"}, "section": {"name": "MARKET DESIGN", "sectionnum": "001", "primary_alias": "ECON-262-001", "path": "/courses/22943/sections/001", "id": "22943-001", "aliases": ["ECON-262-001"]}, "comments": "Traditionally, economics focuses on the study of existing markets. However, this course looks at the recent trend of regulators, entrepreneurs and economists being involved in the design of markets, the creation of institutionalized markets for new products, and the redesign of existing markets that were once dysfunctional. This course utilizes ideas from game theory and microeconomics to provide the theoretical underpinnings for design and analysis of such markets. Further, via real world examples, this course studies the practical aspects of such market design and the institutional details which can determine the success or failure of a design. \r\n\r\nOverall, this course was described as being challenging yet rewarding, helping students to hone their analytical skills. It was described as “one of the best experiences at Penn” due to the Professor and the intellectually stimulating material. Many students said that the real-life examples used in the class effectively linked theory and real-world application, thus enhancing their understanding of the material. \r\n\r\nThe majority of students had nothing but high regards for Professor Pai. They reported that the professor and the TA’s were easily accessible by email and always up for answering questions. In addition, students liked the enthusiasm that Professor Pai had for the subject and for teaching. He was described as “helpful”, and one student described him as “passionate”, both about the subject as well as about his students. The professor aimed to learn the names of all of the students in the class during he first few weeks of the semester.\r\n\r\nStudents said the homework sets were often difficult, especially since you had to work through them alone, but each and every one of the students mentioned how much they got out of the class. The tests usually coincided with reviewed material, though sometimes questions referred to unreviewed homework and ungraded sets. The course was found to be heavily math-based and got progressively harder throughout the semester .This class comes recommended to majors and non-majors alike. One student’s review concisely communicated their opinion on the class: “Great course. Take it.”\r\n", "num_students": 39, "path": "/courses/22943/sections/001/reviews/5610-MALLESH-M--PAI", "instructor": {"path": "/instructors/5610-MALLESH-M--PAI", "first_name": "MALLESH M.", "last_name": "PAI", "id": "5610-MALLESH-M--PAI", "name": "MALLESH M. PAI"}, "num_reviewers": 38, "id": "22943-001-5610-MALLESH-M--PAI"}]