{"coursehistories": {"path": "/coursehistories/1262"}, "description": "\"Contemporary Politics, Policy and Journalism\" is a course on the modern media and its impact on government and politics. It primarily covers the post-Watergate/post-Vietnam era of journalism, the past quarter century. We will focus each week on specific topics and areas of post-Watergate journalism as enumerated below. In weeks we do not have guest lecturers, the first half of class will concern the assigned readings and the second half of class will talk about current press coverage of national events over the prior week. In addition to assigned readings, students are required to stay informed about major national news stories and to follow coverage of them in the national media outlets. An important objective of this course is to afford students the opportunity to interact and discuss the intersection of the press, politics and public policy with some of the leading practitioners in the field, people who work in the \"media environment\" created by the national press. \n\n", "semester": "2011A", "name": "CONTMP POL,POLICY,JOURN", "reviews": {"path": "/courses/21502/reviews", "values": [{"ratings": {"rAmountLearned": "3.14", "rDifficulty": "1.95", "rStimulateInterest": "3.50", "rRecommendMajor": "3.86", "rCourseQuality": "3.59", "rWorkRequired": "2.00", "rInstructorAccess": "2.59", "rReadingsValue": "1.91", "rRecommendNonMajor": "3.45", "rCommAbility": "3.41", "rInstructorQuality": "3.59"}, "section": {"name": "CONTMP POL,POLICY,JOURN", "sectionnum": "301", "primary_alias": "COMM-323-301", "path": "/courses/21502/sections/301", "id": "21502-301", "aliases": ["COMM-323-301"]}, "comments": "Contemporary Politics, Policy and Journalism is a course on the modern media and its impact on government and politics. It focuses on the post-Watergate/post-Vietnam era of journalism, the past quarter century. &#8232;&#8232;&#8232;&#8232;An important objective of this course is to afford students the opportunity to interact and discuss the intersection of the press, politics and public policy with some of the leading practitioners in the field, people who work in the \"media environment\" created by the national press. There are 3 papers in the whole course. &#8232;&#8232;&#8232;Professor Hunt is described as “extremely knowledgeable” and the course as a whole can be described as one word – “incredible”. Students though the guest speakers were “excellent”. Students also have respected comments for Professor Hunt as he is a man with great stories from the journalism world. Professor Hunt takes the class on trips to DC and dinner throughout the semester. &#8232;&#8232;&#8232;&#8232;In addition to assigned readings, students are required to stay informed about major national news stories and to follow coverage of them in the national media outlets. The materials read were mostly for own fulfillment rather than for class discussions. This course might feel redundant if this is not the first communications course.", "num_students": 23, "path": "/courses/21502/sections/301/reviews/295-ALBERT-HUNT", "instructor": {"path": "/instructors/295-ALBERT-HUNT", "first_name": "ALBERT", "last_name": "HUNT", "id": "295-ALBERT-HUNT", "name": "ALBERT HUNT"}, "num_reviewers": 22, "id": "21502-301-295-ALBERT-HUNT"}]}, "credits": null, "primary_alias": "COMM-323", "path": "/courses/21502", "sections": {"path": "/courses/21502/sections", "values": [{"name": "CONTMP POL,POLICY,JOURN", "sectionnum": "301", "primary_alias": "COMM-323-301", "path": "/courses/21502/sections/301", "id": "21502-301", "aliases": ["COMM-323-301"]}]}, "id": 21502, "aliases": ["COMM-323"]}