{"coursehistories": {"path": "/coursehistories/872"}, "description": "This is an introductory course in modern political philosophy. Political philosophy addresses the justification and legitimate purposes of political power; the basic rights of individuals; the justification of property; capitalism vs. socialism vs. the welfare state; economic justice and the fair distribution of income and wealth; the constitutional requirements of a democracy; and the meaning of the freedom and equality of citizens. These are the kinds of questions we will investigate. The course is organized around the social contract tradition in political philosophy and the utilitarian response to it. Our primary focus is the works of the major social contract philosophers--Thomas Hobbes, John Locke, Jean Jacques Rousseau, and John Rawls--and the major utilitarian philosophers--David Hume, Adam Smith, Jeremy Benthams, and John Stuart Mill. Karl Marx is discussed as a critic of capitalism and constitutional democracy. \n\n", "semester": "2009A", "name": "THE SOCIAL CONTRACT", "reviews": {"path": "/courses/16292/reviews", "values": [{"ratings": {"rAmountLearned": "3.01", "rDifficulty": "2.37", "rStimulateInterest": "2.27", "rRecommendMajor": "3.47", "rCourseQuality": "2.73", "rWorkRequired": "2.24", "rInstructorAccess": "2.69", "rReadingsValue": "2.90", "rRecommendNonMajor": "2.30", "rCommAbility": "3.14", "rInstructorQuality": "2.98"}, "section": {"name": "THE SOCIAL CONTRACT", "sectionnum": "401", "primary_alias": "PHIL-008-401", "path": "/courses/16292/sections/401", "id": "16292-401", "aliases": ["PHIL-008-401", "PPE-008-401"]}, "comments": "This course examines the role of social contract doctrines in Western thought and culture. It focuses on the political writings of the major modern proponents of social contract theory: Thomas Hobbes, John Locke, Jean-Jacques Rousseau, and John Rawls. Assignments and lectures focus on contrasting their views with the utilitarian tradition, as represented by the political and economic philosophy of David Hume, Adam Smith and John Stuart Mill. Karl Marx is also covered, regarded as a critic of liberal constitutionalism. The course is designed to provide an introduction to some of the main issues in modern political philosophy.\r\n\r\nIn general, students were satisfied with this course, describing it as “interesting” and “very discussion based.” Most approved of the structure and topics included in the course.\r\n\r\nProfessor Freeman received stellar marks for “making the readings easy to understand and getting the point across.” Several noted that he spent considerable time on each topic in order to ensure that all students were comfortable before moving on. However, some students felt dissatisfied with this approach, saying that his explanations of material, although thorough, were repetitive. One student summed up his impact as, “overall, he\\\\\\'s a really straight forward lecturer and a great teacher, but if it\\\\\\'s not required and you bore easily, this might not be the right elective class for you.” People loved his “down-to-earth” attitude and his “straightforward” approach to material.\r\n\r\nA few students mentioned that Freeman’s simple delivery of the main course concepts greatly reduced the workload of what could have been an intensive class. This course is a good introduction to the methodology and focus of PPE, and one student said, “whoever is considering majoring in PPE should definitely take this course to figure out if the major is right for them.”", "num_students": 120, "path": "/courses/16292/sections/401/reviews/947-SAMUEL-R--FREEMAN", "instructor": {"path": "/instructors/947-SAMUEL-R--FREEMAN", "first_name": "SAMUEL R.", "last_name": "FREEMAN", "id": "947-SAMUEL-R--FREEMAN", "name": "SAMUEL R. FREEMAN"}, "num_reviewers": 119, "id": "16292-401-947-SAMUEL-R--FREEMAN"}]}, "credits": null, "primary_alias": "PHIL-008", "path": "/courses/16292", "sections": {"path": "/courses/16292/sections", "values": [{"name": "THE SOCIAL CONTRACT", "sectionnum": "401", "primary_alias": "PHIL-008-401", "path": "/courses/16292/sections/401", "id": "16292-401", "aliases": ["PHIL-008-401", "PPE-008-401"]}]}, "id": 16292, "aliases": ["PHIL-008", "PPE-008"]}