{"coursehistories": {"path": "/coursehistories/4945"}, "description": "This course introduces the integrative methodlogy that engineers use to solve complex problems. We emphasize the process of problem conception, engineering design, project implementation, and long-term operation as essential components of what we as engineerings do. The course also focuses on the life-cycle approach to large-scale complex systems design, and will incorporate case studies, group projects, and technical communications. \n\n", "semester": "2011A", "name": "SYS METHODOLOGY", "reviews": {"path": "/courses/21647/reviews", "values": [{"ratings": {"rAmountLearned": "2.25", "rDifficulty": "2.28", "rStimulateInterest": "2.60", "rRecommendMajor": "2.95", "rCourseQuality": "2.47", "rWorkRequired": "2.95", "rInstructorAccess": "3.43", "rReadingsValue": "2.18", "rRecommendNonMajor": "1.30", "rCommAbility": "2.70", "rInstructorQuality": "3.00"}, "section": {"name": "SYS METHODOLOGY", "sectionnum": "001", "primary_alias": "ESE-204-001", "path": "/courses/21647/sections/001", "id": "21647-001", "aliases": ["ESE-204-001"]}, "comments": "ESE204, officially titled “Systems Methodology,” introduces students to the integrative methodology that engineers use to solve complex problems. With focus on problem conception, engineering design, project implementation, and long-term operation, the course follows the life-cycle approach to large-scale complex systems design, using case students, group projects, and technical communications to do so.&#8232;&#8232;Many students reported that the course material was “very dry” and had trouble seeing why the course was required. Some students felt that “everything [one learns] in this course [can be learnt] by taking others.” However, others did report that the class “gives a good overview of systems” and that “Systems Methodology was a course unlike other engineering courses.”&#8232;&#8232;Professor Keenan was reported to be “awesome” and students found that “there’s a reason every student in the engineering school loves him.” Students found him to be “the man,” “excellent,” and reported that the main reason they enjoyed the course was because Professor Keenan taught it. One student reported that “Penn will very much miss [Professor Keenan].”&#8232;&#8232;This is an undergraduate course that can be taken at any level. Some students found that the class was more valuable to sophomores because “juniors and seniors... [have] already learned the information in other classes.” Some students expressed regret that too much was “left to the student” and wished that the “grading criteria [was] more explicit.” No excessive coursework load was reported.", "num_students": 44, "path": "/courses/21647/sections/001/reviews/1167-JOHN-D-KEENAN", "instructor": {"path": "/instructors/1167-JOHN-D-KEENAN", "first_name": "JOHN D", "last_name": "KEENAN", "id": "1167-JOHN-D-KEENAN", "name": "JOHN D KEENAN"}, "num_reviewers": 44, "id": "21647-001-1167-JOHN-D-KEENAN"}]}, "credits": null, "primary_alias": "ESE-204", "path": "/courses/21647", "sections": {"path": "/courses/21647/sections", "values": [{"name": "SYS METHODOLOGY", "sectionnum": "001", "primary_alias": "ESE-204-001", "path": "/courses/21647/sections/001", "id": "21647-001", "aliases": ["ESE-204-001"]}]}, "id": 21647, "aliases": ["ESE-204"]}