{"coursehistories": {"path": "/coursehistories/3462"}, "description": "The great pyramids and mysterious mummies of Egypt, the fabled Tower of Babel, and the laws of the Babylonian king Hammurabi are some of the things that might come to mind when you think of the ancient Near East. Yet these are only a very few of the many fascinating -- and at time perplexing -- aspects of the civilizations that flourished there c. 3300-300 BCE. This is where writing first developed, where people thought that the gods wrote down what would happen in the future on the lungs and livers of sacrificed sheep, and where people knew how to determine the length of hypotenuse a thousand years before the Greek Pythagoras was born. During this course, we will learn more about these other matters and discover their place in the cultures and civilizations of that area. \n\nThis is an interdisciplinary survey of the history, society and culture of the ancient Near East, in particular Egypt and Mesopotamia, utilizing extensive readings from ancient texts in translation (including the Epic of Gilgamesh, \"one of the great masterpieces of world literature\"), but also making use of archaeological and art historical materials. The goal of the course is to gain an appreciation of the various societies of the time, to understand some of their great achievements, to become acquainted with some of the fascinating individuals of the time (such as Hatshepsut, \"the women pharaoh,\" and Akhenaten, \"the heretic king\"), and to appreciate the rich heritage that they have left us. \n\n", "semester": "2010C", "name": "INTRO TO ANC NEAR EAST", "reviews": {"path": "/courses/23500/reviews", "values": [{"ratings": {"rAmountLearned": "2.71", "rDifficulty": "2.32", "rStimulateInterest": "2.39", "rRecommendMajor": "3.32", "rCourseQuality": "2.67", "rWorkRequired": "2.10", "rInstructorAccess": "3.06", "rReadingsValue": "2.65", "rRecommendNonMajor": "2.35", "rCommAbility": "3.06", "rInstructorQuality": "2.81"}, "section": {"name": "INTRO TO ANC NEAR EAST", "sectionnum": "401", "primary_alias": "NELC-101-401", "path": "/courses/23500/sections/401", "id": "23500-401", "aliases": ["NELC-101-401", "ANCH-025-401"]}, "comments": "", "num_students": 39, "path": "/courses/23500/sections/401/reviews/3212-GRANT-FRAME", "instructor": {"path": "/instructors/3212-GRANT-FRAME", "first_name": "GRANT", "last_name": "FRAME", "id": "3212-GRANT-FRAME", "name": "GRANT FRAME"}, "num_reviewers": 36, "id": "23500-401-3212-GRANT-FRAME"}]}, "credits": null, "primary_alias": "NELC-101", "path": "/courses/23500", "sections": {"path": "/courses/23500/sections", "values": [{"name": "INTRO TO ANC NEAR EAST", "sectionnum": "401", "primary_alias": "NELC-101-401", "path": "/courses/23500/sections/401", "id": "23500-401", "aliases": ["NELC-101-401", "ANCH-025-401"]}]}, "id": 23500, "aliases": ["NELC-101", "ANCH-025"]}