{"coursehistories": {"path": "/coursehistories/1704"}, "description": "Intensive exposure to current issues and solutions in contemporary human interactions with the environment. Global in scope, but focused on case histories. Emphasis on providing biological and sociological background for a given major environment-human interaction, and state-of-the-art suggested solutions. \n\n", "semester": "2009C", "name": "HUMANS & THE ENVIRONMENT", "reviews": {"path": "/courses/17025/reviews", "values": [{"ratings": {"rAmountLearned": "2.88", "rDifficulty": "2.77", "rStimulateInterest": "3.26", "rRecommendMajor": "3.27", "rCourseQuality": "2.93", "rWorkRequired": "2.32", "rInstructorAccess": "2.24", "rReadingsValue": "2.16", "rRecommendNonMajor": "2.60", "rCommAbility": "3.40", "rInstructorQuality": "3.43"}, "section": {"name": "HUMANS & THE ENVIRONMENT", "sectionnum": "401", "primary_alias": "BIOL-140-401", "path": "/courses/17025/sections/401", "id": "17025-401", "aliases": ["BIOL-140-401", "BIOL-440-401"]}, "comments": "This course explored the interface of contemporary humans with their environments across the world by focusing on various case histories, with a strong emphasis on biology. Lectures were recorded and based on photographic essays mounted onto Power Point presentations, often containing over 50 images with accompanying text. Several classes are taught by guest lecturers. The textbook used is The Diversity of Life, by Wilson (1999). The course fulfills the natural science and mathematics sector requirement, and is not recommended for freshman or students without some background in biology.\r\n\r\nStudents found this course “fascinating,” and one student said it was “the most interesting class I have taken in my 3.5 years at Penn.” Many also felt it was very informative and opened students to new ways of thinking about how humans interact with the environment.\r\n\r\nStudents said Professor Janzen is an “amazing,” “inspiring,’ “incredibly knowledgeable” and “fun” lecturer who can make “the most mundane topics come alive.” Many students claimed that Professor Janzen was one of the best professors they’ve had at Penn and that this class was one of the most interesting courses they’ve ever taken.\r\n\r\nMost students said that the course gives a good overview of basic biological concepts so that even those less familiar with biology can do well. A couple of students mentioned that the class doesn’t require very much work. Although most learning comes straight from lecture, some students said the readings can be tedious at times. There are 2 non-cumulative midterms and one cumulative final, all multiple choice and graded on a curve. Several students voiced concern about the questions asked on exams, which focused on “unimportant minutiae instead of the big issues” as one student put it. Such exams, written by TAs, required “nit-picky and extreme study of the details of all the assigned articles, books and lectures,” complained one student. However, most students said the quality of the course and professor was worth it.", "num_students": 76, "path": "/courses/17025/sections/401/reviews/1287-DANIEL-H-JANZEN", "instructor": {"path": "/instructors/1287-DANIEL-H-JANZEN", "first_name": "DANIEL H", "last_name": "JANZEN", "id": "1287-DANIEL-H-JANZEN", "name": "DANIEL H JANZEN"}, "num_reviewers": 72, "id": "17025-401-1287-DANIEL-H-JANZEN"}]}, "credits": null, "primary_alias": "BIOL-140", "path": "/courses/17025", "sections": {"path": "/courses/17025/sections", "values": [{"name": "HUMANS & THE ENVIRONMENT", "sectionnum": "401", "primary_alias": "BIOL-140-401", "path": "/courses/17025/sections/401", "id": "17025-401", "aliases": ["BIOL-140-401", "BIOL-440-401"]}]}, "id": 17025, "aliases": ["BIOL-140", "BIOL-440"]}