{"coursehistories": {"path": "/coursehistories/2599"}, "description": "This course surveys the history of medical knowledge and practice from antiquity to the present. No prior background in the history of science or medicine is required. The course has two principal goals: (1)to give students a practical introduction to the fundamental questions and methods of the history of medicine, and (2)to foster a nuanced, critical understanding of medicine's complex role in contemporary society. The couse takes a broadly chronological approach, blending the perspectives of the patient,the physician,and society as a whole--recognizing that medicine has always aspired to \"treat\" healthy people as well as the sick and infirm. Rather than history \"from the top down\"or \"from the bottom up,\"this course sets its sights on history from the inside out. This means, first, that medical knowledge and practice is understood through the personal experiences of patients and caregivers. It also means that lectures and discussions will take the long-discredited knowledge and treatments of the past seriously,on their own terms, rather than judging them by todays's standards. Required readings consist largely of primary sources, from elite medical texts to patient diaries. Short research assignments will encourge students to adopt the perspectives of a range of actors in various historical eras. \n\n", "semester": "2009C", "name": "MEDICINE IN HISTORY", "reviews": {"path": "/courses/17534/reviews", "values": [{"ratings": {"rAmountLearned": "2.90", "rDifficulty": "2.30", "rStimulateInterest": "3.20", "rRecommendMajor": "3.42", "rCourseQuality": "2.96", "rWorkRequired": "2.99", "rInstructorAccess": "3.27", "rReadingsValue": "2.87", "rRecommendNonMajor": "2.61", "rCommAbility": "3.09", "rInstructorQuality": "3.24"}, "section": {"name": "MEDICINE IN HISTORY", "sectionnum": "401", "primary_alias": "HSOC-002-401", "path": "/courses/17534/sections/401", "id": "17534-401", "aliases": ["HSOC-002-401", "HIST-036-401", "STSC-002-401"]}, "comments": "This course surveys the history of medical knowledge and practice from antiquity to the present. No prior background in the history of science or medicine is required The course takes a broadly chronological approach, blending the perspectives of the patient, the physician, and society as a whole—recognizing that medicine has always aspired to “treat” healthy people as well as the sick and infirm. \r\n\r\nStudents appreciated the breadth of history that this course covered. One student even claimed that Barnes did an “admirable job in trying to cover thousands of years in one semester.” Another student stated that the course is “fabulous. Makes paying for Penn worth it.”&#8232;&#8232;\r\n\r\nStudents were very enthusiastic about Professor Barnes, using words such as “enthusiastic” and “engaging” to describe his teaching rhetoric. Several students acknowledged Barnes as their favorite Penn professor. Other students praised the new perspectives they were exposed to as a result of having taken this class. However, some students expressed frustration with the amount of material that the course hoped to cover.\r\n\r\nDespite the majority of overwhelming praise given to the course and the instructors, the biggest complaint students had was the work load that was required of them: two extensive research papers, two midterms, and a final. Required readings consist largely of primary sources, from elite medical texts to patient diaries. \r\n", "num_students": 84, "path": "/courses/17534/sections/401/reviews/1520-DAVID-S--BARNES", "instructor": {"path": "/instructors/1520-DAVID-S--BARNES", "first_name": "DAVID S.", "last_name": "BARNES", "id": "1520-DAVID-S--BARNES", "name": "DAVID S. BARNES"}, "num_reviewers": 74, "id": "17534-401-1520-DAVID-S--BARNES"}]}, "credits": null, "primary_alias": "HSOC-002", "path": "/courses/17534", "sections": {"path": "/courses/17534/sections", "values": [{"name": "MEDICINE IN HISTORY", "sectionnum": "401", "primary_alias": "HSOC-002-401", "path": "/courses/17534/sections/401", "id": "17534-401", "aliases": ["HSOC-002-401", "HIST-036-401", "STSC-002-401"]}]}, "id": 17534, "aliases": ["HSOC-002", "HIST-036", "STSC-002"]}