[{"ratings": {"rAmountLearned": "2.35", "rDifficulty": "2.92", "rStimulateInterest": "2.41", "rRecommendMajor": "3.06", "rCourseQuality": "2.19", "rWorkRequired": "2.67", "rInstructorAccess": "2.79", "rReadingsValue": "2.16", "rRecommendNonMajor": "1.49", "rCommAbility": "2.53", "rInstructorQuality": "2.60"}, "section": {"name": "GEN.PHYS:MECH,HEAT,SOUND: General Physics: Mechanics, Heat and Sound", "sectionnum": "001", "primary_alias": "PHYS-101-001", "path": "/courses/22285/sections/001", "id": "22285-001", "aliases": ["PHYS-101-001"]}, "comments": "This is an introduction to the classical laws of motion requiring a background in calculus. It is suggested for students in a pre-health program.\r\n\r\nStudents thought the class was \"informative\" but a little boring. One student explained that the class “started out strong and then got worse as the semester progressed.” Some thought the class moved too quickly, especially towards the end of the semester. \r\n\r\nProfessor Drndic was out for part of the semester, so students felt that \"important concepts\" were skipped. Students for the most part thought Professor Drndic’s approach to problem solving and her explanations were clear and helpful. Some thought that the material was presented poorly or didn’t add much to the readings, however. While some students found Professor Drndic's \"remarks about science and physics to be very inspiring,\" others did not appreciate that she got \"side-tracked\" easily. Students wished the professor \"was more accessible” especially since she was “very good at communicating the material.”\r\n\r\nStudents did not feel \"well prepared for the exams\" since the exam questions were not \"similar in nature\" to homework questions. This was upsetting to many since their grades mainly came from these two exams. Recitations were confusing as the TA and professor used different notation. The midterm and finals were five questions which for some were not “a good gauge at all of our skills.\"\r\n", "num_students": 72, "path": "/courses/22285/sections/001/reviews/2304-MARIJA-DRNDIC", "instructor": {"path": "/instructors/2304-MARIJA-DRNDIC", "first_name": "MARIJA", "last_name": "DRNDIC", "id": "2304-MARIJA-DRNDIC", "name": "MARIJA DRNDIC"}, "num_reviewers": 64, "id": "22285-001-2304-MARIJA-DRNDIC"}]