{"coursehistories": {"path": "/coursehistories/2311"}, "description": "This course offers a comprehensive survey of American Jewish history from the colonial period to the present. It will cover the different waves of Jewish immigration to the United States and examine the construction of Jewish political, cultural, and religious life in America. Topics will include: American Judaism, the Jewish labor movement, Jewish politics and popular culture, and the responses of American Jews to the Holocaust and the State of Israel. \n\n", "semester": "2010C", "name": "AMER JEWISH EXPERIENCE", "reviews": {"path": "/courses/23215/reviews", "values": [{"ratings": {"rAmountLearned": "2.88", "rDifficulty": "2.04", "rStimulateInterest": "2.79", "rRecommendMajor": "3.33", "rCourseQuality": "3.08", "rWorkRequired": "2.42", "rInstructorAccess": "2.83", "rReadingsValue": "2.58", "rRecommendNonMajor": "3.00", "rCommAbility": "3.38", "rInstructorQuality": "3.17"}, "section": {"name": "AMER JEWISH EXPERIENCE", "sectionnum": "401", "primary_alias": "HIST-150-401", "path": "/courses/23215/sections/401", "id": "23215-401", "aliases": ["HIST-150-401", "JWST-130-401", "RELS-124-401"]}, "comments": "American Jewish Experience offers a comprehensive survey of American Jewish history from the colonial period to the present. It covers the different waves of Jewish immigration to the United States and examines the construction of Jewish political, cultural, and religious life in America. Topics include American Judaism, the Jewish labor movement, Jewish politics and popular culture, and the responses of American Jews to the Holocaust and the State of Israel. &#8232;&#8232;\r\n\r\nStudents universally consider this an “excellent course.” They found the material “interesting [and] engaging,” and mentioned that the “visual material really contributes to the learning process of the class.” Overall, it appears students share the opinion that “the course is a great class: very interesting.” &#8232;&#8232;\r\n\r\nIn this class, Professor Wenger demonstrated obvious “knowledge and [his] ability to communicate the material was great.” Other students confirmed that, “Professor Wenger is a strong lecturer who presented a cohesive picture of American Jewish History over the last several hundred years.” However, one student commented that, “whenever asked a question in class, Professor Wenger always said we would come to it later.” Students appreciate that she was “a very good lecturer” and felt it was clear she was “focused…and passionate about the material.” Students said that it was “easy to take notes and follow along” throughout the semester.&#8232;&#8232;\r\n\r\nAmerican Jewish Experience includes a “good amount of assignments,” but “assigned readings are of excellent value.” While some students suggested “including some more literary readings,” others observed that, “many people did not do the readings before class, because we covered most of the material the following day in class.” Some students warned that future attendees should “be prepared for a lot of reading.” This course contributes to the Jewish History Concentration, and is an introductory level history course\r\n", "num_students": 32, "path": "/courses/23215/sections/401/reviews/1488-BETH-S--WENGER", "instructor": {"path": "/instructors/1488-BETH-S--WENGER", "first_name": "BETH S.", "last_name": "WENGER", "id": "1488-BETH-S--WENGER", "name": "BETH S. WENGER"}, "num_reviewers": 24, "id": "23215-401-1488-BETH-S--WENGER"}]}, "credits": null, "primary_alias": "HIST-150", "path": "/courses/23215", "sections": {"path": "/courses/23215/sections", "values": [{"name": "AMER JEWISH EXPERIENCE", "sectionnum": "401", "primary_alias": "HIST-150-401", "path": "/courses/23215/sections/401", "id": "23215-401", "aliases": ["HIST-150-401", "JWST-130-401", "RELS-124-401"]}]}, "id": 23215, "aliases": ["HIST-150", "JWST-130", "RELS-124"]}