[{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "2.95", "rStimulateInterest": "2.82", "rRecommendMajor": "3.00", "rCourseQuality": "2.95", "rWorkRequired": "2.63", "rInstructorAccess": "2.97", "rReadingsValue": "3.11", "rRecommendNonMajor": "2.03", "rCommAbility": "3.11", "rInstructorQuality": "3.14"}, "section": {"name": "HUMAN MEMORY", "sectionnum": "001", "primary_alias": "PSYC-259-001", "path": "/courses/22352/sections/001", "id": "22352-001", "aliases": ["PSYC-259-001"]}, "comments": "This course is an introduction to the scientific study of human memory, with a particular emphasis on the interplay between theory and experiment. Topics include dual store models and the debate over short-term memory, recognition memory for items and associations, the role of time and context in memory formation and retrieval, theories of association, memory for sequences, the influence of prior knowledge on new learning, spatial and navigational memory, perceptual learning, classification and function learning, memory disorders, and developmental changes in memory function. &#8232;&#8232;&#8232;&#8232;Students generally found the subject matter of this course “interesting,” with one student describing the material and concepts as “captivating.” The course involves three Excel-based projects. &#8232;&#8232;&#8232;&#8232;Students held mixed opinions of Dr. Kahana. While some described him as a “great lecturer” and another even as “a phenomenal asset to our institution,” others found that he relied too heavily on the textbook to instruct students rather than teaching himself. One student noted that Dr. Kahana was “more than willing to meet with students,” while another complained that he was “unwilling to make scheduling exceptions for students.” Another student commented that Dr. Kahana was unaware of the unrealistic demands he made of students concerning their assignments. Most agreed that he was very “intelligent.”&#8232;&#8232;&#8232;&#8232;Prerequisites for this course are Math 104 and Psychology 001. Many students commented that efficiency in Excel should be a prerequisite for this class, as well. Knowing how to do intermediate to advance level functions on Excel helped students considerably with homework assignments. The three Excel-based projects were described as “unreasonably difficult” and time-consuming for those students who lacked a solid understanding of Excel. Several students mentioned feeling as though they did not do well in the class.", "num_students": 47, "path": "/courses/22352/sections/001/reviews/3165-MICHAEL-J--KAHANA", "instructor": {"path": "/instructors/3165-MICHAEL-J--KAHANA", "first_name": "MICHAEL J.", "last_name": "KAHANA", "id": "3165-MICHAEL-J--KAHANA", "name": "MICHAEL J. KAHANA"}, "num_reviewers": 44, "id": "22352-001-3165-MICHAEL-J--KAHANA"}]