[{"ratings": {"rAmountLearned": "2.90", "rDifficulty": "2.07", "rStimulateInterest": "3.00", "rRecommendMajor": "3.23", "rCourseQuality": "3.03", "rWorkRequired": "1.97", "rInstructorAccess": "2.97", "rReadingsValue": "2.50", "rRecommendNonMajor": "2.20", "rCommAbility": "3.17", "rInstructorQuality": "3.39"}, "section": {"name": "COMPUTATIONAL LINGUISTCS", "sectionnum": "001", "primary_alias": "CIS-530-001", "path": "/courses/17140/sections/001", "id": "17140-001", "aliases": ["CIS-530-001"]}, "comments": "This course provides computational approaches to the problem of understanding and producing written and spoken natural language, including speech processing, syntactic parsing, statistical and corpus-based techniques, semantic interpretation, discourse meaning, and the role of pragmatics and world knowledge. It is recommended that students have some knowledge of logic, basic linguistics, and programming. \r\n\r\nStudents generally found the course excellent and extremely interesting. There were however, varied opinions on the level of difficulty of the course. Some thought it could have been more challenging, while others contended that the contents of the course were “too high-level without enough detail”. Many students agreed that there should have been more reinforcement of the material taught, perhaps through a final, or assignments more related to the topics covered, or even through more examples of code. \r\n\r\nStudents praised Professor Marcus, a “pioneer in his field” and an “engaging instructor”. Most students were impressed by how much he knew about the material he taught, and enjoyed the “latest gossip” he provided. Students commended his clear demonstrations of algorithms, but were more cautious about praising the mathematical problems covered in class, which were perhaps not as lucid as they could have been. \r\n\r\nThe course was generally hailed as one a lot can be learned from. Students liked the course as well as the instructor, who was quite approachable and accessible and communicated the material very well to them. Students highly recommended it to majors; but even non-majors with programming experience may find the course enjoyable. However students offer a word of warning – “make sure the topics interest you”, otherwise it may be difficult to tackle the final project which “requires a certain amount of creativity”. \r\n", "num_students": 34, "path": "/courses/17140/sections/001/reviews/1345-MITCHELL-PHILIP-MARCUS", "instructor": {"path": "/instructors/1345-MITCHELL-PHILIP-MARCUS", "first_name": "MITCHELL PHILIP", "last_name": "MARCUS", "id": "1345-MITCHELL-PHILIP-MARCUS", "name": "MITCHELL PHILIP MARCUS"}, "num_reviewers": 31, "id": "17140-001-1345-MITCHELL-PHILIP-MARCUS"}]