{"coursehistories": {"path": "/coursehistories/279"}, "description": "What actually was it that the Greeks were thinking of when they used the expression politeia-an expression which we often translate by 'constitution' but which might be translated also by 'citizenship', 'citizen body', or 'regime'? What do their thoughts suggest, if anything, about prospects for constitutionmaking today? This course builds on contemporary scholarship to reconstruct what we may call the constitutiomaking tradition as it develops in the main ancient texts, which are read in English translations. The ancient texts are taken from Herodotus, the Pseudo-Xenophon, Diodorus Siculus, Thucydides, Xenophon, Plato, the author of the Aristotelian Athenian Constitution, Aristotle himself, Polybius, Cicero, Tacitus, Plutarch, Diogenes Laertius, Augustine, and Justinian's codifiers of Roman law. The course traces this ancient tradition through the Middle Ages and the Renaissance and the great thinkers of the Seventeenth Century, following linguistic and other clues that carry one up to Madison and may put the work of the U.S. Constitutional Convention in a somewhat new light;and it continues through Nineteenth Century and Twentieth Century constitutionmaking into today's constitutionmaking efforts in Eastern Europe, , Central Asia, the Middle East and North Africa, and Europe itself. \n\nIn its 2012 version, the course draws on recent work which suggests that Aristotle's Politics was written for an intended audience of people making constitutions and people making laws, either for domestic use or for colonies. \n\nThe course is conducted as a group tutorial. In individual tutorials, where is one on one, the tutor typically assigns a paper to a student each week, and the student reads it the next week and takes questions from the tutor. In a group tutorial, the professor offers a prelecture to the students in each session on the text that they will read next to help them understand its historical, literary, and political context. In the next class, the students read short papers on the text, and these papers are discussed by other students and by the professor. The professor then provides a summary lecture on the text just completed, if necessary, and a prelecture on the set for the next class. At the end of the course, the students have reconstructed the constitutionmaking tradition for themselves from the primary sources. \n\nThis course became a BFS course in Spring 2003. \n\n", "semester": "2007A", "name": "ANC&MOD CONSTITUTION", "reviews": {"path": "/courses/14261/reviews", "values": [{"ratings": {"rAmountLearned": "3.50", "rDifficulty": "2.60", "rStimulateInterest": "3.30", "rRecommendMajor": "3.80", "rCourseQuality": "3.40", "rWorkRequired": "2.80", "rInstructorAccess": "3.80", "rReadingsValue": "3.60", "rRecommendNonMajor": "2.70", "rCommAbility": "3.70", "rInstructorQuality": "3.90"}, "section": {"name": "ANC&MOD CONSTITUTION", "sectionnum": "401", "primary_alias": "CLST-310-401", "path": "/courses/14261/sections/401", "id": "14261-401", "aliases": ["CLST-310-401", "GAFL-510-401"]}, "comments": "", "num_students": 11, "path": "/courses/14261/sections/401/reviews/261-JOHN-J--MULHERN", "instructor": {"path": "/instructors/261-JOHN-J--MULHERN", "first_name": "JOHN J.", "last_name": "MULHERN", "id": "261-JOHN-J--MULHERN", "name": "JOHN J. MULHERN"}, "num_reviewers": 10, "id": "14261-401-261-JOHN-J--MULHERN"}]}, "credits": null, "primary_alias": "CLST-310", "path": "/courses/14261", "sections": {"path": "/courses/14261/sections", "values": [{"name": "ANC&MOD CONSTITUTION", "sectionnum": "401", "primary_alias": "CLST-310-401", "path": "/courses/14261/sections/401", "id": "14261-401", "aliases": ["CLST-310-401", "GAFL-510-401"]}]}, "id": 14261, "aliases": ["CLST-310", "GAFL-510"]}