[{"ratings": {"rAmountLearned": "2.49", "rDifficulty": "2.88", "rStimulateInterest": "2.05", "rRecommendMajor": "2.75", "rCourseQuality": "2.25", "rWorkRequired": "2.76", "rInstructorAccess": "2.30", "rReadingsValue": "2.57", "rRecommendNonMajor": "1.70", "rCommAbility": "2.25", "rInstructorQuality": "2.56"}, "section": {"name": "COMPARATIVE POLITICS", "sectionnum": "001", "primary_alias": "PSCI-110-001", "path": "/courses/16344/sections/001", "id": "16344-001", "aliases": ["PSCI-110-001"]}, "comments": "This course is an introduction to comparative political analysis, with a focus on themes including the role of the state, democracy and dictatorship, economic reforms and revolutions.\r\n&#8232;Most students either really loved or really hated this course; it ranged from a “must-take” to “worst course” at Penn. Fans sung the praises of its “novel approach” to comparative politics, which centered around five books that illustrate different concepts. These students felt the class effectively equipped them with new perspectives and ways of critically analyzing politics, calling it “extremely worthwhile and thought-provoking.” One enthusiastic student said the course was “so rich and extensive” that it made students “almost dizzy with new knowledge.” On the other end of the spectrum, students felt the course was disorganized, dull, and difficult to follow. Critics of the reading-centered approach said the course lacked a central purpose or structure, and they complained about a disjointed focus on small, scattered details rather than a comprehensive grasp on the subject. Many noted that the course could be improved with clearer direction and less information-dense lecture slides. &#8232;&#8232;\r\nThese stratified assessments of the course often boil down to opinions of Professor Lustick himself. Though almost all students praised Professor Lustick’s intellect, some criticized how he presented information, such as in “highly esoteric and jargon-filled” lectures and confusing diagrams. While some students called his lectures dull and dense, others praised his passion and ability to break down complex theories.\r\n&#8232;&#8232;This is one of six Political Science core course options for majors; participants ranged from those with their first PSCI course to those with many under their belt. Students generally found the course a challenge. Many found the readings and lectures more complex, theoretical and dense than they expected of an introductory level class. They also said there was a lot of work, in large part because of the reading assignments. Assignments include a paper, midterm and final. Said one student, “with a name like ‘Introduction to Comparative Politics,’ I was hoping to grasp the topics at hand more formidably.”", "num_students": 220, "path": "/courses/16344/sections/001/reviews/1679-IAN-STEVEN-LUSTICK", "instructor": {"path": "/instructors/1679-IAN-STEVEN-LUSTICK", "first_name": "IAN STEVEN", "last_name": "LUSTICK", "id": "1679-IAN-STEVEN-LUSTICK", "name": "IAN STEVEN LUSTICK"}, "num_reviewers": 211, "id": "16344-001-1679-IAN-STEVEN-LUSTICK"}]