{"coursehistories": {"path": "/coursehistories/4611"}, "description": "During the last decade it has become clear that in the global economy, firms must constantly adapt to changing technological, competitive, demographic and other environmental conditions in order to survive and prosper. The importance of acquiring the knowledge and tools for changing organizations successfully cannot be overemphasized (particularly for students headed for consulting and general management careers, although not limited to them). This course focuses on specific concepts, theories and tools that can guide executives entrusted with the task of leading organizational change to successful execution. Among other topics, the course will focus on various change strategies such asleading change, managing cultural change, and mergers or acquisitions, corporate transformation, managing growth, building the customer centric organization, business process outsourcing both from client and provider perspectives, and managing radical organizational change. The perspective of the course is integrative and the focus is on successful execution. \n\nNatural disasters, business failures, and organizational upheavals are some of the most pressing challenges faced by today's leaders. This course is an opportunity for business school students to learn crisis management skills, but more importantly to learn how to implement systems to prevent and mitgate the impact of potential crisis. Students will develop an understanding of how adisaster impacts various institutions from developing countries to for profit organizations. In addition to completing course readings and attending lectures, students will utilize their talents to assist organizations dedicated to mitigating the effects of disasters. The curriculum is designed to leverage the talented Wharton community (students, faculty, and alumni) to improve the lives of disaster victims through a well-coordinated strategic response. \n\nThe course will meet for one semster once a week for 3 hours. Each class will meet for one semester once a week for three hours and will consist of a one-ho ur lecture followed by a presentation from an outside speaker. Outside of class students will be expected to work on a field study project with an organization dedicated to disaster response, rebuilding or prevention. These projects will be organized by TA's. Deliverables will include weekly class participation and a final presentation on the work completed in the field study projects. \n\n", "semester": "2009C", "name": "MANAGING ORG CHANGE", "reviews": {"path": "/courses/17706/reviews", "values": [{"ratings": {"rAmountLearned": "2.45", "rDifficulty": "1.73", "rStimulateInterest": "2.27", "rRecommendMajor": "2.45", "rCourseQuality": "2.55", "rWorkRequired": "2.55", "rInstructorAccess": "2.82", "rReadingsValue": "2.73", "rRecommendNonMajor": "2.27", "rCommAbility": "2.64", "rInstructorQuality": "2.55"}, "section": {"name": "MANAGING ORG CHANGE", "sectionnum": "001", "primary_alias": "MGMT-773-001", "path": "/courses/17706/sections/001", "id": "17706-001", "aliases": ["MGMT-773-001"]}, "comments": "", "num_students": 14, "path": "/courses/17706/sections/001/reviews/4888-JITENDRA-V--SINGH", "instructor": {"path": "/instructors/4888-JITENDRA-V--SINGH", "first_name": "JITENDRA V.", "last_name": "SINGH", "id": "4888-JITENDRA-V--SINGH", "name": "JITENDRA V. SINGH"}, "num_reviewers": 11, "id": "17706-001-4888-JITENDRA-V--SINGH"}, {"ratings": {"rAmountLearned": "3.71", "rDifficulty": "2.36", "rStimulateInterest": "3.79", "rRecommendMajor": "3.71", "rCourseQuality": "3.64", "rWorkRequired": "2.31", "rInstructorAccess": "3.36", "rReadingsValue": "3.29", "rRecommendNonMajor": "3.57", "rCommAbility": "3.77", "rInstructorQuality": "3.79"}, "section": {"name": "MANAGING ORG CHANGE", "sectionnum": "751", "primary_alias": "MGMT-773-751", "path": "/courses/17706/sections/751", "id": "17706-751", "aliases": ["MGMT-773-751"]}, "comments": "", "num_students": 21, "path": "/courses/17706/sections/751/reviews/4889-DAVID-S--POTTRUCK", "instructor": {"path": "/instructors/4889-DAVID-S--POTTRUCK", "first_name": "DAVID S.", "last_name": "POTTRUCK", "id": "4889-DAVID-S--POTTRUCK", "name": "DAVID S. POTTRUCK"}, "num_reviewers": 14, "id": "17706-751-4889-DAVID-S--POTTRUCK"}]}, "credits": null, "primary_alias": "MGMT-773", "path": "/courses/17706", "sections": {"path": "/courses/17706/sections", "values": [{"name": "MANAGING ORG CHANGE", "sectionnum": "001", "primary_alias": "MGMT-773-001", "path": "/courses/17706/sections/001", "id": "17706-001", "aliases": ["MGMT-773-001"]}, {"name": "MANAGING ORG CHANGE", "sectionnum": "751", "primary_alias": "MGMT-773-751", "path": "/courses/17706/sections/751", "id": "17706-751", "aliases": ["MGMT-773-751"]}]}, "id": 17706, "aliases": ["MGMT-773"]}