[{"ratings": {"rAmountLearned": "1.73", "rDifficulty": "2.47", "rStimulateInterest": "2.11", "rRecommendMajor": "1.97", "rCourseQuality": "1.92", "rWorkRequired": "3.17", "rInstructorAccess": "2.65", "rReadingsValue": "1.42", "rRecommendNonMajor": "1.70", "rCommAbility": "2.03", "rInstructorQuality": "1.95"}, "section": {"name": "ANTHROPOLOGY AND CINEMA", "sectionnum": "401", "primary_alias": "ANTH-231-401", "path": "/courses/15318/sections/401", "id": "15318-401", "aliases": ["ANTH-231-401", "CINE-231-401"]}, "comments": "This course analyzes mass-market American films using traditional anthropological theories about symbolism, ritual, mythology, language, metaphor, narrative and discourse. The goal is to think of the movies as significant cultural artifacts that we use to make sense of the world rather than as just forms of entertainment or art. Through a study of popular American films and their related merchandise and cultural influences, we will also see how anthropology can be used to study contemporary cultures.\r\n\r\nStudents appreciated that this course tested new academic boundaries by requiring video assignments and consideration of graphic and visual materials—like comic books—as serious academic matters. However, they also found many serious problems with the course execution. Most heartily disapproved of the readings required for the course, calling them “completely ridiculous in length and subject matter.” One student even described the tone of the readings as “bombastically filibustering,” and criticized the professor for giving such a “laundry list” of readings that had not been filtered for actual content.\r\n\r\nStudents agreed that while Professor Krasniewicz was a “nice” and “extremely interesting” person, she was “not a very good teacher.” One student noted that, “the class is full of interesting content, but is marred by an instructor who has not yet mastered how to teach it.” Several students noted that her practice cold-calling during lecture was unpleasant since “you had to be inside her head in order to answer questions correctly” and that the correct answer was often “arbitrary.” Moreover, she provided “ambiguous answers” to students’ questions in class. Almost all students noted that her expectations about assignments were also ambiguous, leading to unnecessary stress over the class. Her help outside of class was limited, although one student noted that she improved her responsiveness to students at the close of the term.\r\n\r\nProficiency with a computer, and particular software programs, was practically necessary for success in the class. Without it, the course becomes “nearly unmanageable” in the words of one student. “The professor expects a level of knowledge of video editing software that is inappropriate for a course with no prerequisites or requirement of video editing skills stated in the syllabus,” another said.", "num_students": 39, "path": "/courses/15318/sections/401/reviews/2851-LOUISE-KRASNIEWICZ", "instructor": {"path": "/instructors/2851-LOUISE-KRASNIEWICZ", "first_name": "LOUISE", "last_name": "KRASNIEWICZ", "id": "2851-LOUISE-KRASNIEWICZ", "name": "LOUISE KRASNIEWICZ"}, "num_reviewers": 39, "id": "15318-401-2851-LOUISE-KRASNIEWICZ"}]