{"coursehistories": {"path": "/coursehistories/2527"}, "description": "This course will provide an introduction to modern Irish literature, focusing on the tension between Ireland's violent history and its heroic mythology. This tension leaves its mark not only on the ravaged landscape, but also on the English language, which displays its \"foreignness\" most strongly in the hands of Irish writers. Readings will span the genres of poetry, drama, fiction, and history, and will include works by Sommerville and Ross, Yeats, George Moore, Joyce, Synge, O'Casey, Beckett, Edna O'Brien, and Brian Friel. \n\nSee the English Department's website at www.english.upenn.edu for a description of the current offerings. \n\n", "semester": "2012A", "name": "IRISH LITERATURE: MODERN IRISH LITERATURE", "reviews": {"path": "/courses/27289/reviews", "values": [{"ratings": {"rAmountLearned": "3.60", "rDifficulty": "2.81", "rStimulateInterest": "3.90", "rRecommendMajor": "4.00", "rCourseQuality": "3.77", "rWorkRequired": "3.03", "rInstructorAccess": "3.81", "rReadingsValue": "3.53", "rRecommendNonMajor": "3.32", "rCommAbility": "4.00", "rInstructorQuality": "4.00"}, "section": {"name": "IRISH LITERATURE: MODERN IRISH LITERATURE", "sectionnum": "001", "primary_alias": "ENGL-058-001", "path": "/courses/27289/sections/001", "id": "27289-001", "aliases": ["ENGL-058-001"]}, "comments": "This course surveys a range of modern Irish writing, from the so-called Irish Renaissance of the early 1900s to the Celtic Tiger era of the early 2000s.  This course is designed to explore several distinctive Irish themes and topics, including art and violence, literature and nationalism, language and territory, sexuality and citizenship, and gender and tradition.  Readings and lectures will provide historical background and social contexts for the following main texts:  Bram Stoker's Dracula, W.B. Yeats's Selected Poems, J.M. Synge's Playboy of the Western World, James Joyce's Dubliners, Brian Friel's Translations, Roddy Doyle's A Star Called Henry, Patrick McCabe's Breakfast on Pluto, and Anne Enright's The Gathering.  In addition, we will consider poetry, short fiction, and plays by Oscar Wilde, Lady Gregory, Samuel Beckett, G.B. Shaw, Elizabeth Bowen, Seamus Heaney, Nuala Ní Dhomnaill, Marina Carr, and Conor McPherson as well as a small cluster of films such as The Crying Game(1992), In the Name of the Father (1993), Michael Collins (1996), and The Wind That Shakes the Barley (2006).  Written requirements will include weekly quizzes, a 10-12 page research paper, and two essay exams.\r\n\r\nStudents reported learning a lot from this course. Many students said they were “astounded at how much [they] have learned — about Ireland, about 20th century literature, and about the influence of globalization on both.” Another student agreed, adding, “I’m walking away feeling like I’ve learned a lot.” Students also enjoyed the course. Although many students started the semester without much knowledge about literature and left “semi-expert[s].” Many students were also sad the course was over and felt they not only learned subject material, but also how to approach learning. Several students said it was the “best class... at Penn.” Several students even felt inspired by this course. One student summarized the general consensus by explaining, “The class discussions/lectures led to a greater understanding not only of the texts themselves, but also of the culture and nation that produced them, the purposes of art, literature, and culture in general, and our own society and selves.”\r\n\r\nAccording to student responses, Professor Etsy was accessible, fun, eloquent, knowledgeable, and engaging. Many students commented that Professor Etsy was able to create an intimate and comfortable class environment where discussions could be fostered among students. “Professor Etsy creates a warm class community,” one student wrote, adding that Professor Etsy “is able to guide a class discussion to make sure that people can share their opinions but also stay on track.” As another student noted, “It's clear that Professor Etsy puts a lot of work and thought into his lesson plans, our syllabus, and our paper assignments and test questions and I appreciate his consideration of student input for future semesters.” Students enjoyed the way Professor Etsy handed the class, with one student explaining, “although the course is technically a lecture, Dr. Esty values student input and handles the discussion like a seminar.”\r\n\r\nAlthough students felt that the class required a fair amount of reading, the majority of students also appreciated what they gained from them. “All of the readings were really enjoyable,” one student wrote, “but I thought everything assigned had a lot of value.” However, one student did question the importance of some of the readings, noting that the class “read a little too much material and didn’t have enough time to spend really delving into certain works.” The class also requires readings, quizzes, midterms, viewings, and a 10-page paper. As one student noted, the class was “hard work but well worth it.” Many reviewers would also recommend this course to anyone, regardless of major or interest. One student wrote, “I would strongly recommend this class to English majors and non-English majors, as it looks far beyond just literature.” One noted that this course was “one of those formative classes that will really stay with you after college.”", "num_students": 34, "path": "/courses/27289/sections/001/reviews/4304-JOSHUA-ESTY", "instructor": {"path": "/instructors/4304-JOSHUA-ESTY", "first_name": "JOSHUA", "last_name": "ESTY", "id": "4304-JOSHUA-ESTY", "name": "JOSHUA ESTY"}, "num_reviewers": 31, "id": "27289-001-4304-JOSHUA-ESTY"}]}, "credits": null, "primary_alias": "ENGL-058", "path": "/courses/27289", "sections": {"path": "/courses/27289/sections", "values": [{"name": "IRISH LITERATURE: MODERN IRISH LITERATURE", "sectionnum": "001", "primary_alias": "ENGL-058-001", "path": "/courses/27289/sections/001", "id": "27289-001", "aliases": ["ENGL-058-001"]}]}, "id": 27289, "aliases": ["ENGL-058"]}