[{"ratings": {"rAmountLearned": "2.16", "rDifficulty": "2.72", "rStimulateInterest": "2.29", "rRecommendMajor": "2.82", "rCourseQuality": "1.89", "rWorkRequired": "2.31", "rInstructorAccess": "2.28", "rReadingsValue": "1.78", "rRecommendNonMajor": "1.40", "rCommAbility": "1.98", "rInstructorQuality": "2.18"}, "section": {"name": "VERTEBRATE PHYSIOLOGY", "sectionnum": "001", "primary_alias": "BIOL-215-001", "path": "/courses/24064/sections/001", "id": "24064-001", "aliases": ["BIOL-215-001"]}, "comments": "The course focuses on integrative aspects of physiological function of vertebrates.\r\nComparative, environmental and quantitative approaches are used. Major topics include\r\nmuscle, the cardiovascular system, respiration, renal function and the nervous system.\r\nThis course is concerned with basic principles governing the physiology of\r\nvertebrates. Students found that in this course physiology came alive with all the\r\napplications encountered in the course. Many students mainly relied on the textbook or\r\noutside research to learn the material in this course. Students warn that the course is very\r\nmath based. In addition, they found the course to be disorganized.\r\nStudents thought professor Rome was funny. They describe him as friendly and\r\napproachable. However, found his handouts to be very confusing and unhelpful. In\r\naddition, his use of transparencies was found to be extremely unhelpful in\r\ncommunicating the course material.\r\nThe prerequisites for this course include BIOL 102 or 121 of 124. This class is\r\nrecommended for students interested in medicine because the material of the course is\r\nvery relevant. Students said the course is very difficult. They found that exams did not\r\nassess a student’s knowledge of the class material, but rather were experimental set-ups\r\nthat students were required to analyze. In addition, the grading for this course is very\r\ndifficult, and usually very little partial credit is awarded. There is also little help outside\r\nlecture for the student.", "num_students": 155, "path": "/courses/24064/sections/001/reviews/1289-LAWRENCE-C--ROME", "instructor": {"path": "/instructors/1289-LAWRENCE-C--ROME", "first_name": "LAWRENCE C.", "last_name": "ROME", "id": "1289-LAWRENCE-C--ROME", "name": "LAWRENCE C. ROME"}, "num_reviewers": 145, "id": "24064-001-1289-LAWRENCE-C--ROME"}, {"ratings": {"rAmountLearned": "2.16", "rDifficulty": "2.72", "rStimulateInterest": "1.70", "rRecommendMajor": "2.82", "rCourseQuality": "1.89", "rWorkRequired": "2.31", "rInstructorAccess": "2.23", "rReadingsValue": "1.78", "rRecommendNonMajor": "1.40", "rCommAbility": "1.54", "rInstructorQuality": "1.75"}, "section": {"name": "VERTEBRATE PHYSIOLOGY", "sectionnum": "001", "primary_alias": "BIOL-215-001", "path": "/courses/24064/sections/001", "id": "24064-001", "aliases": ["BIOL-215-001"]}, "comments": "The course focuses on integrative aspects of physiological function of vertebrates.\r\nComparative, environmental and quantitative approaches are used. Major topics include\r\nmuscle, the cardiovascular system, respiration, renal function and the nervous system.\r\nOverall students felt that the concepts covered in the lecture were too simple.\r\nExams had more calculation based questions, which students felt they weren’t prepared\r\nfor. They wished that the lecture was filled with more sample questions that involved\r\ncalculations. However, some felt that the problem solving in class was “interesting and\r\nuseful.” Students thought that the handouts were difficult to understand and they found\r\nthat often, they had to teach themselves the material.\r\nStudents felt that overall there was a “disconnect” between professors and TAs,\r\nwhich made it more difficult for students to get their questions answered. Some felt that\r\nDr. Ren wasted too much time by going off on tangents, which caused them to go too\r\nslowly over the course material. Also, the majority felt that Dr. Ren’s accent also made it\r\ndifficult to understand what he said.\r\nStudents felt that this course was “challenging.” One student felt that the exams\r\ndid not reflect what material the students knew. This course is recommended for biology\r\nmajors or premedical students. The prerequisites for this course are BIOL 102, BIOL\r\n121, or BIOL 124.", "num_students": 155, "path": "/courses/24064/sections/001/reviews/2068-DEJIAN-REN", "instructor": {"path": "/instructors/2068-DEJIAN-REN", "first_name": "DEJIAN", "last_name": "REN", "id": "2068-DEJIAN-REN", "name": "DEJIAN REN"}, "num_reviewers": 145, "id": "24064-001-2068-DEJIAN-REN"}, {"ratings": {"rAmountLearned": "2.59", "rDifficulty": "2.86", "rStimulateInterest": "2.41", "rRecommendMajor": "2.82", "rCourseQuality": "2.41", "rWorkRequired": "2.64", "rInstructorAccess": "3.09", "rReadingsValue": "2.45", "rRecommendNonMajor": "2.00", "rCommAbility": "1.73", "rInstructorQuality": "2.14"}, "section": {"name": "VERTEBRATE PHYSIOLOGY", "sectionnum": "601", "primary_alias": "BIOL-215-601", "path": "/courses/24064/sections/601", "id": "24064-601", "aliases": ["BIOL-215-601"]}, "comments": "Vertebrate physiology focuses on integrative aspects of the physiological function\r\nof vertebrates. Comparative, environmental, and quantitative approaches are used. Major\r\ntopics include muscles, the cardiovascular system, respiration, renal function, and the\r\nnervous system.\r\nMany students recommended this class and found it very interesting. However,\r\nsome students found the course description misleading, as it focused more on humans\r\nthan vertebrates in general. Many basic concepts were covered, and students generally\r\nfelt that the course requires a lot of memorization.\r\nStudents described Witmer as “genuinely interested in her students’ success.”\r\nShe was very responsive to students’ concerns, and they found her passion for the topic\r\n“refreshing.”\r\nThis BIOL 215 section is an LPS section, so most of the students were post-grads.", "num_students": 30, "path": "/courses/24064/sections/601/reviews/2880-XIAOHONG-ZOU-WITMER", "instructor": {"path": "/instructors/2880-XIAOHONG-ZOU-WITMER", "first_name": "XIAOHONG ZOU", "last_name": "WITMER", "id": "2880-XIAOHONG-ZOU-WITMER", "name": "XIAOHONG ZOU WITMER"}, "num_reviewers": 22, "id": "24064-601-2880-XIAOHONG-ZOU-WITMER"}]