{"coursehistories": {"path": "/coursehistories/897"}, "description": "This course parallels and extends the content of PHYS 151, at a somewhat higher mathematical level. Recommended for well-prepared students in engineering and the physical sciences, and particularly for those planning to major in physics. Electric and magnetic fields; Coulomb's, Ampere's, and Faraday's laws; special relativity; Maxwell's equations, electromagnetic radiation. \n\n", "semester": "2011A", "name": "HONORS PHYSICS II", "reviews": {"path": "/courses/22291/reviews", "values": [{"ratings": {"rAmountLearned": "3.36", "rDifficulty": "3.76", "rStimulateInterest": "2.72", "rRecommendMajor": "3.80", "rCourseQuality": "3.00", "rWorkRequired": "3.68", "rInstructorAccess": "2.92", "rReadingsValue": "2.63", "rRecommendNonMajor": "1.44", "rCommAbility": "2.84", "rInstructorQuality": "2.81"}, "section": {"name": "HONORS PHYSICS II", "sectionnum": "301", "primary_alias": "PHYS-171-301", "path": "/courses/22291/sections/301", "id": "22291-301", "aliases": ["PHYS-171-301"]}, "comments": "This course parallels and extends the content of PHYS 151, at a somewhat higher\r\nmathematical level. Subjects investigated include: Electric and magnetic fields; Coulomb's, Ampere's, and Faraday's laws; special relativity; Maxwell's equations; and electromagnetic radiation.\r\n\r\nStudents found the course to be “very difficult but rewarding” and felt that they better understood many concepts after taking the class. One student wished the class had a TA and recitation.\r\n\r\nProfessor Gladney “was a good instructor who effectively taught the material.” He was “very good at detailing the underlying physics and mathematical reasoning behind everything and ultimately uniting almost everything we did in a single model and theory.”\r\n\r\nPHYS 171 is “an incredibly difficult and in-depth course,” described by one student in one word: “intense.” One student wrote that the homework was very difficult, time consuming, and graded harshly. The course is recommended for well-prepared students in engineering and the physical sciences, and particularly for those planning to major in physics. It fulfills the Physical World Sector. Pre-requisites include Math 114 and PHYS 150 or 170 and co-requisite of Math 240. Note: Fewer than eight students reviewed this course.\r\n", "num_students": 27, "path": "/courses/22291/sections/301/reviews/975-LARRY-GLADNEY", "instructor": {"path": "/instructors/975-LARRY-GLADNEY", "first_name": "LARRY", "last_name": "GLADNEY", "id": "975-LARRY-GLADNEY", "name": "LARRY GLADNEY"}, "num_reviewers": 27, "id": "22291-301-975-LARRY-GLADNEY"}]}, "credits": null, "primary_alias": "PHYS-171", "path": "/courses/22291", "sections": {"path": "/courses/22291/sections", "values": [{"name": "HONORS PHYSICS II", "sectionnum": "301", "primary_alias": "PHYS-171-301", "path": "/courses/22291/sections/301", "id": "22291-301", "aliases": ["PHYS-171-301"]}]}, "id": 22291, "aliases": ["PHYS-171"]}