[{"ratings": {"rAmountLearned": "2.72", "rDifficulty": "3.01", "rStimulateInterest": "3.03", "rRecommendMajor": "3.30", "rCourseQuality": "2.76", "rWorkRequired": "2.24", "rInstructorAccess": "2.32", "rReadingsValue": "1.92", "rRecommendNonMajor": "1.84", "rCommAbility": "3.07", "rInstructorQuality": "2.99"}, "section": {"name": "ATTENTION & MEMORY", "sectionnum": "001", "primary_alias": "PSYC-155-001", "path": "/courses/16377/sections/001", "id": "16377-001", "aliases": ["PSYC-155-001"]}, "comments": "This course looks at attention and memory in humans with a modern experimental focus. Topics include multiple memory systems, attentional selection, the interrelationship between memory and attention, dysfunction due to disease states and aging, exceptional functioning, and strategies to improve memory and attentional processes. Particular emphasis is given to the neural basis of cognitive processes. Prerequisites include PSYC 001 or BIBB 109.\r\nThe course was taught mostly in a lecture-style format off of Power Point slides with some demonstrations and activities. Students found these activities to be stimulating and wished there had been more. Providing the slides beforehand was also cited as a way of improving the course. The content was generally thought to be complex, but the slides were found to serve as a good complement to the readings, which multiple students described as “dense,” especially the PDF articles. The review sessions provided by the TA before exams were almost universally described as “useless” and many cited the TA as not very well-versed in the course material.\r\n\r\nStudents had wide-ranging opinions of Professor Jha, which generally correlated with their level of interaction with her. Some found her to be an “engaging” lecturer who “knows what she’s talking about,” while others felt she may have been a bit “condescending” or “snappy” even during office hours. Those who did not find her to be a great lecturer cited that she often read directly off of her lecture slides, which made the course material a bit “dry” and less exciting than expected. On the other hand, students who praised her teaching skills found her slides to be informative, felt she did a good job of communicating difficult material, and described her as “accessible.” She took a brief leave during the course, during which a substitute taught lectures, which many students lamented because of Professor Jha’s great teaching ability.\r\n\r\nNo students complained about the workload aside from some of the readings being described as “dense.” Students recommended this course to psychology majors, though those with limited background in memory and attention found the class to be very different from what they expected.", "num_students": 82, "path": "/courses/16377/sections/001/reviews/1948-AMISHI-P-JHA", "instructor": {"path": "/instructors/1948-AMISHI-P-JHA", "first_name": "AMISHI P", "last_name": "JHA", "id": "1948-AMISHI-P-JHA", "name": "AMISHI P JHA"}, "num_reviewers": 80, "id": "16377-001-1948-AMISHI-P-JHA"}]