[{"ratings": {"rAmountLearned": "3.30", "rDifficulty": "2.73", "rStimulateInterest": "2.98", "rRecommendMajor": "3.56", "rCourseQuality": "3.25", "rWorkRequired": "2.73", "rInstructorAccess": "3.00", "rReadingsValue": "3.15", "rRecommendNonMajor": "2.81", "rCommAbility": "3.31", "rInstructorQuality": "3.40"}, "section": {"name": "JUSTICE, LAW & MORALITY", "sectionnum": "001", "primary_alias": "PHIL-277-001", "path": "/courses/23621/sections/001", "id": "23621-001", "aliases": ["PHIL-277-001", "PPE-277-001"]}, "comments": "This course focuses on the philosophical background to questions regarding the exercise of legitimate political power and individuals' rights under the U.S. Constitution, including 1st Amendment freedoms of religion, expression, and association; the 14th amendment guarantee of Due Process and the right of privacy, abortion, euthanasia, and the right to marry; the Equal Protection clause and its bearing on affirmative action and equal political rights, and the Takings and Contract clauses and their bearing on rights of private property and economic freedom. The class also discusses competing conceptions of democracy and their implications for the purported authority of courts to reverse democratically enacted decisions by a majority. In addition to Supreme Court decisions concerning these and other issues, students read works by J.S. Mill, John Rawls, Ronald Dworkin, T.M. Scanlon, Martha Nussbaum, Thomas Nagel, Robert Nozick, and other contemporary philosophers. &#8232;&#8232;\r\n\r\nStudents thoroughly enjoyed this “stimulating” course. One student said it was “my favorite class at Penn so far.” Students reported learning a lot of pertinent information on current “socially-relevant philosophical topics.” Students agreed that the course exposed them to “different viewpoints.”&#8232;&#8232;\r\n\r\nStudents praised Professor Freeman for his interest and communication skills as a teacher. One student wrote that Professor Freeman “does a wonderful job of communicating the material to the class on a consistent basis.” Another added that Professor Freeman “cares that we know the material and as a result makes every effort to make the class interesting and rewarding.” One student found Professor Freeman to be “one of the strongest professors I have had at the University.” Students respect his ability to stimulate the interests of his students. Another student wrote that, “he encourages students to learn and interact with the material and helps them apply philosophical concepts to current issues.” Students admire Professor Freeman for being “very knowledgeable.” &#8232;\r\n\r\n&#8232;This course is available to Freshmen and Upperclassmen. The course requires a lot of reading, however students agreed that the information gained was well worth the workload. The course has no prerequisites and is recommended to interested majors and non-majors.\r\n", "num_students": 63, "path": "/courses/23621/sections/001/reviews/947-SAMUEL-R--FREEMAN", "instructor": {"path": "/instructors/947-SAMUEL-R--FREEMAN", "first_name": "SAMUEL R.", "last_name": "FREEMAN", "id": "947-SAMUEL-R--FREEMAN", "name": "SAMUEL R. FREEMAN"}, "num_reviewers": 59, "id": "23621-001-947-SAMUEL-R--FREEMAN"}]