[{"ratings": {"rAmountLearned": "2.96", "rDifficulty": "2.61", "rStimulateInterest": "3.52", "rRecommendMajor": "3.35", "rCourseQuality": "3.22", "rWorkRequired": "3.41", "rInstructorAccess": "2.96", "rReadingsValue": "2.96", "rRecommendNonMajor": "2.78", "rCommAbility": "3.05", "rInstructorQuality": "3.17"}, "section": {"name": "Dealing with the Media", "sectionnum": "001", "primary_alias": "GAFL-561-001", "path": "/courses/27480/sections/001", "id": "27480-001", "aliases": ["GAFL-561-001"]}, "comments": "This course explores the role of media in politics and discusses strategies for using media resources for greatest effect.  The design of the course allows for a flexible workshop format and includes guest lectures by media personalities and politicians as well as a trip to meet with media professionals in Washington.  The course also provides regular opportunities for students to implement what they have learned through in-class media trainings, mock editorial board interviews, governing strategy scenarios, campaign strategy scenarios, and political advertisement assessments.\r\n\r\nOverall, the students had high regard for the course quality. It was described as a “fantastic course” and “all in all a wonderful experience.” The students mentioned that there were lots of great guest speakers who contributed to the course. One student suggested to “not encourage students to take the mock press conferences lightly,” as valuable speaking skills are learned through the experience.\r\n\r\nOverall, students stated that Professor Margolies “was spectacular” and “amazing.” but that she “tries to jam too much into the class that it becomes overwhelming.” In addition, one student mentioned that Professor Margolies “has very little structure, which has its benefits but usually just confuses the students.” \r\n\r\nFuture students should be aware that there are lots of supplemental readings to the course. One student commented that “the final project is very difficult and one of the most expensive projects I have had to do.” Sometimes the homework assignments may not be very clear to the students, and the final project had “vague guidelines.” There are no prerequisites for this course. ", "num_students": 24, "path": "/courses/27480/sections/001/reviews/562-MARJORIE-MARGOLIES-MEZVINSKY", "instructor": {"path": "/instructors/562-MARJORIE-MARGOLIES-MEZVINSKY", "first_name": "MARJORIE", "last_name": "MARGOLIES-MEZVINSKY", "id": "562-MARJORIE-MARGOLIES-MEZVINSKY", "name": "MARJORIE MARGOLIES-MEZVINSKY"}, "num_reviewers": 23, "id": "27480-001-562-MARJORIE-MARGOLIES-MEZVINSKY"}]