[{"ratings": {"rAmountLearned": "2.39", "rDifficulty": "2.16", "rStimulateInterest": "2.04", "rRecommendMajor": "2.87", "rCourseQuality": "1.96", "rWorkRequired": "2.37", "rInstructorAccess": "3.22", "rReadingsValue": "2.07", "rRecommendNonMajor": "1.63", "rCommAbility": "1.76", "rInstructorQuality": "2.02"}, "section": {"name": "INTRO SCIENTIFIC COMP", "sectionnum": "001", "primary_alias": "EAS-105-001", "path": "/courses/24250/sections/001", "id": "24250-001", "aliases": ["EAS-105-001"]}, "comments": "This course introduces computation and data analysis using MATLAB - an\r\nindustry standard programming and visualization environment. The course covers the\r\nfundamentals of computing including: variables, functions, flow control, iteration, and\r\nrecursion. These concepts are illustrated through examples and assignments which show\r\nhow computing is applied to various scientific and engineering problems. Examples are\r\ndrawn from the simulation of physical and chemical systems, the analysis of\r\nexperimental data, Monte Carlo numerical experiments, image and audio processing, and\r\ncontrol of sensors and actuators.\r\nOverall, students thought that this course was a good introductory programming\r\ncourse. However, for those with no prior programming experience, little extra help is\r\noffered. Students were thrown blindly into the first few projects, and oftentimes those\r\nwith prior programming knowledge benefitted much more than those who had never been\r\nexposed to it before.\r\nProfessor Dietz was seen as a good teacher, but some students wished that she did\r\na little more teaching in regards to the programming she expected her students to\r\ncomplete. Dietz believes that “everyone is smart” and thus “capable of tackling the\r\nchallenges of programming and debugging,” but those with little prior experience had\r\ndifficulty following her teaching style.\r\nStudents appreciated the depth of knowledge they gained about MATLAB. The\r\nprojects for homework were apt, and many felt the tests were slightly biased toward those\r\nwho could write code faster. However, students thought this was a good course overall.", "num_students": 58, "path": "/courses/24250/sections/001/reviews/4414-DONNA-A--DIETZ", "instructor": {"path": "/instructors/4414-DONNA-A--DIETZ", "first_name": "DONNA A.", "last_name": "DIETZ", "id": "4414-DONNA-A--DIETZ", "name": "DONNA A. DIETZ"}, "num_reviewers": 51, "id": "24250-001-4414-DONNA-A--DIETZ"}, {"ratings": {"rAmountLearned": "2.22", "rDifficulty": "2.17", "rStimulateInterest": "2.25", "rRecommendMajor": "2.89", "rCourseQuality": "2.17", "rWorkRequired": "2.22", "rInstructorAccess": "3.00", "rReadingsValue": "2.25", "rRecommendNonMajor": "1.72", "rCommAbility": "2.18", "rInstructorQuality": "2.20"}, "section": {"name": "LABORATORY", "sectionnum": "101", "primary_alias": "EAS-105-101", "path": "/courses/24250/sections/101", "id": "24250-101", "aliases": ["EAS-105-101"]}, "comments": "", "num_students": 28, "path": "/courses/24250/sections/101/reviews/4414-DONNA-A--DIETZ", "instructor": {"path": "/instructors/4414-DONNA-A--DIETZ", "first_name": "DONNA A.", "last_name": "DIETZ", "id": "4414-DONNA-A--DIETZ", "name": "DONNA A. DIETZ"}, "num_reviewers": 26, "id": "24250-101-4414-DONNA-A--DIETZ"}, {"ratings": {"rAmountLearned": "2.17", "rDifficulty": "2.18", "rStimulateInterest": "2.11", "rRecommendMajor": "2.56", "rCourseQuality": "2.04", "rWorkRequired": "2.56", "rInstructorAccess": "2.89", "rReadingsValue": "1.94", "rRecommendNonMajor": "1.82", "rCommAbility": "1.89", "rInstructorQuality": "2.09"}, "section": {"name": "LABORATORY", "sectionnum": "102", "primary_alias": "EAS-105-102", "path": "/courses/24250/sections/102", "id": "24250-102", "aliases": ["EAS-105-102"]}, "comments": "This course provides an introduction to computation and data analysis using\r\nMATLAB, which is an industry standard programming and visualization environment.\r\nThe course covers the fundamentals of computing including variables, functions, flow\r\ncontrol, iteration and recursion. These concepts are illustrated through examples and\r\nassignments which show how computing is applied to various scientific and engineering\r\nproblems. Examples are drawn from the simulation of physical and chemical systems, the\r\nanalysis of experimental data, Monte Carlo numerical experiments, image and audio\r\nprocessing, and control of sensors and actuators. This course does not assume any prior\r\nprogramming experience but makes use of basic concepts from calculus and Newtonian\r\nphysics.\r\nStudents for the most part enjoyed this course, despite it being time consuming.\r\nMost students were satisfied with Professor Dietz. However, one student did note\r\nthat some of the debugging concepts were not taught clearly enough during lecture. They\r\nfound lab hours to be “helpful” in debugging code and completing the projects\r\nthroughout the semester.\r\nThis course was time-consuming and students found themselves spending a lot of\r\ntime with the TAs to debug their code and thoroughly finish their projects.\r\nFewer than eight student comments were submitted for this course.", "num_students": 30, "path": "/courses/24250/sections/102/reviews/4414-DONNA-A--DIETZ", "instructor": {"path": "/instructors/4414-DONNA-A--DIETZ", "first_name": "DONNA A.", "last_name": "DIETZ", "id": "4414-DONNA-A--DIETZ", "name": "DONNA A. DIETZ"}, "num_reviewers": 25, "id": "24250-102-4414-DONNA-A--DIETZ"}]