{"coursehistories": {"path": "/coursehistories/3148"}, "description": "This course explores the history, literature, and philosophy of two age-old questions: what does it mean to be successful and how does one achieve this elusive goal? It surveys some of the classics of the \"success\" genre - from Benjamin Franklin's Autobiography in the 18th century to Dale Carnegie's How to Win Friends and Influence People and Marcus Buckingham's Now, Discover Your Strengths in the 20th and 21st centuries. Case studies of remarkable achievements in business and society and Arthur Miller's play Death of a Salesman provide additional contexts within which to reflect on the questions at the center of the course. Students will keep a personal journal and use web-based tools to examine their own character strengths, talents, and achievement orientations. Grading is based on class attendance and participation, reading response papers, personal journals on assigned topics involving self reflection, a mid-term paper on an assigned research subject related to success, and a final, longer paper exploring, based on course readings and original research, each students personal philosophy of success. No final exam. \n\n", "semester": "2009A", "name": "LITERATURE OF SUCCESS: Literature of Success: Ethical and Historical Perspectives", "reviews": {"path": "/courses/15994/reviews", "values": [{"ratings": {"rAmountLearned": "3.61", "rDifficulty": "2.68", "rStimulateInterest": "3.84", "rRecommendMajor": "3.77", "rCourseQuality": "3.84", "rWorkRequired": "3.39", "rInstructorAccess": "3.61", "rReadingsValue": "3.71", "rRecommendNonMajor": "3.81", "rCommAbility": "3.84", "rInstructorQuality": "3.87"}, "section": {"name": "LITERATURE OF SUCCESS: Literature of Success: Ethical and Historical Perspectives", "sectionnum": "001", "primary_alias": "LGST-227-001", "path": "/courses/15994/sections/001", "id": "15994-001", "aliases": ["LGST-227-001"]}, "comments": "This course explores the history, literature, and philosophy of two age-old questions: what does it mean to be successful and how does one achieve this elusive goal? It surveys some of the classics of the \\\"success\\\" genre - from Benjamin Franklin\\'s Autobiography in the 18th century to Dale Carnegie\\'s How to Win Friends and Influence People and Marcus Buckingham\\'s Now, Discover Your Strengths in the 20th and 21st centuries. Case studies of remarkable achievements in business and society and Arthur Miller\\'s play Death of a Salesman provide additional contexts within which to reflect on the questions at the center of the course. Students will keep a personal journal and use web-based tools to examine their own character strengths, talents, and achievement orientations. Grading is based on class participation, reading response papers, a final paper and quizzes on the readings.\r\n\r\nStudents raved about “Literature of Success,” describing it as a “class on life” that has “improved who I am as a person.” Several students noted that the “tangible practices” taught in this class helped them “see the big picture” and develop a better view on their futures. While the course content contains “a lot of reading,” outside material and personal experiences drawn from Professor Shell and the other students make it “incredibly fascinating… as ideal of a college class as one can get.”\r\n\r\nStudents heaped almost every type of praise on Professor Shell, calling him “terrific, incredible, excellent, amazing, and fabulous… by far my favorite professor at Penn.” According to one student, Professor Shell creates “an amazingly welcoming and entertaining classroom experience” with great organization and an ability to get the class to interact with each other. For those who like to get to know their professors on a more personal level, one student expressed an appreciation for Professor Shell’s willingness “to spend time outside the classroom and mentor students.”\r\n\r\nOne area of criticism was the grading system. While Professor Shell warns students before the class to “learn and not worry about the grade,” many expressed frustration at what they felt were “subjective” grades that “don’t really have anything to do with what you are learning.” Students were divided on whether the top students were those who “got the most out of the class” or were simply the best writers. A few also noted that the class requires “a lot of reading and writing.”", "num_students": 33, "path": "/courses/15994/sections/001/reviews/2191-G-RICHARD-SHELL", "instructor": {"path": "/instructors/2191-G-RICHARD-SHELL", "first_name": "G RICHARD", "last_name": "SHELL", "id": "2191-G-RICHARD-SHELL", "name": "G RICHARD SHELL"}, "num_reviewers": 32, "id": "15994-001-2191-G-RICHARD-SHELL"}]}, "credits": null, "primary_alias": "LGST-227", "path": "/courses/15994", "sections": {"path": "/courses/15994/sections", "values": [{"name": "LITERATURE OF SUCCESS: Literature of Success: Ethical and Historical Perspectives", "sectionnum": "001", "primary_alias": "LGST-227-001", "path": "/courses/15994/sections/001", "id": "15994-001", "aliases": ["LGST-227-001"]}]}, "id": 15994, "aliases": ["LGST-227"]}