{"coursehistories": {"path": "/coursehistories/1704"}, "description": "Intensive exposure to current issues and solutions in contemporary human interactions with the environment. Global in scope, but focused on case histories. Emphasis on providing biological and sociological background for a given major environment-human interaction, and state-of-the-art suggested solutions. \n\n", "semester": "2011C", "name": "HUMANS & THE ENVIRONMENT", "reviews": {"path": "/courses/24061/reviews", "values": [{"ratings": {"rAmountLearned": "3.27", "rDifficulty": "2.43", "rStimulateInterest": "3.76", "rRecommendMajor": "3.73", "rCourseQuality": "3.32", "rWorkRequired": "2.59", "rInstructorAccess": "2.89", "rReadingsValue": "2.67", "rRecommendNonMajor": "3.30", "rCommAbility": "3.76", "rInstructorQuality": "3.70"}, "section": {"name": "HUMANS & THE ENVIRONMENT", "sectionnum": "401", "primary_alias": "BIOL-140-401", "path": "/courses/24061/sections/401", "id": "24061-401", "aliases": ["BIOL-140-401", "BIOL-440-401"]}, "comments": "This course explores the interface of contemporary humans with their\r\nenvironments across the world by focusing on various case histories, with a strong\r\nemphasis on biology. Lectures are recorded and based on photographic essays mounted\r\nonto Power Point presentations, often containing over 50 images with accompanying text.\r\nSeveral classes are taught by guest lecturers. The textbook used is The Diversity of Life,\r\nby Wilson (1999). The course fulfills the Natural Science and Mathematics sector\r\nrequirement and is not recommended for freshman or students without some background\r\nin biology.\r\nMany students referred to this course as “the best class” they have ever taken,\r\nreporting “the material was really interesting, even for people who don’t have much\r\ninterest in biology.” There was a lot of material to be learned, however.\r\nNearly every student gave Professor Janzen fantastic reviews, describing him as\r\n“an icon in science… an inspiration to anyone interested in biology.” He was noted for\r\nhis “extensive life experiences” in the subject and the fact that he “discovered a lot” of\r\nwhat was studied in class. Students reported Professor Janzen had the ability to make\r\n“ecology extremely interesting and accessible.”\r\nBoth science and non-science majors really enjoyed this class and found it\r\nmanageable. The course does require “a lot of reading,” but not much work outside of\r\nthat. Additionally, the material was described as “not difficult.” Students described the\r\nexams as “fair,” but they could be very “specific.”", "num_students": 55, "path": "/courses/24061/sections/401/reviews/1287-DANIEL-H-JANZEN", "instructor": {"path": "/instructors/1287-DANIEL-H-JANZEN", "first_name": "DANIEL H", "last_name": "JANZEN", "id": "1287-DANIEL-H-JANZEN", "name": "DANIEL H JANZEN"}, "num_reviewers": 48, "id": "24061-401-1287-DANIEL-H-JANZEN"}]}, "credits": null, "primary_alias": "BIOL-140", "path": "/courses/24061", "sections": {"path": "/courses/24061/sections", "values": [{"name": "HUMANS & THE ENVIRONMENT", "sectionnum": "401", "primary_alias": "BIOL-140-401", "path": "/courses/24061/sections/401", "id": "24061-401", "aliases": ["BIOL-140-401", "BIOL-440-401"]}]}, "id": 24061, "aliases": ["BIOL-140", "BIOL-440"]}