[{"ratings": {"rAmountLearned": "3.13", "rDifficulty": "3.17", "rStimulateInterest": "3.04", "rRecommendMajor": "3.26", "rCourseQuality": "3.28", "rWorkRequired": "2.89", "rInstructorAccess": "3.16", "rReadingsValue": "2.84", "rRecommendNonMajor": "1.69", "rCommAbility": "3.37", "rInstructorQuality": "3.48"}, "section": {"name": "THEORY OF COMPUTATION", "sectionnum": "001", "primary_alias": "CIS-511-001", "path": "/courses/27168/sections/001", "id": "27168-001", "aliases": ["CIS-511-001"]}, "comments": "This course will cover:  1) review of regular and context-free languages and machine models;  2) Turing machines and RAM models, Decidability, Halting problem, Reductions, Recursively enumerable sets, Universal TMs, Church/Turing thesis; 3) time and space complexity, hierarchy theorems, the complexity classes P, NP, PSPACE, L, NL, and co-NL; 4) reductions revisited, Cook-Levin Theorem, completeness, NL = co-NL; as well as 5) advanced topics as time permits: Circuit complexity and parallel computation, randomized complexity, approximability, interaction and cryptography.\r\n\r\nMost students enjoyed how the professor made the material accessible to everyone. Students noticed an overlap with this course’s material and CIS502. However one student stated how “I would have liked a more mathematical course, but the current format is definitely most appropriate for the intended audience.” Students also enjoyed the textbook which is “amazing, very detailed, and covered everything that was in the class.”\r\n\r\nStudents commended Prof. Kannan’s teaching style, which made the material accessible to students. Students also called the professor “exciting.” Students stated that most TA’s were incredibly helpful and highly recommended seeing them outside of class for homework assistance.\r\n\r\nThis course is intended for upper level undergraduate or graduate computer science students. Homework was reported as time-consuming and challenging especially at the beginning, but students were comforted by the fact that homework didn’t count much towards grading and really helped with understanding the class material. \r\n", "num_students": 66, "path": "/courses/27168/sections/001/reviews/247-SAMPATH-K--KANNAN", "instructor": {"path": "/instructors/247-SAMPATH-K--KANNAN", "first_name": "SAMPATH K.", "last_name": "KANNAN", "id": "247-SAMPATH-K--KANNAN", "name": "SAMPATH K. KANNAN"}, "num_reviewers": 62, "id": "27168-001-247-SAMPATH-K--KANNAN"}]