[{"ratings": {"rAmountLearned": "3.56", "rDifficulty": "2.00", "rTAQuality": "3.33", "rStimulateInterest": "3.47", "rRecommendMajor": "3.76", "rCourseQuality": "3.82", "rWorkRequired": "2.13", "rInstructorAccess": "3.71", "rReadingsValue": "3.41", "rRecommendNonMajor": "2.59", "rCommAbility": "3.82", "rInstructorQuality": "3.76"}, "section": {"name": "CASE STUDY: QUALITY CARE CHALLENGES IN AN EVOLVING HEALTH CARE MARKET", "sectionnum": "401", "primary_alias": "NURS-359-401", "path": "/courses/27880/sections/401", "id": "27880-401", "aliases": ["NURS-359-401", "NURS-559-401"]}, "comments": "Quality care is an issue for consumers, providers, purchasers, and policy makers.  This case study examines the multiple challenges that surround the quality of health care in the evolving United States health care marketplace. Through classroom discussion and special project experience, the student will become familiar with the concept of health care quality and approaches to the measurement and management of quality.  Using Donabedian's construct of structure, process and outcomes, strategies to  improve quality while containing or reducing costs are reviewed, including the contributions of clinical practice guidelines.  The evolving dominant structures for providing health care services, managed care and integrated delivery systems, and their approaches to quality management and reporting will be explored.\r\n\tReviews of this course were overwhelmingly positive. The course is described as “incredibly informative,” “engaging,” and “exciting.” Not only did students appreciate the material, but they found the small class size to be enhancing to the course and the interactive games to be “amazing.” Students also appreciated the numerous out-of-class experiences offered as part of the course and described the course as “applicable to any field of nursing.” Most students commented that the class should be made a requirement of the undergraduate curriculum as all would benefit from the material.\r\n\tThere could not be greater enthusiasm toward the professors of this course. The reviews lauded the “great support” from both professors and described both as “professional,” “warm,” “friendly,” and “respectful.” The general consensus amongst students was that both professors were extremely “enthusiastic and knowledgeable teachers” who engaged students and served as role models. \r\n\tStudents would have appreciated greater grade feedback. Furthermore, while the amount of work was considered manageable, the bulk of the course load occurred at the end stage of the class. This course is not a required component of the curriculum, so students must fulfill the prerequisite courses of NURS 104 or 106 before enrolling in this course.\r\n", "num_students": 17, "path": "/courses/27880/sections/401/reviews/6143-KRISTA-M-PINOLA", "instructor": {"path": "/instructors/6143-KRISTA-M-PINOLA", "first_name": "KRISTA M", "last_name": "PINOLA", "id": "6143-KRISTA-M-PINOLA", "name": "KRISTA M PINOLA"}, "num_reviewers": 17, "id": "27880-401-6143-KRISTA-M-PINOLA"}, {"ratings": {"rAmountLearned": "3.56", "rDifficulty": "2.00", "rTAQuality": "3.33", "rStimulateInterest": "3.53", "rRecommendMajor": "3.76", "rCourseQuality": "3.82", "rWorkRequired": "2.13", "rInstructorAccess": "3.44", "rReadingsValue": "3.41", "rRecommendNonMajor": "2.59", "rCommAbility": "3.82", "rInstructorQuality": "3.88"}, "section": {"name": "CASE STUDY: QUALITY CARE CHALLENGES IN AN EVOLVING HEALTH CARE MARKET", "sectionnum": "401", "primary_alias": "NURS-359-401", "path": "/courses/27880/sections/401", "id": "27880-401", "aliases": ["NURS-359-401", "NURS-559-401"]}, "comments": "Quality care is an issue for consumers, providers, purchasers, and policy makers. This case study examines the multiple challenges that surround the quality of health care in the evolving United States health care marketplace. Through classroom discussion and special project experience, students will become familiar with the concept of health care quality and approaches to the measurement and management of quality. Using Donabedian's construct of structure, process and outcomes, strategies to improve quality while containing or reducing costs are reviewed, including the contributions of clinical practice guidelines. The evolving dominant structures for providing health care services, managed care and integrated delivery systems, and their approaches to quality management and reporting will be explored.\r\n\tReviews of this course were overwhelmingly positive. The course is described as “incredibly informative,” “engaging,” and “exciting.” Not only did students appreciate the material, but they found the small class size as enhancing the course and the interactive games as “amazing.” Students also appreciated the numerous out of class experiences offered as a part of the course and described the course as “applicable to any field of nursing.” Most students commented that the class should be made a requirement of the undergraduate curriculum as all would benefit from the material.\r\n\tThere could not be greater enthusiasm toward the professors of this course. The reviews lauded the “great support” from both professors and described both as “professional,” “warm,” “friendly,” and “respectful.” The general consensus amongst students was that both professors were extremely “enthusiastic and knowledgeable teachers” who engaged students and served as role models. \r\n\tStudents would have appreciated greater grade feedback. Furthermore, while the amount of work was considered manageable, the bulk of the course load occurred at the end stage of the class. This course is not a required component of the curriculum, so students must fulfill the prerequisite courses of NURS 104 or 106 before enrolling in this course.\r\n", "num_students": 17, "path": "/courses/27880/sections/401/reviews/6144-MICHELLE-O-SPARROW", "instructor": {"path": "/instructors/6144-MICHELLE-O-SPARROW", "first_name": "MICHELLE O", "last_name": "SPARROW", "id": "6144-MICHELLE-O-SPARROW", "name": "MICHELLE O SPARROW"}, "num_reviewers": 17, "id": "27880-401-6144-MICHELLE-O-SPARROW"}]