{"coursehistories": {"path": "/coursehistories/568"}, "description": "This course covers the social, political, and economic history of the United States from the end of the Civil War to the present. Topics to be discussed include Reconstruction, politics in the Gilded Age, late nineteenth-century urbanization and immigration, Populism, Progressivism, the rise of the United States to world power, the culture and politics of the twenties, the New Deal, the Cold War, post-World War II America, the turbulence of the sixties, the conservative resurgence, and the move toward a more pluralistic society. \n\n", "semester": "2009A", "name": "US HISTORY 1865-PRESENT", "reviews": {"path": "/courses/15887/reviews", "values": [{"ratings": {"rAmountLearned": "2.65", "rDifficulty": "2.12", "rStimulateInterest": "2.75", "rRecommendMajor": "3.22", "rCourseQuality": "2.73", "rWorkRequired": "2.47", "rInstructorAccess": "2.81", "rReadingsValue": "2.84", "rRecommendNonMajor": "2.87", "rCommAbility": "3.04", "rInstructorQuality": "3.00"}, "section": {"name": "US HISTORY 1865-PRESENT", "sectionnum": "001", "primary_alias": "HIST-021-001", "path": "/courses/15887/sections/001", "id": "15887-001", "aliases": ["HIST-021-001"]}, "comments": "This course covers the social, political, and economic history of the nation from the Civil War to the present. Topics to be discussed include the causes and course of the Civil War, Reconstruction, politics in the Gilded Age, late nineteenth-century urbanization and immigration, Populism, Progressivism, the sociology and politics of the twenties, the New Deal, post-World War II America, the turbulence of the sixties, and contemporary affairs.\r\n\r\nIn general, students gave the class “two thumbs up.” The readings for the class—which consisted of material from both textbook and a bulk pack—got mixed reviews in terms of both quality and relevance to the course. Most students felt that they got a good survey of this historical period. However, some were dissatisfied with the lack of depth of analysis into certain events, and that there seemed to be few unifying themes in the course.\r\n\r\nUnfortunately, the “fantastic” Professor Kropp will not be teaching at Penn any more, a fact that dismayed many of the students. Her use of multimedia—which included documentary clips, primary sources, and music from the period they were studying at the start of each class—was a major source of positive feedback.\r\n\r\nStudents uniformly thought the class was not difficult, although it was still “stimulating.” Most thought it was an appropriate first course in the History department because it relied on material students would know from high school.", "num_students": 88, "path": "/courses/15887/sections/001/reviews/641-PHOEBE-S-KROPP", "instructor": {"path": "/instructors/641-PHOEBE-S-KROPP", "first_name": "PHOEBE S", "last_name": "KROPP", "id": "641-PHOEBE-S-KROPP", "name": "PHOEBE S KROPP"}, "num_reviewers": 80, "id": "15887-001-641-PHOEBE-S-KROPP"}]}, "credits": null, "primary_alias": "HIST-021", "path": "/courses/15887", "sections": {"path": "/courses/15887/sections", "values": [{"name": "US HISTORY 1865-PRESENT", "sectionnum": "001", "primary_alias": "HIST-021-001", "path": "/courses/15887/sections/001", "id": "15887-001", "aliases": ["HIST-021-001"]}]}, "id": 15887, "aliases": ["HIST-021"]}