[{"ratings": {"rAmountLearned": "2.18", "rDifficulty": "1.57", "rStimulateInterest": "2.86", "rRecommendMajor": "3.16", "rCourseQuality": "2.45", "rWorkRequired": "1.71", "rInstructorAccess": "2.90", "rReadingsValue": "2.11", "rRecommendNonMajor": "2.60", "rCommAbility": "2.67", "rInstructorQuality": "2.69"}, "section": {"name": "COMM, CHILDHOOD, & PLAY", "sectionnum": "001", "primary_alias": "COMM-224-001", "path": "/courses/25835/sections/001", "id": "25835-001", "aliases": ["COMM-224-001"]}, "comments": "This course is designed to explore the history and construction of childhood and investigate the importance of play. To that end, during the first part of the course we will explore the idea of childhood including infancy, middle childhood, and the invention of adolescence; changing notions of child-rearing (e.g., “experts”, discipline, place in society); schooling; vulnerable children; the child and the state; and the child’s world (e.g., relationships with parents and peers; consumer culture; media; play). During the second part of the course, we will explore play in more detail including the culture of play; theories of play; artifacts used in play; and ways to study play. Course activities include lectures and group discussions; reading book chapters and empirical journal articles; examining children’s artwork and writing samples; observing children at play; exploring children’s artifacts (e.g., video games, board games, toys, videos, TV shows, books); and examining representations of childhood in popular culture. There will be several small writing projects (i.e., 3-5 pages); a mid-term and final (i.e., multiple choice, short-answer, and essay questions); and a final project designed in consultation with the instructor and/or TA.\r\nA number of students felt that the course was not accurately represented by the title and that it should be listed in the Psychology department rather than the Communications department. That said, many described the material as “interesting and fun.”\r\nReviews of Professor Linenbarger’s style were mixed. Some students really enjoyed being able to have such a great deal of discussion and sharing of personal experience despite the 90-person class size. Most found this to be frustrating, however, with students complaining that all the discussion was “not really necessary, particularly since there were many times when the professor could not finish the lecture.” Furthermore, students agreed that Professor Linenbarger’s tardiness led to an overall decrease in class productivity. Nevertheless, they conceded that Professor Linenbarger “knows how to engage a class and encourage participation.”\r\nStudents found the workload to be manageable but noted that since so much class time is devoted to discussion, exams tend to test material that was only covered in the reading. Students found that the papers were “not very taxing” and somewhat unique. ", "num_students": 90, "path": "/courses/25835/sections/001/reviews/1814-DEBORAH-L--LINEBARGER", "instructor": {"path": "/instructors/1814-DEBORAH-L--LINEBARGER", "first_name": "DEBORAH L.", "last_name": "LINEBARGER", "id": "1814-DEBORAH-L--LINEBARGER", "name": "DEBORAH L. LINEBARGER"}, "num_reviewers": 89, "id": "25835-001-1814-DEBORAH-L--LINEBARGER"}]