[{"ratings": {"rAmountLearned": "3.69", "rDifficulty": "2.93", "rStimulateInterest": "3.61", "rRecommendMajor": "3.86", "rCourseQuality": "3.58", "rWorkRequired": "2.64", "rInstructorAccess": "3.45", "rReadingsValue": "3.28", "rRecommendNonMajor": "3.72", "rCommAbility": "3.62", "rInstructorQuality": "3.48"}, "section": {"name": "NEGOTIATION/CONFLICT RES", "sectionnum": "406", "primary_alias": "LGST-206-406", "path": "/courses/27660/sections/406", "id": "27660-406", "aliases": ["LGST-206-406", "OPIM-291-406", "MGMT-291-406"]}, "comments": "LGST 206 examines the art and science of negotiation, with additional emphasis on conflict resolution. Students will engage in a number of simulated negotiations ranging from simple one-issue transactions to multi-party joint ventures. Through these exercises and associated readings, students explore the basic theoretical models of bargaining and have an opportunity to test and improve their negotiation skills.\r\n \r\nMost students found that this class helped them develop their “own skills as a negotiator,” and was the “most valuable and applicable to life course” they have taken at Penn. Some students found that the “classes consisted of telling personal stories, followed by negotiations that students were expected to prepare for and largely learn from.” Most students found that the organization of the class was the “most effective way to present the complexity of the fascinating art of negotiation” and that “people should take this course if they genuinely wish to learn and better themselves as negotiators.” Many students liked that there was a lot of “opportunity to work with other students” which stimulated their “interest in negotiations.” However, some students complained that they would have liked a “stronger background in negotiations theory.”\r\n\r\nThe majority of students thought Professor Shell was “fantastic” and “extremely knowledgeable.” Some students found that Professor Shell did a “fantastic job providing us with the tools needed to succeed not only in negotiations, but in life”. However, a few students found that Professor Shell did not meet their expectations because there was “not a great deal of advice from the Professor” and that his “contribution to the class is more of a mediator than anything else.” Another student also thought Professor Shell was a “huge stickler with grading.” \r\n\r\nIn all, every student found that this course was “challenging” and stressful. Some students noticed that the “competition is fierce,” the “grading schema was brutal” and that there are “few A’s.” Some students also felt that the exams were “exams felt out of place in the overall grand scheme of the course.” Another student found that the “negotiation outcomes against” other top students “a high portion of your grade.” Therefore students agreed that this course is “not for everyone.” This class has no prerequisites and is open to any student regardless of college or major. \r\n", "num_students": 36, "path": "/courses/27660/sections/406/reviews/2191-G-RICHARD-SHELL", "instructor": {"path": "/instructors/2191-G-RICHARD-SHELL", "first_name": "G RICHARD", "last_name": "SHELL", "id": "2191-G-RICHARD-SHELL", "name": "G RICHARD SHELL"}, "num_reviewers": 33, "id": "27660-406-2191-G-RICHARD-SHELL"}, {"ratings": {"rAmountLearned": "3.41", "rDifficulty": "1.24", "rStimulateInterest": "3.21", "rRecommendMajor": "3.52", "rCourseQuality": "3.42", "rWorkRequired": "1.45", "rInstructorAccess": "2.93", "rReadingsValue": "3.07", "rRecommendNonMajor": "3.48", "rCommAbility": "3.14", "rInstructorQuality": "3.41"}, "section": {"name": "NEGOTIATION/CONFLICT RES", "sectionnum": "407", "primary_alias": "LGST-206-407", "path": "/courses/27660/sections/407", "id": "27660-407", "aliases": ["LGST-206-407", "OPIM-291-407", "MGMT-291-407"]}, "comments": "", "num_students": 36, "path": "/courses/27660/sections/407/reviews/718-KENNETH-L--SHROPSHIRE", "instructor": {"path": "/instructors/718-KENNETH-L--SHROPSHIRE", "first_name": "KENNETH L.", "last_name": "SHROPSHIRE", "id": "718-KENNETH-L--SHROPSHIRE", "name": "KENNETH L. SHROPSHIRE"}, "num_reviewers": 33, "id": "27660-407-718-KENNETH-L--SHROPSHIRE"}, {"ratings": {"rAmountLearned": "3.32", "rDifficulty": "2.27", "rStimulateInterest": "3.27", "rRecommendMajor": "3.41", "rCourseQuality": "3.10", "rWorkRequired": "2.41", "rInstructorAccess": "3.23", "rReadingsValue": "2.59", "rRecommendNonMajor": "3.36", "rCommAbility": "3.41", "rInstructorQuality": "3.10"}, "section": {"name": "NEGOTIATION/CONFLICT RES", "sectionnum": "408", "primary_alias": "LGST-206-408", "path": "/courses/27660/sections/408", "id": "27660-408", "aliases": ["LGST-206-408", "OPIM-291-408", "MGMT-291-408"]}, "comments": "Legal Studies 206, Negotiation and Conflict Resolution, examines the art and science of negotiation, with additional emphasis on conflict resolution. Students will engage in a number of simulated negotiations ranging from simple one-issue transactions to multi-party joint ventures. Through these exercises and associated readings, students explore the basic theoretical models of bargaining and have an opportunity to test and improve their negotiation skills. \r\n\tStudents commented that the course was “awesome,” and “the most rewarding class they have taken at Penn.” There is an “emphasis on learning and applying knowledge.” Some students did comment that the grading seemed “rather arbitrary,” and “inconsistent.”\r\n\tStudents regarded Professor Beer as “amazing” and “nice.” She seemed to be enthusiastic about the subject matter and was able to convey that to students. One student commented that “not only does she do a great job of communicating the course material, but also [she is] great at getting students to critically engage with the material.” \r\n\tThis course is open to everyone. Students recommended it to any current Penn student. \r\n", "num_students": 35, "path": "/courses/27660/sections/408/reviews/1544-JENNIFER-E--BEER", "instructor": {"path": "/instructors/1544-JENNIFER-E--BEER", "first_name": "JENNIFER E.", "last_name": "BEER", "id": "1544-JENNIFER-E--BEER", "name": "JENNIFER E. BEER"}, "num_reviewers": 30, "id": "27660-408-1544-JENNIFER-E--BEER"}, {"ratings": {"rAmountLearned": "3.38", "rDifficulty": "2.31", "rStimulateInterest": "3.83", "rRecommendMajor": "3.52", "rCourseQuality": "3.35", "rWorkRequired": "2.79", "rInstructorAccess": "3.03", "rReadingsValue": "3.00", "rRecommendNonMajor": "3.31", "rCommAbility": "3.62", "rInstructorQuality": "3.62"}, "section": {"name": "NEGOTIATION/CONFLICT RES", "sectionnum": "409", "primary_alias": "LGST-206-409", "path": "/courses/27660/sections/409", "id": "27660-409", "aliases": ["LGST-206-409", "OPIM-291-409", "MGMT-291-409"]}, "comments": "Legal Studies 206, Negotiation and Conflict Resolution, examines the art and science of negotiation, with additional emphasis on conflict resolution. Students will engage in a number of simulated negotiations ranging from simple one-issue transactions to multi-party joint ventures. Through these exercises and associated readings, students explore the basic theoretical models of bargaining and have an opportunity to test and improve their negotiation skills. \r\n\tStudents commented that this class was one of “the best taken at Penn.” Others commented that this class is a “must take,” and “awesome.” A couple of students commented that the workload is quite immense, but most students said they loved the class regardless. One student commented that the “course helped to shape my negotiating style and how I approach negotiations more generally.” Another student highlighted the value of “the outside work for the class… Weekly negotiations, reading from a few great books, and [the] course journal [were] invaluable when synthesizing the course material.”\r\n\tProfessor Blum was highly praised by students.  He was regarded as “fantastic” and “great” and “one of the funniest and considerate people.” Students commented that Professor Blum did a great job of connecting course concepts the real world and that he “[was] great at stimulating student interest.”\r\n\tStudents recommended this course to any student at Penn. The course is open to all, but auditors do need permission. \r\n", "num_students": 35, "path": "/courses/27660/sections/409/reviews/710-STEVEN-BLUM", "instructor": {"path": "/instructors/710-STEVEN-BLUM", "first_name": "STEVEN", "last_name": "BLUM", "id": "710-STEVEN-BLUM", "name": "STEVEN BLUM"}, "num_reviewers": 34, "id": "27660-409-710-STEVEN-BLUM"}]