{"coursehistories": {"path": "/coursehistories/486"}, "description": "This course examines the available corporate securities that firms can use to finance investment. The course will focus on:(1) the design of these securities (Why do bonds have embedded options? What is the role of preferred stock?); (2) the issuing process for these securities (What do investment banks do? Is the underwriting process important for the cost of capital?); (3) the pricing of these securities (How are credit risk in bonds and loans priced?) The securities covered include corporate and junk bonds, bank loans, common and preferred equity, commercial paper, securitization, as well as some recent innovations. Other topics include: the role of embedded options in corporate bonds; the role of bank and loan covenants; the function of bond rating agencies; exchange offers; prepackaged bankruptcies; bankruptcy in Chapter 11; workouts; debtor-in-possession financing; and pricing credit risk. The course is desgined to be complementary to Advanced Corporate Finance and Fixed Income Securities. \n\n", "semester": "2009A", "name": "FUNDING INVESTMENTS", "reviews": {"path": "/courses/15773/reviews", "values": [{"ratings": {"rAmountLearned": "3.09", "rDifficulty": "3.47", "rStimulateInterest": "2.65", "rRecommendMajor": "3.05", "rCourseQuality": "2.79", "rWorkRequired": "3.77", "rInstructorAccess": "2.84", "rReadingsValue": "1.67", "rRecommendNonMajor": "1.44", "rCommAbility": "2.70", "rInstructorQuality": "2.87"}, "section": {"name": "FUNDING INVESTMENTS", "sectionnum": "001", "primary_alias": "FNCE-238-001", "path": "/courses/15773/sections/001", "id": "15773-001", "aliases": ["FNCE-238-001"]}, "comments": "FNCE 238 will focus on: (1) the design of these securities; (2) the issuing process for these securities; and (3) the pricing of these securities. The securities covered include corporate and junk bonds, bank loans, common and preferred equity, commercial paper, securitization, as well as some recent innovations. Other topics include: the role of embedded options in corporate bonds; the role of bank and loan covenants; the function of bond rating agencies; exchange offers; prepackaged bankruptcies; bankruptcy in Chapter 11; workouts; debtor-in-possession financing; and pricing credit risk. The course is designed to be complementary to Advanced Corporate Finance and Fixed Income Securities.\r\n\r\nFNCE 738 with Professor Hauswald covers a variety of investment topics and is taught thoroughly. Students noted that the lectures move quickly and cover a vast array of finance material. This course also becomes highly quantitative, straying into several topics on trading.\r\n\r\nProfessor Hauswald has been described by students as “entertaining,” “funny,” and “incredibly knowledgeable.” Many students appreciate the considerable effort he puts into the class and the vast quantity of information he introduces. Some, however, feel that he tries to pack too much material into each lecture.\r\n\r\nMost students find FNCE 738 extremely intense. The workload was described as “overwhelming.” It requires 5 cases, 6 homework assignments, and 2 exams. Though the challenge of FNCE 738 can seem daunting initially, most students who can manage it find it worthwhile and rewarding.", "num_students": 50, "path": "/courses/15773/sections/001/reviews/4337-ROBERT-HAUSWALD", "instructor": {"path": "/instructors/4337-ROBERT-HAUSWALD", "first_name": "ROBERT", "last_name": "HAUSWALD", "id": "4337-ROBERT-HAUSWALD", "name": "ROBERT HAUSWALD"}, "num_reviewers": 49, "id": "15773-001-4337-ROBERT-HAUSWALD"}]}, "credits": null, "primary_alias": "FNCE-238", "path": "/courses/15773", "sections": {"path": "/courses/15773/sections", "values": [{"name": "FUNDING INVESTMENTS", "sectionnum": "001", "primary_alias": "FNCE-238-001", "path": "/courses/15773/sections/001", "id": "15773-001", "aliases": ["FNCE-238-001"]}]}, "id": 15773, "aliases": ["FNCE-238"]}