{"coursehistories": {"path": "/coursehistories/3031"}, "description": "This course examines how the criminal justice system responds to crime in society. The course reviews the historical development of criminal justice agencies in the United States and Europe and the available scientific evidence on the effect these agencies have on controlling crime. The course places an emphasis onthe functional creation of criminal justice agencies and the discretionary role decision makers in these agencies have in deciding how to enforce criminal laws and whom to punish. Evidence on how society measures crime and the role that each major criminal justice agency plays in controlling crime is examined from the perspective of crime victims, police, prosecutors, jurors, judges, prison officials, probation officers and parole board members. Using the model of social policy evaluation, the course asks students to consider how the results of criminal justice could be more effectively delivered to reduce the social and economic costs of crime. \n\n", "semester": "2011A", "name": "CRIMINAL JUSTICE", "reviews": {"path": "/courses/21513/reviews", "values": [{"ratings": {"rAmountLearned": "2.61", "rDifficulty": "1.57", "rStimulateInterest": "2.71", "rRecommendMajor": "3.47", "rCourseQuality": "2.78", "rWorkRequired": "1.60", "rInstructorAccess": "2.73", "rReadingsValue": "1.89", "rRecommendNonMajor": "3.09", "rCommAbility": "3.18", "rInstructorQuality": "3.07"}, "section": {"name": "CRIMINAL JUSTICE", "sectionnum": "401", "primary_alias": "CRIM-200-401", "path": "/courses/21513/sections/401", "id": "21513-401", "aliases": ["CRIM-200-401", "SOCI-200-401"]}, "comments": "This course examines how the criminal justice system responds to crime in society. The course reviews the historical development of criminal justice agencies in the United States and Europe and the available scientific evidence on the effect these agencies have on controlling crime. An emphasis is placed on the functional creation of criminal justice agencies and the discretionary role decision makers in these agencies have in deciding how to enforce criminal laws and whom to punish. Evidence on how society measures crime and the role that each major criminal justice agency plays in controlling crime is examined from the perspective of crime victims, police, prosecutors, jurors, judges, prison officials, probation officers and parole board members. Using the model of social policy evaluation, the course asks students to consider how the results of criminal justice could be more effectively delivered to reduce the social and economic costs of crime.&#8232;&#8232;This course heaped praise for its engaging curriculum and its practicality. Each student said that they learned a lot about a subject they were not initially knowledgeable about, and many found a new interest in the field. The class is planned so that students do not lose their interest halfway through. Instead, the professor takes time to delve into details that students show interest in and expands on real world examples to help deepen understanding within the course. &#8232;&#8232;Professor MacDonald received praise from nearly all of his students. He was said to be “the best professor I’ve had at Penn,” as well as “the reason I wanted to become a Criminology major.” He is very knowledgeable about the field and consequently, the class is very informative. Overall, students raved about his ability to use humor to communicate the material. &#8232;&#8232;The work level of this course was not described as demanding. Many students were not Criminology majors but were still averaging good results on tests and homework assignments. The readings were dry but often were found to be unnecessary because the material was reiterated in class. The course comes recommended to all.", "num_students": 183, "path": "/courses/21513/sections/401/reviews/4292-JOHN-M--MACDONALD", "instructor": {"path": "/instructors/4292-JOHN-M--MACDONALD", "first_name": "JOHN M.", "last_name": "MACDONALD", "id": "4292-JOHN-M--MACDONALD", "name": "JOHN M. MACDONALD"}, "num_reviewers": 168, "id": "21513-401-4292-JOHN-M--MACDONALD"}]}, "credits": null, "primary_alias": "CRIM-200", "path": "/courses/21513", "sections": {"path": "/courses/21513/sections", "values": [{"name": "CRIMINAL JUSTICE", "sectionnum": "401", "primary_alias": "CRIM-200-401", "path": "/courses/21513/sections/401", "id": "21513-401", "aliases": ["CRIM-200-401", "SOCI-200-401"]}]}, "id": 21513, "aliases": ["CRIM-200", "SOCI-200"]}