{"coursehistories": {"path": "/coursehistories/745"}, "description": "MGMT 230 integrates the material introduced in business fundamental courses andapplies it to the design and evaluation of new ventures. The purpose of this course is to explore the many dimensions of new venture creation and growth and to foster innovation and new business formations in independent and corporate settings. The course addresses both a theoretical perspective on venture initiation and the application of writing an actual business plan. \n\n", "semester": "2010A", "name": "ENTREPRENEURSHIP", "reviews": {"path": "/courses/26374/reviews", "values": [{"ratings": {"rAmountLearned": "2.21", "rDifficulty": "2.08", "rStimulateInterest": "3.00", "rRecommendMajor": "2.67", "rCourseQuality": "2.34", "rWorkRequired": "2.53", "rInstructorAccess": "3.63", "rReadingsValue": "2.13", "rRecommendNonMajor": "2.23", "rCommAbility": "2.45", "rInstructorQuality": "2.74"}, "section": {"name": "ENTREPRENEURSHIP", "sectionnum": "001", "primary_alias": "MGMT-230-001", "path": "/courses/26374/sections/001", "id": "26374-001", "aliases": ["MGMT-230-001"]}, "comments": "MGMT 230 integrates the material introduced in core courses and applies it to the design and evaluation of new ventures. The purpose of this course is to explore the many dimensions of new venture creation and growth to foster innovation and new business formations in independent and corporate settings. The course addresses both a theoretical perspective on venture initiation and the application of writing an actual business plan. \r\n\r\nStudent feedback for this course was mixed. Some students reported gaining “valuable knowledge about enterpreneurship and writing a business plan” but many students reported “learning very little in class.” One student commented, “I'm not walking away with too much tangible knowledge. I did feel like I learned some important life lessons, however.” On a whole, students were unsatisfied with the overall structure of the class.\r\n\r\nSimilarly, student feedback on Professor Gelburd varied significantly. A few students agreed that “Professor Gelburd is a fantastic instructor” but many criticized his incorporation of “way too many guest speakers” which made the class feel “haphazard.” There were many guest speakers. One student commented that “the added value of guest speakers and real-world experience information is incredible” but many felt that there were “too many guest speakers which took away from the class objective.”\r\n\r\nOne of the main requirements is to write a business plan which students agreed “required a great deal of time.” Some students wished that they received more specific guidelines for the final presentation. One student commented that “Assigned readings were very out-dated and I found them not helpful at all. However, I learned very much through the business-plan project (much more than in my other Wharton courses) and this class has really changed the way I view entrepreneurship and changed my career outlook and I am grateful for that.”", "num_students": 53, "path": "/courses/26374/sections/001/reviews/3064-LAWRENCE-GELBURD", "instructor": {"path": "/instructors/3064-LAWRENCE-GELBURD", "first_name": "LAWRENCE", "last_name": "GELBURD", "id": "3064-LAWRENCE-GELBURD", "name": "LAWRENCE GELBURD"}, "num_reviewers": 49, "id": "26374-001-3064-LAWRENCE-GELBURD"}]}, "credits": null, "primary_alias": "MGMT-230", "path": "/courses/26374", "sections": {"path": "/courses/26374/sections", "values": [{"name": "ENTREPRENEURSHIP", "sectionnum": "001", "primary_alias": "MGMT-230-001", "path": "/courses/26374/sections/001", "id": "26374-001", "aliases": ["MGMT-230-001"]}]}, "id": 26374, "aliases": ["MGMT-230"]}