[{"ratings": {"rAmountLearned": "2.91", "rDifficulty": "2.11", "rStimulateInterest": "3.33", "rRecommendMajor": "3.48", "rCourseQuality": "2.85", "rWorkRequired": "2.12", "rInstructorAccess": "2.11", "rReadingsValue": "2.82", "rRecommendNonMajor": "3.02", "rCommAbility": "3.11", "rInstructorQuality": "3.30"}, "section": {"name": "INTRO TO SOCIOLOGY", "sectionnum": "001", "primary_alias": "SOCI-001-001", "path": "/courses/20843/sections/001", "id": "20843-001", "aliases": ["SOCI-001-001"]}, "comments": "Sociology provides a unique way to look at human behavior and the world. Sociology is the systematic study of the groups and societies in which people live. This introductory course will examine and analyze how social structures and cultures are created, maintained, and most importantly, how they affect behavior. The course deconstructs our taken for granted world of social interactions and behaviors and examines what theory and research can tell about human social behavior.\r\n\r\nMost students “really enjoyed the class” and found the material “interesting.” Many students also indicated that lectures involved casual discussion. Some of the students found this engaging, while others found it frustrating in light of the tests, which most said focused on “memorization/regurgitation” of information in assigned readings.\r\n\r\nMost students remarked, “Professor Gelles is a great teacher.” However, some others thought that he should have conducted a more structured class.\r\n\r\nThe majority of student responses indicated dissatisfaction with tests and grading.  One student wrote, “We were often graded on terms used in our answers (rather than the content).”  Another said, “the exams focus on memorizing terms never mentioned in class.” This class fulfills the society requirement.", "num_students": 91, "path": "/courses/20843/sections/001/reviews/1084-RICHARD-GELLES", "instructor": {"path": "/instructors/1084-RICHARD-GELLES", "first_name": "RICHARD", "last_name": "GELLES", "id": "1084-RICHARD-GELLES", "name": "RICHARD GELLES"}, "num_reviewers": 66, "id": "20843-001-1084-RICHARD-GELLES"}]