[{"ratings": {"rAmountLearned": "2.93", "rDifficulty": "2.76", "rStimulateInterest": "2.71", "rRecommendMajor": "3.42", "rCourseQuality": "3.01", "rWorkRequired": "2.83", "rInstructorAccess": "2.88", "rReadingsValue": "2.75", "rRecommendNonMajor": "2.34", "rCommAbility": "3.16", "rInstructorQuality": "3.26"}, "section": {"name": "CONSTITUTIONAL LAW", "sectionnum": "401", "primary_alias": "PSCI-271-401", "path": "/courses/17967/sections/401", "id": "17967-401", "aliases": ["PSCI-271-401", "PPE-270-401"]}, "comments": "This course explores the role of constitutional principles and the U.S. Supreme Court in political struggles over the structure, distribution and uses of power in the American political system. Emphasis is placed on division of powers between the state and national governments and the branches of the federal government; economic powers of private actors and governmental regulators; and authority over national security issues. In analyzing governmental structures and powers, the course also focuses on the substantive values the American constitutional system has pursued in the hands of different political coalitions over time, and on the virtues and vices of constitutionalism as the mode of their pursuit. Most readings come from the new constitutional law casebook, American Constitutionalism, Vol. 1, Structures of Government, by Howard Gillman, Mark A. Graber, and Keith E. Whittington. \r\n\r\nThough students found the class to be very interesting, the main complaint students had was that there was little connection between assigned readings and course content; many found the reading to be “not terribly cohesive.” \r\n\r\nStudents raved about Professor Smith, claiming he “is a master in his field” and “a superb lecturer” with a good sense of humor. They found Professor Smith to be knowledgeable and exceedingly good at stimulating interest in the material. The one complaint that students had was that his Powerpoint slides were not very informative. \r\n\r\nStudents found the reading exceedingly long, dense, and challenging, but one student said, “exams and papers were fair and interesting to answer.” The class is strongly recommended for majors. Many students found it to be quite challenging. \r\n", "num_students": 99, "path": "/courses/17967/sections/401/reviews/1002-ROGERS-M-SMITH", "instructor": {"path": "/instructors/1002-ROGERS-M-SMITH", "first_name": "ROGERS M", "last_name": "SMITH", "id": "1002-ROGERS-M-SMITH", "name": "ROGERS M SMITH"}, "num_reviewers": 86, "id": "17967-401-1002-ROGERS-M-SMITH"}]