[{"ratings": {"rAmountLearned": "2.45", "rDifficulty": "2.61", "rStimulateInterest": "2.93", "rRecommendMajor": "2.79", "rCourseQuality": "2.34", "rWorkRequired": "3.14", "rInstructorAccess": "3.59", "rReadingsValue": "2.55", "rRecommendNonMajor": "1.59", "rCommAbility": "2.79", "rInstructorQuality": "2.97"}, "section": {"name": "THE ROMANTIC PERIOD: ROMANTIC REVOLUTIONS", "sectionnum": "001", "primary_alias": "ENGL-050-001", "path": "/courses/27286/sections/001", "id": "27286-001", "aliases": ["ENGL-050-001"]}, "comments": "This is an introductory course to the literature, history, and culture of the Romantic period, an epoch that saw at least four revolutions (American, French, Haitian, and Industrial). A time of renaissance and upheaval, it's an age essential to understanding our own modernity, one that gave us modern economics and chemistry, democracy and dictatorship, chemistry and the cult of celebrity, science fiction and the secret service. Students read Jane Austen and Lord Byron, Thomas Paine and Mary Wollstonecraft, John Keats and Mary Shelley, among others. Along the way, the course also covers the events that shaped the fiction, poetry, and drama of these turbulent years. The aim is to understand our readings both as texts in themselves (as responses to literary and cultural traditions) and as public statements (as responses to contemporary events and culture). This course fulfills the Sector 4 and Sector 4 requirements of the English Standard Major. \r\n\r\nOverall, students enjoyed the course material. Many students commented that the readings were very fascinating, well selected, and valuable. One student explained that the assigned readings were great, because they consisted “not only of literature, as would be expected in an English class… [but are framed] within the historical, political, and social context of the time.”\r\n\r\nStudents described Professor Gamer as a fun lecturer who is passionate about his field. Several students even dubbed Professor Garner one of the best professors they have taken a class from at Penn. A large majority of the comments on Professor Gamer also referred to his remarkable dedication to his students.  In the words of one reviewer, “Professor Garner is always accessible and happy to talk about the course… Professor Garner cares about his students and their academic progress.”\r\n\r\nA few students commented that the workload for this course was a lot, and “for someone not familiar with the Romantics, could be very difficult to comprehend.” Furthermore, several students expressed that the assignments were challenging, though ultimately fulfilling—with the possible exception of the final exam, which a few students were dissatisfied with.", "num_students": 35, "path": "/courses/27286/sections/001/reviews/454-MICHAEL-C-GAMER", "instructor": {"path": "/instructors/454-MICHAEL-C-GAMER", "first_name": "MICHAEL C", "last_name": "GAMER", "id": "454-MICHAEL-C-GAMER", "name": "MICHAEL C GAMER"}, "num_reviewers": 32, "id": "27286-001-454-MICHAEL-C-GAMER"}]