[{"ratings": {"rAmountLearned": "2.92", "rDifficulty": "3.83", "rStimulateInterest": "2.08", "rRecommendMajor": "2.25", "rCourseQuality": "2.50", "rWorkRequired": "3.75", "rInstructorAccess": "2.25", "rReadingsValue": "1.75", "rRecommendNonMajor": "1.42", "rCommAbility": "2.67", "rInstructorQuality": "2.82"}, "section": {"name": "PRIN&TECH OF APP MATH II", "sectionnum": "001", "primary_alias": "ENM-521-001", "path": "/courses/27346/sections/001", "id": "27346-001", "aliases": ["ENM-521-001"]}, "comments": "This course is a continuation of ENM 520 (or equivalent) and deals with classical methods in applied mathematics. The topics to be covered include: Functions of a Complex Variable, Partial Differential Equations, Asymptotic and Perturbation Methods, and Convex Analysis and Variational Methods.\r\n\r\nOverall, students described this course as being difficult and advanced, yet still interesting. Though they learnt much about complex analysis, they did not see “how this math could be applied to a wide range of problems.” This was partly due to the lack of continuity with lower level courses such as ENM 510, ENM 511 and ENM 520. Also, many expressed the opinion that “more time [should have been] spent on PDEs,” since they were “covered too late” in the course. Some indicated that “the methodology became more clear and the value of the material was apparent” by the end of the course even though the material seemed daunting at the beginning. Some especially noted that the close-reading project was worthwhile and “should be offered to students in the future.”\r\n\r\nMost of the students did not directly comment on Professor Ponte-Castaneda, but some indicated that he assigned very time consuming problem sets, and did not completely follow the syllabus in the course. Some complimented the TA on his detailed comments on graded assignments, as well as his helpful office hours.\r\n\r\nThis is a required math class for PhD students, who are recommended to take it in their first year. This course is also recommended to other students who are especially interested in learning about complex analysis.\r\n", "num_students": 13, "path": "/courses/27346/sections/001/reviews/1571-PEDRO-PONTE-CASTANEDA", "instructor": {"path": "/instructors/1571-PEDRO-PONTE-CASTANEDA", "first_name": "PEDRO", "last_name": "PONTE-CASTANEDA", "id": "1571-PEDRO-PONTE-CASTANEDA", "name": "PEDRO PONTE-CASTANEDA"}, "num_reviewers": 13, "id": "27346-001-1571-PEDRO-PONTE-CASTANEDA"}]