[{"ratings": {"rAmountLearned": "1.82", "rDifficulty": "1.96", "rStimulateInterest": "1.22", "rRecommendMajor": "1.53", "rCourseQuality": "1.66", "rWorkRequired": "2.35", "rInstructorAccess": "2.33", "rReadingsValue": "2.14", "rRecommendNonMajor": "2.39", "rCommAbility": "1.35", "rInstructorQuality": "1.66"}, "section": {"name": "IDEAS IN MATHEMATICS", "sectionnum": "001", "primary_alias": "MATH-170-001", "path": "/courses/21992/sections/001", "id": "21992-001", "aliases": ["MATH-170-001"]}, "comments": "Topics in this class cover the following: logic, sets, calculus, probability, history and philosophy of mathematics, game theory, geometry, and their relevance to contemporary science and society.\r\n\r\nStudents gave mixed reviews of the course content. Some enjoyed the course material, saying it was a “practical application of math,” while others thought the material was “boring” and “pointless.”\r\n\r\nStudents found that Professor Nyugen taught directly from the book. Students noted that Professor Nyugen strongly wanted students to understand the material, and was “very supportive,” but some students felt Professor Nyguen had difficulty generating interest in the material itself.\r\n\r\nMost students found the course to be “generally easy,” although they felt it sometimes required a fair amount of work in the form of “homework every week and quizzes every other week.” Most students felt it was “easy to get an A.” This course may be counted toward the General Requirement in Natural Science & Mathematics.\r\n", "num_students": 116, "path": "/courses/21992/sections/001/reviews/5403-HOI-HUU-NGUYEN", "instructor": {"path": "/instructors/5403-HOI-HUU-NGUYEN", "first_name": "HOI HUU", "last_name": "NGUYEN", "id": "5403-HOI-HUU-NGUYEN", "name": "HOI HUU NGUYEN"}, "num_reviewers": 115, "id": "21992-001-5403-HOI-HUU-NGUYEN"}, {"ratings": {"rAmountLearned": "2.03", "rDifficulty": "1.97", "rStimulateInterest": "2.06", "rRecommendMajor": "1.71", "rCourseQuality": "2.05", "rWorkRequired": "1.94", "rInstructorAccess": "2.27", "rReadingsValue": "2.10", "rRecommendNonMajor": "2.32", "rCommAbility": "2.42", "rInstructorQuality": "2.23"}, "section": {"name": "IDEAS IN MATHEMATICS", "sectionnum": "601", "primary_alias": "MATH-170-601", "path": "/courses/21992/sections/601", "id": "21992-601", "aliases": ["MATH-170-601"]}, "comments": "This course covers the following topics: logic, sets, calculus, probability, history and philosophy of mathematics, game theory, geometry, and their relevance to contemporary science and society. It fulfills the Natural Science and Mathematics Sector requirement for the Class of 2010 and beyond and may also be counted toward the General Requirement in Natural Science and Mathematics.\r\n\r\nIn general, students felt somewhat frustrated by this course, claiming that “topics were obscure” and that they were “forced to memorize random patterns and equations.” Many students also complained about the textbook, saying that it’s a “poor one for learning math.” Some students felt that they did not get much out of this course.\r\n\r\nMany students found Professor Hughes to be “friendly enough” and believed that he “meant well.” However, they also found him to be “unresponsive to emails or requests for help” and many felt that he “treated the class like we were simple-minded.”\r\n\r\nMost students took this course to fulfill a General Requirement.\r\n", "num_students": 50, "path": "/courses/21992/sections/601/reviews/748-ANTHONY-HUGHES", "instructor": {"path": "/instructors/748-ANTHONY-HUGHES", "first_name": "ANTHONY", "last_name": "HUGHES", "id": "748-ANTHONY-HUGHES", "name": "ANTHONY HUGHES"}, "num_reviewers": 44, "id": "21992-601-748-ANTHONY-HUGHES"}]