{"coursehistories": {"path": "/coursehistories/2510"}, "description": "Facts and theories about the determination of per capita income and its differences across countries and across time. The study of economic fluctuations in output and employment. The role of government in influencing these aggregate variables: monetary and fiscal policy. \n\n", "semester": "2010C", "name": "INTERMED MACROECONOMICS", "reviews": {"path": "/courses/22924/reviews", "values": [{"ratings": {"rAmountLearned": "2.81", "rDifficulty": "3.13", "rStimulateInterest": "3.40", "rRecommendMajor": "3.72", "rCourseQuality": "2.92", "rWorkRequired": "2.63", "rInstructorAccess": "2.47", "rReadingsValue": "2.26", "rRecommendNonMajor": "2.13", "rCommAbility": "3.21", "rInstructorQuality": "3.41"}, "section": {"name": "INTERMED MACROECONOMICS", "sectionnum": "001", "primary_alias": "ECON-102-001", "path": "/courses/22924/sections/001", "id": "22924-001", "aliases": ["ECON-102-001"]}, "comments": "The course provides facts and theories about the determination of per capita income and its differences across countries and across time. Then it moves onto the study of economic fluctuations in output and employment. Lastly, it examines the role of government in influencing these aggregate variables: monetary and fiscal policy.\r\n\r\nMost students described the course as “challenging” and “mathematically based.” Quantitative and qualitative points are provided in class to make the content more interesting. The course goes into a lot of detailed description of macro-economic theories. A few students expressed their concern about the lack of time to prepare for the final because a lot of important information was presented in the last week. \r\n\r\nA large number of students enjoyed Professor Villaverde’s class and described him as a “fantastic,” “engaging” and “knowledgeable” teacher. However, some felt that he was not welcoming enough of questions. Professor Villaverde grades the exams and is said to be a tough grader with harsh re-grading standards. As a whole, most students enjoyed being in the professor’s class and said he is a great professor for upper-level courses. \r\n\r\nMost students found the homework “challenging” and “ambiguous” at times. Many wished there were more in-class examples to make sense of the material. The course is quite mathematically intensive and goes into detail on macro-economic theory. It is not suggested that a non-Economics major take this course due to the tough materials covered. The course intensifies in workload and comprehension towards the end of the semester.\r\n", "num_students": 67, "path": "/courses/22924/sections/001/reviews/326-JESUS-FERNANDEZ-VILLAVERDE", "instructor": {"path": "/instructors/326-JESUS-FERNANDEZ-VILLAVERDE", "first_name": "JESUS", "last_name": "FERNANDEZ-VILLAVERDE", "id": "326-JESUS-FERNANDEZ-VILLAVERDE", "name": "JESUS FERNANDEZ-VILLAVERDE"}, "num_reviewers": 65, "id": "22924-001-326-JESUS-FERNANDEZ-VILLAVERDE"}]}, "credits": null, "primary_alias": "ECON-102", "path": "/courses/22924", "sections": {"path": "/courses/22924/sections", "values": [{"name": "INTERMED MACROECONOMICS", "sectionnum": "001", "primary_alias": "ECON-102-001", "path": "/courses/22924/sections/001", "id": "22924-001", "aliases": ["ECON-102-001"]}]}, "id": 22924, "aliases": ["ECON-102"]}