[{"ratings": {"rAmountLearned": "2.71", "rDifficulty": "2.33", "rStimulateInterest": "3.30", "rRecommendMajor": "3.37", "rCourseQuality": "2.76", "rWorkRequired": "2.56", "rInstructorAccess": "2.89", "rReadingsValue": "2.56", "rRecommendNonMajor": "2.84", "rCommAbility": "3.31", "rInstructorQuality": "3.18"}, "section": {"name": "FREUD", "sectionnum": "401", "primary_alias": "GRMN-253-401", "path": "/courses/27511/sections/401", "id": "27511-401", "aliases": ["GRMN-253-401", "COML-253-401", "HSOC-253-401", "ENGL-105-401", "GSWS-252-401", "STSC-253-401"]}, "comments": "No other person of the twentieth century has probably influenced scientific thought, humanistic scholarship, medical therapy, and popular culture as much as Sigmund Freud.  This course studies his work, its cultural background, and its impact on us today.  In the first part of the course, students learn about Freud's life and the Viennese culture of his time.  The course then move to a discussion of seminal texts, such as excerpts from his Interpretation of Dreams, case studies, as well as essays on psychoanalytic practice, human development, definitions of gender and sex, neuroses, and culture in general.  In the final part of the course, students discuss the impact of Freud's work.  Guest lecturers from the medical field, history of science, psychology, and the humanities offer insights into the reception of Freud's work, and its consequences for various fields of study and therapy.\r\n\r\n\tMost students found this class to be stimulating and enjoyable, citing it as “an excellent way to gain an informative understanding of Sigmund Freud and the world's reaction to psychoanalysis.”  While there was a common sentiment that “each class was more compelling and entertaining than the next,” some found there to be “a lack of clear structure in the lectures and assignments” which thus made the class “difficult to follow” at times.\r\n\r\n\tStudents described Professor Weissberg as “an excellent lecturer” who “really made an effort to connect with everyone in the class, even though it was a larger lecture.”  Students reported that Professor Weissberg was “highly qualified” to teach this course as a result of her extensive research pertaining to the topic, but that her lectures could “sometimes be a little bit hard to follow,” and that it would have been “helpful if there were Powerpoint slides to help guide the lectures.”\r\n\r\n\tIn terms of workload, students reported that there were  “two papers which [had to] be written for this course, as well as a creative project and a final exam.”  One student commented that there was “a lot of flexibility in choosing the topics” for the essays, and another student stated that the final “asked straightforward questions” that anyone with a strong knowledge of course material could answer well.  Many students reported there was “a lot of reading,” but that “students [could] get by without completing all of the assigned texts.”  Overall, the class was recommended as “a fantastic course for non-majors who are looking for a quirky course.”", "num_students": 67, "path": "/courses/27511/sections/401/reviews/1332-LILIANE-WEISSBERG", "instructor": {"path": "/instructors/1332-LILIANE-WEISSBERG", "first_name": "LILIANE", "last_name": "WEISSBERG", "id": "1332-LILIANE-WEISSBERG", "name": "LILIANE WEISSBERG"}, "num_reviewers": 54, "id": "27511-401-1332-LILIANE-WEISSBERG"}]