[{"ratings": {"rAmountLearned": "3.78", "rDifficulty": "3.58", "rStimulateInterest": "3.68", "rRecommendMajor": "3.91", "rCourseQuality": "3.58", "rWorkRequired": "3.80", "rInstructorAccess": "3.63", "rReadingsValue": "3.38", "rRecommendNonMajor": "2.14", "rCommAbility": "3.66", "rInstructorQuality": "3.72"}, "section": {"name": "HUMAN ANATOMY & PHYSIOLOGY-PART A", "sectionnum": "001", "primary_alias": "NURS-131-001", "path": "/courses/17793/sections/001", "id": "17793-001", "aliases": ["NURS-131-001"]}, "comments": "This is a required course for all students in the School of Nursing and the first of a two part series. Prerequisites include NURS40 and NURS41 or NURS42. The course is made up of 4 hours of lecture and two hours of lab per week. The structural and functional organization of the human organism is presented, along with the fundamentals of developmental anatomy and embryology. Histologic and gross anatomical features of selected organ systems are related to the physiologic and biochemical mechanisms which enable the human body to maintain homeostasis in an ever-changing environment.\r\n\r\nThis course does not seem to be for the light-hearted student. Although students warned that, “You need to mentally prepare for this course” because of an overwhelming workload and \"massive amounts of information,\" the overall consensus was that the outcome was definitely worth the effort. One student claimed that the course, “forced me to change the way I study for science classes in general.” Despite the demanding nature of this course, students thoroughly enjoyed it and gained from it. One student even referred to this course as, “the most pleasant experience of my nursing career thus far.” Students described this course as purely exam based and very heavy on memorization. The course content, although vast, is imperative and essential. Dr. Scanga facilitates this course in a way that students admit to learning the material in a “deep way” that they will remember as they continue in their nursing careers.\r\n\r\nStudents give overwhelming praise for Dr. Scanga. One student referred to her as an “absolute asset to Penn Nursing.” Students were unable to deny Dr. Scanga’s enthusiasm for and love of Anatomy and Physiology and her dedication to the success of her students. One student says, “Dr. Scanga is excellent in communicating difficult concepts in a creative manner that is understandable and enjoyable.” Several students noted that she captures their attention with humor and keeps the class entertained throughout the entire lecture. “Her enthusiasm is infectious,” one student remarked. Dr. Scanga is noted for answering e-mails promptly, eagerly discussing content outside of class, being available for students who are having difficulties, and getting to know every single student by name. Students constantly use the words “animated,” “compassionate,” and “entertaining” when referring to Dr. Scanga. She is referred to as “The most organized professor I’ve ever had.” Dr. Scanga provides students with study questions, lecture outlines, and online resources which the majority of students find really facilitate their learning.\r\n\r\nThis course is said to be extremely valuable for all individuals who are planning to be a health care professional. The workload associated with this course is noted to be overwhelming initially and requires highly developed time management skills; however students admit that it is manageable as long as you keep up with the content. Students say that the course is “very time consuming\" and “involves many hours per day of studying.” One student admits that, “Sometimes it seems like Dr. Scanga thinks this is the only class we have.” It is hard to deny that this course will be challenging for students; however it is fairly safe to say that students will appreciate the experience and gain an extensive base of valuable knowledge. One student sums up a common feeling by saying that this course was “the hardest but best class I’ve ever had.” The pre-requisites include N40, N41, or N42. ", "num_students": 120, "path": "/courses/17793/sections/001/reviews/1637-CONNIE-B--SCANGA", "instructor": {"path": "/instructors/1637-CONNIE-B--SCANGA", "first_name": "CONNIE B.", "last_name": "SCANGA", "id": "1637-CONNIE-B--SCANGA", "name": "CONNIE B. SCANGA"}, "num_reviewers": 118, "id": "17793-001-1637-CONNIE-B--SCANGA"}]