[{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "3.04", "rStimulateInterest": "3.04", "rRecommendMajor": "3.60", "rCourseQuality": "2.82", "rWorkRequired": "2.98", "rInstructorAccess": "3.04", "rReadingsValue": "2.91", "rRecommendNonMajor": "2.44", "rCommAbility": "3.47", "rInstructorQuality": "3.45"}, "section": {"name": "HISTORY OF MODERN PHILOS", "sectionnum": "001", "primary_alias": "PHIL-004-001", "path": "/courses/20660/sections/001", "id": "20660-001", "aliases": ["PHIL-004-001"]}, "comments": "In this course, we shall read and analyze some of the centrally important works of seventeenth-and eighteenth-century philosophy. Our readings will include writings from Descartes, Locke, Hume, and Kant. We shall focus on metaphysics (the fundamental nature of reality) and epistemology (theory of knowledge). Some of the metaphysical questions dealt with by these authors concern the existence and nature of mind, matter and God, and the problem of human freedom. Some of the epistemological questions dealt with by these authors concern how much and what kind of knowledge we gain by the senses and by pure reason, and the limits of the human intellect. While we shall read these authors in order to get a sense of their historical relations to each other, the aim of the course is not to provide a sweeping survey of philosophy from Descartes through Kant. Rather, the aim is to focus on a few seminal texts in the history of modern philosophy especially appropriate to the themes noted above.\r\n\r\nMany students found this to be an “interesting course” that was “well constructed” and able to hold their attention. Most found the lectures to be “extremely helpful” and “impressively clear.” However, some said that the lecture handouts were difficult to follow and “would have been more useful if they were better organized and less cluttered.” Some others commented that there was perhaps “a bit too much material attempted for the semester.” Others stated that “the only problem was the regular changes made to the syllabus and course plan.” A minority of students said they had trouble “getting into what we were discussing.” \r\n\r\nThe majority of students found Professor Detlefsen to be an “outstanding professor,” and commented that she communicated the course matter with “an unparalleled grasp on the material and with terrific energy.”  More students said that she “does a great job at providing examples and making the subject matter clearer.” Another student raved that the professor is “so passionate and knowledgeable that it’s nearly impossible not to pay attention.”  Others wished that she had facilitated more discussion in the class. Some students complimented her on what she wrote on the board, but wished she had made it more “note-friendly.”\r\n\r\nMany people commented that the course material for this class was very difficult, and the readings, incredibly dense. Many said the readings were “VERY hard” and suggested that less reading would be preferable “so the reading which is assigned can be studied in greater depth.” Others said that using slides would have been helpful in taking notes. One student also commented that “you have to be extremely self-motivated to do well.” Another said that the final was “very daunting” and “seems unnecessary after our third large paper.” Regardless of this, most thought that this was “a class worth taking” even for non-majors.", "num_students": 87, "path": "/courses/20660/sections/001/reviews/945-KAREN-E--DETLEFSEN", "instructor": {"path": "/instructors/945-KAREN-E--DETLEFSEN", "first_name": "KAREN E.", "last_name": "DETLEFSEN", "id": "945-KAREN-E--DETLEFSEN", "name": "KAREN E. DETLEFSEN"}, "num_reviewers": 55, "id": "20660-001-945-KAREN-E--DETLEFSEN"}]