{"coursehistories": {"path": "/coursehistories/3297"}, "description": "Along with CHIN012, CHIN111 and CHIN112, this is the first course of a four-semester sequence. By completing all four semesters, students fulfill the College language requirement. The sequence starts each fall. Students cannot begin their study in the spring. This course is designed primarily for students who have little or no prior exposure to Chinese. The objective of the course is to help students build a solid foundation of the four basic skills--listening, speaking, reading, and writing in an interactive and communicative learning environment. The emphasis is on correct pronunciation, accurate tones and mastery of basic grammatical structures. By the end of the second semester, students will be able to manage many situations that have immediate concern to them, such as relating one's personal life and experiences, expressing preferences and feelings, ordering meals, purchasing goods and asking for directions. \n\nThis course is designed primarily for students who have little or no prior exposure to Chinese. The objective of the course is to help students build a solid foundation of the four basic skills--listening, speaking, reading, and writing in an interactive and communicative learning environment. The emphasis is on correct pronunciation, accurate tones and mastery of basic grammatical structures. By the end of the second semester, students will be able to manage many situations that have immediate concern to them, such as relating one's personal life and experiences, expressing preferences and feelings, ordering meals, purchasing goods and asking for directions. In order to achieve these goals, students are expected to thoroughly preview and review the materials according to the weekly lesson plan (on course website) prior to attending class. Regular attendance is mandatory and strictly monitored. \n\n", "semester": "2007B", "name": "BEGINNING MOD CHINESE I", "reviews": {"path": "/courses/12576/reviews", "values": [{"ratings": {"rInstructorRapport": "4.00", "rTAQuality": "0.00", "rAbilitiesChallenged": "3.50", "rInstructorAttitude": "4.00", "rHomeworkValuable": "3.75", "rReadingsValue": "3.50", "rInstructorConcern": "3.75", "rCourseQuality": "3.50", "rClassPace": "2.25", "rExamsConsistent": "3.75", "rInstructorAccess": "3.50", "rGradeFairness": "4.00", "rArticulateGoals": "3.75", "rOralSkills": "4.00", "rNativeAbility": "4.00", "rInstructorQuality": "3.75", "rWorkRequired": "1.50", "rStimulateInterest": "3.75", "rInstructorEffective": "3.50", "rSkillEmphasis": "3.75"}, "section": {"name": "BEGINNING MOD CHINESE I", "sectionnum": "910", "primary_alias": "CHIN-011-910", "path": "/courses/12576/sections/910", "id": "12576-910", "aliases": ["CHIN-011-910"]}, "comments": "", "num_students": 6, "path": "/courses/12576/sections/910/reviews/35-MAIHENG-SHEN-DIETRICH", "instructor": {"path": "/instructors/35-MAIHENG-SHEN-DIETRICH", "first_name": "MAIHENG SHEN", "last_name": "DIETRICH", "id": "35-MAIHENG-SHEN-DIETRICH", "name": "MAIHENG SHEN DIETRICH"}, "num_reviewers": 4, "id": "12576-910-35-MAIHENG-SHEN-DIETRICH"}]}, "credits": null, "primary_alias": "CHIN-011", "path": "/courses/12576", "sections": {"path": "/courses/12576/sections", "values": [{"name": "BEGINNING MOD CHINESE I", "sectionnum": "910", "primary_alias": "CHIN-011-910", "path": "/courses/12576/sections/910", "id": "12576-910", "aliases": ["CHIN-011-910"]}]}, "id": 12576, "aliases": ["CHIN-011"]}