[{"ratings": {"rAmountLearned": "3.15", "rDifficulty": "1.79", "rStimulateInterest": "3.74", "rRecommendMajor": "3.77", "rCourseQuality": "3.36", "rWorkRequired": "1.59", "rInstructorAccess": "3.20", "rReadingsValue": "2.81", "rRecommendNonMajor": "3.43", "rCommAbility": "3.61", "rInstructorQuality": "3.65"}, "section": {"name": "BIOETHICS", "sectionnum": "401", "primary_alias": "HSOC-102-401", "path": "/courses/21888/sections/401", "id": "21888-401", "aliases": ["HSOC-102-401", "SOCI-101-401"]}, "comments": "Bioethical conundrums such as cloning, stem cells, transplantation, the use of psychopharmaceuticals, end of life technologies, pre-implantation diagnosis of embryos, artificial reproductive technologies, and the genetic manipulation of life will challenge policy-makers and moral thinkers throughout the twenty-first century. In this course, a philosopher and a sociologist team up to frame and explore these important issues. Guest lecturers, multimedia presentations, and spirited debates will allow the students to understand the science, the social implications, and the philosophical, ethical, and religious implications of the coming biotechnological revolution.\r\n\r\nStudents loved the \"philosophical approach to bioethical issues.\" They found the course \"fascinating,\" and they \"truly enjoyed going to class.\" The class was \"very contemporary and forward-looking.\"\r\n\r\nProfessor Moreno is \"a talented, dedicated, and enthusiastic professor\" and the “epitome of interdisciplinary work.\" He \"communicates the course material well and creates an engaging class environment.\" He is a \"well-versed professor and leader in his field. He truly knows how to sustain interest and discussion in his course.\" Students described him as “amazing” “impressive” and an “unbelievable lecturer.”\r\n\r\nStudents recommend this class to anyone \"interested in medicine.\" One student did mention that the exam essays were very open-ended and may not necessarily follow class material. Overall, the workload was very manageable.\r\n", "num_students": 81, "path": "/courses/21888/sections/401/reviews/4186-JONATHAN-D-MORENO", "instructor": {"path": "/instructors/4186-JONATHAN-D-MORENO", "first_name": "JONATHAN D", "last_name": "MORENO", "id": "4186-JONATHAN-D-MORENO", "name": "JONATHAN D MORENO"}, "num_reviewers": 73, "id": "21888-401-4186-JONATHAN-D-MORENO"}]