[{"ratings": {"rAmountLearned": "3.70", "rDifficulty": "3.73", "rStimulateInterest": "3.03", "rRecommendMajor": "3.94", "rCourseQuality": "3.37", "rWorkRequired": "3.67", "rInstructorAccess": "3.63", "rReadingsValue": "2.97", "rRecommendNonMajor": "1.85", "rCommAbility": "3.27", "rInstructorQuality": "3.54"}, "section": {"name": "HONORS CALCULUS", "sectionnum": "001", "primary_alias": "MATH-116-001", "path": "/courses/24689/sections/001", "id": "24689-001", "aliases": ["MATH-116-001"]}, "comments": "MATH116 is the honors version of Calculus II, taking a more challenging and\r\ntheoretical approach. It covers material similar to MATH114, but with greater depth,\r\nincluding a review of the foundations of calculus, vector algebra and its applications, the\r\ncalculus of vector-valued functions, ordinary differential equations, and linear algebra\r\n(linear spaces, inner product spaces, linear transformations and matrices).\r\nStudents raved about Professor Nicoara’s course, calling it “valuable,” “amazing,”\r\nand “mathematically enlightening.” Students felt that they learned a great deal from the\r\ncourse and found that the hard work it required “really paid off.”\r\nStudents heaped praise on Professor Nicoara, calling her “enthusiastic”,\r\n“knowledgeable” and a “spectacular professor.” They also found her to be “full of life”\r\nand “engaging,” with a few students claiming that she is the “best teacher” they have ever\r\nhad.\r\nStudents unanimously agreed that Professor Nicoara’s course is “valuable to any\r\nstudent considering mathematics or physics” and is a “great introduction to true\r\nmathematics.” One student pointed out that the class might be “difficult if you’ve had no\r\nprior experience in proof-writing” but that the professor and TA do a good job bringing\r\neveryone up to speed. Most students felt that problem sets were long and hard, but very\r\nvaluable.", "num_students": 35, "path": "/courses/24689/sections/001/reviews/4412-ANDREEA-C--NICOARA", "instructor": {"path": "/instructors/4412-ANDREEA-C--NICOARA", "first_name": "ANDREEA C.", "last_name": "NICOARA", "id": "4412-ANDREEA-C--NICOARA", "name": "ANDREEA C. NICOARA"}, "num_reviewers": 35, "id": "24689-001-4412-ANDREEA-C--NICOARA"}]