{"coursehistories": {"path": "/coursehistories/1251"}, "description": "This course provides an introduction to fundamental concepts of distributed systems, and the design principles for building large scale computational systems. Topics covered include communication, concurrency, programming paradigms, naming, managing shared state, caching, synchronization, reaching agreement, fault tolerance, security, middleware, and distributed applications. This course is appropriate as an upper-level undergraduate CIS elective. \n\n", "semester": "2012A", "name": "SOFTWARE SYSTEMS", "reviews": {"path": "/courses/27167/reviews", "values": [{"ratings": {"rAmountLearned": "2.12", "rDifficulty": "2.21", "rStimulateInterest": "2.67", "rRecommendMajor": "2.38", "rCourseQuality": "1.91", "rWorkRequired": "2.01", "rInstructorAccess": "2.05", "rReadingsValue": "1.92", "rRecommendNonMajor": "1.57", "rCommAbility": "2.65", "rInstructorQuality": "2.42"}, "section": {"name": "SOFTWARE SYSTEMS", "sectionnum": "001", "primary_alias": "CIS-505-001", "path": "/courses/27167/sections/001", "id": "27167-001", "aliases": ["CIS-505-001"]}, "comments": "This course provides an introduction to fundamental concepts of distributed systems, and the design principles for building large scale computational systems.  Topics covered include communication, concurrency, programming paradigms, naming, managing shared state, caching, synchronization, reaching agreement, fault tolerance, security, middleware, and distributed applications. This course is appropriate as an upper-level undergraduate CIS elective.\r\n\r\nStudents thought that the \"topics covered in this course were fascinating.\" Students found that they had to do a lot of self-learning when it came to doing the homework and projects, but nonetheless learned a lot from the class.\r\n\r\nStudents had generally positive comments about Prof. Blaze. Some thought Prof. Blaze was \" [one of the] better teachers at Penn in the realm of teaching at School of Engineering\" because he was an \"engaging lecturer.\" Though students enjoyed having Prof. Blaze, they highlighted the fact that the class was \"highly unorganized\" and \"poor structured.\" Students found it a recurring theme where Prof. Blaze would change \"lecture topics without warning or clear distinction, and their contents were muddled with anecdotes and actual course material, followed with non-sequitur slides.\"\r\n\r\nStudents found that the \"the class was not generally difficult\" because the course did not cover a great amount of material. The homework for the class was not hard, but was time-consuming. Students found that his course was \"very useful for CIS/CIT students.\" The listed prerequistes for this class are undergraduate-level knowledge of operating systems, networking, and programming experience (CIT 594 or equivalent).", "num_students": 107, "path": "/courses/27167/sections/001/reviews/2435-MATTHEW-BLAZE", "instructor": {"path": "/instructors/2435-MATTHEW-BLAZE", "first_name": "MATTHEW", "last_name": "BLAZE", "id": "2435-MATTHEW-BLAZE", "name": "MATTHEW BLAZE"}, "num_reviewers": 94, "id": "27167-001-2435-MATTHEW-BLAZE"}]}, "credits": null, "primary_alias": "CIS-505", "path": "/courses/27167", "sections": {"path": "/courses/27167/sections", "values": [{"name": "SOFTWARE SYSTEMS", "sectionnum": "001", "primary_alias": "CIS-505-001", "path": "/courses/27167/sections/001", "id": "27167-001", "aliases": ["CIS-505-001"]}]}, "id": 27167, "aliases": ["CIS-505"]}