[{"ratings": {"rAmountLearned": "2.64", "rDifficulty": "1.87", "rStimulateInterest": "2.18", "rRecommendMajor": "2.73", "rCourseQuality": "2.42", "rWorkRequired": "1.45", "rInstructorAccess": "3.09", "rReadingsValue": "2.25", "rRecommendNonMajor": "2.34", "rCommAbility": "2.71", "rInstructorQuality": "2.59"}, "section": {"name": "BUS INSR & EST PLNG", "sectionnum": "401", "primary_alias": "INSR-823-401", "path": "/courses/17553/sections/401", "id": "17553-401", "aliases": ["INSR-823-401", "INSR-222-401"]}, "comments": "Insurance 823 presents an analysis of overall private wealth management. This includes planning for disposition of closely-held business interests; the impact of income taxes and other transfer costs on business interests and other assets; integration of life insurance, disability insurance, medical benefits, and long-term care insurance in the financial plan; planning for concentrated asset (e.g. common stock) positions, diversification techniques, and asset allocation strategies; distribution of retirement assets; lifetime giving and estate planning; and analysis of current developments in the creation, conservation, and distribution of estates. Attention is also given to various executive compensation techniques and planning for various employee benefits. The course also covers sophisticated charitable-giving techniques and methods for financing education expenses. This course should be attractive to students interested in learning how to plan their own financial affairs. It also should be particularly attractive to students specializing in entrepreneurship, wealth management finance, and law.\r\n\r\nStudents found the course thoroughly “interesting” and thought that what they learned was extremely applicable to their own futures.\r\n\r\nMost students thought that Professor Hallman was “knowledgeable” and approachable. One student described the professor as a “walking encyclopedia of personal finance and private wealth management.” According to many students, Professor Hallman was concerned about students’ performance in the course, noting that he actively seeks to help students work through the more difficult material.\r\n\r\nSeveral students commented that the course could be structured differently to encourage more student interaction and to increase the use of technology in the classroom. \r\n", "num_students": 76, "path": "/courses/17553/sections/401/reviews/4381-GEORGE-VICTOR-HALLMAN", "instructor": {"path": "/instructors/4381-GEORGE-VICTOR-HALLMAN", "first_name": "GEORGE VICTOR", "last_name": "HALLMAN", "id": "4381-GEORGE-VICTOR-HALLMAN", "name": "GEORGE VICTOR HALLMAN"}, "num_reviewers": 72, "id": "17553-401-4381-GEORGE-VICTOR-HALLMAN"}]