{"coursehistories": {"path": "/coursehistories/4004"}, "description": "Focusing on movies made after 1945, this course allows students to learn and to sharpen methods, terminologies, and tools needed for the critical analysis of film. Beginning with the cinematic revolution signaled by the Italian Neo-Realism (of Rossellini and De Sica), we will follow the evolution of postwar cinema through the French New Wave (of Godard, Resnais, and Varda), American movies of the 1950s and 1960s (including the New Hollywood cinema of Coppola and Scorsese), and the various other new wave movements of the 1960s, 1970s and 1980s (such as the New German Cinema). We will then selectively examine some of the most important films of the last two decades, including those of U.S. independent film movement and movies from Iran, China, and elsewhere in an expanding global cinema culture. There will be precise attention paid to formal and stylistic techniques in editing, mise-en-scene, and sound, as well as to the narrative, non-narrative, and generic organizations of film. \n\nAt the same time, those formal features will be closely linked to historical and cultural distinctions and changes, ranging from the Paramount Decision of 1948 to the digital convergences that are defining screen culture today. There are no perquisites. Requirements will include readings in film history and film analysis, an analytical essay, a research paper, a final exam, and active participation. Fulfills the Arts and Letters Sector (All Classes). \n\n", "semester": "2008A", "name": "FILM ANALYSIS & METHODS", "reviews": {"path": "/courses/19919/reviews", "values": [{"ratings": {"rAmountLearned": "3.17", "rDifficulty": "1.58", "rStimulateInterest": "3.25", "rRecommendMajor": "3.70", "rCourseQuality": "3.29", "rWorkRequired": "1.71", "rInstructorAccess": "3.75", "rReadingsValue": "2.88", "rRecommendNonMajor": "3.42", "rCommAbility": "3.46", "rInstructorQuality": "3.54"}, "section": {"name": "FILM ANALYSIS & METHODS", "sectionnum": "601", "primary_alias": "CINE-102-601", "path": "/courses/19919/sections/601", "id": "19919-601", "aliases": ["CINE-102-601", "ENGL-092-601", "ARTH-109-601"]}, "comments": "This course is an introduction to the analysis of film as both a textual practice and a cultural practice. The course will examine a variety of films--from Fritz Lang\\'s M (1931) to Julia Dash\\'s Daughters of the Dust (1991)--in order to demonstrate the tools and skills of \\\"close reading.\\\" The class will concentrate on those specifically filmic features of the movies, such as mise-en-scene, cinematography, editing and sound strategies, as well as those larger organizational forms, such as narrative and non-narrative structures and movie genres. Because responses to the movies always extend beyond the film frame, the class will additionally do \\\"close readings\\\" of the complex business of film distribution, promotion, and exhibition to show how the less visible machinery of the movie business also shapes our understanding and enjoyment of particular films. Along the way,  the class will discuss some of the most influential and productive critical schools of thought informing film analysis today, including realism, auteurism, feminism, postmodernism, and others. Screenings are mandatory.\r\n\r\nThe course used film clips to demonstrate theory.  Professor Mazaj included interdisciplinary analysis and helped student hone their analytical skills.  Overall, students enjoyed the movies, reading discussions, course content, and instructor, although many wished they had had more opportunity to discuss and apply the theories to films.  \r\n\r\nStudents commented that Professor Mazaj did an excellent job of communicating material and leading discussions.  She was described as “eloquent,” “dynamic,” and “enthusiastic.”\r\n\r\nThis class is described as a good introductory class.  Multiple students decided to major or minor in Cinema Studies after taking the course.\r\n", "num_students": 25, "path": "/courses/19919/sections/601/reviews/3224-META-MAZAJ", "instructor": {"path": "/instructors/3224-META-MAZAJ", "first_name": "META", "last_name": "MAZAJ", "id": "3224-META-MAZAJ", "name": "META MAZAJ"}, "num_reviewers": 24, "id": "19919-601-3224-META-MAZAJ"}]}, "credits": null, "primary_alias": "CINE-102", "path": "/courses/19919", "sections": {"path": "/courses/19919/sections", "values": [{"name": "FILM ANALYSIS & METHODS", "sectionnum": "601", "primary_alias": "CINE-102-601", "path": "/courses/19919/sections/601", "id": "19919-601", "aliases": ["CINE-102-601", "ENGL-092-601", "ARTH-109-601"]}]}, "id": 19919, "aliases": ["CINE-102", "ENGL-092", "ARTH-109"]}