{"coursehistories": {"path": "/coursehistories/4274"}, "description": "The purpose of this course is to apply economics to an analysis of the health care industry, with special emphasis on the unique characteristics of the US healthcare markets, from pre-hospital to post-acute care. This course focuses on salient economic features of health care delivery, including: the role of nonprofit providers, the effects of regulation and antitrust activity on hospitals, the degree of input substitutability within hospitals, the nature of competition in home health care, public versus private provision of emergency medical services, the effect of specialty hospitals and ambulatory surgery centers, the economics of direct-to-consumer advertising and its effect on drug safety, defining and improving medical performance in hospitals, specialization and investment in physical and human capital, and shifting of services between inpatient and outpatient settings and its effect on health care costs and quality. \n\n", "semester": "2012A", "name": "HEALTH CARE SERVICES DEL: A Managerial Economic Approach", "reviews": {"path": "/courses/27534/reviews", "values": [{"ratings": {"rAmountLearned": "2.83", "rDifficulty": "1.55", "rStimulateInterest": "2.62", "rRecommendMajor": "3.18", "rCourseQuality": "2.79", "rWorkRequired": "1.48", "rInstructorAccess": "3.11", "rReadingsValue": "2.46", "rRecommendNonMajor": "2.14", "rCommAbility": "3.14", "rInstructorQuality": "3.03"}, "section": {"name": "HEALTH CARE SERVICES DEL: A Managerial Economic Approach", "sectionnum": "001", "primary_alias": "HCMG-852-001", "path": "/courses/27534/sections/001", "id": "27534-001", "aliases": ["HCMG-852-001"]}, "comments": "The purpose of this course is to apply economics to an analysis of the health care industry, with special emphasis on the unique characteristics of the US healthcare markets, from pre-hospital to post-acute care. This course focuses on salient economic features of health care delivery, including: the role of nonprofit providers, the effects of regulation and antitrust activity on hospitals, the degree of input substitutability within hospitals, the nature of competition in home health care, public versus private provision of emergency medical services, the effect of specialty hospitals and ambulatory surgery centers, the economics of direct-to-consumer advertising and its effect on drug safety, defining and improving medical performance in hospitals, specialization and investment in physical and human capital, and shifting of services between inpatient and outpatient settings and its effect on health care costs and quality.  The class includes a written exam and student presentation.\r\nMost students thought HCMG852 was “excellent.”  In particular, a couple of students thought the course “perfectly [combined] economic theory, research findings, and real-world insights,” and they “[loved] how [the course was] organized around different issues/areas and the level of depth it [went] into the operations of different types of organizations.”  While one student appreciated the practical insight contributed by frequent guest speakers, a couple other students wished there were less guest speakers because they thought the professor was a better lecturer than the guests.\r\nStudents universally praised Professor David for his dedication to his students and the subject matter.  They felt that he was an excellent lecturer who was “fun to listen to” and who did a “good job distilling complex economic concepts into understandable lectures.”  At the same time, several noted that he “really cared about his students,” and one highlighted in particular that he “did a wonderful job catering to [students’] specific career interests.”\r\nStudents did not comment on the difficulty of the course.  HCMG 852 is an MBA course that counts towards the Health Care Management major.       \r\n", "num_students": 35, "path": "/courses/27534/sections/001/reviews/2995-GUY-DAVID", "instructor": {"path": "/instructors/2995-GUY-DAVID", "first_name": "GUY", "last_name": "DAVID", "id": "2995-GUY-DAVID", "name": "GUY DAVID"}, "num_reviewers": 34, "id": "27534-001-2995-GUY-DAVID"}]}, "credits": null, "primary_alias": "HCMG-852", "path": "/courses/27534", "sections": {"path": "/courses/27534/sections", "values": [{"name": "HEALTH CARE SERVICES DEL: A Managerial Economic Approach", "sectionnum": "001", "primary_alias": "HCMG-852-001", "path": "/courses/27534/sections/001", "id": "27534-001", "aliases": ["HCMG-852-001"]}]}, "id": 27534, "aliases": ["HCMG-852"]}