[{"ratings": {"rAmountLearned": "3.03", "rDifficulty": "2.43", "rStimulateInterest": "3.39", "rRecommendMajor": "3.55", "rCourseQuality": "3.33", "rWorkRequired": "2.51", "rInstructorAccess": "3.58", "rReadingsValue": "2.76", "rRecommendNonMajor": "2.79", "rCommAbility": "3.61", "rInstructorQuality": "3.56"}, "section": {"name": "CHILDREN & MEDIA", "sectionnum": "001", "primary_alias": "COMM-225-001", "path": "/courses/21498/sections/001", "id": "21498-001", "aliases": ["COMM-225-001"]}, "comments": "This course examines children's relationship to media in its historic, economic, political and social contexts. The class begins with an exploration of the ways in which \"childhood\" is created and understood as a time of life that is qualitatively unique and socially constructed over time. It continues with a review of various theories of child development as they inform children's relationship with and understanding of television and other household media. The course teaches students how to make a critical examination of research on the impact of media on children's physical, cognitive, social and psychological development. &#8232;&#8232;Students enjoyed taking this class and considered the course material as \"incredibly interesting.\" &#8232;&#8232;There seemed to be a general consensus that Professor Jordan was an engaging and exceptional teacher. One student said, \" Dr. Jordan is an excellent professor. Her lectures are very clear and informative.\" Others used words such as, \"brilliant\" and, “charismatic” to describe Professor Jordan. &#8232;&#8232;The class is defined as, \"organized and structured,\" and the professor promotes discussion. This class fulfills a Society requirement. It is open to both freshmen and upperclassmen.", "num_students": 45, "path": "/courses/21498/sections/001/reviews/281-AMY-B--JORDAN", "instructor": {"path": "/instructors/281-AMY-B--JORDAN", "first_name": "AMY B.", "last_name": "JORDAN", "id": "281-AMY-B--JORDAN", "name": "AMY B. JORDAN"}, "num_reviewers": 44, "id": "21498-001-281-AMY-B--JORDAN"}]