[{"ratings": {"rAmountLearned": "2.72", "rDifficulty": "2.09", "rStimulateInterest": "2.64", "rRecommendMajor": "2.58", "rCourseQuality": "2.63", "rWorkRequired": "2.05", "rInstructorAccess": "3.00", "rReadingsValue": "2.64", "rRecommendNonMajor": "2.05", "rCommAbility": "2.93", "rInstructorQuality": "2.90"}, "section": {"name": "ORGANIZ ECON & STRAT", "sectionnum": "002", "primary_alias": "MGMT-719-002", "path": "/courses/27764/sections/002", "id": "27764-002", "aliases": ["MGMT-719-002"]}, "comments": "", "num_students": 59, "path": "/courses/27764/sections/002/reviews/4887-EVAN-T--RAWLEY", "instructor": {"path": "/instructors/4887-EVAN-T--RAWLEY", "first_name": "EVAN T.", "last_name": "RAWLEY", "id": "4887-EVAN-T--RAWLEY", "name": "EVAN T. RAWLEY"}, "num_reviewers": 50, "id": "27764-002-4887-EVAN-T--RAWLEY"}, {"ratings": {"rAmountLearned": "2.48", "rDifficulty": "2.39", "rStimulateInterest": "2.76", "rRecommendMajor": "2.62", "rCourseQuality": "2.51", "rWorkRequired": "2.17", "rInstructorAccess": "3.10", "rReadingsValue": "2.65", "rRecommendNonMajor": "1.97", "rCommAbility": "2.89", "rInstructorQuality": "2.82"}, "section": {"name": "ORGANIZ ECON & STRAT", "sectionnum": "004", "primary_alias": "MGMT-719-004", "path": "/courses/27764/sections/004", "id": "27764-004", "aliases": ["MGMT-719-004"]}, "comments": "MGMT719 examines the economic factors underlying value creation in organizational strategy. We shall explore the role of transaction costs, complementary assets, incentives, routines and organizational rigidity in the context vertical integration, horizontal diversification, market entry and scaling up. Consequently, students who take this course will develop a sophisticated basis for creating and evaluating growth strategies. Classroom time is devoted primarily to lively discussion of the cases and assigned readings. There are also two group case write-ups and a final exam. \r\nStudents overall thought this class was “interesting” and “engaging.” Most students stressed that there was a “theoretical” focus, with a “pretty academic approach to strategy.” One student noted that therefore “some cases did not meet the standards of rigor set by the course theory.” Another student noted that this class contains “important concepts that I will apply as a manager within a firm.” However, one student found the course to be “overall confusing” and that it “sometimes lost sight of application to the real world”.\r\n The majority of students loved Professor Rawley because he is “naturally curious” an “effective communicator,” “challenges students to approach managerial issues in new ways,” and is “able to connect with the class.” One student noted that he “became more comfortable as the class progressed” and another student said that he is “accommodating to everyone’s needs.” However, a few students thought that Professor Rawley presented “material in an overly academic way” which “impedes learning” and that he should “take better control of the classroom.”\r\nStudents did not like how the “basic learning’s of the theoretical principals” allowed great understanding. Students did not complain about difficulty. This course is an upper level MGMT course and its prerequisites are MGMT611 or 612. Since this is an advanced course that moves at a very rapid pace and builds on material covered in a number of core courses it is primarily geared toward second year MBA students and is only appropriate for the most advanced first year graduate students.\r\n", "num_students": 56, "path": "/courses/27764/sections/004/reviews/4887-EVAN-T--RAWLEY", "instructor": {"path": "/instructors/4887-EVAN-T--RAWLEY", "first_name": "EVAN T.", "last_name": "RAWLEY", "id": "4887-EVAN-T--RAWLEY", "name": "EVAN T. RAWLEY"}, "num_reviewers": 40, "id": "27764-004-4887-EVAN-T--RAWLEY"}]