{"coursehistories": {"path": "/coursehistories/5159"}, "description": "The purpose of the course is to achieve an understanding of events occuring in the Islamic world by studying how Muslims view themselves and the world they live in. Beginning with a discussion of the impact of colonialism, we will examine Islamic ideas and trends from the late colonial period until the present. Readings will include religions, political and literary writings by important Muslim figures. Movements, events and central issues (e.g.the changing status of women and relations between the Islamic world and the West) will be examined in the context of modern nation states. Special attention will be paid to contesting forms of Islam in the late twentieth and early twenty first centuries and to contesting forms of Islam in the United States, both among converts and immigrants. One of the main objectives is to show that what appear to be similar movements in the Islamic World are, in fact, widely disparate in their origins and goals. \n\n", "semester": "2010C", "name": "ISLAM IN MODERN WORLD", "reviews": {"path": "/courses/23734/reviews", "values": [{"ratings": {"rAmountLearned": "3.11", "rDifficulty": "2.42", "rStimulateInterest": "3.53", "rRecommendMajor": "3.63", "rCourseQuality": "3.35", "rWorkRequired": "2.63", "rInstructorAccess": "3.47", "rReadingsValue": "2.95", "rRecommendNonMajor": "3.21", "rCommAbility": "3.58", "rInstructorQuality": "3.80"}, "section": {"name": "ISLAM IN MODERN WORLD", "sectionnum": "401", "primary_alias": "RELS-146-401", "path": "/courses/23734/sections/401", "id": "23734-401", "aliases": ["RELS-146-401", "NELC-184-401", "SAST-146-401"]}, "comments": "The purpose of the course is to achieve an understanding of events occurring in the Islamic world by studying how Muslims view themselves and the world they live in. Beginning with a discussion of the impact of colonialism, we will examine Islamic ideas and trends from the late colonial period until the present. Readings will include religious, political and literary writings by important Muslim figures. Movements, events and central issues (e.g. the changing status of women and relations between the Islamic world and the West) will be examined in the context of modern nation states. Special attention will be paid to contesting forms of Islam in the late twentieth and early twenty first centuries and to developments in Islam in the United States, both among converts and immigrants. One of the main objectives is to show that what appear to be similar movements in the Islamic world are, in fact, widely disparate in their origins and goals.&#8232;&#8232;\r\n\r\nStudents found this course interesting and a couple said that it was one of the best courses they had taken at Penn. However, one student did mention that they did not learn as much as they had hoped. A student commented that the topic of the course was “approached fairly and made accessible,” while another said it was an “excellent and stimulating course.”&#8232;&#8232;\r\n\r\nStudents who commented described Professor Elias as a wonderful lecturer. One student commented that Professor Elias was “very knowledgeable, very engaging, [and] very accessible.” Another also mentioned that Professor Elias was very approachable.&#8232;&#8232;\r\n\r\nA few students commented that this course had a heavy reading load, and one student said that it was “more difficult to understand readings if no background knowledge of Islam.” Another student went on to say that “the prompts on essays are a bit too vague.”\r\n", "num_students": 26, "path": "/courses/23734/sections/401/reviews/3483-JAMAL-J--ELIAS", "instructor": {"path": "/instructors/3483-JAMAL-J--ELIAS", "first_name": "JAMAL J.", "last_name": "ELIAS", "id": "3483-JAMAL-J--ELIAS", "name": "JAMAL J. ELIAS"}, "num_reviewers": 20, "id": "23734-401-3483-JAMAL-J--ELIAS"}]}, "credits": null, "primary_alias": "RELS-146", "path": "/courses/23734", "sections": {"path": "/courses/23734/sections", "values": [{"name": "ISLAM IN MODERN WORLD", "sectionnum": "401", "primary_alias": "RELS-146-401", "path": "/courses/23734/sections/401", "id": "23734-401", "aliases": ["RELS-146-401", "NELC-184-401", "SAST-146-401"]}]}, "id": 23734, "aliases": ["RELS-146", "NELC-184", "SAST-146"]}