[{"ratings": {"rAmountLearned": "2.74", "rDifficulty": "2.63", "rStimulateInterest": "3.28", "rRecommendMajor": "2.83", "rCourseQuality": "3.10", "rWorkRequired": "2.08", "rInstructorAccess": "3.29", "rReadingsValue": "2.11", "rRecommendNonMajor": "3.06", "rCommAbility": "3.36", "rInstructorQuality": "3.50"}, "section": {"name": "THE BIOLOGY OF FOOD", "sectionnum": "001", "primary_alias": "BIOL-017-001", "path": "/courses/27043/sections/001", "id": "27043-001", "aliases": ["BIOL-017-001"]}, "comments": "This course examines the ways in which humans manipulate - and have been manipulated by - the organisms we depend on for food, with particular emphasis on the biological factors that influence this interaction. The first part of the course covers the biology, genetics, evolution, and breeding of cultivated plants and animals; the second part is concerned with the ways in which food/plants can cause and cure human disease. This course was offered as an ABCS course.\r\n\r\nStudents universally seemed to enjoy this class, calling it “a fantastic and eye-opening course,” “incredibly interesting,” and “a true pleasure.” A number of students noted the relevancy of the material to students’ lives. Several students noted that the class was “at times gratuitously challenging,” the opinion seeming to be that the exams did not cover what the lectures did.\r\n\r\nProfessor Poethig was largely praised for his teaching of this course. Students remarked that Professor Poethig had “genuine interest and enthusiasm that made the course engaging,” was “passionate,” “a great professor.” One student remarked, however, that while he was “so smart,” he “often forgets that his students aren’t as knowledgeable as he is.”\r\n\r\nMost of the class agreed that the material was often difficult, with one student remarking that the course was “definitely not as easy of a science course as I expected.” Midterms were thought to be challenging and “very obscure.” The students were divided over their recommendations as to what types of students should take the class. Though it was “designed as a science class for non-majors,” many believed that the class was too difficult for non-science majors. However, equally as many held the opposite view, saying that they would “recommend this class to anyone” and that the course presented “just the right amount of biology information for a non-major.”", "num_students": 43, "path": "/courses/27043/sections/001/reviews/208-RICHARD-SCOTT-POETHIG", "instructor": {"path": "/instructors/208-RICHARD-SCOTT-POETHIG", "first_name": "RICHARD SCOTT", "last_name": "POETHIG", "id": "208-RICHARD-SCOTT-POETHIG", "name": "RICHARD SCOTT POETHIG"}, "num_reviewers": 42, "id": "27043-001-208-RICHARD-SCOTT-POETHIG"}]