{"coursehistories": {"path": "/coursehistories/2545"}, "description": "The course provides an introduction to modern logic design and digital systems. It starts with an overview of the major building blocks of a computer. It covers combinational logic including logic gates, minimization techniques, arithmetic circuits and modern logic devices such as programmable logic arrays. The next part deals with sequential circuits: flip-flops, regist memories, and state machines. Case studies of real-world applications are used to illustrate the design of sequential circuits. The use of hardware description language will be introduced. There is a companion lab-based course, ESE 201, required for EE/CTE majors. \n\n", "semester": "2010A", "name": "PRIN OF DIGITAL DESIGN", "reviews": {"path": "/courses/25979/reviews", "values": [{"ratings": {"rAmountLearned": "3.57", "rDifficulty": "2.43", "rStimulateInterest": "3.18", "rRecommendMajor": "3.86", "rCourseQuality": "3.33", "rWorkRequired": "2.46", "rInstructorAccess": "3.61", "rReadingsValue": "2.63", "rRecommendNonMajor": "2.43", "rCommAbility": "3.48", "rInstructorQuality": "3.75"}, "section": {"name": "PRIN OF DIGITAL DESIGN", "sectionnum": "001", "primary_alias": "ESE-200-001", "path": "/courses/25979/sections/001", "id": "25979-001", "aliases": ["ESE-200-001"]}, "comments": "This course provides an introduction to modern logic design and digital systems. It starts with an overview of the major building blocks of a computer and the importance of abstraction. It covers combinational logic including logic gates, minimization techniques, arithmetic circuits and modern logic devices such as programmable logic arrays.\r\n\r\nOverall, students found the class to be quite enjoyable and the course material to be quite “interesting” Furthermore, students overwhelmingly suggested that the “textbook was hardly needed,” and that all the notes were “posted online.”\r\n\r\nAlmost all the students praised the professor, claiming he was “excellent” and “very helpful.” He “always answered everyone’s questions” and “ensured that the entire class understands the subject material well.” The majority of the students highly recommended Professor Spiegel for the course, describing him as “simply fantastic” and claiming that he “makes the course great.”\r\n\r\nThere were weekly homework assignments for this course. While some students claimed “it wasn’t bad,” others protested that there was “too much.” Overall, the course was recommended for Majors in electrical engineering. For students who are considering this course, the companion lab-based course, ESE 171 is highly recommended. ", "num_students": 42, "path": "/courses/25979/sections/001/reviews/350-JAN-DER-SPIEGEL", "instructor": {"path": "/instructors/350-JAN-DER-SPIEGEL", "first_name": "JAN", "last_name": "DER SPIEGEL", "id": "350-JAN-DER-SPIEGEL", "name": "JAN DER SPIEGEL"}, "num_reviewers": 37, "id": "25979-001-350-JAN-DER-SPIEGEL"}]}, "credits": null, "primary_alias": "ESE-200", "path": "/courses/25979", "sections": {"path": "/courses/25979/sections", "values": [{"name": "PRIN OF DIGITAL DESIGN", "sectionnum": "001", "primary_alias": "ESE-200-001", "path": "/courses/25979/sections/001", "id": "25979-001", "aliases": ["ESE-200-001"]}]}, "id": 25979, "aliases": ["ESE-200"]}