[{"ratings": {"rAmountLearned": "3.52", "rDifficulty": "2.69", "rStimulateInterest": "3.81", "rRecommendMajor": "3.84", "rCourseQuality": "3.56", "rWorkRequired": "2.88", "rInstructorAccess": "3.71", "rReadingsValue": "2.81", "rRecommendNonMajor": "2.97", "rCommAbility": "3.78", "rInstructorQuality": "3.74"}, "section": {"name": "BRAIN-COMPUTER INTERFACE", "sectionnum": "401", "primary_alias": "BE-421-401", "path": "/courses/15378/sections/401", "id": "15378-401", "aliases": ["BE-421-401", "BE-521-401"]}, "comments": "The course is geared to advanced undergraduate and graduate students interested in understanding the basics of implantable neuro-devices, their design, practical implementation, approval, and use. Reading will cover the basics of neuro signals, recording, analysis, classification, modulation, and fundamental principles of Brain-Machine Interfaces. The course will be based upon twice-weekly lectures and \\\"hands-on\\\" weekly assignments that teach basic signal recording, feature extraction, classification and practical implementation in clinical systems. Assignments will build incrementally toward constructing a complete, functional BMI system. Fundamental concepts in neuro-signals, hardware and software will be reinforced by practical examples and in-depth study. Guest lecturers and demonstrations will supplement regular lectures.\r\n\r\nStudents overall found this course to be “excellent” and “stimulating.” Students reported learning a lot from this course, especially from the homework. One student noted, “The MATLAB experience is very valuable.” Students were divided on the relevance of the homework to the course, although they all agreed that the homework was “useful.”\r\n\r\nStudents found Professor Litt to be an “excellent professor.” One student wrote the Dr. Litt’s “teaching style is great, and should be a model for other professors.” In addition, “Dr. Litt is very open to suggestions”\r\n\r\nThere is “Homework every week” and “there wasn\\'t an emphasis on exams.” The Prerequisites for this course are BE 301 (Signals and Systems) or equivalent, computer programming experience, preferably MATLAB (e.g., as used the BE labs, BE 209/210/310). Some basic neuroscience background (e.g. BIOL 215, BE 305, BE 520, INSC core course), or independent study in neuroscience, is required. This requirement may be waived based upon practical experience on a case-by-case basis by the instructor.", "num_students": 34, "path": "/courses/15378/sections/401/reviews/4252-BRIAN-LITT", "instructor": {"path": "/instructors/4252-BRIAN-LITT", "first_name": "BRIAN", "last_name": "LITT", "id": "4252-BRIAN-LITT", "name": "BRIAN LITT"}, "num_reviewers": 34, "id": "15378-401-4252-BRIAN-LITT"}]