[{"ratings": {"rAmountLearned": "2.49", "rDifficulty": "2.38", "rStimulateInterest": "1.30", "rRecommendMajor": "2.95", "rCourseQuality": "2.21", "rWorkRequired": "2.08", "rInstructorAccess": "1.88", "rReadingsValue": "3.03", "rRecommendNonMajor": "1.95", "rCommAbility": "2.18", "rInstructorQuality": "2.19"}, "section": {"name": "HIST ANCIENT PHILOSOPHY", "sectionnum": "401", "primary_alias": "PHIL-003-401", "path": "/courses/23610/sections/401", "id": "23610-401", "aliases": ["PHIL-003-401", "CLST-103-401"]}, "comments": "This course presents a survey of classical Greek approaches to questions about knowledge, the nature of the world, the soul, ethics, and politics. Students focus on Socrates, Plato, and Aristotle. &#8232;&#8232;\r\nStudents overall did not enjoy the class; some called it “the worst course” they have taken in the College. Students felt the class was disorganized and hard to follow. One student noted that the lectures seemed to have been a “rehash of the readings.” Though one student did note that this course was “good,” and another called it “tremendous” (but requiring much commitment), most students gave the course material less than favorable comments.&#8232;&#8232;\r\nWhile most students noted that Professor Kahn is “an expert in his field” and “very knowledgeable,” they did not enjoy his teaching style. Students also mentioned that it was difficult to hear Professor Kahn. Other students were upset at Professor Kahn’s inability to answer questions and his discussion of the same topic for a long period of time. Professor Kahn, according to one student, “did not stimulate interest in the material,” and thus made the class boring. &#8232;&#8232;\r\n\r\nMany students who commented took this class to fulfill one of the General Requirements. Students felt upset about the grade distribution, with only a small percentage of the class receiving A’s or A minuses, and wanted more direction with respect to readings and written assignments.\r\n", "num_students": 55, "path": "/courses/23610/sections/401/reviews/953-CHARLES-H--KAHN", "instructor": {"path": "/instructors/953-CHARLES-H--KAHN", "first_name": "CHARLES H.", "last_name": "KAHN", "id": "953-CHARLES-H--KAHN", "name": "CHARLES H. KAHN"}, "num_reviewers": 51, "id": "23610-401-953-CHARLES-H--KAHN"}]