[{"ratings": {"rAmountLearned": "2.91", "rDifficulty": "1.72", "rStimulateInterest": "2.72", "rRecommendMajor": "3.56", "rCourseQuality": "3.21", "rWorkRequired": "1.81", "rInstructorAccess": "3.47", "rReadingsValue": "2.59", "rRecommendNonMajor": "3.13", "rCommAbility": "3.50", "rInstructorQuality": "3.26"}, "section": {"name": "BECOMING HUMAN", "sectionnum": "301", "primary_alias": "ANTH-122-301", "path": "/courses/25588/sections/301", "id": "25588-301", "aliases": ["ANTH-122-301"]}, "comments": "Human evolutionary studies is a composite product of the fieldwork of both Paleolithic archaeology and human paleontology (or what we refer to as \"stones and bones\"). This marriage of two subdisciplines of anthropology produces a unique set of data that is intellectually managed and driven by theories within anthropology as a whole and even beyond -- to fields such as biology, psychology, and primate ethology, as we try to understand the origins of language, culture, and our unique physical characteristics. In this course, two archaeologists and one physical anthropologist will jointly discuss and debate the actual evidence of human evolution, describing what the actual evidence is and exploring how far can we take these interpretations.\r\n\r\nStudents heaped praise on the class. Students found the course both engaging and informative. They also thought it was a very comprehensive class. Students found Professor Olszewski to be very accessible and a great communicator. They found her to be amusing and very interesting. They thought she effectively presented the lectures.\r\n\r\nThis class fulfills the Natural Science & Mathematics sector. The coursework is very reasonable and is recommended for both majors and non-majors alike.", "num_students": 39, "path": "/courses/25588/sections/301/reviews/86-DEBORAH-IRENE-OLSZEWSKI", "instructor": {"path": "/instructors/86-DEBORAH-IRENE-OLSZEWSKI", "first_name": "DEBORAH IRENE", "last_name": "OLSZEWSKI", "id": "86-DEBORAH-IRENE-OLSZEWSKI", "name": "DEBORAH IRENE OLSZEWSKI"}, "num_reviewers": 36, "id": "25588-301-86-DEBORAH-IRENE-OLSZEWSKI"}]