[{"ratings": {"rAmountLearned": "2.57", "rDifficulty": "2.33", "rTAQuality": "3.10", "rStimulateInterest": "3.00", "rRecommendMajor": "2.71", "rCourseQuality": "3.00", "rWorkRequired": "2.52", "rInstructorAccess": "2.81", "rReadingsValue": "2.80", "rRecommendNonMajor": "2.29", "rCommAbility": "3.19", "rInstructorQuality": "3.23"}, "section": {"name": "CASE STUDY: CULTURE OF BIRTH", "sectionnum": "001", "primary_alias": "NURS-356-001", "path": "/courses/27879/sections/001", "id": "27879-001", "aliases": ["NURS-356-001"]}, "comments": "This course will explore the cultural context of birth and the activities of women and professionals and/or attendants in meeting the health care needs of pregnant women.  The history of caring for women at birth, international health care, cultural mores/societal values, place of birth, psychosocial factors, ethical decision-making and the role of technology are content areas that will be discussed.\r\nStudents enjoyed the exploration of different cultures in this class.  They found it refreshing and interesting to compare and contrast norms in a myriad of cultural contexts.  This class was “very enjoyable” persuaded students to think of their studies in a broader framework.\r\nProfessor McCool was highly motivating.  The instructor encouraged students to “think about why medical interventions are done and whether they are done out of tradition or evidence-based practice.”  Overall the teachers served as “great role models” for what students “aspire to be as nurses – both in their humanitarian efforts and role as health care providers.” \r\nA portion of this class is presentation driven.  Prerequisite: NURS 210, 220 or Permission of Instructors.\r\n", "num_students": 25, "path": "/courses/27879/sections/001/reviews/878-WILLIAM-F--MCCOOL", "instructor": {"path": "/instructors/878-WILLIAM-F--MCCOOL", "first_name": "WILLIAM F.", "last_name": "MCCOOL", "id": "878-WILLIAM-F--MCCOOL", "name": "WILLIAM F. MCCOOL"}, "num_reviewers": 23, "id": "27879-001-878-WILLIAM-F--MCCOOL"}, {"ratings": {"rAmountLearned": "2.57", "rDifficulty": "2.33", "rTAQuality": "3.10", "rStimulateInterest": "3.24", "rRecommendMajor": "2.71", "rCourseQuality": "3.00", "rWorkRequired": "2.52", "rInstructorAccess": "3.14", "rReadingsValue": "2.80", "rRecommendNonMajor": "2.29", "rCommAbility": "3.24", "rInstructorQuality": "3.26"}, "section": {"name": "CASE STUDY: CULTURE OF BIRTH", "sectionnum": "001", "primary_alias": "NURS-356-001", "path": "/courses/27879/sections/001", "id": "27879-001", "aliases": ["NURS-356-001"]}, "comments": "This course will explore the cultural context of birth and the activities of women and professionals and/or attendants in meeting the health care needs of pregnant women.  The history of caring for women at birth, international health care, cultural mores/societal values, place of birth, psychosocial factors, ethical decision-making and the role of technology are content areas that will be discussed.\r\n\tThis course covered a variety of ethical, political, and controversial topics that allowed the students to reflect on “how issues are applicable to countries around the world.” Students found the material engaging, but commented that some topics received too much attention throughout the course and began to feel tedious. More than half of the semester was spent on American culture, which was appreciated by some and lamented by others.  Overall, students enjoyed this course and found it to be “really interesting.”\r\n\tThis class was led by Dr. Lewis with the assistance of many guest lecturers.  Students “loved hearing the guest speakers” and appreciated the encouragement from the speakers to think more deeply about medical interventions.  The instructors were many students’ favorite part of the class, citing them as “great role models of what one should aspire to be as a nurse.”\r\n\tThe workload of this class was viewed as doable and not overwhelming, consisting of case studies and a final presentation and paper.  Some students expressed a desire for weekly cultural presentations to tie in to the information taught in class.  The final paper was seen as “valuable” but the vast scope of the topic soon because “tedious.”  All reviews had positive things to say about this course.  NURS 210 and 220 are prerequisites for this course, or the permission of instructors is needed before enrollment.\r\n", "num_students": 25, "path": "/courses/27879/sections/001/reviews/3139-JANET-L--LEWIS", "instructor": {"path": "/instructors/3139-JANET-L--LEWIS", "first_name": "JANET L.", "last_name": "LEWIS", "id": "3139-JANET-L--LEWIS", "name": "JANET L. LEWIS"}, "num_reviewers": 23, "id": "27879-001-3139-JANET-L--LEWIS"}]