{"coursehistories": {"path": "/coursehistories/1960"}, "description": "The historical origin of writing in Sumeria, Egypt, China, and Mesoamerica; the transmission of writing across languages and cultures, including the route from Phoenician to Greek to Etruscan to Latin to English; the development of individual writing systems over time; the traditional classification of written symbols (ideographic, logographic, syllabic, alphabetic); methods of decipherment; differences between spoken and written language; how linguistic structure influences writing, and is reflected by it; social and political aspects of writing; literacy and the acquisition of writing. \n\n", "semester": "2011A", "name": "WRITING SYSTEMS", "reviews": {"path": "/courses/21973/reviews", "values": [{"ratings": {"rAmountLearned": "2.39", "rDifficulty": "1.88", "rStimulateInterest": "2.34", "rRecommendMajor": "3.30", "rCourseQuality": "2.72", "rWorkRequired": "2.00", "rInstructorAccess": "2.53", "rReadingsValue": "1.83", "rRecommendNonMajor": "2.41", "rCommAbility": "3.24", "rInstructorQuality": "2.91"}, "section": {"name": "WRITING SYSTEMS", "sectionnum": "001", "primary_alias": "LING-115-001", "path": "/courses/21973/sections/001", "id": "21973-001", "aliases": ["LING-115-001"]}, "comments": "This course looks at the historical origin of writing in Sumeria, Egypt, China, and Mesoamerica; the transmission of writing across languages and cultures, including the route from Phoenician to Greek to Etruscan to Latin to English; the development of individual writing systems over time; the traditional classification of written symbols (ideographic, logographic, syllabic, alphabetic); methods of decipherment; differences between spoken and written language; how linguistic structure influences writing, and is reflected by it; social and psychological aspects of writing.&#8232;&#8232;&#8232;The course itself got very mixed reviews; some students remarked that the content was extremely interesting, while others thought that the manner in which it was taught made it “dry”. There is “a lot of information covered” and the exams often rely on rote memorization.&#8232;&#8232;&#8232; Students found Professor Buckley to be a very knowledgeable and very accessible teacher whose lectures were at times, “dry”.&#8232;&#8232;&#8232;This course fulfills the History & Tradition Sector requirement. The review was based on fewer than 8 student comments.", "num_students": 47, "path": "/courses/21973/sections/001/reviews/722-EUGENE-BUCKLEY", "instructor": {"path": "/instructors/722-EUGENE-BUCKLEY", "first_name": "EUGENE", "last_name": "BUCKLEY", "id": "722-EUGENE-BUCKLEY", "name": "EUGENE BUCKLEY"}, "num_reviewers": 46, "id": "21973-001-722-EUGENE-BUCKLEY"}]}, "credits": null, "primary_alias": "LING-115", "path": "/courses/21973", "sections": {"path": "/courses/21973/sections", "values": [{"name": "WRITING SYSTEMS", "sectionnum": "001", "primary_alias": "LING-115-001", "path": "/courses/21973/sections/001", "id": "21973-001", "aliases": ["LING-115-001"]}]}, "id": 21973, "aliases": ["LING-115"]}