[{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "2.45", "rStimulateInterest": "3.20", "rRecommendMajor": "3.45", "rCourseQuality": "3.05", "rWorkRequired": "2.65", "rInstructorAccess": "3.55", "rReadingsValue": "2.63", "rRecommendNonMajor": "2.30", "rCommAbility": "3.25", "rInstructorQuality": "3.29"}, "section": {"name": "C++ PROG", "sectionnum": "001", "primary_alias": "CIS-190-001", "path": "/courses/22823/sections/001", "id": "22823-001", "aliases": ["CIS-190-001"]}, "comments": "This course provides an introduction to programming in C++ and is intended for students who already have some exposure to programming in another language such as Java, C++ provides the programmer with a greater level of control over machine resources and are commonly used in situations where low level access or performance are important. This course illuminates the issues associated with programming at this level and will cover issues such as explicit memory management, pointers, the compilation process and debugging. The course involves several programming projects which will provide students with the experience they need to program effectively in these languages. This course assumes programming experience equivalent to CIS110, CIS 120 or ESE 112.\r\n\r\nThis was a half-credit course that met for an hour each week and some students felt that it “doesn’t exactly lend itself to learning the C++ language in depth.” However, even those students felt that the course “was executed really well and made good use of the time” and that they really learned a programming language. Some criticized the inclusion of C material at the beginning of the course, which the prerequisite (CIS 240) has already covered.\r\n\r\nStudents were full of praise for Professor Osera, who they described as knowledgeable, personable, and receptive to questions. According to most, he was a fair grader and “went out of his way to heavily and extensively comment the code he presented in class,” which was extremely helpful for after-class review given the short period of instruction each week.\r\n\r\nThough students generally felt that the very short class time each week was well utilized, a lot of self-instruction was needed to complete the assignments, some of which was “long and involved.” As a result, many students felt that the workload exceeded the 0.5 credit designation. However, many extensions were given to make up for this. The prerequisite for this course is CIS 240.\r\n\r\nThis course review is based on the 6 student comments that were submitted.\r\n", "num_students": 23, "path": "/courses/22823/sections/001/reviews/5317-PETER-MICHAEL-S--OSERA", "instructor": {"path": "/instructors/5317-PETER-MICHAEL-S--OSERA", "first_name": "PETER-MICHAEL S.", "last_name": "OSERA", "id": "5317-PETER-MICHAEL-S--OSERA", "name": "PETER-MICHAEL S. OSERA"}, "num_reviewers": 23, "id": "22823-001-5317-PETER-MICHAEL-S--OSERA"}]