[{"ratings": {"rAmountLearned": "3.43", "rDifficulty": "2.92", "rStimulateInterest": "3.03", "rRecommendMajor": "3.82", "rCourseQuality": "3.18", "rWorkRequired": "3.52", "rInstructorAccess": "3.18", "rReadingsValue": "2.65", "rRecommendNonMajor": "2.69", "rCommAbility": "3.37", "rInstructorQuality": "3.39"}, "section": {"name": "PROG LANG & TECH I", "sectionnum": "001", "primary_alias": "CIS-120-001", "path": "/courses/24161/sections/001", "id": "24161-001", "aliases": ["CIS-120-001"]}, "comments": "Programming Languages and Techniques I is a fast-paced introduction to the\r\nfundamental concepts of programming and software design. This course assumes some\r\nprevious programming experience, at the level of a high school computer science class or\r\nCIS110. No specific programming language background is assumed: basic experience\r\nwith any language (for instance Java, C, C++, VB, Python, Perl, or Scheme) is fine.\r\nStudents raved that this course was “rewarding” and “worth it.” The general\r\nconsensus between students was that this class was “truly challenging” but “challenging\r\nin a good way” that made them “want to further pursue my interests in computer\r\nscience.” OCaml was taught at the beginning of the course to “level the playing field”\r\nbetween people who had and had not taken 110, but a few students who were not as\r\nexperienced in computer science struggled a little more on assignments that those who\r\nhad prior experience breezed right by on.\r\nProfessor Zdancewic was seen as a “great teacher” and his course was well liked\r\nby the majority of his students. However, students did wish that there were more TAs.\r\nThe course required a lot of work, but students viewed the material interesting and\r\nwere thus happy completing the work. Students should expect to spend upwards of 15\r\nhours per week on this class, but also expect to learn a lot because of it and become better\r\nat programming because of this course. Prior programming experience or CIS110 is\r\nrecommended.", "num_students": 163, "path": "/courses/24161/sections/001/reviews/1357-STEPHAN-A--ZDANCEWIC", "instructor": {"path": "/instructors/1357-STEPHAN-A--ZDANCEWIC", "first_name": "STEPHAN A.", "last_name": "ZDANCEWIC", "id": "1357-STEPHAN-A--ZDANCEWIC", "name": "STEPHAN A. ZDANCEWIC"}, "num_reviewers": 147, "id": "24161-001-1357-STEPHAN-A--ZDANCEWIC"}]