[{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "2.94", "rStimulateInterest": "2.56", "rRecommendMajor": "3.12", "rCourseQuality": "2.62", "rWorkRequired": "2.94", "rInstructorAccess": "1.94", "rReadingsValue": "2.29", "rRecommendNonMajor": "1.82", "rCommAbility": "2.29", "rInstructorQuality": "2.38"}, "section": {"name": "CL RESEARCH EMERG MED I", "sectionnum": "601", "primary_alias": "BIBB-320-601", "path": "/courses/27033/sections/601", "id": "27033-601", "aliases": ["BIBB-320-601"]}, "comments": "\tThis course is designed to teach students the fundamentals of clinical research highlighting basic research design, research ethics, data collection, and good clinical practices. Students work closely with faculty in the Emergency Department screening, recruiting, and consenting patients for a variety of studies. A supplemental seminar series will introduce students to innovative, focused areas of medical research. This course stresses independent thinking, professional responsibility, and personal accountability. \r\n\t\r\n\tMost students had great things to say about this class, primarily due to the rewarding and “invaluable clinical research exposure,” though many did not like the academic portion of the class. Students should be prepared for a “different schedule and different requirements than in most courses,” as this class requires a big time commitment.\r\n\r\nWhile not many students commented on Dr. Hollander, there was a general consensus that “accessibility of the instructors was nonexistent.” The grading of the class was said to be very arbitrary, and students were not even given exams back, preventing any checking for errors in grading. The professor did not give very much information on what would be on exams, and he also changed the weighting of certain exams in the middle of the course.\r\n\r\nThis class was highly recommended to pre-med students. \r\n\r\n*This review was based on 8 student comments.", "num_students": 22, "path": "/courses/27033/sections/601/reviews/173-JUDD-E--HOLLANDER", "instructor": {"path": "/instructors/173-JUDD-E--HOLLANDER", "first_name": "JUDD E.", "last_name": "HOLLANDER", "id": "173-JUDD-E--HOLLANDER", "name": "JUDD E. HOLLANDER"}, "num_reviewers": 21, "id": "27033-601-173-JUDD-E--HOLLANDER"}]