[{"ratings": {"rAmountLearned": "2.00", "rDifficulty": "1.61", "rStimulateInterest": "2.52", "rRecommendMajor": "2.28", "rCourseQuality": "2.25", "rWorkRequired": "1.66", "rInstructorAccess": "2.85", "rReadingsValue": "1.93", "rRecommendNonMajor": "1.70", "rCommAbility": "2.58", "rInstructorQuality": "2.55"}, "section": {"name": "E-HEALTH:BUSINESS MODELS: E-Health: Business Models and Impact", "sectionnum": "001", "primary_alias": "HCMG-866-001", "path": "/courses/27536/sections/001", "id": "27536-001", "aliases": ["HCMG-866-001"]}, "comments": "Health Care Management 866 will introduce students to the roles health information technologies (HIT) can play in improving the performance of health care delivery, financing and innovation. The course will discuss the portfolio of health information technologies; the opportunities to apply these technologies to improve health care safety, quality and efficiency; the challenges of HIT implementation and value realization; and emerging HIT areas. While this course will not prepare students for primary information technology management positions, it will provide a foundation that will prepare them as managers in, and consultants to, the health care industry. The course relies heavily on industry leaders to share their ideas and experiences with industry leaders.\r\n\r\nThis course covered a board range of topics and relied heavily upon guest speakers. Many students hoped this course could be more structured and focused. Specifically, students said the course “felt like a mishmash of speakers,” with good and engaging ones and others of “low quality.” Students also thought the topics covered by guest speakers were somewhat repetitive and tangent to course material.\r\n\r\nThe majority of students had nothing but high regards for Professor Kolstad. Many students hoped Professor Kolstad could speak more instead of the outside speakers. Students also praised Professor Kolstad’s lectures as being “interesting” and “instructive.”\r\n\r\nThis is an MBA course, and undergraduates need permission to attend this course.\r\n", "num_students": 66, "path": "/courses/27536/sections/001/reviews/4834-JONATHAN-T--KOLSTAD", "instructor": {"path": "/instructors/4834-JONATHAN-T--KOLSTAD", "first_name": "JONATHAN T.", "last_name": "KOLSTAD", "id": "4834-JONATHAN-T--KOLSTAD", "name": "JONATHAN T. KOLSTAD"}, "num_reviewers": 58, "id": "27536-001-4834-JONATHAN-T--KOLSTAD"}, {"ratings": {"rAmountLearned": "2.00", "rDifficulty": "1.61", "rStimulateInterest": "3.05", "rRecommendMajor": "2.28", "rCourseQuality": "2.25", "rWorkRequired": "1.66", "rInstructorAccess": "2.60", "rReadingsValue": "1.93", "rRecommendNonMajor": "1.70", "rCommAbility": "3.17", "rInstructorQuality": "3.12"}, "section": {"name": "E-HEALTH:BUSINESS MODELS: E-Health: Business Models and Impact", "sectionnum": "001", "primary_alias": "HCMG-866-001", "path": "/courses/27536/sections/001", "id": "27536-001", "aliases": ["HCMG-866-001"]}, "comments": "This course will introduce students to the roles health information technologies (HIT) can play in improving the performance of health care delivery, financing and innovation. The course will discuss the portfolio of health information technologies; the opportunities to apply these technologies to improve health care safety, quality and efficiency; the challenges of HIT implementation and value realization; and emerging HIT areas. While this course will not prepare students for primary information technology management positions, it will provide a foundation that will prepare them as managers in, and consultants to, the health care industry. The course relies heavily on industry leaders to share their ideas and experiences with industry leaders.\r\nMany students thought the courses had a lack of structure, with many guest speakers “who covered a variety of topics.” Professor Glaser did not lecture enough to create structure, and students felt that some speakers were “saying redundant things or speaking in generalities. Students also felt that the “speakers need to be debriefed thoroughly with what the students have already learned,” as they “did not understand the class’s knowledge base. “ As a result, students felt like they didn’t “learn much in terms of core concepts.  Since most classes were guest lecturers the conversations tended to be very anecdotal and high-level.”\r\nStudents enjoyed whenever Professor Glaser lectured, because “his sessions were always very interesting and instructive.” Professor Glaser did a great job using “his work experiences to teach us life lessons!”\r\nStudents would have appreciated more “structure” and lectures from the professors.\r\n", "num_students": 66, "path": "/courses/27536/sections/001/reviews/5379-JOHN-GLASER", "instructor": {"path": "/instructors/5379-JOHN-GLASER", "first_name": "JOHN", "last_name": "GLASER", "id": "5379-JOHN-GLASER", "name": "JOHN GLASER"}, "num_reviewers": 58, "id": "27536-001-5379-JOHN-GLASER"}]