[{"ratings": {"rAmountLearned": "3.39", "rDifficulty": "3.00", "rStimulateInterest": "3.61", "rRecommendMajor": "3.78", "rCourseQuality": "3.58", "rWorkRequired": "3.04", "rInstructorAccess": "3.61", "rReadingsValue": "3.43", "rRecommendNonMajor": "3.13", "rCommAbility": "3.87", "rInstructorQuality": "3.88"}, "section": {"name": "RISE & FALL OF RUSS EMP", "sectionnum": "401", "primary_alias": "HIST-048-401", "path": "/courses/17489/sections/401", "id": "17489-401", "aliases": ["HIST-048-401", "RUSS-048-401"]}, "comments": "This course studies the Russian Empire prior to the Revolution of 1917, exploring the rise of a distinct political culture beginning in medieval Muscovy, its transformation under the impact of a prolonged encounter with European civilization, and the various attempts to re-form Russia from above and below. Main themes in this course include façade vs. the reality of central authority, the intersection of foreign and domestic issues, the development of a radical intelligentsia, and the tension between empire and nation.\r\n\r\nStudents* who took this course described it as “great,” “amazing,” and “absolutely excellent in every regard.” Others noted that the class covered “very stimulating subject matter” presented by an equally stimulating professor.\r\n\r\nOne student commented that Professor Holquist’s “personal passion for Russian history really shows in his lectures.” The professor was described by students as not only a superb lecturer, but “enthusiastic and knowledgeable” as well.\r\n\r\nThis course requires a lot of reading that students admit is often “pretty dense,” but they agree that it is enjoyable nevertheless. The class itself is comprised mostly of students either majoring in the subject or taking it to fulfill the History & Tradition Sector requirement.\r\n\r\n*This review is based on all 6/30 submitted student comments.\r\n", "num_students": 30, "path": "/courses/17489/sections/401/reviews/3325-PETER-HOLQUIST", "instructor": {"path": "/instructors/3325-PETER-HOLQUIST", "first_name": "PETER", "last_name": "HOLQUIST", "id": "3325-PETER-HOLQUIST", "name": "PETER HOLQUIST"}, "num_reviewers": 24, "id": "17489-401-3325-PETER-HOLQUIST"}]