{"coursehistories": {"path": "/coursehistories/1921"}, "description": "The meteoric rise of Hitler's NSDAP in Germany, the nature of Nazi rule, and the final collapse of the Third Reich. The first half of the semester analyzes the appeal of the NSDAP- who joined the party, who voted for it, and why. Nazi mobilization tactics, campaign strategy, and grass-roots techniques, the content of the party's social appeals. The second half of the course concentrates on the Nazis in power, their use of terror and propaganda, their ideological objective, everyday life in the Third Reich, the possibilities of resistance to the regime. Special attention will be devoted to Nazi Jewish policy and the step that led to the \"Final Solution\" and the Holocaust. \n\n", "semester": "2009C", "name": "THIRD REICH", "reviews": {"path": "/courses/17528/reviews", "values": [{"ratings": {"rAmountLearned": "3.49", "rDifficulty": "3.04", "rStimulateInterest": "3.85", "rRecommendMajor": "3.91", "rCourseQuality": "3.68", "rWorkRequired": "3.01", "rInstructorAccess": "3.11", "rReadingsValue": "3.13", "rRecommendNonMajor": "3.56", "rCommAbility": "3.89", "rInstructorQuality": "3.87"}, "section": {"name": "THIRD REICH", "sectionnum": "001", "primary_alias": "HIST-430-001", "path": "/courses/17528/sections/001", "id": "17528-001", "aliases": ["HIST-430-001"]}, "comments": "This course explores the meteoric rise of Hitler's NSDAP in Germany, the nature of Nazi rule, and the final collapse of the Third Reich. The first half of the semester analyzes the appeal of the NSDAP, Nazi mobilization tactics, campaign strategy, and the content of the party's social appeals. The second half concentrates on the Nazis in power, their use of terror and propaganda, their ideological objective, everyday life in the Third Reich, and the possibilities of resistance. Special attention is devoted to Nazi Jewish policy and the steps that led to the \"Final Solution\" and the Holocaust.\r\n\r\nStudents who have taken this course have called it “amazing,” “fantastic,” and one student mentioned that it was “the greatest class I’ve ever taken at Penn.” The course was described by students as “engaging” and others reported that the subject was “fascinating.”\r\n\r\nStudents attribute most of the course’s success to Professor Childers himself, who is described by many as “an absolutely captivating lecturer” who delivers his lectures in a “storytelling-like style” and manages to end each class on a cliffhanger. Students also note that Professor Childers “is extremely accommodating and approachable with any questions outside of class.”\r\n\r\nThe class entails keeping up with a lot of reading, but students who have taken the course in the past recommend it to any student at Penn, particularly those interested in German and Jewish history. \r\n", "num_students": 137, "path": "/courses/17528/sections/001/reviews/655-THOMAS-C-CHILDERS", "instructor": {"path": "/instructors/655-THOMAS-C-CHILDERS", "first_name": "THOMAS C", "last_name": "CHILDERS", "id": "655-THOMAS-C-CHILDERS", "name": "THOMAS C CHILDERS"}, "num_reviewers": 115, "id": "17528-001-655-THOMAS-C-CHILDERS"}]}, "credits": null, "primary_alias": "HIST-430", "path": "/courses/17528", "sections": {"path": "/courses/17528/sections", "values": [{"name": "THIRD REICH", "sectionnum": "001", "primary_alias": "HIST-430-001", "path": "/courses/17528/sections/001", "id": "17528-001", "aliases": ["HIST-430-001"]}]}, "id": 17528, "aliases": ["HIST-430"]}