[{"ratings": {"rAmountLearned": "2.33", "rDifficulty": "2.78", "rStimulateInterest": "1.90", "rRecommendMajor": "3.28", "rCourseQuality": "2.08", "rWorkRequired": "2.67", "rInstructorAccess": "2.61", "rReadingsValue": "1.81", "rRecommendNonMajor": "1.50", "rCommAbility": "1.68", "rInstructorQuality": "2.15"}, "section": {"name": "INTERMED MICROECONOMICS", "sectionnum": "001", "primary_alias": "ECON-101-001", "path": "/courses/22923/sections/001", "id": "22923-001", "aliases": ["ECON-101-001"]}, "comments": "This course covers theories of consumer behavior, demand, production, costs, the firm in various market contexts, factor employment, factor incomes, elementary general equilibrium, and welfare.\r\n\r\nOverall, students felt that the material was challenging and difficult to navigate due to the structure of the course. Many complained that “homework and quizzes were not representative of the material taught in class,” which made it “difficult to study for the exams, and several students claimed that the course would benefit from “a more structured plan.”\r\n\r\nOpinions about Professor Liu were quite mixed. Many cited his strong accent as a real hindrance to their understanding during the first few weeks of the course. Some felt that this “was not so much a problem as the course progressed,” and found Professor Liu “brilliant” and “clearly passionate about the material.” One student wrote that Professor Liu was “extremely talented at explaining complicated concepts and answering students’ questions.” Others felt that Professor Liu was “unable to communicate the information properly,” and that the effort he undoubtedly put in did not translate into understanding.\r\n\r\nThe highly theoretical nature of the course was “challenging” and “frustrating” to some, but appealed to other students. Some pointed out that the supporting materials did not increase understanding, noting that “PowerPoints could be more extensive,” and calling the textbook “beyond useless.” Many felt that Professor Liu’s passion for and ability to explain game theory made that section of the course a clear highlight.\r\n", "num_students": 154, "path": "/courses/22923/sections/001/reviews/5036-QINGMIN-LIU", "instructor": {"path": "/instructors/5036-QINGMIN-LIU", "first_name": "QINGMIN", "last_name": "LIU", "id": "5036-QINGMIN-LIU", "name": "QINGMIN LIU"}, "num_reviewers": 144, "id": "22923-001-5036-QINGMIN-LIU"}, {"ratings": {"rAmountLearned": "1.89", "rDifficulty": "3.28", "rStimulateInterest": "1.06", "rRecommendMajor": "2.94", "rCourseQuality": "1.76", "rWorkRequired": "2.44", "rInstructorAccess": "2.78", "rReadingsValue": "1.67", "rRecommendNonMajor": "1.28", "rCommAbility": "1.65", "rInstructorQuality": "1.90"}, "section": {"name": "INTERMED MICROECONOMICS", "sectionnum": "601", "primary_alias": "ECON-101-601", "path": "/courses/22923/sections/601", "id": "22923-601", "aliases": ["ECON-101-601"]}, "comments": "Theories of consumer behavior, demand, production, costs, the firm in various market contexts, factor employment, factor incomes, elementary general equilibrium, and welfare.\r\n\r\nGenerally, students did not enjoy this class. It is a very \"math-heavy\" course with a lot of emphasis on algebra and calculus. One student said, \"The course was way too technical and hard to understand for students in Econ 101.\" But some students did find the content \"interesting.\"\r\n\r\nStudents by and large did not praise Professor Hanley’s teaching abilities. One student said, \"Professor Hanley is the nicest, smartest teacher. He clearly knows his stuff. That being said ECON101 is the first econ class where you need to understand calculus applications in economics. Some felt that the professor “could not relate to people who had only an elementary understanding of the material.\"\r\n\r\nStudents generally found the material in this class to be difficult. The exams were fairly difficult. One student said it was because the students \"were not adequately prepared.\" Also, the problems sets were very difficult and were hard to complete \"without extensive help.\" The prerequisites are ECON 001 and 002; MATH 104 and either MATH 114 or MATH 115. Note: Incoming freshmen with AP or transfer credit for Econ 1 and Econ 2, MUST complete Math 104 and Math 114 or Math 115 before enrolling in Econ 101. Upper classmen must have at least a B+ in Math 104 to take Econ 101 and Math 114 or Math 115 concurrently. Most students took this class as a major requirement.\r\n", "num_students": 25, "path": "/courses/22923/sections/601/reviews/5606-DOUGLAS-B-HANLEY", "instructor": {"path": "/instructors/5606-DOUGLAS-B-HANLEY", "first_name": "DOUGLAS B", "last_name": "HANLEY", "id": "5606-DOUGLAS-B-HANLEY", "name": "DOUGLAS B HANLEY"}, "num_reviewers": 23, "id": "22923-601-5606-DOUGLAS-B-HANLEY"}]