[{"ratings": {"rAmountLearned": "3.68", "rDifficulty": "2.47", "rStimulateInterest": "3.05", "rRecommendMajor": "3.89", "rCourseQuality": "3.00", "rWorkRequired": "2.74", "rInstructorAccess": "3.47", "rReadingsValue": "3.26", "rRecommendNonMajor": "2.21", "rCommAbility": "3.32", "rInstructorQuality": "3.14"}, "section": {"name": "STRUCTURAL MATERIALS", "sectionnum": "001", "primary_alias": "MSE-220-001", "path": "/courses/23470/sections/001", "id": "23470-001", "aliases": ["MSE-220-001"]}, "comments": "MSE 220 introduces the fundamental concepts of Materials Science through an examination of the structure, property, performance relationship for synthetic and biologic structural materials with a focus on surgical implants and medical devices. Consideration is given to issues of biocompatibility, degradation of materials by the biologic systems, and biologic response to artificial materials. Particular attention is given to the materials of total hip and knee prostheses and their relationship to the long-term outcomes in hip and knee arthroplasty.\r\n\r\nStudents generally described this course as “fantastic” and “fascinating.” They said that it took a good bit of work, but it was “pretty worth it.” In this course, there was a daily quiz component, which a student claimed was “very effective in making sure [the students] got the most out of lectures and understood the content.”\r\n\r\nMany students gave positive feedback about Dr. Winey. One student reported that she was “frank about material covered on exams” and had “an engaging conversational style of teaching.” Students said that she did “a great job of going over and clarifying the subject matter.” Some students even claimed that she was their favorite professor at Penn.\r\n\r\nThis course received fairly high ratings from students. It is a requirement for all MSE majors, but it was also recommended to non-majors.\r\n\r\nThis review was based on the 5 student comments that were submitted.\r\n", "num_students": 24, "path": "/courses/23470/sections/001/reviews/842-KAREN-I--WINEY", "instructor": {"path": "/instructors/842-KAREN-I--WINEY", "first_name": "KAREN I.", "last_name": "WINEY", "id": "842-KAREN-I--WINEY", "name": "KAREN I. WINEY"}, "num_reviewers": 21, "id": "23470-001-842-KAREN-I--WINEY"}]