{"coursehistories": {"path": "/coursehistories/1040"}, "description": "As a science, sociology uses various tools to establish knowledge about the social world, as one step in the process of producing explanatory (and ideally, predictive) theory. The purpose of this course is to introduce students to different sociological methods, including survey research and associated quantitative/statistical analysis, interviewing, ethnography, historical-comparative and archival research, experimentation and computer simulatin. We will review basic mechanics for applying these methods, and discuss the assumptions behind each and the kind of insight each yields. The class is required of sociology majors, and satisfies the College quantitative data analysis requirement. \n\n", "semester": "2010C", "name": "INTRO SOC RESEARCH", "reviews": {"path": "/courses/23784/reviews", "values": [{"ratings": {"rAmountLearned": "3.24", "rDifficulty": "2.68", "rStimulateInterest": "3.44", "rRecommendMajor": "3.71", "rCourseQuality": "3.17", "rWorkRequired": "3.38", "rInstructorAccess": "3.18", "rReadingsValue": "2.88", "rRecommendNonMajor": "2.24", "rCommAbility": "3.32", "rInstructorQuality": "3.43"}, "section": {"name": "INTRO SOC RESEARCH", "sectionnum": "401", "primary_alias": "SOCI-100-401", "path": "/courses/23784/sections/401", "id": "23784-401", "aliases": ["SOCI-100-401", "HSOC-100-401"]}, "comments": "This course provides a board overview of how sociologists gather and analyze information to generate and test hypotheses about the social world. We begin by covering key building blocks of sociological research: theory, measurement, and sampling. Then, we review a variety of research designs and analytic approaches. Finally, we take a critical perspective on social research discussing topics of research ethics, objectivity, and whether research findings should be used to inform policy. The emphasis in the course will be on training students to develop a healthy skepticism and to be intelligent consumers, and we will regularly discuss and evaluate research examples found in mainstream news sources. Students will also gain hands-on experience with survey and qualitative research through course research products. \r\n\r\nStudents described the course as “challenging” but “worthwhile.” In the course, students “learned about sociological research methods” and “saw real-life examples.” \r\n\r\nOverall, students loved Professor Wilde and they described her as “kind,” “hilarious,” and “intelligent.” Most importantly students found Professor Wilde “extremely accessible” and felt that she “wants her students to succeed.”\r\n\r\nThe class is described as “challenging” due to the large amount of reading and work relating to the research project and papers. One student commented that “students should be prepared to work hard for this course,” though the grading is fair.\r\n", "num_students": 37, "path": "/courses/23784/sections/401/reviews/3489-MELISSA-J--WILDE", "instructor": {"path": "/instructors/3489-MELISSA-J--WILDE", "first_name": "MELISSA J.", "last_name": "WILDE", "id": "3489-MELISSA-J--WILDE", "name": "MELISSA J. WILDE"}, "num_reviewers": 36, "id": "23784-401-3489-MELISSA-J--WILDE"}]}, "credits": null, "primary_alias": "SOCI-100", "path": "/courses/23784", "sections": {"path": "/courses/23784/sections", "values": [{"name": "INTRO SOC RESEARCH", "sectionnum": "401", "primary_alias": "SOCI-100-401", "path": "/courses/23784/sections/401", "id": "23784-401", "aliases": ["SOCI-100-401", "HSOC-100-401"]}]}, "id": 23784, "aliases": ["SOCI-100", "HSOC-100"]}