{"coursehistories": {"path": "/coursehistories/1807"}, "description": "In this class we come to speak as people spoke in England some six centuries ago: in medieval or 'Middle' English. We do this by reading the poetry of Geoffrey Chaucer, a great poet who has influenced everyone from William Shakespeare to Sylvia Plath. Since Middle English takes some getting use to, class assignments are not heavy: usually about 800 lines per class. A typical class might begin by looking at a few of the easier passages in the Canterbury Tales, proceed to reading the greatest poem of love in the English language (Chaucer's Troilus And Criseyde), before moving on to other contemporary writers in medieval culture. We will likely compare representations of medieval Christianty, Judaism, and Islam, as well as aspects of film adaptation by Italian filmmaker Pasolini (and perhaps by Chaucer scholar Terry Jones). We will consider what it might have been like to live secure in an age of faith; yet to live insecure, as a dizzying new profusion of trades and occupations sprang up in unprecedented \"divisions of labor.\" We will imagine being a medieval woman, and may visit and handle medieval manuscripts. Above all, we will enjoy the poetry. \n\nSee the English Department's website at www.english.upenn.edu for a description of the current offerings. \n\n", "semester": "2010C", "name": "THE AGE OF CHAUCER: CHAUCER AT LARGE", "reviews": {"path": "/courses/22951/reviews", "values": [{"ratings": {"rAmountLearned": "3.22", "rDifficulty": "2.22", "rStimulateInterest": "3.43", "rRecommendMajor": "3.68", "rCourseQuality": "3.29", "rWorkRequired": "2.22", "rInstructorAccess": "3.86", "rReadingsValue": "3.61", "rRecommendNonMajor": "2.57", "rCommAbility": "3.74", "rInstructorQuality": "3.67"}, "section": {"name": "THE AGE OF CHAUCER: CHAUCER AT LARGE", "sectionnum": "001", "primary_alias": "ENGL-025-001", "path": "/courses/22951/sections/001", "id": "22951-001", "aliases": ["ENGL-025-001"]}, "comments": "In this class students came to speak as people spoke in England some six centuries ago: in medieval or 'Middle' English. Students did this by reading the poetry of Geoffrey Chaucer, a great poet who has influenced everyone from William Shakespeare to Sylvia Plath. Since Middle English takes some getting used to, class assignments were not heavy: usually about 800 lines per class. A typical class might begin by looking at a few of the easier passages in the Canterbury Tales, proceed to reading the greatest poem of love in the English language (Chaucer's Troilus and Criseyde), before moving on to other contemporary writers in medieval culture. The class compared representations of medieval Christianty, Judaism, and Islam, as well as aspects of film adaptation by Italian filmmaker Pasolini (and perhaps by Chaucer scholar Terry Jones). The class considered what it might have been like to live secure in an age of faith; yet to live insecure, as a dizzying new profusion of trades and occupations sprang up in unprecedented \"divisions of labor.\" The class imagined being a medieval woman, and visited and handled medieval manuscripts. &#8232;&#8232;\r\n\r\nStudents enjoyed the class and its material, calling it “fun and interesting.” Students were also “willing to participate in the discussion,” making the class atmosphere enjoyable. One student disagreed, saying that the class “tended to be lecture-oriented and although there was opportunity for student input, there was never an atmosphere of class discussion.” Students felt that they emerged from the class with “a tremendous amount” of knowledge and “absorbed by material [they] hadn’t expected to like.”&#8232;&#8232;\r\n\r\nThe students praised Professor Steiner, calling her “enthusiastic” and “accessible.” Students all appreciated her ability to stimulate “interest in students about such a seemingly boring subject like Middle English and Chaucer.” The students were also impressed by Professor Steiner’s knowledge on the subject, especially concerning the historic events surrounding the works of literature.&#8232;&#8232;\r\n\r\nSome students disliked the amount of work in the class and were “surprised to find three papers and two exams within one English class; the papers often coinciding closely with the exam.” Other students declared the assignments “exactly appropriate for the undergraduate level.” Overall, students felt that while the course required effort, it was not unmanageable.\r\n", "num_students": 24, "path": "/courses/22951/sections/001/reviews/455-EMILY-R-STEINER", "instructor": {"path": "/instructors/455-EMILY-R-STEINER", "first_name": "EMILY R", "last_name": "STEINER", "id": "455-EMILY-R-STEINER", "name": "EMILY R STEINER"}, "num_reviewers": 24, "id": "22951-001-455-EMILY-R-STEINER"}]}, "credits": null, "primary_alias": "ENGL-025", "path": "/courses/22951", "sections": {"path": "/courses/22951/sections", "values": [{"name": "THE AGE OF CHAUCER: CHAUCER AT LARGE", "sectionnum": "001", "primary_alias": "ENGL-025-001", "path": "/courses/22951/sections/001", "id": "22951-001", "aliases": ["ENGL-025-001"]}]}, "id": 22951, "aliases": ["ENGL-025"]}