[{"ratings": {"rAmountLearned": "3.12", "rDifficulty": "3.83", "rStimulateInterest": "2.73", "rRecommendMajor": "3.35", "rCourseQuality": "2.58", "rWorkRequired": "3.79", "rInstructorAccess": "2.76", "rReadingsValue": "3.13", "rRecommendNonMajor": "0.83", "rCommAbility": "3.10", "rInstructorQuality": "3.12"}, "section": {"name": "ORGANIC CHEMISTRY I", "sectionnum": "001", "primary_alias": "CHEM-241-001", "path": "/courses/21399/sections/001", "id": "21399-001", "aliases": ["CHEM-241-001"]}, "comments": "Part I of Principles of Organic Chemistry, Chemistry 241, introduces students to organic chemistry based on modern concepts of structure and mechanisms of reactions. The course builds on the fundamental concepts taught in Chemistry 101 but teaches the detailed stepwise reaction mechanisms of carbon-based structures as well as the methods for determining the thermodynamic and kinetic stability of organic products. \r\n\r\nOverall, students seemed to find the course extremely demanding and one of the most difficult they have ever taken. In general, students seemed to be interested in the material and learned a lot of chemistry as each chapter was very “dense” and thoroughly covered.\r\n\r\nStudents praised Professor Dailey’s teaching style. Most found him to be “clear” and “eager” to teach the material. Students felt that Professor Dailey was genuinely enthusiastic about the subject matter, making class naturally stimulating. There were, however, frequent requests for Professor Dailey to provide more guidance in terms of suggesting practice problems for test preparation.\r\n\r\nThe majority of people taking the class were upperclassmen chemistry majors or pre-medical students. Students should expect to work at least two hours a day to completely understand the material. Because of the difficulty and length of tests, the average scores tended to be quite low.\r\n", "num_students": 101, "path": "/courses/21399/sections/001/reviews/228-WILLIAM-P-DAILEY", "instructor": {"path": "/instructors/228-WILLIAM-P-DAILEY", "first_name": "WILLIAM P", "last_name": "DAILEY", "id": "228-WILLIAM-P-DAILEY", "name": "WILLIAM P DAILEY"}, "num_reviewers": 94, "id": "21399-001-228-WILLIAM-P-DAILEY"}]