{"coursehistories": {"path": "/coursehistories/5261"}, "description": "This course is an introduction to the study of religion as an academic discipline. We will consider issues such as the role of religion in human societies, how religion addresses perennial questions of life and death, and how religious traditions change, evolve, and influence one another. Although this is NOT a primarily an introduction to different religious traditions in sense of a \"world religions\" survey course, students will become acquainted with major teachings of several faith traditions. Our focus, though, will be the big questions: Does religion do more good than harm or is it the other way around? Has the modern emergence of a more secular worldview been an improvement or a diminishment? Can we know or experience who or what \"ultimatereality\" is, or is \"it\" really beyond us? How can we explain the relationship religion, peace, and violence? Is suffering and meaninglessness so pervasive that no traditional concept of a loving and powerful God can be affirmed credibly? What kinds of provocative and perhaps enduring answers have people given to these questions in the past? Has something changed as we've moved from ancient to modern times in terms of our own worldviews, so that the the ways people used to think about God must be radically revised if not abandoned entirely? \n\nor are there ways for modern women and men to become or remain religious without ceasing to be modern? The goals of this freshman seminar include: 1. an enhanced working knowledge of some significant elements of religion, especially symbol, doctrine, experience, and systems of cosmic, social and order, as they are manifested in several religious traditions. 2. an enhanced capacity to make critical comparisons among religious traditionsacross time. 3. a greater capacity to analyze and reflect on the meaning of religious beliefs and practices. 4. a greater capacity to read and critically interpret religious and scholarly texts. 5. development of your written and verbal communication skills. \n\n", "semester": "2012C", "name": "INTRODUCTION TO RELIGION", "reviews": {"path": "/courses/29598/reviews", "values": [{"ratings": {"rDifficulty": "1.63", "rStimulateInterest": "3.24", "rCourseQuality": "3.00", "rWorkRequired": "1.76", "rInstructorQuality": "2.72", "rCommAbility": "3.35", "rInstructorAccess": "3.47"}, "section": {"name": "INTRODUCTION TO RELIGION", "sectionnum": "301", "primary_alias": "RELS-012-301", "path": "/courses/29598/sections/301", "id": "29598-301", "aliases": ["RELS-012-301"]}, "comments": "", "num_students": 18, "path": "/courses/29598/sections/301/reviews/1048-E-ANN-MATTER", "instructor": {"path": "/instructors/1048-E-ANN-MATTER", "first_name": "E ANN", "last_name": "MATTER", "id": "1048-E-ANN-MATTER", "name": "E ANN MATTER"}, "num_reviewers": 18, "id": "29598-301-1048-E-ANN-MATTER"}]}, "credits": null, "primary_alias": "RELS-012", "path": "/courses/29598", "sections": {"path": "/courses/29598/sections", "values": [{"name": "INTRODUCTION TO RELIGION", "sectionnum": "301", "primary_alias": "RELS-012-301", "path": "/courses/29598/sections/301", "id": "29598-301", "aliases": ["RELS-012-301"]}]}, "id": 29598, "aliases": ["RELS-012"]}