[{"ratings": {"rAmountLearned": "2.41", "rDifficulty": "2.45", "rStimulateInterest": "2.11", "rRecommendMajor": "3.26", "rCourseQuality": "2.25", "rWorkRequired": "2.21", "rInstructorAccess": "2.82", "rReadingsValue": "2.05", "rRecommendNonMajor": "1.69", "rCommAbility": "2.51", "rInstructorQuality": "2.51"}, "section": {"name": "STAT FOR ECONOMISTS", "sectionnum": "001", "primary_alias": "ECON-103-001", "path": "/courses/21554/sections/001", "id": "21554-001", "aliases": ["ECON-103-001"]}, "comments": "This course focuses on elementary probability and inferential statistical techniques. The course begins with a survey of basic descriptive statistics and data sources and then covers elementary probability theory, sampling, estimation, hypothesis testing, correlation, and regression. The course focuses on practical issues involved in the substantive interpretation of economic data using the techniques of statistical inference. For this reason empirical case studies that apply the techniques to real-life data are stressed and discussed throughout the course, and students are required to perform several statistical analyses of their own. Students need to complete MATH 104 and MATH 114 or 115 as prerequisites. &#8232;&#8232;While some students said that the class was boring and confusing, others said that it was straightforward and easy to follow. The course gives a solid foundation in statistics for those who are interested in economics. In general students found that they gained valuable tools from taking the course. &#8232;&#8232;Professor De Paula was described as nice and good at explaining the material. He was also said to be quite accessible outside of class to answer questions. He was praised for reaching out to his students, his good nature and for maintaining a clear organization of the class. &#8232;&#8232;The course moves a bit fast and although the professor is great at explaining new concepts, students found that the material sometimes does not coincide with tests. Students also found the terminology used in class to be hard to keep up with. This course is recommended for majors but not for those who are looking to go into the field of statistics.", "num_students": 62, "path": "/courses/21554/sections/001/reviews/2923-AUREO-DE-PAULA", "instructor": {"path": "/instructors/2923-AUREO-DE-PAULA", "first_name": "AUREO", "last_name": "DE PAULA", "id": "2923-AUREO-DE-PAULA", "name": "AUREO DE PAULA"}, "num_reviewers": 55, "id": "21554-001-2923-AUREO-DE-PAULA"}]