[{"ratings": {"rAmountLearned": "1.20", "rDifficulty": "2.10", "rStimulateInterest": "0.90", "rRecommendMajor": "1.71", "rCourseQuality": "1.02", "rWorkRequired": "1.66", "rInstructorAccess": "1.98", "rReadingsValue": "0.78", "rRecommendNonMajor": "0.76", "rCommAbility": "0.71", "rInstructorQuality": "0.91"}, "section": {"name": "PUBLIC FINANCE", "sectionnum": "001", "primary_alias": "ECON-231-001", "path": "/courses/15592/sections/001", "id": "15592-001", "aliases": ["ECON-231-001"]}, "comments": "This course has two parts. The first looks at market and government failures and discusses the need for public policies as well as limits to their effectiveness, including the evaluation of public projects using cost-benefit analysis. The second part focuses on the economic analysis of taxation, including the economic incidence and efficiency of taxes.&#8232;\r\n\r\nStudents found this course \\\"disappointing.\\\" It was described as having \\\"minimal concept development\\\" and little \\\"depth of material.\\\" Some described it as one of the worst classes they had taken at Penn.&#8232;&#8232;\r\n\r\nStudents said that Professor Zax was a \\\"poor\\\" instructor and very \\\"hard to understand\\\" because of his weak English. As a result, he was \\\"unable to convey the material properly\\\" and there were many typos in his slides. Students found him \\\"confusing\\\", and thought that his test questions were worded poorly and ambiguously.\r\n\r\nStudents said that it was difficult to understand the homework questions and that the readings assigned did not relate to the class. One student remarked that \\\"almost everybody felt helpless.\\\" Economics 101 is a prerequisite for this course. Economics 103 and Math 104, Math 114, or Math 115 are recommended. Credit cannot be received for both Economics 030 and 231.", "num_students": 50, "path": "/courses/15592/sections/001/reviews/4297-ORI-ZAX", "instructor": {"path": "/instructors/4297-ORI-ZAX", "first_name": "ORI", "last_name": "ZAX", "id": "4297-ORI-ZAX", "name": "ORI ZAX"}, "num_reviewers": 47, "id": "15592-001-4297-ORI-ZAX"}]