{"coursehistories": {"path": "/coursehistories/5667"}, "description": "Our perception of Jewish women around 1800 is shaped by the social and intellectual adventures of Jewish Salonieres and recently re-discovered female writers. The glamorous lives of the romantic writer Dorothea Mendelssohn/Veit/Schlegel and the \"German Wollstonecraft\" Esther Gad/Bernard/Domeier, the Salonieres Rahel Levin/Varnhagen and Henriette de Lemos/Herz, who were instrumental in spreading Goethe's fame and literature, overshadow the existence of most Jewish women of that period. While the aforementioned women sought realizing their self and their ambitions in gentile society, others asked to fulfill their objectives and aspirations within the framework and language of traditional Judaism. \n\nThe latter group was encouraged to embark on this journey by the speedy religious and socio-political transformation process that changed the life and habits of central European Jewry since the last quarter of the eighteenth century. These transformation processes caused significant changes in the female role model. Whereas traditional Judaism has marginalized women religiously, the structure of bourgeois family placed women in the center of religious performance. In their new role as housewife and mother, women were held responsible for the religious education of their children (male and female) and thus guaranteed the transmission of Judaism to future generations. In preparation for this role, they draw upon the rich literature of text and prayer books for women that were increasingly published in German language. This course aims at capturing the lives of women in Central Europe on the threshold of modernity, between the mid eighteenth and the mid nineteenth century. Starting from different fole models that Jewish society/societies ascribed to women during this period, we will discuss possibilities and limitation of female self-realization. The actual and written biographies of Jewish women will therefore be contrasted with authoritative texts of traditional, enlightened and bourgeois Jewish society, respectively. \n\n", "semester": "2013A", "name": "BETWEEN POETRY & PRAYER", "reviews": {"path": "/courses/30404/reviews", "values": [{"ratings": {"rDifficulty": "3.00", "rStimulateInterest": "4.00", "rCourseQuality": "4.00", "rWorkRequired": "3.00", "rInstructorQuality": "4.00", "rCommAbility": "4.00", "rInstructorAccess": "4.00"}, "section": {"name": "BETWEEN POETRY & PRAYER", "sectionnum": "401", "primary_alias": "GRMN-563-401", "path": "/courses/30404/sections/401", "id": "30404-401", "aliases": ["GRMN-563-401", "JWST-563-401", "GSWS-563-401"]}, "comments": "", "num_students": 3, "path": "/courses/30404/sections/401/reviews/6503-ANNA-LOUISE-HECHT", "instructor": {"path": "/instructors/6503-ANNA-LOUISE-HECHT", "first_name": "ANNA LOUISE", "last_name": "HECHT", "id": "6503-ANNA-LOUISE-HECHT", "name": "ANNA LOUISE HECHT"}, "num_reviewers": 2, "id": "30404-401-6503-ANNA-LOUISE-HECHT"}]}, "credits": null, "primary_alias": "GRMN-563", "path": "/courses/30404", "sections": {"path": "/courses/30404/sections", "values": [{"name": "BETWEEN POETRY & PRAYER", "sectionnum": "401", "primary_alias": "GRMN-563-401", "path": "/courses/30404/sections/401", "id": "30404-401", "aliases": ["GRMN-563-401", "JWST-563-401", "GSWS-563-401"]}]}, "id": 30404, "aliases": ["GRMN-563", "JWST-563", "GSWS-563"]}