[{"ratings": {"rAmountLearned": "3.28", "rDifficulty": "2.88", "rStimulateInterest": "3.21", "rRecommendMajor": "3.52", "rCourseQuality": "3.21", "rWorkRequired": "2.68", "rInstructorAccess": "3.56", "rReadingsValue": "2.36", "rRecommendNonMajor": "1.56", "rCommAbility": "3.32", "rInstructorQuality": "3.38"}, "section": {"name": "MATHEMAT METHODS OF PHYS", "sectionnum": "401", "primary_alias": "PHYS-500-401", "path": "/courses/17931/sections/401", "id": "17931-401", "aliases": ["PHYS-500-401", "MATH-594-401"]}, "comments": "This course explores concepts and techniques of classical analysis employed in physical theories. Topics include complex analysis, Fourier series and transforms, ordinary and partial equations, and Hilbert spaces.\r\n\r\nThis course was consistently described by students as “excellent.” After taking this course, students felt well-equipped to manipulate a broad range of mathematical tools useful in solving physics problems. A couple of students would have liked “a little more detail” about the subjects covered, and some students felt that certain topics were slightly redundant in that they had learned them before in other classes.\r\n\r\nPraise for Professor Trodden was endless. Students unanimously agreed that Professor Trodden’s lectures were “clear,” “concise,” and “organized,” as well as “illuminating,” and “interesting.” Students felt that Professor Trodden was “genuinely committed” to helping them understand the material both during and outside of class, and they felt comfortable asking questions, which were encouraged. Students also appreciated that Professor Trodden provided all students would need to know, making few references to outside sources and placing “few demands” on prior knowledge.\r\n\r\nProfess Trodden’s homework assignments were typically considered “interesting and clever,” as well as “effective in enforcing material,” although difficulty and length of problem sets steadily declined as the semester progressed. A complaint that came up was that there were not enough assigned homework problems, especially toward the end of the semester, which would’ve been helpful in studying for exams.", "num_students": 30, "path": "/courses/17931/sections/401/reviews/4960-MARK-TRODDEN", "instructor": {"path": "/instructors/4960-MARK-TRODDEN", "first_name": "MARK", "last_name": "TRODDEN", "id": "4960-MARK-TRODDEN", "name": "MARK TRODDEN"}, "num_reviewers": 30, "id": "17931-401-4960-MARK-TRODDEN"}]