{"coursehistories": {"path": "/coursehistories/1452"}, "description": "This course is designed to introduce students to comparative political analysis. How can the political behavior, circumstances, institutions, and dynamic patterns of change that people experience in very different societies be analyzed using the same set of concepts and theories? Key themes include nationalism, political culture, democratization, authoritarianism, and the nature of protracted conflict. \n\n", "semester": "2011A", "name": "COMPARATIVE POLITICS", "reviews": {"path": "/courses/22317/reviews", "values": [{"ratings": {"rAmountLearned": "3.08", "rDifficulty": "3.04", "rStimulateInterest": "3.08", "rRecommendMajor": "3.27", "rCourseQuality": "2.67", "rWorkRequired": "2.84", "rInstructorAccess": "2.96", "rReadingsValue": "3.23", "rRecommendNonMajor": "2.28", "rCommAbility": "2.71", "rInstructorQuality": "2.98"}, "section": {"name": "COMPARATIVE POLITICS", "sectionnum": "001", "primary_alias": "PSCI-110-001", "path": "/courses/22317/sections/001", "id": "22317-001", "aliases": ["PSCI-110-001"]}, "comments": "This course is designed to introduce students to comparative political analysis. The course covers how political behavior, circumstances, institutions, and dynamic patterns of change that people experience in very different societies can be analyzed using the same set of concepts and theories. Key themes include nationalism, political culture, democratization, authoritarianism, and the nature of protracted conflict.&#8232;&#8232;&#8232;All the materials taught in the class were “relevant” and “controversial”. Students were encouraged to think outside of the box. The class focused on comparing between Israel and South Africa and was able to stimulate an interesting discussion. &#8232;&#8232;&#8232;There are mixed comments for Professor Vitalis. Some students thought the professor was “intellectually demanding” and “provocative”. The class is taught in a seminar style to a class of over 100 people. As such, some students thought the class was very disorganized and Professor Vitalis did not come with a prepared set of notes. Students that enjoyed the class learned a lot from the discussions. &#8232;&#8232;&#8232;There are no quizzes, homework assignments, tests nor midterms for the class. Students read 5 books and wrote book reports. The class format did not allow for any lazy academic work. Nothing is spoon-fed and students explored real political science subjects.", "num_students": 109, "path": "/courses/22317/sections/001/reviews/1014-ROBERT-VITALIS", "instructor": {"path": "/instructors/1014-ROBERT-VITALIS", "first_name": "ROBERT", "last_name": "VITALIS", "id": "1014-ROBERT-VITALIS", "name": "ROBERT VITALIS"}, "num_reviewers": 98, "id": "22317-001-1014-ROBERT-VITALIS"}]}, "credits": null, "primary_alias": "PSCI-110", "path": "/courses/22317", "sections": {"path": "/courses/22317/sections", "values": [{"name": "COMPARATIVE POLITICS", "sectionnum": "001", "primary_alias": "PSCI-110-001", "path": "/courses/22317/sections/001", "id": "22317-001", "aliases": ["PSCI-110-001"]}]}, "id": 22317, "aliases": ["PSCI-110"]}