[{"ratings": {"rAmountLearned": "3.16", "rDifficulty": "2.00", "rStimulateInterest": "3.19", "rRecommendMajor": "3.53", "rCourseQuality": "3.16", "rWorkRequired": "1.97", "rInstructorAccess": "3.59", "rReadingsValue": "2.78", "rRecommendNonMajor": "2.72", "rCommAbility": "3.34", "rInstructorQuality": "3.53"}, "section": {"name": "INTRO TO LANGUAGE CHANGE", "sectionnum": "001", "primary_alias": "LING-110-001", "path": "/courses/16010/sections/001", "id": "16010-001", "aliases": ["LING-110-001"]}, "comments": "This course covers the principles of language change and the methods of historical linguistics on an elementary level. The systematic regularity of change, the reasons for that regularity, and the exploitation of regularity in linguistic reconstruction are especially emphasized. Examples are drawn from a wide variety of languages, both familiar and unfamiliar. Since there are no prerequisites, the course includes brief introductions to basic linguistics studies such as phonetics, phonology, and morphology.\r\nStudents commented that the course demonstrated an “excellent balance of in depth coverage and breadth.” Although the class focused too much on applicable skill rather than general knowledge of language change, the students stated that they would “hate to see the depth lost in favor of touching on a wider range of topics.” The exercises given in the course were “like puzzles that really make the students think.”\r\nProfessor Ringe’s famous quote is “linguistics is my default activity.” Students commented that Professor Ringe conveyed his knowledge to students so easily that the class was described as “story time with Ringe.” Students stated that his passion for the subject made the class much more interesting.\r\nAlthough the course was “enjoyable and valuable to the major,” students commented that it required too much basic knowledge about linguistics for an introductory class meant to fulfill a general requirement. Students recommended that at least an introductory linguistics class like LING001 be taken before this course in order to “fully absorb the material.”", "num_students": 32, "path": "/courses/16010/sections/001/reviews/728-DONALD-A--RINGE", "instructor": {"path": "/instructors/728-DONALD-A--RINGE", "first_name": "DONALD A.", "last_name": "RINGE", "id": "728-DONALD-A--RINGE", "name": "DONALD A. RINGE"}, "num_reviewers": 32, "id": "16010-001-728-DONALD-A--RINGE"}]