[{"ratings": {"rAmountLearned": "3.36", "rDifficulty": "2.57", "rStimulateInterest": "3.75", "rRecommendMajor": "3.78", "rCourseQuality": "3.62", "rWorkRequired": "2.71", "rInstructorAccess": "3.82", "rReadingsValue": "2.79", "rRecommendNonMajor": "2.75", "rCommAbility": "3.50", "rInstructorQuality": "3.79"}, "section": {"name": "INTRO TO FLIGHT", "sectionnum": "001", "primary_alias": "MEAM-245-001", "path": "/courses/17668/sections/001", "id": "17668-001", "aliases": ["MEAM-245-001"]}, "comments": "The basic concepts of this course are pressure, density, velocity, forces, and the standard atmosphere. It provides an introduction to low speed aerodynamics, airfoils, wings, other aerodynamic shapes, aircraft performance, aircraft stability and control, aircraft propulsion. \r\n\r\nStudents immensely enjoyed the course. Learning about airplanes and flight was exciting. There were “varied applications” of the problems, which made the course very interesting. However, many students did feel that the concepts were taught too quickly and they weren’t allowed enough time to fully grasp all of the core concepts of the course. In addition, they felt that the lack of midterms and tests left the students uncertain about what to expect in the final and left them confused about whether they were really prepared for it. Students generally enjoyed the lab, although there were some complaints about the instructions being vague and topics not being covered in enough depth; but, they agreed that the labs did “[drive] home important topics”.\r\n\r\nStudents enjoyed having Professor Kothmann as their instructor. They found him “knowledgeable about the subject” and “[concerned about] the students' learning and understanding”. He was able to “instill in the students his obvious passion for the subject matter” and “cover the many ideas and topics pertaining to flight while not getting too detailed or complicated to understand”. Students highly appreciated his accessibility, his willingness to help students understanding the material, and his prompt replies to emails. \r\n\r\nThis course was highly recommended to majors. Non-majors claimed that even with little background knowledge of mechanical engineering, they were able to keep up because Professor Kothmann was so willing to help. The course is, however, not recommended for anyone who hasn’t taken Math 240. The mathematics in the course was found to be complex and it was “easy to get lost”. There were calls for recaps at the end of each lecture. There were complaints about the textbook which was “seemingly filled with \"historical\" information, [but] rather dry with technical details [of theories]”. However, even those who had complaints, ultimately agreed that this was a great course. It was very informative and they learned a lot, and enjoyed it too. \r\n", "num_students": 31, "path": "/courses/17668/sections/001/reviews/3294-BRUCE-D--KOTHMANN", "instructor": {"path": "/instructors/3294-BRUCE-D--KOTHMANN", "first_name": "BRUCE D.", "last_name": "KOTHMANN", "id": "3294-BRUCE-D--KOTHMANN", "name": "BRUCE D. KOTHMANN"}, "num_reviewers": 29, "id": "17668-001-3294-BRUCE-D--KOTHMANN"}]