[{"ratings": {"rAmountLearned": "2.76", "rDifficulty": "2.89", "rStimulateInterest": "3.11", "rRecommendMajor": "3.46", "rCourseQuality": "2.69", "rWorkRequired": "3.39", "rInstructorAccess": "3.04", "rReadingsValue": "2.25", "rRecommendNonMajor": "1.30", "rCommAbility": "2.87", "rInstructorQuality": "3.06"}, "section": {"name": "LECTURE", "sectionnum": "001", "primary_alias": "MEAM-247-001", "path": "/courses/22019/sections/001", "id": "22019-001", "aliases": ["MEAM-247-001"]}, "comments": "Students will complete this laboratory course over the fall and spring semesters. Students will learn the principles of experimentation and measurement systems as well as design. The fall semester involves doing experiments to explore the principles taught in statics and strength of materials. The spring semester includes hands-on design projects in thermodynamics and dynamics.&#8232;&#8232;Students were generally pleased with the work that they accomplished in this course. Several of them shared the opinion that the course was “well worth it” and that the assigned projects were interesting. &#8232;&#8232;Most students were pleased with Dr. Fiene. They described him as someone who “pushes his students to the limits,” but also as someone who was, “creative,” “enthusiastic,” and someone who was “engaging” to listen to during lecture. However, some people did feel that Dr. Fiene should have made himself more readily available to answer questions for the projects and that he should have given more guidance on MATLAB related material. &#8232;&#8232;This was regarded by many students as a difficult course, as it required a great time commitment outside of class. This course was not recommended for people outside of the MEAM major. To take this class, you must be sophomore in engineering. The corequisites are MEAM 210 in the fall, and MEAM 203 and 211 in the spring.", "num_students": 56, "path": "/courses/22019/sections/001/reviews/3916-JONATHAN-FIENE", "instructor": {"path": "/instructors/3916-JONATHAN-FIENE", "first_name": "JONATHAN", "last_name": "FIENE", "id": "3916-JONATHAN-FIENE", "name": "JONATHAN FIENE"}, "num_reviewers": 52, "id": "22019-001-3916-JONATHAN-FIENE"}]