{"coursehistories": {"path": "/coursehistories/748"}, "description": "This course examines the technical and managerial challenges presented by emerging and evolving technologies. Particular consideration is given to the forces affecting the nature and rate of technological innovation and the managerial options available to both established and entrepreneurial organizations. In doing so, we explore both internal and external sources of innovation as well as the appropriate strategies and processes for capitalizingon them. The course will be taught in seminar fashion with substantial class discussion. Assigned and supplementary readings will be augmented by cases and occasional guest lectures. Students will prepare a variety of written assignments, including case analyses and two research papers dealing with selected technologies, firms and industries. \n\n", "semester": "2009A", "name": "MANAGEMENT OF TECHNOLOGY", "reviews": {"path": "/courses/16076/reviews", "values": [{"ratings": {"rAmountLearned": "3.40", "rDifficulty": "2.62", "rStimulateInterest": "3.70", "rRecommendMajor": "3.85", "rCourseQuality": "3.65", "rWorkRequired": "3.40", "rInstructorAccess": "3.47", "rReadingsValue": "3.36", "rRecommendNonMajor": "2.66", "rCommAbility": "3.83", "rInstructorQuality": "3.77"}, "section": {"name": "MANAGEMENT OF TECHNOLOGY", "sectionnum": "001", "primary_alias": "MGMT-237-001", "path": "/courses/16076/sections/001", "id": "16076-001", "aliases": ["MGMT-237-001"]}, "comments": "This course examines the innovative process within technology-based organizations and the range of internal and external forces which impact technological innovation and growth. Emphasis is placed on managerial initiatives which can influence the nature and rate of technological development. Technological innovation and change, technology forecasting and assessment, R&D management, technical planning, and organizational models are among the topics considered.\r\n\r\nStudents in general found the course highly \\\"interesting\\\" and \\\"stimulating.\\\" Most students described their experience as a valuable one that \\\"brought together management and technology.\\\"\r\n\r\nStudents only had praise for Professor Hamilton, with one student describing his lectures as \\\"the most valuable part the course.\\\" Professor Hamilton facilitated conversations and often brought interesting guest speakers from industry and academia that added another dimension to the class. Professor Hamilton was knowledgeable and gave students a superb classroom experience.\r\n\r\nThe course is limited to Management and Technology students who have already taken MGMT100 and MGMT101. Students have to complete two written case analyses and two research projects. Many students thought that the grading system was fair and that Professor Hamilton gave the right incentives for students. Quite a few thought that assigned readings were of \\\"high quality,\\\" while others described them as \\\"redundant.\\\" The course was highly recommended for other M & T students.", "num_students": 54, "path": "/courses/16076/sections/001/reviews/801-WILLIAM-F--HAMILTON", "instructor": {"path": "/instructors/801-WILLIAM-F--HAMILTON", "first_name": "WILLIAM F.", "last_name": "HAMILTON", "id": "801-WILLIAM-F--HAMILTON", "name": "WILLIAM F. HAMILTON"}, "num_reviewers": 53, "id": "16076-001-801-WILLIAM-F--HAMILTON"}]}, "credits": null, "primary_alias": "MGMT-237", "path": "/courses/16076", "sections": {"path": "/courses/16076/sections", "values": [{"name": "MANAGEMENT OF TECHNOLOGY", "sectionnum": "001", "primary_alias": "MGMT-237-001", "path": "/courses/16076/sections/001", "id": "16076-001", "aliases": ["MGMT-237-001"]}]}, "id": 16076, "aliases": ["MGMT-237"]}