[{"ratings": {"rAmountLearned": "3.65", "rDifficulty": "2.24", "rStimulateInterest": "3.94", "rRecommendMajor": "3.82", "rCourseQuality": "3.67", "rWorkRequired": "2.53", "rInstructorAccess": "3.71", "rReadingsValue": "3.29", "rRecommendNonMajor": "3.41", "rCommAbility": "3.94", "rInstructorQuality": "3.83"}, "section": {"name": "INTRO BUDDHISM", "sectionnum": "401", "primary_alias": "RELS-173-401", "path": "/courses/26721/sections/401", "id": "26721-401", "aliases": ["RELS-173-401", "SAST-142-401", "EALC-015-401"]}, "comments": "This course seeks to introduce students to the diversity of doctrines held and practices performed by Buddhists in Asia. By focusing on how specific beliefs and practices are tied to particular locations and particular times, students will be able to explore in detail the religious institutions, artistic, architectural, and musical traditions, textual production and legal and doctrinal developments of Buddhism over time and within its socio-historical context. Religion is never divorced from its place and its time. Furthermore, by geographically and historically grounding the study of these religions students will be able to examine how their individual ethic, cosmological and soteriological systems effect local history, economics, politics, and material culture. Students concentrate first on the person of the Budda, his many biographies and how he has been followed and worshipped in a variety of ways from Lhasa, Tibet to Phrae, Thailand. From there the class touches on the foundational teachings of the Buddha with an eye to how they have evolved and transformed over time. Finally, the class focuses on the practice of Buddhist ritual, magic and ethics in monasteries and among aly communities in Asia and even in the West. This section will confront the way Buddhists have thought of issues such as \"Just-War,\" Women's Rights and Abortion. While no one quarter course could provide a detailed presentation of the beliefs and practices of Buddhism, students will be able to look closely at certain aspects of these religions by focusing on how they are practiced in places like Nara, Japan or Vientianne, Laos. \r\n\r\nStudents really enjoyed this class and found it very interesting. \r\n\r\nPeople loved Professor McDaniel; as one said: “Justin McDaniel is one of the best professors I have had the pleasure of knowing.” Students found him to be incredibly knowledgeable and funny. \r\n\r\nStudents really enjoyed this course, but one thought that the recitations should have been more discussion-oriented. \r\n\r\n*This review is based on the 6 student comments which were submitted.\r\n", "num_students": 18, "path": "/courses/26721/sections/401/reviews/4968-JUSTIN-THOMAS-MCDANIEL", "instructor": {"path": "/instructors/4968-JUSTIN-THOMAS-MCDANIEL", "first_name": "JUSTIN THOMAS", "last_name": "MCDANIEL", "id": "4968-JUSTIN-THOMAS-MCDANIEL", "name": "JUSTIN THOMAS MCDANIEL"}, "num_reviewers": 18, "id": "26721-401-4968-JUSTIN-THOMAS-MCDANIEL"}]