{"coursehistories": {"path": "/coursehistories/5111"}, "description": "Traditionally, economics focuses on the study of existing markets. Recently, regulators, entrepreneurs and economists have been involved in the design of markets. They have created institutionalized markets for new products, and have redesigned existing markets that were dysfunctional. This course utilizes ideas from game theory and microeconomics to provide the theoretical underpinnings for design and analysis of such markets. Further, via real world examples, we study the practical aspects of such market design and the institutional details which can determine the success or failure of a design. \n\n", "semester": "2011C", "name": "MARKET DESIGN", "reviews": {"path": "/courses/24280/reviews", "values": [{"ratings": {"rAmountLearned": "3.20", "rDifficulty": "2.78", "rStimulateInterest": "3.23", "rRecommendMajor": "3.68", "rCourseQuality": "3.09", "rWorkRequired": "2.65", "rInstructorAccess": "3.43", "rReadingsValue": "2.76", "rRecommendNonMajor": "2.30", "rCommAbility": "2.98", "rInstructorQuality": "3.20"}, "section": {"name": "MARKET DESIGN", "sectionnum": "001", "primary_alias": "ECON-262-001", "path": "/courses/24280/sections/001", "id": "24280-001", "aliases": ["ECON-262-001"]}, "comments": "Economics 262 course looks at the recent trend of regulators, entrepreneurs and economists being involved in the design of markets, the creation of institutionalized markets for new products, and the redesign of existing markets that were once dysfunctional, rather than the traditional study of existing markets.  This course utilizes ideas from game theory and microeconomics to provide the theoretical underpinnings for design and analysis of such markets.  Further, via real world examples, this course studies the practical aspects of such market design and the institutional details which can determine the success or failure of a design. \r\n\r\nOverall, this course was described as being challenging, yet rewarding. Students said the class started off “deceivingly easy” and got progressively more difficult. This was mainly due to the math heavy material later on in the semester. However, this did not detract from what students got out of the class. Many said that the real-life examples used in the class effectively linked theory and real-world application, thus enhancing their understanding of the material. Some wished examples were more concrete, especially for the harder concepts, but overall students found the class stimulating.\r\n\r\nThe majority of students had nothing but high regards for Professor Pai. They reported that the professor was easily accessible by email and was always open to answering questions. In addition, students liked the enthusiasm that Professor Pai had for the subject and for teaching. He was described as “awesome,” “funny,” and “energetic.” He engages all students and captivates their interest. Many students also complimented him on preparing them well for the exams and being so eager to help.  \r\n\r\nThis class comes recommended to majors and non-majors alike. It was described as “one of the best 200 level classes at Penn” due to the professor and the intellectually stimulating material. The prerequisites are ECON 101, ECON 103, and MATH 114.\r\n", "num_students": 48, "path": "/courses/24280/sections/001/reviews/5610-MALLESH-M--PAI", "instructor": {"path": "/instructors/5610-MALLESH-M--PAI", "first_name": "MALLESH M.", "last_name": "PAI", "id": "5610-MALLESH-M--PAI", "name": "MALLESH M. PAI"}, "num_reviewers": 47, "id": "24280-001-5610-MALLESH-M--PAI"}]}, "credits": null, "primary_alias": "ECON-262", "path": "/courses/24280", "sections": {"path": "/courses/24280/sections", "values": [{"name": "MARKET DESIGN", "sectionnum": "001", "primary_alias": "ECON-262-001", "path": "/courses/24280/sections/001", "id": "24280-001", "aliases": ["ECON-262-001"]}]}, "id": 24280, "aliases": ["ECON-262"]}