{"coursehistories": {"path": "/coursehistories/5444"}, "description": "In the past decade, massive shifts in how companies interact with their customers have suddenly made field experiments an economically feasible way to learn about a variety of business questions such as what types of promotions are most effective, what products should be stocked at a store, how e-mail promotions should be designed, how sales staff should be compensated, etc. Many marketers engaged in online retailing, direct-marketing, online advertising, media management, etc. are rapidly embracing a \"test and learn\" philosophy and a number of platforms such as Google Website Optimizer, have been developed to facilitate rigorous field experiments in the online environment. Just as with the quality revolution in manufacturing during the 1980s and 1990s, the rapid rise of the \"test and learn\" philosophy in marketing has created a huge demand for those who can design, field, and analyze marketing experiments. \n\nThrough this course, you will learn and practice a wide range of critical skills, from the statistical methods used to design and analyze experiments to the management and strategy required to execute an experiment and act on the results. Although the cases and examples will focus on marketing problems, the material covered can be applied in a number of other domains particularly operations management and product design. \n\n", "semester": "2012A", "name": "SPECIAL TOPICS: Experiments for Business Decision Making", "reviews": {"path": "/courses/27798/reviews", "values": [{"ratings": {"rAmountLearned": "3.43", "rDifficulty": "3.14", "rStimulateInterest": "3.10", "rRecommendMajor": "3.48", "rCourseQuality": "3.14", "rWorkRequired": "3.29", "rInstructorAccess": "3.40", "rReadingsValue": "2.43", "rRecommendNonMajor": "2.33", "rCommAbility": "3.15", "rInstructorQuality": "3.00"}, "section": {"name": "SPECIAL TOPICS: Experiments for Business Decision Making", "sectionnum": "401", "primary_alias": "MKTG-669-401", "path": "/courses/27798/sections/401", "id": "27798-401", "aliases": ["MKTG-669-401", "MKTG-269-401"]}, "comments": "Through MKTG 669, students will learn and practice a wide range of critical skills, from the statistical methods used to design and analyze experiments to the management and strategy required to execute an experiment and act on the results. Although the cases and examples will focus on marketing problems, the material covered can be applied in a number of other domains particularly operations management and product design. \r\nStudents described the course as “absolutely fantastic.” This class teaches “how to properly analyze data in a business setting.” Students appreciated the “well-chosen” guest speakers. A few students had some concerns about the scope of the class. A student explained this, mentioning that some topics were covered “a little too broadly.”\r\nProfessor Feit received very positive reviews. Students appreciated how Professor Feit “was creative and adapted class to sustain student interest.” Professor Feit “is able to explain concepts in class very well” and “is super on top of her materials.” One student mentioned that Professor Feit did an “excellent job administering the marketing experiments class.”\r\nStudents “highly recommended” this course to peers, non-major and major alike.\r\n", "num_students": 30, "path": "/courses/27798/sections/401/reviews/5435-ELEANOR-MCDONNELL-FEIT", "instructor": {"path": "/instructors/5435-ELEANOR-MCDONNELL-FEIT", "first_name": "ELEANOR MCDONNELL", "last_name": "FEIT", "id": "5435-ELEANOR-MCDONNELL-FEIT", "name": "ELEANOR MCDONNELL FEIT"}, "num_reviewers": 24, "id": "27798-401-5435-ELEANOR-MCDONNELL-FEIT"}]}, "credits": null, "primary_alias": "MKTG-669", "path": "/courses/27798", "sections": {"path": "/courses/27798/sections", "values": [{"name": "SPECIAL TOPICS: Experiments for Business Decision Making", "sectionnum": "401", "primary_alias": "MKTG-669-401", "path": "/courses/27798/sections/401", "id": "27798-401", "aliases": ["MKTG-669-401", "MKTG-269-401"]}]}, "id": 27798, "aliases": ["MKTG-669", "MKTG-269"]}