[{"ratings": {"rAmountLearned": "3.35", "rDifficulty": "2.40", "rStimulateInterest": "3.65", "rRecommendMajor": "3.60", "rCourseQuality": "3.39", "rWorkRequired": "2.45", "rInstructorAccess": "3.30", "rReadingsValue": "3.45", "rRecommendNonMajor": "3.30", "rCommAbility": "3.25", "rInstructorQuality": "3.48"}, "section": {"name": "AMERICA IN THE WORLD", "sectionnum": "001", "primary_alias": "PSCI-235-001", "path": "/courses/23673/sections/001", "id": "23673-001", "aliases": ["PSCI-235-001"]}, "comments": "This course is designed to develop your critical reading and writing skills in the areas of international relations and contemporary history. You are expected to take charge of your learning, engaging with each other and the instructor in a process of knowledge creation through practice, inquiry, deliberation, criticism, and problem solving. You will produce three pieces of analytical writing. These are complementary and cumulative assignments that, combined, will enhance your understanding of the nature, purpose, and future of U.S. hegemony or global dominance. This is the issue, arguably, at the core of debate today about US foreign policy or grand strategy. \r\n\r\nThe class reads the “five most recent books on American Foreign Policy,” a choice which one student calls a “stroke of genius.” One of the major assignments includes writing book reviews. Students were generally pleased with the course, describing it as “interesting” and one of the “best [courses] I have taken at Penn.” One student remarked that his “favorite part of class was the material” and it consisted of books that he “would read on [his] own.” Other students were enthused by the opportunity to discuss and debate “controversial issues.”\r\n\r\nMost students raved about Professor Vitalis’ “unconventional teaching style” which “challenges you” to “think in completely new ways.” He is described as a “dynamic” and “energetic” speaker, as well as being noted for contributing a sense of humor to the class. One student did complain that he brought a “liberal/progressive agenda” to his teaching; though others remarked that he was able to bring up controversial issues without “imposing or even hinting at his own views.”\r\n\r\nStudents claimed that there was “lots of reading” and that the “method of evaluation – series of critical book reviews” was valuable and enjoyable. The course has no official prerequisites, but it is recommended that a student has taken either PSCI 130 (American Foreign Policy) or PSCI 150 (Introduction to International Relations).\r\n", "num_students": 32, "path": "/courses/23673/sections/001/reviews/1014-ROBERT-VITALIS", "instructor": {"path": "/instructors/1014-ROBERT-VITALIS", "first_name": "ROBERT", "last_name": "VITALIS", "id": "1014-ROBERT-VITALIS", "name": "ROBERT VITALIS"}, "num_reviewers": 25, "id": "23673-001-1014-ROBERT-VITALIS"}]