[{"ratings": {"rAmountLearned": "3.67", "rDifficulty": "3.70", "rStimulateInterest": "2.94", "rRecommendMajor": "3.76", "rCourseQuality": "3.52", "rWorkRequired": "3.86", "rInstructorAccess": "3.26", "rReadingsValue": "3.06", "rRecommendNonMajor": "1.49", "rCommAbility": "3.44", "rInstructorQuality": "3.48"}, "section": {"name": "CORPORATE VALUATION", "sectionnum": "001", "primary_alias": "FNCE-207-001", "path": "/courses/13275/sections/001", "id": "13275-001", "aliases": ["FNCE-207-001"]}, "comments": "The focus of this course is on the valuation of companies. Topics discussed include discounted cash flow techniques and valuation using alternative valuation techniques such as price multiples. Emphasis is on developing the required information for valuation from financial statements and other information sources.\r\n\r\nWith regard to the content of this course, one student believed that there were “great, in-depth analyses of the topics” and that “the bulk pack was great.” Another student felt that FNCE-207 was “much more accounting-heavy than first anticipated. The cases seem a bit more obscure and difficult than the material in class/tests.” A third student felt that FNCE-207 “teaches all of the aspects of Valuation, while pointing out what we will most likely use in practical settings.” \r\n\r\nAs far as Professor Holthausen’s teaching ability, one student felt that he was “wonderful but speaks WAY too fast. Notes should be IN the slides.” Another student thanked Professor Holthausen for a “great” semester and emphasized that “a lot of effort clearly goes into preparing and teaching the material.” Several students described Professor Holthausen as “knowledgeable.”  \r\n\r\nOne student felt that “the grading for the cases was unfair” and that it was beyond “the extent of skills expected from undergraduates.” As for the workload, another student felt that FNCE-207 was a “very challenging course with a huge syllabus. Great value in final learnings but a very intensive course.” A third student felt that there was “an immense disconnect between the theory presented in the slides, the detailed accounting you are expected to decipher in the cases and exams, and the modeling methodology that you are essentially expected figure out on your own when doing cases.”", "num_students": 81, "path": "/courses/13275/sections/001/reviews/1431-ROBERT-W--HOLTHAUSEN", "instructor": {"path": "/instructors/1431-ROBERT-W--HOLTHAUSEN", "first_name": "ROBERT W.", "last_name": "HOLTHAUSEN", "id": "1431-ROBERT-W--HOLTHAUSEN", "name": "ROBERT W. HOLTHAUSEN"}, "num_reviewers": 67, "id": "13275-001-1431-ROBERT-W--HOLTHAUSEN"}]