[{"ratings": {"rAmountLearned": "2.31", "rDifficulty": "2.46", "rStimulateInterest": "2.09", "rRecommendMajor": "3.06", "rCourseQuality": "2.36", "rWorkRequired": "2.60", "rInstructorAccess": "2.86", "rReadingsValue": "2.20", "rRecommendNonMajor": "2.09", "rCommAbility": "2.63", "rInstructorQuality": "2.63"}, "section": {"name": "INDIA:CULTURE & SOCIETY", "sectionnum": "401", "primary_alias": "SAST-008-401", "path": "/courses/18042/sections/401", "id": "18042-401", "aliases": ["SAST-008-401", "RELS-068-401"]}, "comments": "This course is an introduces students to India by answering the question, “What makes India, India?” Examples of topics include religion, philosophy, architectural splendor, kingdoms, caste, and the position of women. Students study a range of social and cultural institutions through primary texts, novels, and historical sociological analysis.&#8232;\r\nThe class and material provide a broad overview of Indian history and culture, as outlined, and students found the organization “clear” and the readings “interesting.” However, most students agreed that readings were much too long and thus “difficult to keep up with.” Students also felt that the readings could have been of higher quality and more relevant; they did not necessarily further understanding of the material and many were not discussed in class at all. The class, many students felt, could have been smaller to better facilitate discussion.&#8232;\r\nProfessor Viswanath is “intelligent” and successfully made the material appealing to students who were previously not interested. Most students appreciated her instruction, even claiming she was one of the best professors at Penn; only one felt she had trouble communicating the subject matter. &#8232;\r\nStudents were content with their grades, reporting that “grading was a bit tough but not completely unfair.” They took the course for various reasons, but even those who unenthusiastically enrolled to fulfill a requirement became interested “thanks to this professor” and the “intriguing” material, and it became a favorite course.\r\n", "num_students": 43, "path": "/courses/18042/sections/401/reviews/4972-RUPASHREE-VISWANATH", "instructor": {"path": "/instructors/4972-RUPASHREE-VISWANATH", "first_name": "RUPASHREE", "last_name": "VISWANATH", "id": "4972-RUPASHREE-VISWANATH", "name": "RUPASHREE VISWANATH"}, "num_reviewers": 41, "id": "18042-401-4972-RUPASHREE-VISWANATH"}]