[{"ratings": {"rAmountLearned": "2.93", "rDifficulty": "2.19", "rStimulateInterest": "3.15", "rRecommendMajor": "3.48", "rCourseQuality": "3.10", "rWorkRequired": "2.93", "rInstructorAccess": "3.70", "rReadingsValue": "3.15", "rRecommendNonMajor": "3.15", "rCommAbility": "3.04", "rInstructorQuality": "3.38"}, "section": {"name": "THE POLITICS OF FOOD", "sectionnum": "401", "primary_alias": "PSCI-135-401", "path": "/courses/23663/sections/401", "id": "23663-401", "aliases": ["PSCI-135-401", "HSOC-135-401", "GAFL-135-401"]}, "comments": "This academically based community service seminar explores the politics and institutions that have shaped—and continue to shape—food production and consumption. Students use the readings, their community service, and ongoing \"food events\" at Penn to analyze the politics of food in many arenas: from farms, kitchens, supermarkets, schools, and communities of faith to corporations, research institutions, the media and international trade.\r\n\r\nOverall, students felt this class was “interesting” and “amazing.” Some felt that the three-hour seminar could be “boring,” and that time in class was not utilized effectively. Others thought that the community service aspect of the course unevenly burdened the students, as “the amount of time required on the part of the student varied dramatically” between projects.\r\n\r\nStudents had uniformly positive reviews of Professor Summers, calling her “extremely passionate,” “engaging,” and “one of the most effective instructors I’ve had at Penn.”\r\n\r\nSome students found the workload somewhat difficult to manage because they were expected to read “about one book a week,” and complete “lots of little papers and assignments.” Many, however, were quick to recommend this course to their peers, with one student calling it “the most rewarding class I’ve taken so far.”\r\n", "num_students": 32, "path": "/courses/23663/sections/401/reviews/990-MARY-E-SUMMERS", "instructor": {"path": "/instructors/990-MARY-E-SUMMERS", "first_name": "MARY E", "last_name": "SUMMERS", "id": "990-MARY-E-SUMMERS", "name": "MARY E SUMMERS"}, "num_reviewers": 29, "id": "23663-401-990-MARY-E-SUMMERS"}]