{"coursehistories": {"path": "/coursehistories/176"}, "description": "A basic course for majors in astronomy, in other physical sciences, and in engineering. Stars, galaxies, and the evolution of the universe. \n\n", "semester": "2009A", "name": "INTRO ASTROPHYSICS II", "reviews": {"path": "/courses/15370/reviews", "values": [{"ratings": {"rAmountLearned": "2.65", "rDifficulty": "2.16", "rStimulateInterest": "3.26", "rRecommendMajor": "3.39", "rCourseQuality": "2.84", "rWorkRequired": "1.71", "rInstructorAccess": "3.00", "rReadingsValue": "2.71", "rRecommendNonMajor": "2.55", "rCommAbility": "3.26", "rInstructorQuality": "3.19"}, "section": {"name": "INTRO ASTROPHYSICS II", "sectionnum": "001", "primary_alias": "ASTR-012-001", "path": "/courses/15370/sections/001", "id": "15370-001", "aliases": ["ASTR-012-001"]}, "comments": "This course continues the introductory sequence for majors in astronomy, the physical sciences and engineering. Topics include stars, galaxies and the universe. Math 114 and Physics 151 are prerequisites.\r\n\r\nAll reviews for the course were positive. One reviewer said the course was “mind blowing,” while another said it was “eye-opening.” The common criticism is that the mathematics involved was a little hard if you didn’t have the some advanced math or physics background. But the peopled who voiced that criticism said it was well worth it in the end, and felt the quality of the professor helped bridge the gap for those less familiar with the material.\r\n\r\nProfessor Jain got very good reviews. Most people found him interesting and enjoyed all the topics he covered especially the exotic topics like dark matter. The most common complaint was that he was not always on top of things. One reviewer said that professor Jain assigned overly complex problems. But everyone agreed that professor Jain was “approachable” and “friendly.”\r\n\r\nDespite finding the course challenging, the majority of students did not indicate that there was a lot of coursework. The freshmen definitely indicated they struggled more than their counterparts in the higher grades. This course fulfills the physical world sector. It is highly recommended to both majors and non-majors.", "num_students": 32, "path": "/courses/15370/sections/001/reviews/152-BHUVNESH-JAIN", "instructor": {"path": "/instructors/152-BHUVNESH-JAIN", "first_name": "BHUVNESH", "last_name": "JAIN", "id": "152-BHUVNESH-JAIN", "name": "BHUVNESH JAIN"}, "num_reviewers": 32, "id": "15370-001-152-BHUVNESH-JAIN"}]}, "credits": null, "primary_alias": "ASTR-012", "path": "/courses/15370", "sections": {"path": "/courses/15370/sections", "values": [{"name": "INTRO ASTROPHYSICS II", "sectionnum": "001", "primary_alias": "ASTR-012-001", "path": "/courses/15370/sections/001", "id": "15370-001", "aliases": ["ASTR-012-001"]}]}, "id": 15370, "aliases": ["ASTR-012"]}