{"coursehistories": {"path": "/coursehistories/3315"}, "description": "This course surveys the history of world film from cinema s precursors to 1945. We will develop methods for analyzing film while examining the growth of film as an art, an industry, and a political instrument. The course begins with the emergence of film technology and early film audiences. We will then look at the rise of narrative film and the birth of Hollywood before turning to a number of national film industries that flourished after World War I, including French, Italian, Soviet, German, Japanese, Chinese, and Indian film. Along the way, we will look at different genres and topics including African-American independent film during the silent era, animation, ethnographic and documentary film, censorship, and the coming of sound. We conclude with the transformation of several film industries into propaganda tools during World War II (including the Nazi, Soviet, and US film industries). There are no prerequisites. Requirements include a short essay, a research project, a midterm, and a final. Fulfills the Arts and Letters Sector (All Classes). \n\n", "semester": "2012A", "name": "WORLD FILM HIST TO 1945", "reviews": {"path": "/courses/27133/reviews", "values": [{"ratings": {"rAmountLearned": "3.14", "rDifficulty": "1.55", "rStimulateInterest": "3.40", "rRecommendMajor": "3.83", "rCourseQuality": "3.23", "rWorkRequired": "1.95", "rInstructorAccess": "3.57", "rReadingsValue": "3.05", "rRecommendNonMajor": "3.26", "rCommAbility": "3.62", "rInstructorQuality": "3.41"}, "section": {"name": "WORLD FILM HIST TO 1945", "sectionnum": "601", "primary_alias": "CINE-101-601", "path": "/courses/27133/sections/601", "id": "27133-601", "aliases": ["CINE-101-601", "ARTH-108-601", "ENGL-091-601"]}, "comments": "This course surveys the history of world film from cinema’s precursors to 1945. Students develop methods for analyzing film while examining the growth of film as an art, an industry, and a political instrument. The course begins with the emergence of film technology and early film audiences. It then looks at the rise of narrative film and the birth of Hollywood before turning to a number of national film industries that flourished after World War I, including French, Italian, Soviet, German, Japanese, Chinese, and Indian film. Along the way, the course looks at different genres and topics including African-American independent film during the silent era, animation, ethnographic and documentary film, censorship, and the coming of sound. Finally, the course concludes with the transformation of several film industries into propaganda tools during World War II (including the Nazi, Soviet, and US film industries). \r\n\r\nThe reviews of this course were generally very positive. Students expressed that they enjoyed the course. One reviewer said that students “learn a lot about film from the way the course was taught in very integrated in terms of learning about film history, film style/techniques, classic films, etc.” The only complaint by one student was that there were no film screenings for the course, leaving the students to watch the films outside of class on their own.  \r\n\r\nProfessor Fiumara received rave reviews from his students. Students described Professor Fiumara as a wonderful and talented instructor and scholar, who was knowledgeable, approachable, and willing to meet outside of class to discuss course material and assignments. Some students also mentioned that Professor Fiumara graded assigned work very fairly. \r\n\r\nRequired assignments include a short essay, a research project, a midterm, and a final.  There are no prerequisites for this course.  This course fulfills the Arts and Letters Sector. ", "num_students": 57, "path": "/courses/27133/sections/601/reviews/3913-JAMES-J--FIUMARA", "instructor": {"path": "/instructors/3913-JAMES-J--FIUMARA", "first_name": "JAMES J.", "last_name": "FIUMARA", "id": "3913-JAMES-J--FIUMARA", "name": "JAMES J. FIUMARA"}, "num_reviewers": 50, "id": "27133-601-3913-JAMES-J--FIUMARA"}]}, "credits": null, "primary_alias": "CINE-101", "path": "/courses/27133", "sections": {"path": "/courses/27133/sections", "values": [{"name": "WORLD FILM HIST TO 1945", "sectionnum": "601", "primary_alias": "CINE-101-601", "path": "/courses/27133/sections/601", "id": "27133-601", "aliases": ["CINE-101-601", "ARTH-108-601", "ENGL-091-601"]}]}, "id": 27133, "aliases": ["CINE-101", "ARTH-108", "ENGL-091"]}