[{"ratings": {"rAmountLearned": "3.27", "rDifficulty": "2.76", "rStimulateInterest": "3.02", "rRecommendMajor": "3.64", "rCourseQuality": "3.21", "rWorkRequired": "3.13", "rInstructorAccess": "3.29", "rReadingsValue": "2.98", "rRecommendNonMajor": "2.95", "rCommAbility": "3.55", "rInstructorQuality": "3.34"}, "section": {"name": "INTRO TO THE BIBLE", "sectionnum": "401", "primary_alias": "NELC-150-401", "path": "/courses/23503/sections/401", "id": "23503-401", "aliases": ["NELC-150-401", "JWST-150-401", "NELC-450-401"]}, "comments": "This course is an introduction the major themes and ideas of the Hebrew Bible (the Old Testament), with attention to the contributions of archaeology and modern Biblical scholarship, including Biblical criticism and the response to it in Judaism and Christianity. All readings are in English. &#8232;&#8232;\r\n\r\nThe majority of students raved about this class calling it an “excellent introduction to the Bible and Biblical criticism” and “one of the best courses at Penn.” Several students who had not studied the Bible in depth before called the class eye-opening and one student said he “learned an incredible amount of material in one semester.” Despite the amount of material, students mentioned it was suitable for an intro-level class. “This class changed the way I view religion,” said one comment. Students also appreciated that Professor Tigay shared his own research and “gave an excellent overview of possible areas of further study.”&#8232;&#8232;\r\n\r\nStudents’ only complaint about Professor Tigay was that he was “boring.” Several mentioned that he could be “monotone” saying he “read off of notes for 90 minutes.” However not everyone agreed. “The monotonous lectures could have been boring, but he’s actually amazingly interesting,” said one student. All students agreed, though, that Professor Tigay was extremely knowledgeable and one even mentioned that, “I’m confident few people in the world know as much [about the course material] as Dr. Tigay.” Professor Tigay was also described as approachable and helpful. &#8232;&#8232;Several students felt the class was overly difficult for a sector requirement. Quite a few students complained about the amount of readings assigned. One student said, “There are so many readings that it is nearly impossible to complete them all.” Another student warned that the quizzes were more like midterms. This course fulfills a Humanities and Social Science requirement and is recommended to non-majors.\r\n", "num_students": 67, "path": "/courses/23503/sections/401/reviews/67-JEFFREY-HOWARD-TIGAY", "instructor": {"path": "/instructors/67-JEFFREY-HOWARD-TIGAY", "first_name": "JEFFREY HOWARD", "last_name": "TIGAY", "id": "67-JEFFREY-HOWARD-TIGAY", "name": "JEFFREY HOWARD TIGAY"}, "num_reviewers": 59, "id": "23503-401-67-JEFFREY-HOWARD-TIGAY"}]