[{"ratings": {"rAmountLearned": "3.25", "rDifficulty": "2.45", "rStimulateInterest": "3.50", "rRecommendMajor": "3.55", "rCourseQuality": "3.24", "rWorkRequired": "2.65", "rInstructorAccess": "3.55", "rReadingsValue": "3.20", "rRecommendNonMajor": "3.30", "rCommAbility": "3.70", "rInstructorQuality": "3.52"}, "section": {"name": "ETHNICITY: THE IMMIGRANT CITY", "sectionnum": "401", "primary_alias": "URBS-270-401", "path": "/courses/26857/sections/401", "id": "26857-401", "aliases": ["URBS-270-401", "URBS-670-401", "CPLN-676-401", "AFRC-272-401", "SOCI-270-401"]}, "comments": "Immigration is a controversial issue, dividing Americans from Congress to big cities to small towns. What's at stake in these debates? What does immigration mean for cities and regions? And what roles should policy makers, planners, and community organizations play in shaping migration and its impacts? This course examines these questions in the context of immigrant, refugee, and receiving communities in the United States. It surveys public policy and community and economic development practices related to migration, at the local, regional, and trans-national scale. Class readings, discussions, and regular visits to a variety of Philadelphia's immigrant neighborhoods explore themes including labor markets, political mobilization, social and cultural policy, and the built environment.\r\nThe first half of the course surveys migration and community development among a broad range of ethnic groups in different parts of the city and suburbs while the second half focuses on specific policy and development initiatives. Assignments include an opportunity to work with immigrant-serving organizations.\r\nStudents raved about this class. They thoroughly enjoyed the fields trips and thought they really contributed to their understanding of the material in the course. One student said that he left the course with “a more nuanced understanding of the immigration debate.” \r\nStudents also heaped praise on Professor Vietello. They described Professor Vietello as an “amazing professor.\" Students liked that Professor Vietello encouraged them to think about immigration issues and perspectives they had not previously considered. \r\nThis class is recommended for majors. Some students found that the work was too time-consuming for a 200 level class and thought that there was too much reading. They thought the quality of the class made the work worthwhile.\r\n", "num_students": 21, "path": "/courses/26857/sections/401/reviews/2719-DOMENIC-VITIELLO", "instructor": {"path": "/instructors/2719-DOMENIC-VITIELLO", "first_name": "DOMENIC", "last_name": "VITIELLO", "id": "2719-DOMENIC-VITIELLO", "name": "DOMENIC VITIELLO"}, "num_reviewers": 21, "id": "26857-401-2719-DOMENIC-VITIELLO"}]