{"coursehistories": {"path": "/coursehistories/3601"}, "description": "This is a new course designed for students in any major, but the isntructor assumes that there will likely be both students with no background in Korean studies as well as some students with considerable linguistic and area studies preparation. Nonetheless, there are no prerequisites. The course will be interdisciplinary in nature and deals primarily with the Republic of Korea, or South Korea. Some attention will be paid to historical developments, but primarily we will examine a number of social issues in Korea today. However, since so much of postwar Korea development has been based upon the relationship between the Korean peninsula and the U.S., we will begin with a consideration of the US and Soviet Occupations of Korea that gave rise to two bitterly opposed regimes on the peninsula. Some attention will also be paid to the Korean War, since many of the political and economic issues of today are the direct result of that conflict. \n\nWe will examine the rocky development of the South Korean political system from authoritarianism to democracy; we will also study the economic development of the country from poverty to prosperity. Among the social issues we will examine are class and stratification, ethnic consciousness, work and gender roles, school and education, and developments in popular culture. Less information is available concerning the Democratic Peoples Republic of Korea in the north, but some attention will be devoted to it was well. \n\n", "semester": "2005A", "name": "CONTEMPORARY KOREAN SOC", "reviews": {"path": "/courses/9991/reviews", "values": [{"ratings": {"rAmountLearned": "3.57", "rDifficulty": "2.14", "rStimulateInterest": "3.86", "rRecommendMajor": "3.43", "rCourseQuality": "3.43", "rWorkRequired": "2.14", "rInstructorAccess": "3.29", "rReadingsValue": "3.86", "rRecommendNonMajor": "3.29", "rCommAbility": "3.71", "rInstructorQuality": "3.57"}, "section": {"name": "CONTEMPORARY KOREAN SOC", "sectionnum": "601", "primary_alias": "AMES-386-601", "path": "/courses/9991/sections/601", "id": "9991-601", "aliases": ["AMES-386-601", "AMES-686-601"]}, "comments": "", "num_students": 10, "path": "/courses/9991/sections/601/reviews/70-G--CAMERON-HURST", "instructor": {"path": "/instructors/70-G--CAMERON-HURST", "first_name": "G. CAMERON", "last_name": "HURST", "id": "70-G--CAMERON-HURST", "name": "G. CAMERON HURST"}, "num_reviewers": 8, "id": "9991-601-70-G--CAMERON-HURST"}]}, "credits": null, "primary_alias": "AMES-386", "path": "/courses/9991", "sections": {"path": "/courses/9991/sections", "values": [{"name": "CONTEMPORARY KOREAN SOC", "sectionnum": "601", "primary_alias": "AMES-386-601", "path": "/courses/9991/sections/601", "id": "9991-601", "aliases": ["AMES-386-601", "AMES-686-601"]}]}, "id": 9991, "aliases": ["AMES-386", "AMES-686"]}