[{"ratings": {"rAmountLearned": "2.95", "rDifficulty": "1.53", "rStimulateInterest": "3.38", "rRecommendMajor": "3.45", "rCourseQuality": "2.93", "rWorkRequired": "1.80", "rInstructorAccess": "3.38", "rReadingsValue": "3.03", "rRecommendNonMajor": "2.48", "rCommAbility": "3.28", "rInstructorQuality": "3.35"}, "section": {"name": "THEORETICAL FOUNDATIONS OF HEALTH CARE ETHICS", "sectionnum": "001", "primary_alias": "NURS-330-001", "path": "/courses/20572/sections/001", "id": "20572-001", "aliases": ["NURS-330-001"]}, "comments": "NURS 330: Theoretical Foundations of Health Care Ethics\r\n \r\n\r\nDr. Perlman \r\n\r\n      The development of ethics as it relates to healthcare, bioethics, and nursing ethics is explored in this course.  Morality, philosophy, and ethical theory are all discussed while particular attention is paid to their application to nursing.  The course is a lecture of about 60 students where discussion and debate are encouraged. \r\n\r\n      The theoretical components of healthcare ethics are applied to real-world situations that will be applicable in the students’ professional careers.  The students enjoyed the content of the course and appreciated the weekly quizzes or outlines to keep up with the reading and key concepts.\r\n\r\n      Students used adjectives such as “knowledgeable,” “accessible,” “delightful” and “impressive” to describe Dr. Perlman.  However, some students wished Dr. Perlman had been “more organized” with the posting of slides and grades.  Despite these complaints, most students had a generally positive impression of the “funny” professor.\r\n\r\n      Overall, students felt NURS 330 was a worthwhile class with realistic applications.  Students found the course enjoyable and reported little difficulty completing the three hour lecture.  Though the course enrolls primarily nursing students, all students are encouraged to take the course.  NURS 330 is recommended to anyone interested in ethics and morality as it applies to the field of healthcare. ", "num_students": 56, "path": "/courses/20572/sections/001/reviews/3117-DAVID-PERLMAN", "instructor": {"path": "/instructors/3117-DAVID-PERLMAN", "first_name": "DAVID", "last_name": "PERLMAN", "id": "3117-DAVID-PERLMAN", "name": "DAVID PERLMAN"}, "num_reviewers": 42, "id": "20572-001-3117-DAVID-PERLMAN"}]