[{"ratings": {"rAmountLearned": "3.18", "rDifficulty": "1.00", "rStimulateInterest": "3.55", "rRecommendMajor": "3.81", "rCourseQuality": "3.46", "rWorkRequired": "1.09", "rInstructorAccess": "3.77", "rReadingsValue": "3.45", "rRecommendNonMajor": "3.59", "rCommAbility": "3.55", "rInstructorQuality": "3.67"}, "section": {"name": "SELECTED TOPICS IN MED: INFECTIOUS DISEASES", "sectionnum": "301", "primary_alias": "BFMD-073-301", "path": "/courses/27028/sections/301", "id": "27028-301", "aliases": ["BFMD-073-301"]}, "comments": "This course is designed to examine the interactions between human beings, their organs and cells, and various infectious agents such as bacteria, viruses, fungi and parasites. The biological, societal and historical factors influencing these interactions will be analyzed and emerging infectious diseases will be particularly studied. Important infectious pathogenic agents will be surveyed in terms of their physiological functions, properties that permit them to be pathogens, pathogenesis of infections, clinical pictures of the disease states, therapeutic agents, and methods of prevention of infection. Each student will choose an infectious disease, and make an oral and written presentation on it and in this way will learn how to keep up with the topic of infectious diseases. Special permission is needed; the course is restricted to juniors and seniors only. The course is a Benjamin Franklin Seminar.\r\n\r\nAll students reviewed reported learning a lot from this course. According to one student, “this is easily one of the best courses I’ve taken at Penn,” calling it very enjoyable and informative. One student felt that they learned “a great perspective in infectious diseases, a topic not often taught in college classes.” All students also agreed that the class was interesting and allowed students to accumulate a lot of practical knowledge about infectious diseases.\r\n\r\nProfessor Davies, according to all students surveyed, is a skilled and wonderful teacher. As one student wrote, “Professor Davies is incredibly nice, and always so willing to help.” Another noted that Professor Davies really cares about students. Overall, students agreed that Professor Davies is a magnificent teacher.\r\n\r\nEvery student loved attending class and would recommend the course. “It was a joy to go to class and learn about such a fascinating array of diseases,” one student noted. Another said that it was the best course at Penn.  One reviewer noted that there is little or no emphasis on grades or memorization.", "num_students": 24, "path": "/courses/27028/sections/301/reviews/178-HELEN-CONRAD-DAVIES", "instructor": {"path": "/instructors/178-HELEN-CONRAD-DAVIES", "first_name": "HELEN CONRAD", "last_name": "DAVIES", "id": "178-HELEN-CONRAD-DAVIES", "name": "HELEN CONRAD DAVIES"}, "num_reviewers": 24, "id": "27028-301-178-HELEN-CONRAD-DAVIES"}]