{"coursehistories": {"path": "/coursehistories/3448"}, "description": "This course builds on the fundamentals of solid mechanics taught in MEAM 210 and addresses more advanced problems in strength of materials. The students will be exposed to a wide array of applications from traditional engineering disciplines as well as emerging areas such as biotechnology and nanotechnology. The methods of analysis developed in this course will form the cornerstone of machine design and also more advanced topics in the mechanics of materials. \n\n", "semester": "2010A", "name": "MECHANICS OF SOLIDS", "reviews": {"path": "/courses/26361/reviews", "values": [{"ratings": {"rAmountLearned": "2.42", "rDifficulty": "3.53", "rStimulateInterest": "2.05", "rRecommendMajor": "3.05", "rCourseQuality": "2.38", "rWorkRequired": "3.00", "rInstructorAccess": "2.63", "rReadingsValue": "2.16", "rRecommendNonMajor": "0.53", "rCommAbility": "2.93", "rInstructorQuality": "3.00"}, "section": {"name": "MECHANICS OF SOLIDS", "sectionnum": "001", "primary_alias": "MEAM-354-001", "path": "/courses/26361/sections/001", "id": "26361-001", "aliases": ["MEAM-354-001"]}, "comments": "This course builds on the fundamentals of solid mechanics taught in MEAM 210 and addresses more advanced problems in strength of materials. The students will be exposed to a wide array of applications from traditional engineering disciplines as well as emerging areas such as biotechnology and nanotechnology. The methods of analysis developed in this course will form the cornerstone of machine design and more advanced topics in the mechanics of materials.\r\n\r\nMany students found this course to cover content that was not always interesting or easy to understand. Several students were disappointed with how the difficult concepts often masked the general practicality of the subject matter. Students generally agreed that the course moved too quickly and covered too much content, which made complete understanding of the concepts challenging.\r\n\r\nWhile many students praised Professor Purohit as “the most passionate professor I have encountered during my time at Penn.” Many students also commented on his “extremely high expectations for students,” which some students appreciated as Professor Purohit would spend the time to work with students, although others translated into an “intimidating” and “abrasive” demeanor and an “apparent dislike for teaching this class.” Comments on his teaching style were mixed with one student commenting on how Professor Purohit “makes this course extremely interesting, even when the material sometimes appears not to be” while another commented on his “incredibly dry lecture style.”\r\n\r\nStudents found the class as a “tough course…but definitely a challenging and rewarding one as well.” Many students agreed that the exams were very difficult when compared to the rest of the course content. One student commented on the disconnect between the material covered in lecture, the homework assignments, and the exam: “I attended every lecture, completed every homework assignment and felt comfortable with the material we covered but somehow felt entirely lost on the exams.” Overall, students agreed that the course really “needs a recitation” in order to adequately explain the fundamental concepts. ", "num_students": 52, "path": "/courses/26361/sections/001/reviews/3364-PRASHANT-KISHORE-PUROHIT", "instructor": {"path": "/instructors/3364-PRASHANT-KISHORE-PUROHIT", "first_name": "PRASHANT KISHORE", "last_name": "PUROHIT", "id": "3364-PRASHANT-KISHORE-PUROHIT", "name": "PRASHANT KISHORE PUROHIT"}, "num_reviewers": 49, "id": "26361-001-3364-PRASHANT-KISHORE-PUROHIT"}]}, "credits": null, "primary_alias": "MEAM-354", "path": "/courses/26361", "sections": {"path": "/courses/26361/sections", "values": [{"name": "MECHANICS OF SOLIDS", "sectionnum": "001", "primary_alias": "MEAM-354-001", "path": "/courses/26361/sections/001", "id": "26361-001", "aliases": ["MEAM-354-001"]}]}, "id": 26361, "aliases": ["MEAM-354"]}