{"coursehistories": {"path": "/coursehistories/3665"}, "description": "Transnational Issues in Global Politics This course is designed to provide students with an introduction to transnational issues and world politics and to acquaint them with some of the leading issues, theories, concepts and processes that shape and define world events. It is expected that students taking the course will gain an ability to analyze, understand objectively evaluate and apprecate the complex dynamic that is \"global politics.\" In order to better understand other nations, their leaders and their motivations, the readings and lectures in the first segment of this course will examine the traditional and contemporary approaches to studying world politics. Next, we will focus on the instruments of conflict and cooperation and the forces of integration and fragmentation in the world today. Finally, we will assess some of the major international issues of our time (i.e. climate change, proliferation of weapons of mass destruction, genocide and human trafficing) and debate the prospects for bringing peace and prosperity to a world that is rife with conflict and poverty. The overriding challenge in this introductory course is to consider international relations from different perspectives and to be open and adaptive as you develop a deeper understanding of global issues and politics. \n\n", "semester": "2012C", "name": "TRANSNATL ISSUES GLOBAL", "reviews": {"path": "/courses/29126/reviews", "values": [{"ratings": {"rDifficulty": "2.59", "rTAQuality": "3.50", "rStimulateInterest": "3.04", "rCourseQuality": "2.50", "rWorkRequired": "1.91", "rInstructorQuality": "2.83", "rCommAbility": "2.91", "rInstructorAccess": "3.09"}, "section": {"name": "TRANSNATL ISSUES GLOBAL", "sectionnum": "001", "primary_alias": "INTR-101-001", "path": "/courses/29126/sections/001", "id": "29126-001", "aliases": ["INTR-101-001"]}, "comments": "", "num_students": 31, "path": "/courses/29126/sections/001/reviews/4383-JAMES-MCGANN", "instructor": {"path": "/instructors/4383-JAMES-MCGANN", "first_name": "JAMES", "last_name": "MCGANN", "id": "4383-JAMES-MCGANN", "name": "JAMES MCGANN"}, "num_reviewers": 24, "id": "29126-001-4383-JAMES-MCGANN"}]}, "credits": null, "primary_alias": "INTR-101", "path": "/courses/29126", "sections": {"path": "/courses/29126/sections", "values": [{"name": "TRANSNATL ISSUES GLOBAL", "sectionnum": "001", "primary_alias": "INTR-101-001", "path": "/courses/29126/sections/001", "id": "29126-001", "aliases": ["INTR-101-001"]}]}, "id": 29126, "aliases": ["INTR-101"]}