{"coursehistories": {"path": "/coursehistories/4488"}, "description": "Successful practitioners of corporate diplomacy meld art and skill in engaging external stakeholders to advance their corporate interests. They craft international coalitions of stakeholders spanning politicians, regulators, bureaucrats, analysts, investors, lawyers, reporters, consumers and activists. They influence these stakeholders' opinions, perceptions, behaviors and decisions so as to secure a favorable policy outcome, collective decision or shift in group opinion that enhances their corporation's ability to generate a profit by satisfying a market demand. This course surveys the managerial, political economic, sociological and psychological foundations of corporate diplomacy as well as case study examples of successful and failed implementation in order to develop an interdisciplinary framework for the play of global influence games. The insights gained can be applied to influence team decision-making and organizational politics as well as by individuals and organizations in lobbying, marketing, sales, political campaigns and corporate, national or multilaterial projections of soft power. \n\n", "semester": "2012A", "name": "POL & SOC ENVIRON OF MM", "reviews": {"path": "/courses/27762/reviews", "values": [{"ratings": {"rAmountLearned": "3.43", "rDifficulty": "2.63", "rStimulateInterest": "3.83", "rRecommendMajor": "3.75", "rCourseQuality": "3.72", "rWorkRequired": "2.96", "rInstructorAccess": "3.54", "rReadingsValue": "3.33", "rRecommendNonMajor": "3.83", "rCommAbility": "3.75", "rInstructorQuality": "3.81"}, "section": {"name": "POL & SOC ENVIRON OF MM", "sectionnum": "001", "primary_alias": "MGMT-715-001", "path": "/courses/27762/sections/001", "id": "27762-001", "aliases": ["MGMT-715-001"]}, "comments": "", "num_students": 43, "path": "/courses/27762/sections/001/reviews/795-WITOLD-HENISZ", "instructor": {"path": "/instructors/795-WITOLD-HENISZ", "first_name": "WITOLD", "last_name": "HENISZ", "id": "795-WITOLD-HENISZ", "name": "WITOLD HENISZ"}, "num_reviewers": 26, "id": "27762-001-795-WITOLD-HENISZ"}, {"ratings": {"rAmountLearned": "3.57", "rDifficulty": "2.95", "rStimulateInterest": "3.71", "rRecommendMajor": "3.90", "rCourseQuality": "3.68", "rWorkRequired": "3.29", "rInstructorAccess": "3.71", "rReadingsValue": "3.52", "rRecommendNonMajor": "3.67", "rCommAbility": "3.95", "rInstructorQuality": "3.77"}, "section": {"name": "POL & SOC ENVIRON OF MM", "sectionnum": "003", "primary_alias": "MGMT-715-003", "path": "/courses/27762/sections/003", "id": "27762-003", "aliases": ["MGMT-715-003"]}, "comments": "MGMT 715 is a course on the political environment of the multinational firm. This course surveys the managerial, political economic, sociological and psychological foundations of corporate diplomacy as well as 12 case study examples of successful and failed implementation in order to develop an interdisciplinary framework for the play of global influence games. The insights gained can be applied to influence team decision-making and organizational politics as well as by individuals and organizations in lobbying, marketing, sales, political campaigns and corporate, national or multilateral projections of soft power.\r\n\r\nOverall, students had very positive reviews of the class, with one student commenting that it was the “best class that I’ve taken at Wharton.” Students enjoyed the “realistic case scenarios” as well as acquiring a “framework” that they could apply to future cases. Although there is a lot of prep work for class (e.g. discussion posts), students felt that the prep work was useful as it prepared the class for a high-level discussion during class.\r\n\r\nProfessor Henisz had very positive reviews. Students commented that he was a great “case facilitator,” “pushed students to think critically,” provided great and “timely feedback to posts” and knew when to “step back in discussions.” They also lauded his “infectious enthusiasm” and appreciated the fact that he did not “embarrass or cold call.” \r\n\r\nThis class is recommended for majors and non-majors alike, and especially for people who want to “work internationally.”\r\n", "num_students": 39, "path": "/courses/27762/sections/003/reviews/795-WITOLD-HENISZ", "instructor": {"path": "/instructors/795-WITOLD-HENISZ", "first_name": "WITOLD", "last_name": "HENISZ", "id": "795-WITOLD-HENISZ", "name": "WITOLD HENISZ"}, "num_reviewers": 22, "id": "27762-003-795-WITOLD-HENISZ"}]}, "credits": null, "primary_alias": "MGMT-715", "path": "/courses/27762", "sections": {"path": "/courses/27762/sections", "values": [{"name": "POL & SOC ENVIRON OF MM", "sectionnum": "001", "primary_alias": "MGMT-715-001", "path": "/courses/27762/sections/001", "id": "27762-001", "aliases": ["MGMT-715-001"]}, {"name": "POL & SOC ENVIRON OF MM", "sectionnum": "003", "primary_alias": "MGMT-715-003", "path": "/courses/27762/sections/003", "id": "27762-003", "aliases": ["MGMT-715-003"]}]}, "id": 27762, "aliases": ["MGMT-715"]}