[{"ratings": {"rAmountLearned": "3.48", "rDifficulty": "2.43", "rStimulateInterest": "3.43", "rRecommendMajor": "3.81", "rCourseQuality": "3.48", "rWorkRequired": "2.67", "rInstructorAccess": "3.05", "rReadingsValue": "3.48", "rRecommendNonMajor": "2.62", "rCommAbility": "3.57", "rInstructorQuality": "3.57"}, "section": {"name": "CELLS TO TISSUES", "sectionnum": "401", "primary_alias": "BE-557-401", "path": "/courses/21329/sections/401", "id": "21329-401", "aliases": ["BE-557-401", "CBE-582-401"]}, "comments": "BE557 aims to introduce students to quantitative concepts in manipulating and understanding the behavior of biological cells. Focusing on receptors, the cell surface molecules that mediate cell responses, this course will describe the interwoven attributes between molecules in cells and cell function. Other covered topics include adhesion, motility, cytoskeleton, signal transduction, differentiation, and gene regulation.&#8232;&#8232;Students generally found the course to be “superb” and “fantastic.” Some students reported that it was “one of the best courses [they’ve] taken at Penn,” and not “just because of what [they] learned in terms of the field of cell mechanics... but [also] the science in general.” One student reported that this course made “coming to Penn for [his] Master’s in [Bioengineering] worthwhile”.&#8232;&#8232;Students generally enjoyed the structure of the course set out by Professor Chen, which was “to take a high profile professor in bioengineering and have him guide the class through the 50+ papers that have influenced his thinking.” Students stated that the professor made “students interested in the material” and that he was a “dynamic professor.” One criticism was that the course structure restricted personal contribution from Professor Chen, since each paper was presented by a different group of students. Students would have “liked it if Professor Chen had offered his viewpoint more often.”&#8232;&#8232;This is a graduate level course that may be taken by upper-class undergraduate Bioengineering majors under certain circumstances. Students generally felt that the course “didn’t require too much work” and that it was “reasonable.” Most students highly recommended this course to all BE majors.", "num_students": 22, "path": "/courses/21329/sections/401/reviews/2873-CHRISTOPHER-S--CHEN", "instructor": {"path": "/instructors/2873-CHRISTOPHER-S--CHEN", "first_name": "CHRISTOPHER S.", "last_name": "CHEN", "id": "2873-CHRISTOPHER-S--CHEN", "name": "CHRISTOPHER S. CHEN"}, "num_reviewers": 21, "id": "21329-401-2873-CHRISTOPHER-S--CHEN"}]