[{"ratings": {"rAmountLearned": "3.08", "rDifficulty": "3.07", "rStimulateInterest": "2.89", "rRecommendMajor": "3.71", "rCourseQuality": "2.94", "rWorkRequired": "3.24", "rInstructorAccess": "3.62", "rReadingsValue": "2.66", "rRecommendNonMajor": "2.12", "rCommAbility": "3.25", "rInstructorQuality": "3.28"}, "section": {"name": "CALCULUS II", "sectionnum": "001", "primary_alias": "MATH-114-001", "path": "/courses/21989/sections/001", "id": "21989-001", "aliases": ["MATH-114-001"]}, "comments": "Math114 looks at functions of several variables, vector-valued functions, partial derivatives and applications, double and triple integrals, conic sections, polar coordinates, vectors and analytic geometry, and first and second order ordinary differential equations. Additionally, it looks at applications to physical sciences and use of symbolic manipulation and graphics software in calculus.\r\n\r\nStudents overall greatly enjoyed this class. The material while “conceptually confusing” was applicable in the real world and was conveyed in a manner that made it very understandable. \r\n\r\nStudents raved about Professor Deturck. He was called one of the “best professors at Penn” as well as being described as “awesome” and “amazing.” He was very approachable, accessible, and helpful outside of class. His ability to convey complex material in a concise manner was highly praised. \r\n\r\nA prerequisite for this course is Math 104. This course fulfills the Formal Reasoning requirement. One student who took the course only due to the requirement, however, believes it was too hard to take only for that reason. Students remarked on the extensive amount of homework, yet noted that the tests were fair and often easier than the homework itself.\r\n", "num_students": 149, "path": "/courses/21989/sections/001/reviews/1555-DENNIS-M--DETURCK", "instructor": {"path": "/instructors/1555-DENNIS-M--DETURCK", "first_name": "DENNIS M.", "last_name": "DETURCK", "id": "1555-DENNIS-M--DETURCK", "name": "DENNIS M. DETURCK"}, "num_reviewers": 135, "id": "21989-001-1555-DENNIS-M--DETURCK"}, {"ratings": {"rAmountLearned": "3.52", "rDifficulty": "3.40", "rStimulateInterest": "3.55", "rRecommendMajor": "3.65", "rCourseQuality": "3.11", "rWorkRequired": "3.09", "rInstructorAccess": "3.31", "rReadingsValue": "2.62", "rRecommendNonMajor": "2.38", "rCommAbility": "3.31", "rInstructorQuality": "3.50"}, "section": {"name": "CALCULUS II", "sectionnum": "002", "primary_alias": "MATH-114-002", "path": "/courses/21989/sections/002", "id": "21989-002", "aliases": ["MATH-114-002"]}, "comments": "The second course in a four-part calculus sequence, Math 114 covers multivariable calculus, partial derivatives, first and second order differential equations, vectors, and analytic geometry, with a focus on applications to the physical sciences. Catering to students pursuing study in the natural sciences, engineering and economics, Math 114 prepares students for more advanced calculus, whereas Math 115 delves more into probability and matrices for students in the biological and health sciences. Math 114 fulfills the formal reasoning requirement for the College. This course works with the textbook “Calculus,” by Stewart.\r\n\r\nStudents felt that this MATH114 section, which was meant for engineers, covered more material than other sections. They also described the course as “interesting,” “applicable,” “engaging,” and “instructive.”\r\n\r\nStudents were very impressed with Professor Ghrist, whom they described as “hands down, one of the best professors at Penn” and “able to make math interesting even to non-math majors.” They found that Professor Ghrist not only “explains the concepts of the course in a unique and effective way, but is also entertaining during lecture.” Furthermore, Professor Ghrist “really takes the syllabus and expands it so that it is of more relevance to engineers,” and “was always available in office hours to go over material again.”\r\n\r\nThough students also felt that Professor Ghrist was “harder than most professors,” this only “resulted in more learning and doing better on the final, which is shared with the other MATH 114 classes.” Students recommended this course for “anyone interested in understanding math.”\r\n", "num_students": 75, "path": "/courses/21989/sections/002/reviews/4413-ROBERT-W--GHRIST", "instructor": {"path": "/instructors/4413-ROBERT-W--GHRIST", "first_name": "ROBERT W.", "last_name": "GHRIST", "id": "4413-ROBERT-W--GHRIST", "name": "ROBERT W. GHRIST"}, "num_reviewers": 68, "id": "21989-002-4413-ROBERT-W--GHRIST"}, {"ratings": {"rAmountLearned": "2.80", "rDifficulty": "3.02", "rStimulateInterest": "2.57", "rRecommendMajor": "3.47", "rCourseQuality": "2.68", "rWorkRequired": "2.94", "rInstructorAccess": "2.92", "rReadingsValue": "2.57", "rRecommendNonMajor": "2.19", "rCommAbility": "2.77", "rInstructorQuality": "2.81"}, "section": {"name": "LECTURE", "sectionnum": "003", "primary_alias": "MATH-114-003", "path": "/courses/21989/sections/003", "id": "21989-003", "aliases": ["MATH-114-003"]}, "comments": "The course focuses on functions of several variables, vector-valued functions, partial derivatives and applications; double and triple integrals, conic sections, polar coordinates, vectors and analytic geometry, first and second order ordinary differential equations. It has applications to the physical sciences. Furthermore, there is use of symbolic manipulation and graphics software in calculus.\r\n\r\nThis is a difficult course to do well in, a step up from Math 104. The material itself is complex. If you're a math person and excel at it, take this class. If not, many advised to stay away, for it may hurt your GPA.\r\n\r\nStudents found that Professor Rimmer was very fair and provided a lot of resources to prepare for exams and do well. His PowerPoint slides were helpful, but he provided few example problems. He was always accessible, friendly, and tries his best to help students understand the difficult content of Math 114. Professor Rimmer utilized technology in this course to record lectures and take attendance. This, on the whole, made the class easier as it became possible to review lectures if one missed class for any reason. Also, having the prewritten notes online was helpful. Professor Rimmer does everything online which makes it amazing for students. All his notes are posted online; the HW is online, as are other helpful resources. Students did, however, feel that meeting Professor Rimmer outside of class was very difficult.\r\n\r\nThis course has a Prerequisite of Math 104. This is a Formal Reasoning course. Students say that there was a lot of homework given in this course. They complained that the homework was not a very good indicator of material on the exams. The course material overall isn't all that hard for anyone willing to put in the work for the midterm and final. However, the curve in the class made it nearly impossible to stay up near the top without getting close to perfect on the midterms.\r\n", "num_students": 76, "path": "/courses/21989/sections/003/reviews/4008-NAKIA-ANTHONY-RIMMER", "instructor": {"path": "/instructors/4008-NAKIA-ANTHONY-RIMMER", "first_name": "NAKIA ANTHONY", "last_name": "RIMMER", "id": "4008-NAKIA-ANTHONY-RIMMER", "name": "NAKIA ANTHONY RIMMER"}, "num_reviewers": 64, "id": "21989-003-4008-NAKIA-ANTHONY-RIMMER"}, {"ratings": {"rAmountLearned": "2.96", "rDifficulty": "3.24", "rStimulateInterest": "2.98", "rRecommendMajor": "3.59", "rCourseQuality": "2.76", "rWorkRequired": "2.93", "rInstructorAccess": "3.30", "rReadingsValue": "2.67", "rRecommendNonMajor": "2.02", "rCommAbility": "3.31", "rInstructorQuality": "3.19"}, "section": {"name": "CALCULUS II", "sectionnum": "004", "primary_alias": "MATH-114-004", "path": "/courses/21989/sections/004", "id": "21989-004", "aliases": ["MATH-114-004"]}, "comments": "", "num_students": 77, "path": "/courses/21989/sections/004/reviews/3578-SHUVRA-GUPTA", "instructor": {"path": "/instructors/3578-SHUVRA-GUPTA", "first_name": "SHUVRA", "last_name": "GUPTA", "id": "3578-SHUVRA-GUPTA", "name": "SHUVRA GUPTA"}, "num_reviewers": 69, "id": "21989-004-3578-SHUVRA-GUPTA"}, {"ratings": {"rAmountLearned": "2.43", "rDifficulty": "3.14", "rStimulateInterest": "2.43", "rRecommendMajor": "3.86", "rCourseQuality": "2.33", "rWorkRequired": "2.43", "rInstructorAccess": "3.14", "rReadingsValue": "2.00", "rRecommendNonMajor": "2.43", "rCommAbility": "3.14", "rInstructorQuality": "2.67"}, "section": {"name": "CALCULUS II", "sectionnum": "601", "primary_alias": "MATH-114-601", "path": "/courses/21989/sections/601", "id": "21989-601", "aliases": ["MATH-114-601"]}, "comments": "", "num_students": 14, "path": "/courses/21989/sections/601/reviews/742-EDWARD-T-CROTTY", "instructor": {"path": "/instructors/742-EDWARD-T-CROTTY", "first_name": "EDWARD T", "last_name": "CROTTY", "id": "742-EDWARD-T-CROTTY", "name": "EDWARD T CROTTY"}, "num_reviewers": 12, "id": "21989-601-742-EDWARD-T-CROTTY"}]