[{"ratings": {"rAmountLearned": "2.59", "rDifficulty": "2.55", "rStimulateInterest": "2.64", "rRecommendMajor": "3.23", "rCourseQuality": "2.69", "rWorkRequired": "2.41", "rInstructorAccess": "2.35", "rReadingsValue": "2.13", "rRecommendNonMajor": "2.34", "rCommAbility": "2.88", "rInstructorQuality": "2.89"}, "section": {"name": "Oceanography:  Oceans & Climate", "sectionnum": "001", "primary_alias": "GEOL-130-001", "path": "/courses/15823/sections/001", "id": "15823-001", "aliases": ["GEOL-130-001"]}, "comments": "This course introduces basic oceanographic concepts such as plate tectonics, marine sediments, physical and chemical properties of seawater, ocean circulation, air-sea interactions, waves, tides, nutrient cycles in the ocean, biology of the oceans, and environmental issues related to the marine environment. This course fulfills the Natural Science & Mathematics Sector requirement.\r\n\r\nThe course content was described as being “too difficult for a sector course,” and the lectures as “too technical/specific for an introductory course”; however, many students found the course to be interesting, sparking their interests in Oceanography. &#8232;&#8232;\r\n\r\nStudents generally had a great deal of praise for Professor Horton, describing him as “interesting” and “enthusiastic.” However, some students felt that Professor Horton could not communicate the course content well, and that he moved “too fast” in lectures. &#8232;\r\n\r\nBecause of the aforementioned disconnect in professor-student communication, some students found they had to do a lot of research and studying on their own in order to keep up with the class. Most students taking this course did so in order to fulfill sector requirements and were non-majors. Nonetheless, many students found the course content to be somewhat interesting and engaging.", "num_students": 120, "path": "/courses/15823/sections/001/reviews/2987-BENJAMIN-P--HORTON", "instructor": {"path": "/instructors/2987-BENJAMIN-P--HORTON", "first_name": "BENJAMIN P.", "last_name": "HORTON", "id": "2987-BENJAMIN-P--HORTON", "name": "BENJAMIN P. HORTON"}, "num_reviewers": 116, "id": "15823-001-2987-BENJAMIN-P--HORTON"}]