{"coursehistories": {"path": "/coursehistories/5687"}, "description": "One of the challenging aspects of MBA curricula is that students are taught various techniques in each function as well as what determines success in that function but not how to manage trade-offs among those different goals and the different techniques for achieving them. This is especially true in the contextof the workforce. It is possible, for example, to organize tasks and work schedules in ways that should maximize efficiency if systems all operated correctly and individuals are rational. Yet we know that pursuing those objectives too far can lead in practice to high levels of stress and alienationamong workers that causes performance suffers. We can motivate employees power-fully with financial incentives, but we rarely know in advance how far to push those incentives before they are no longer cost-effective. \n\nThe purpose of this class is to understand those trade-offs and to give stu- dents a practical sense as to when they matter in terms of overall firm or organizational performance. The way we propose to do this is throug computer- based simulations. The simulations give participants options then show them theconsequences of their decisions for overall firm performance. In contrast to other pedagogy, the goal of these simulations is not to show us the best systems. It is to show how the choices among practices matter. A noval feature of this course is that we use simulations from real organizations that include those that most students would otherwise never see, such as managing the operating staff in a nuclear control room or running a MacDonald's store. Each simulation focuses on a different aspect of managing, focused on the human capital issues. Assesments for the course will be based on class participation,performance in each simulation, and write-ups describing lessons learned. \n\n", "semester": "2013A", "name": "SPECIAL TOPICS: Management in Practice: A Simulation-Based Approach", "reviews": {"path": "/courses/30637/reviews", "values": [{"ratings": {"rAmountLearned": "0.59", "rDifficulty": "1.35", "rTAQuality": "2.60", "rStimulateInterest": "1.22", "rRecommendMajor": "0.73", "rCourseQuality": "0.58", "rWorkRequired": "1.76", "rInstructorAccess": "1.95", "rReadingsValue": "1.11", "rRecommendNonMajor": "0.70", "rCommAbility": "1.65", "rInstructorQuality": "1.56"}, "section": {"name": "SPECIAL TOPICS: Management in Practice: A Simulation-Based Approach", "sectionnum": "001", "primary_alias": "MGMT-799-001", "path": "/courses/30637/sections/001", "id": "30637-001", "aliases": ["MGMT-799-001"]}, "comments": "", "num_students": 60, "path": "/courses/30637/sections/001/reviews/5398-PETER-CAPPELLI", "instructor": {"path": "/instructors/5398-PETER-CAPPELLI", "first_name": "PETER", "last_name": "CAPPELLI", "id": "5398-PETER-CAPPELLI", "name": "PETER CAPPELLI"}, "num_reviewers": 42, "id": "30637-001-5398-PETER-CAPPELLI"}]}, "credits": null, "primary_alias": "MGMT-799", "path": "/courses/30637", "sections": {"path": "/courses/30637/sections", "values": [{"name": "SPECIAL TOPICS: Management in Practice: A Simulation-Based Approach", "sectionnum": "001", "primary_alias": "MGMT-799-001", "path": "/courses/30637/sections/001", "id": "30637-001", "aliases": ["MGMT-799-001"]}]}, "id": 30637, "aliases": ["MGMT-799"]}