{"coursehistories": {"path": "/coursehistories/5364"}, "description": "This course explores the history and archaeology of the last 20,000 years from the development of agriculture to the industrial revolution. Why did people across the world abandon foraging for farming? How and why did cities and states develop? Why did societies succeed or fail? How have humans transformed themselves and the natural world, including the landscape and the climate? We will explore the methods that archaeologists use to consider these questions and analyze evidence for social and economic change from the Middle East, the Americas, Asia, Africa, Australia and Europe. In addition, students will have a chance to conduct hands-on exercises with artifacts from the Penn Museum and an opportunity to do some experimental archaeology during recitations. \n\n", "semester": "2012A", "name": "GREAT TRANSFORMATIONS", "reviews": {"path": "/courses/26941/reviews", "values": [{"ratings": {"rAmountLearned": "2.06", "rDifficulty": "1.89", "rStimulateInterest": "1.28", "rRecommendMajor": "2.56", "rCourseQuality": "1.88", "rWorkRequired": "2.18", "rInstructorAccess": "2.50", "rReadingsValue": "2.17", "rRecommendNonMajor": "1.67", "rCommAbility": "1.89", "rInstructorQuality": "2.00"}, "section": {"name": "GREAT TRANSFORMATIONS", "sectionnum": "001", "primary_alias": "ANTH-005-001", "path": "/courses/26941/sections/001", "id": "26941-001", "aliases": ["ANTH-005-001"]}, "comments": "This course explores the history and archaeology of the last 20,000 years from the development of agriculture to the industrial revolution. Why did people across the world abandon foraging for farming? How and why did cities and states develop? Why did societies succeed or fail? The class explores the methods that archaeologists use to consider these questions and analyze evidence for social and economic change from the Middle East, the Americas, Asia, Africa, Australia and Europe. In addition, students will have a chance to conduct hands-on exercises with artifacts from the Penn Museum and an opportunity to do some experimental archaeology during recitations.\r\n\r\nThis course was described as “sometimes difficult to follow.” One student mentioned that the “lectures were a little dry.” Future students should be aware that there are pop quizzes in the class. Another student stated that he or she felt that “a lot of background knowledge of the topics were taken for granted.”\r\n\r\nStudents stated that Professor Ristvet was “extremely experienced” but “had a tendency to simply read off the slides.” Another student mentioned that her “over-gesticulating” could be a bit distracting. She is also described as a “wonderful human being.”\r\n\r\nThis course may be difficult for non-major students because much background knowledge is not covered. Another student stated that one should be “really interested” in the subject material to enjoy the class. There are also pop quizzes on the readings. This course fulfills the History & Tradition sector. ", "num_students": 29, "path": "/courses/26941/sections/001/reviews/4239-LAUREN-M--RISTVET", "instructor": {"path": "/instructors/4239-LAUREN-M--RISTVET", "first_name": "LAUREN M.", "last_name": "RISTVET", "id": "4239-LAUREN-M--RISTVET", "name": "LAUREN M. RISTVET"}, "num_reviewers": 24, "id": "26941-001-4239-LAUREN-M--RISTVET"}]}, "credits": null, "primary_alias": "ANTH-005", "path": "/courses/26941", "sections": {"path": "/courses/26941/sections", "values": [{"name": "GREAT TRANSFORMATIONS", "sectionnum": "001", "primary_alias": "ANTH-005-001", "path": "/courses/26941/sections/001", "id": "26941-001", "aliases": ["ANTH-005-001"]}]}, "id": 26941, "aliases": ["ANTH-005"]}