{"coursehistories": {"path": "/coursehistories/3231"}, "description": "An introduction to the scientific study of humn memory, with a particular emphasis on the interplay between theory and experiment. Topics will include dual store models and the debate over short-term meory, recognition memory for items and associations, the role of time and context in memory formation and retrieval, theories of association, memory for sequences, the influence of prior knowledge on new learning, spatial and navigational memory, perceptual learning, classification and function learning, memory diorders, and developmental changes in memory function. \n\n", "semester": "2010A", "name": "HUMAN MEMORY", "reviews": {"path": "/courses/26690/reviews", "values": [{"ratings": {"rAmountLearned": "2.75", "rDifficulty": "2.85", "rStimulateInterest": "2.75", "rRecommendMajor": "3.06", "rCourseQuality": "2.68", "rWorkRequired": "2.31", "rInstructorAccess": "3.23", "rReadingsValue": "2.91", "rRecommendNonMajor": "1.89", "rCommAbility": "2.87", "rInstructorQuality": "3.05"}, "section": {"name": "HUMAN MEMORY", "sectionnum": "001", "primary_alias": "PSYC-159-001", "path": "/courses/26690/sections/001", "id": "26690-001", "aliases": ["PSYC-159-001"]}, "comments": "An introduction to the scientific study of human memory, with a particular emphasis on the interplay between theory and experiment. Topics include dual store models and the debate over short-term memory, recognition memory for items and associations, the role of time and context in memory formation and retrieval, theories of association, memory for sequences, the influence of prior knowledge on new learning, spatial and navigational memory, perceptual learning, classification and function learning, memory disorders, and developmental changes in memory function.\r\n\r\nStudents were divided in terms their opinion of the course. Some claimed that “the lectures were very enjoyable” and the class was “very difficult, yet very rewarding.” Others were not as pleased, describing the material as “dry” and very hard to understand. A key factor in the students’ reactions to the class seemed to be their comfort with the mathematical concepts involved, since it “engages almost exclusively with statistical models of human memory.”\r\nStudent opinions of Professor Kahana were similarly mixed. Some used words such as “hilarious,” “bright,” and “well-spoken” to describe the professor and others further portrayed him as “extremely knowledgeable and very enthusiastic about the course.” One student said he “was very open to speaking with students and had the goal of getting to know every student personally.” A few described his style as “boring” and were unappreciative of him “jumping from one tangent to another.”\r\nThough the material seemed to have a heavy mathematical focus, some students recommend the course to “anyone who is interested in psychology or just looking for an interesting elective.” Others felt the course would be irrelevant to most students unless they were “planning to study human memory or go into this field.”\r\n", "num_students": 64, "path": "/courses/26690/sections/001/reviews/3165-MICHAEL-J--KAHANA", "instructor": {"path": "/instructors/3165-MICHAEL-J--KAHANA", "first_name": "MICHAEL J.", "last_name": "KAHANA", "id": "3165-MICHAEL-J--KAHANA", "name": "MICHAEL J. KAHANA"}, "num_reviewers": 56, "id": "26690-001-3165-MICHAEL-J--KAHANA"}]}, "credits": null, "primary_alias": "PSYC-159", "path": "/courses/26690", "sections": {"path": "/courses/26690/sections", "values": [{"name": "HUMAN MEMORY", "sectionnum": "001", "primary_alias": "PSYC-159-001", "path": "/courses/26690/sections/001", "id": "26690-001", "aliases": ["PSYC-159-001"]}]}, "id": 26690, "aliases": ["PSYC-159"]}