[{"ratings": {"rAmountLearned": "2.72", "rDifficulty": "2.51", "rStimulateInterest": "3.41", "rRecommendMajor": "3.52", "rCourseQuality": "3.09", "rWorkRequired": "2.08", "rInstructorAccess": "3.08", "rReadingsValue": "2.62", "rRecommendNonMajor": "2.52", "rCommAbility": "3.48", "rInstructorQuality": "3.51"}, "section": {"name": "COGNITIVE DEVELOPMENT", "sectionnum": "001", "primary_alias": "PSYC-281-001", "path": "/courses/28078/sections/001", "id": "28078-001", "aliases": ["PSYC-281-001"]}, "comments": "What infants and young children come to know about the world, and how they learn it.  Topics will include changes in children's thinking, perceptual development, language acquisition, and current theories of cognitive development.\r\n\r\n\tStudents noted that this was a “perfectly designed course” and that they “learned a lot” from it. However, future students should be aware that the only grades in the class are based on multiple choice exams, and some students commented that it is unfair to students who are not necessarily as good in this testing format. They stated that “the curriculum was well organized and had a logical, flowing progression from unit to unit.”\r\n\r\nStudents noted that Professor Swingley is “a great lecturer” and “enthusiastic.” He also “communicat[ed] the subject matter in a way that is accessible and enjoyable.” Others noted that his “passion for the course material was contagious” and on top of that, he is “funny” and “down-to-earth.”\r\n\r\nThis course has been described by students as “not too difficult.” It may be harder for students who do not typically do well on multiple choice exams. The lectures were described as “fast-paced” but “not too fast for me to keep up and take notes.” The prerequisite for this course is PSYC 001. ", "num_students": 72, "path": "/courses/28078/sections/001/reviews/2667-DANIEL-SWINGLEY", "instructor": {"path": "/instructors/2667-DANIEL-SWINGLEY", "first_name": "DANIEL", "last_name": "SWINGLEY", "id": "2667-DANIEL-SWINGLEY", "name": "DANIEL SWINGLEY"}, "num_reviewers": 68, "id": "28078-001-2667-DANIEL-SWINGLEY"}]