{"coursehistories": {"path": "/coursehistories/209"}, "description": "General principles of biology that have been established by studies of microbes, animals, and plants and the viruses of these organisms will be covered. Emphasis will be on the basic chemistry of life, cell biology, molecular biology, and genetics. The study of developmental pathways and evolutionary trends in life cycles will be explored using plants as model organisms. \n\nBiology Majors and Pre-Medical students should take either BIOL 101 or 121. BIOL 101 is the companion course to BIOL 102, may be taken before or after BIOL 102. \n\nLab fee $150. \n\n", "semester": "2011C", "name": "INTRO BIOLOGY A", "reviews": {"path": "/courses/24058/reviews", "values": [{"ratings": {"rAmountLearned": "2.69", "rDifficulty": "3.32", "rStimulateInterest": "2.67", "rRecommendMajor": "3.52", "rCourseQuality": "2.24", "rWorkRequired": "2.96", "rInstructorAccess": "2.59", "rReadingsValue": "2.22", "rRecommendNonMajor": "1.46", "rCommAbility": "2.28", "rInstructorQuality": "2.48"}, "section": {"name": "INTRO BIOLOGY A", "sectionnum": "001", "primary_alias": "BIOL-101-001", "path": "/courses/24058/sections/001", "id": "24058-001", "aliases": ["BIOL-101-001"]}, "comments": "Topics covered include: viruses, bacteria, protozoa and plants, and the general\r\nprinciples of biology that have been established by studies of these organisms. Emphasis\r\nis on cell and molecular biology, genetics, development, diversity of adaptations and\r\nevolution.\r\nStudents described the material as “dull,” but “useful.” Many students noted that\r\nthe course relied heavily on memorization. Many students also noted that the range of\r\nmaterial covered was quite extensive.\r\nStudent described Professor Daldal as “engaging” and noted that he really made\r\nstudents “care about what we were learning.” Some students complained that due to his\r\naccent, however, his lectures were sometimes difficult to understand. However, many\r\nstudents credited him with being able to present difficult and extensive material in a\r\ncomprehensive way.\r\nThe class was considered very “difficult” and the workload extensive, but a\r\n“necessary evil if you’re pre-med.” One student said that the assigned reading can be\r\n“mountainous and overwhelming.”", "num_students": 306, "path": "/courses/24058/sections/001/reviews/1283-MEHMET-FEVZI-DALDAL", "instructor": {"path": "/instructors/1283-MEHMET-FEVZI-DALDAL", "first_name": "MEHMET FEVZI", "last_name": "DALDAL", "id": "1283-MEHMET-FEVZI-DALDAL", "name": "MEHMET FEVZI DALDAL"}, "num_reviewers": 283, "id": "24058-001-1283-MEHMET-FEVZI-DALDAL"}, {"ratings": {"rAmountLearned": "2.69", "rDifficulty": "3.32", "rStimulateInterest": "2.03", "rRecommendMajor": "3.52", "rCourseQuality": "2.24", "rWorkRequired": "2.96", "rInstructorAccess": "2.59", "rReadingsValue": "2.22", "rRecommendNonMajor": "1.46", "rCommAbility": "2.52", "rInstructorQuality": "2.43"}, "section": {"name": "INTRO BIOLOGY A", "sectionnum": "001", "primary_alias": "BIOL-101-001", "path": "/courses/24058/sections/001", "id": "24058-001", "aliases": ["BIOL-101-001"]}, "comments": "This class is an introduction to the general principles of biology through the study\r\nof microbes, animals, plants and viruses. It emphasizes the basic chemistry of life, cell\r\nbiology, molecular biology, and genetics. The study of developmental pathways and\r\nevolutionary trends in life cycles are explored using plants as model organisms.\r\nStudents felt like there was a lot of material covered in this course; some felt it\r\nwas too much for an introductory course. Many agreed that it was easy to fall behind on\r\nthe material, as there was so much reading. Overall, students felt that the course was\r\nlargely based on memorization.\r\nStudents agreed that Dr. Casper was enthusiastic and “very passionate”, but her\r\npowerpoints and lectures tended to be disorganized.\r\nThis course is useful for students interested in medicine or the sciences. It fulfills\r\nthe Living World Sector; BIOL 102 is a companion course. Many noted that the course\r\nwas competitive and the curve was steep; some students also felt that the tests weren’t\r\nalways clearly written. However, many noted that if you stay on top of coursework, you\r\nwill be able to achieve an above average grade.", "num_students": 306, "path": "/courses/24058/sections/001/reviews/1296-BRENDA-B-CASPER", "instructor": {"path": "/instructors/1296-BRENDA-B-CASPER", "first_name": "BRENDA B", "last_name": "CASPER", "id": "1296-BRENDA-B-CASPER", "name": "BRENDA B CASPER"}, "num_reviewers": 283, "id": "24058-001-1296-BRENDA-B-CASPER"}, {"ratings": {"rAmountLearned": "2.75", "rDifficulty": "3.22", "rStimulateInterest": "2.56", "rRecommendMajor": "2.79", "rCourseQuality": "2.30", "rWorkRequired": "3.25", "rInstructorAccess": "2.89", "rReadingsValue": "2.70", "rRecommendNonMajor": "1.68", "rCommAbility": "2.26", "rInstructorQuality": "2.55"}, "section": {"name": "INTRO BIOLOGY A", "sectionnum": "601", "primary_alias": "BIOL-101-601", "path": "/courses/24058/sections/601", "id": "24058-601", "aliases": ["BIOL-101-601"]}, "comments": "General principles of biology that have been established by studies of microbes,\r\nanimals, plants and the viruses of these organisms are covered. Emphasis is placed on the\r\nbasic chemistry of life, cell biology, molecular biology, and genetics. The study of\r\ndevelopmental pathways and evolutionary trends in life cycles is explored using plants as\r\nmodel organisms.\r\nStudents described this class as “rather boring… though extremely informative.”\r\nStudents also mentioned that they learned a lot from the course, stating that it discusses a\r\n“vast amount” of information. That being said, some students complained that the course\r\ndid not revolve around an actual comprehension of the material on a conceptual level,\r\nand instead “memorization [was] the key to success” in the class.\r\nStudents overwhelmingly commended Professor Sanders for his “solid sense of\r\nhumor.” He was described as “an excellent professor” who “cares about his students and\r\nwants them to understand the material.” However, some students complained about his\r\nlack of organization in lecture, and some reported that they “didn’t learn much in class\r\nthat [they] couldn’t learn from reading through the slides online.”\r\nThis course requires a lot of work, with several students saying it “greatly subjects\r\nitself to individual studying and effort to master it.” Additionally, tests were not\r\nnecessarily a “fair reflection of what… [was] learned in class and studied outside.” Some\r\nstudents complained that test questions were “poorly or vaguely worded.”", "num_students": 86, "path": "/courses/24058/sections/601/reviews/5712-CARSTEN-SANDERS", "instructor": {"path": "/instructors/5712-CARSTEN-SANDERS", "first_name": "CARSTEN", "last_name": "SANDERS", "id": "5712-CARSTEN-SANDERS", "name": "CARSTEN SANDERS"}, "num_reviewers": 78, "id": "24058-601-5712-CARSTEN-SANDERS"}]}, "credits": null, "primary_alias": "BIOL-101", "path": "/courses/24058", "sections": {"path": "/courses/24058/sections", "values": [{"name": "INTRO BIOLOGY A", "sectionnum": "001", "primary_alias": "BIOL-101-001", "path": "/courses/24058/sections/001", "id": "24058-001", "aliases": ["BIOL-101-001"]}, {"name": "INTRO BIOLOGY A", "sectionnum": "601", "primary_alias": "BIOL-101-601", "path": "/courses/24058/sections/601", "id": "24058-601", "aliases": ["BIOL-101-601"]}]}, "id": 24058, "aliases": ["BIOL-101"]}