{"coursehistories": {"path": "/coursehistories/3397"}, "description": "This course presents an overview of the business of health and how a variety of health care organizations have gained, sustained, and lost competitive advantage amidst intense competition, widespread regulation, high interdependence, and massive technological, economic, social and political changes. Specifically, we evaluate the challenges facing health care organizations using competitive analysis, identify their past responses, and explore the current strategies they are using to manage these challenges (and emerging ones) more effectively. Students will develop generalized skills in competitive analysis and the ability to apply those skills in the specialized analysis of opportunities in producer (e.g. biopharmaceutical, medical product, information technology), purchaser (e.g. insurance), and provider (e.g. hospitals, nursing homes, physician) organizations and industry sectors. The course is organized around a number of readings, cases, presentations, and a required project. \n\n", "semester": "2010C", "name": "HC MGMT&STRAT", "reviews": {"path": "/courses/23178/reviews", "values": [{"ratings": {"rAmountLearned": "2.50", "rDifficulty": "2.73", "rStimulateInterest": "2.56", "rRecommendMajor": "2.42", "rCourseQuality": "2.60", "rWorkRequired": "2.85", "rInstructorAccess": "3.20", "rReadingsValue": "2.42", "rRecommendNonMajor": "1.77", "rCommAbility": "2.81", "rInstructorQuality": "2.97"}, "section": {"name": "HC MGMT&STRAT", "sectionnum": "001", "primary_alias": "HCMG-213-001", "path": "/courses/23178/sections/001", "id": "23178-001", "aliases": ["HCMG-213-001"]}, "comments": "This course presents an overview of the business of health and how a variety of health care organizations have gained, sustained, and lost competitive advantage amidst intense competition, widespread regulation, high interdependence, and massive technological, economic, social and political changes. Specifically, we evaluate the challenges facing health care organizations using competitive analysis, identify their past responses, and explore the current strategies they are using to manage these challenges (and emerging ones) more effectively. Students will develop generalized skills in competitive analysis and the ability to apply those skills in the specialized analysis of opportunities in producer (e.g. biopharmaceutical, medical product, information technology), purchaser (e.g. insurance), and provider (e.g. hospitals, nursing homes, physician) organizations and industry sectors. The course is organized around a number of readings, cases, presentations, and a required project.\r\n\r\nRequired readings consist of articles that either must be purchased or are posted online, and the recommended textbook is Economics of Strategy by Besanko et al. (5th edition).\r\n\r\nOverall, students found this course to be challenging, interesting, and a “good integration of management, economics and a study of the health care industry.” However, some students complained that the focus of course material was not what they had been hoping for and was rather repetitive of other economics courses. Students agreed that the course focused more on “basic corporate strategy and basic economics” than on healthcare and healthcare management. Students agreed that “3/4s of the course did not even tie into health care at all”, and they learned more about economics and finance than the healthcare industry. \r\n\r\nStudents found Professor Teresawa to be “organized, prepared, and always available to help”. Students agreed that Professor Teresawa was very knowledgeable and expressed a love for the course material that stimulated student interest. However, students commented that Professor Teresawa “gave little value to students time”, expecting students to complete large and time-consuming assignments over a short amount of time. Other students felt that the lecture was fast and hard to follow, and wished that Professor Teresawa made lecture slides and notes available ahead of time so that students might be able to better follow and understand the material presented in lecture. \r\n\r\nStudents agreed that this course was “a lot of work compared to other HCMG courses.” The course material was difficult for students that did not have strong backgrounds in economics and management, and students felt that introductory economics and management courses should be prerequisites. Students commented that the exams mostly “tested memorization skills” with facts based from the slides. Some students felt that the exams did not correlate with lecture material and were not accurate gauges of student understanding. Other students commented that not enough time was given for the project and that the 10-minute oral presentation was “especially challenging”.\r\n", "num_students": 36, "path": "/courses/23178/sections/001/reviews/5620-EMI-L-TERASAWA", "instructor": {"path": "/instructors/5620-EMI-L-TERASAWA", "first_name": "EMI L", "last_name": "TERASAWA", "id": "5620-EMI-L-TERASAWA", "name": "EMI L TERASAWA"}, "num_reviewers": 31, "id": "23178-001-5620-EMI-L-TERASAWA"}]}, "credits": null, "primary_alias": "HCMG-213", "path": "/courses/23178", "sections": {"path": "/courses/23178/sections", "values": [{"name": "HC MGMT&STRAT", "sectionnum": "001", "primary_alias": "HCMG-213-001", "path": "/courses/23178/sections/001", "id": "23178-001", "aliases": ["HCMG-213-001"]}]}, "id": 23178, "aliases": ["HCMG-213"]}