[{"ratings": {"rAmountLearned": "2.55", "rDifficulty": "2.20", "rStimulateInterest": "3.20", "rRecommendMajor": "3.39", "rCourseQuality": "2.98", "rWorkRequired": "2.05", "rInstructorAccess": "3.28", "rReadingsValue": "2.19", "rRecommendNonMajor": "3.22", "rCommAbility": "3.24", "rInstructorQuality": "3.55"}, "section": {"name": "WORLD MUSICS & CULTURES", "sectionnum": "401", "primary_alias": "MUSC-050-401", "path": "/courses/16151/sections/401", "id": "16151-401", "aliases": ["MUSC-050-401", "AFRC-050-401", "FOLK-022-401", "AFST-050-401"]}, "comments": "This course examines how we as consumers in the \\\"Western\\\" world engage with musical difference largely through the products of the global entertainment industry. We examine music cultures in contact in a variety of ways-- particularly as traditions in transformation. Students gain an understanding of traditional music as live, meaningful person-to-person music making, by examining the music in its original site of production, and then considering its transformation once it is removed, and recontextualized in a variety of ways. The purpose of the course is to enable students to become informed and critical consumers of \\\"World Music\\\" by telling a series of stories about particular recordings made with, or using the music of, peoples culturally and geographically distant from the US. Students come to understand that not all music downloads containing music from unfamiliar places are the same, and that particular recordings may be embedded in intriguing and controversial narratives of production and consumption. At the very least, students should emerge from the class with a clear understanding that the production, distribution, and consumption of world music is rarely a neutral process.\r\n\r\nAlmost every student enjoyed the class. One student said the class not only fulfilled two requirements, but also helped him “understand music from a new perspective.” Students found the lectures to be amazing. It was noted that the exams were “much more difficult than the lectures and the reading assignments, particularly the listening portions.” One student mentioned that he felt that the professor “hands assignments and assessments over to a grader, who is not as understanding.” &#8232;\r\n\r\n&#8232;Professor Rommen was praised by his students for his teaching ability. They found him to be “enthusiastic and passionate about the material” as well as “nice and helpful.” One student felt that Professor Rommen is “perhaps the most accessible professor at Penn. He gives out his cell phone number to students to discuss course content outside of class hours and is always willing to help on something course-related.” Clearly it was the teacher that made the class so exceptional for the students. &#8232;\r\n\r\nThis course fulfills School of Arts and Sciences General Requirement Sector III: Arts and Letters for Class of 2009 and earlier. It fulfills Arts and Letters Sector III and Cross Cultural Analysis requirement for Class of 2010 and later. The class also fulfills Cultural Diversity in the U.S. requirements for Class of 2012 and later as well as School of Engineering and Applied Sciences Humanities Requirement and Wharton Undergraduate Global Environment Requirement.", "num_students": 94, "path": "/courses/16151/sections/401/reviews/1625-TIMOTHY-ROMMEN", "instructor": {"path": "/instructors/1625-TIMOTHY-ROMMEN", "first_name": "TIMOTHY", "last_name": "ROMMEN", "id": "1625-TIMOTHY-ROMMEN", "name": "TIMOTHY ROMMEN"}, "num_reviewers": 94, "id": "16151-401-1625-TIMOTHY-ROMMEN"}, {"ratings": {"rAmountLearned": "3.31", "rDifficulty": "1.41", "rStimulateInterest": "3.63", "rRecommendMajor": "3.50", "rCourseQuality": "3.65", "rWorkRequired": "1.57", "rInstructorAccess": "3.81", "rReadingsValue": "3.25", "rRecommendNonMajor": "3.88", "rCommAbility": "3.63", "rInstructorQuality": "3.74"}, "section": {"name": "WORLD MUSICS & CULTURES", "sectionnum": "402", "primary_alias": "MUSC-050-402", "path": "/courses/16151/sections/402", "id": "16151-402", "aliases": ["MUSC-050-402", "AFRC-050-402", "FOLK-022-402", "AFST-050-402"]}, "comments": "This course examines how we as consumers in the \"Western\" world engage with musical difference largely through the products of the global entertainment industry. The course examines music cultures in contact in a variety of ways-- particularly as traditions in transformation. Students gain an understanding of traditional music as live, meaningful person-to-person music making, by examining the music in its original site of production, and then considering its transformation once it is removed, and recontextualized in a variety of ways. The purpose of the course is to enable students to become informed and critical consumers of \"World Music\" by telling a series of stories about particular recordings made with, or using the music of, peoples culturally and geographically distant from the US. Students come to understand that not all music downloads containing music from unfamiliar places are the same, and that particular recordings may be embedded in intriguing and controversial narratives of production and consumption. At the very least, students should emerge from the class with a clear understanding that the production, distribution, and consumption of world music is rarely a neutral process.&#8232;&#8232;\r\n\r\nOne student described this course as having “been a very beneficial expansion of [his] knowledge of world music and how it relates to various cultures.” In class, Professor Holtzman played both recorded music and his own live music, in addition to plenty of “movies, pictures, and transcripts.” Students felt they learned an “incredible amount of information” about material one “will never forget.” One student appreciated Professor Holtzman’s idea of doing a group project at the end of the semester instead of a final paper. &#8232;&#8232;\r\n\r\nStudents really enjoyed Professor Holtzman’s company and found him to be “knowledgeable,” “engaging,” and “effective.” One student said Professor Holtzman “led great discussions and consistently held the class’ attention.” Another student reported Professor Holtzman “always makes everything so interesting.”&#8232;&#8232;\r\n\r\nThis course is cross-listed with FOLK 022, AFST 050, and AFRC 050. It fulfills the Arts & Letters Sector, the Cultural Diversity in the US, and Cross Cultural Analysis college requirements. Most students seemed to take this class to fulfill college requirements, and reported a light workload in a class that was “easy and fun with very little pressure of work and studying.”", "num_students": 35, "path": "/courses/16151/sections/402/reviews/4467-GLENN-G-HOLTZMAN", "instructor": {"path": "/instructors/4467-GLENN-G-HOLTZMAN", "first_name": "GLENN G", "last_name": "HOLTZMAN", "id": "4467-GLENN-G-HOLTZMAN", "name": "GLENN G HOLTZMAN"}, "num_reviewers": 35, "id": "16151-402-4467-GLENN-G-HOLTZMAN"}, {"ratings": {"rAmountLearned": "2.84", "rDifficulty": "1.53", "rStimulateInterest": "2.94", "rRecommendMajor": "3.59", "rCourseQuality": "3.03", "rWorkRequired": "2.06", "rInstructorAccess": "3.53", "rReadingsValue": "2.53", "rRecommendNonMajor": "3.34", "rCommAbility": "2.97", "rInstructorQuality": "3.34"}, "section": {"name": "WORLD MUSICS & CULTURES", "sectionnum": "403", "primary_alias": "MUSC-050-403", "path": "/courses/16151/sections/403", "id": "16151-403", "aliases": ["MUSC-050-403", "AFRC-050-403", "FOLK-022-403", "AFST-050-403"]}, "comments": "This course examines how we as consumers in the \"Western\" world engage with musical difference largely through the products of the global entertainment industry. We examine music cultures in contact in a variety of ways-- particularly as traditions in transformation. Students gain an understanding of traditional music as live, meaningful person-to-person music making, by examining the music in its original site of production, and then considering its transformation once it is removed, and recontextualized in a variety of ways. The purpose of the course is to enable students to become informed and critical consumers of \"World Music\" by telling a series of stories about particular recordings made with, or using the music of, peoples culturally and geographically distant from the US. Students come to understand that not all music downloads containing music from unfamiliar places are the same, and that particular recordings may be embedded in intriguing and controversial narratives of production and consumption. At the very least, students should emerge from the class with a clear understanding that the production, distribution, and consumption of world music is rarely a neutral process.&#8232;&#8232;\r\n\r\nOne student described this class as being a “good introduction” to world music and another described the course as being “mind-blowing.” The amount of reading for each class was reported to be “fair.”&#8232;&#8232;\r\n\r\nStudents generated positive feedback about Professor Dang’s teaching ability. They felt Professor Dang to be “extremely passionate” and “wonderfully enthusiastic” about the topic, both of which were evident through her “detailed lectures.” Professor Dang was also reported to be “very accommodating” and “extremely approachable and friendly.”&#8232;&#8232;\r\n\r\nThis course is cross-listed with FOLK 022, AFST 050, and AFRC 050. It fulfills the Arts & Letters Sector, the Cultural Diversity in the US, and Cross Cultural Analysis college requirements.", "num_students": 37, "path": "/courses/16151/sections/403/reviews/4468-CHRISTINE-N-DANG", "instructor": {"path": "/instructors/4468-CHRISTINE-N-DANG", "first_name": "CHRISTINE N", "last_name": "DANG", "id": "4468-CHRISTINE-N-DANG", "name": "CHRISTINE N DANG"}, "num_reviewers": 36, "id": "16151-403-4468-CHRISTINE-N-DANG"}, {"ratings": {"rAmountLearned": "2.52", "rDifficulty": "1.52", "rStimulateInterest": "2.76", "rRecommendMajor": "3.34", "rCourseQuality": "2.91", "rWorkRequired": "1.90", "rInstructorAccess": "3.59", "rReadingsValue": "2.55", "rRecommendNonMajor": "2.83", "rCommAbility": "2.90", "rInstructorQuality": "3.26"}, "section": {"name": "WORLD MUSICS & CULTURES", "sectionnum": "404", "primary_alias": "MUSC-050-404", "path": "/courses/16151/sections/404", "id": "16151-404", "aliases": ["MUSC-050-404", "AFRC-050-404", "FOLK-022-404", "AFST-050-404"]}, "comments": "", "num_students": 32, "path": "/courses/16151/sections/404/reviews/4469-NINA-C-OHMAN", "instructor": {"path": "/instructors/4469-NINA-C-OHMAN", "first_name": "NINA C", "last_name": "OHMAN", "id": "4469-NINA-C-OHMAN", "name": "NINA C OHMAN"}, "num_reviewers": 32, "id": "16151-404-4469-NINA-C-OHMAN"}]