[{"ratings": {"rAmountLearned": "3.45", "rDifficulty": "3.36", "rStimulateInterest": "3.27", "rRecommendMajor": "3.64", "rCourseQuality": "3.36", "rWorkRequired": "2.82", "rInstructorAccess": "3.82", "rReadingsValue": "3.09", "rRecommendNonMajor": "2.45", "rCommAbility": "3.64", "rInstructorQuality": "3.55"}, "section": {"name": "MOLEC MODEL & SIMULATION", "sectionnum": "001", "primary_alias": "CBE-525-001", "path": "/courses/24101/sections/001", "id": "24101-001", "aliases": ["CBE-525-001"]}, "comments": "In this course, students explore current topics in thermodynamics through\r\nmolecular simulations and molecular modeling. The requisite statistical mechanics are\r\nconveyed as well as the essential simulation techniques (molecular dynamics, Monte\r\nCarlo, etc.). Various approaches for calculating experimentally measurable properties are\r\npresented and used in student projects.\r\nStudents found this course to be “useful” and “learned a lot” throughout the\r\nsemester. Some even expressed that they especially enjoyed hearing about the more\r\nadvanced topics in the course.\r\nStudents felt that Professor Riggleman did a great job of preparing assignments\r\nthat helped them utilize concepts learned in class, emphasizing their thinking and\r\nproblem-solving skills.\r\nOverall, students felt that the class was graded generously and that exams were a\r\nfair assessment of knowledge. This course was recommended for both majors and nonmajors\r\nwho are interested in the topic. However, it was also recommended that students\r\nshould have some programming background before taking this class. The official\r\nprerequisites for this course are CBE 231 or 618, or any other equivalent background in\r\nphysical chemistry.", "num_students": 12, "path": "/courses/24101/sections/001/reviews/5717-ROBERT-A--RIGGLEMAN", "instructor": {"path": "/instructors/5717-ROBERT-A--RIGGLEMAN", "first_name": "ROBERT A.", "last_name": "RIGGLEMAN", "id": "5717-ROBERT-A--RIGGLEMAN", "name": "ROBERT A. RIGGLEMAN"}, "num_reviewers": 11, "id": "24101-001-5717-ROBERT-A--RIGGLEMAN"}]