{"coursehistories": {"path": "/coursehistories/4959"}, "description": "The course will be a survey of the private equity asset class. Its objective is to provide an understanding of the concepts, agents, and institutions involved in the late stage corporate private equity market in the U.S. and around the globe. It will examine the buyout market and the activities of buyout funds from the differing perspectives of private equity investors, private equity fund sponsors, and managers of the portfolio companies. The course will be taught almost entirely with cases. Distinguished Wharton alumni in the private equity industry will be our guest speakers for many of the cases based on transactions they concluded. While this course is primarily intended for graduate students, admission may be granted to a limited number of interested undergraduate students. PLEASE NOTE: this course may be recorded for live or subsequent distribution, display, broadcast, or commercialization in any media, including video, audio, or electronic media. For additional information, see the course syllabus or contact the department. \n\nThis is a short seminar on finance in Europe. Its objective is to bring students, academics and several industry experts together to study financial markets, practice, and institutions in Europe. Course Content: The course will primarily examine following areas: 1.Current challenges in European markets and Euro zone 2.Political economy of European Union 3.Alternative Investments 4.Investment Banking & Cross Border Mergers and Acquisitions We will cover the above topics by studying practice and transactions in Europe with a comparison to USA and rest of the world. This is a half unit course and it is designed for Wharton MBAs. Exceptionally motivated undergraduate students are also welcome to take the course. \n\n", "semester": "2013A", "name": "Advanced Seminar on Private Equity", "reviews": {"path": "/courses/30343/reviews", "values": [{"ratings": {"rAmountLearned": "3.05", "rDifficulty": "1.18", "rTAQuality": "2.78", "rStimulateInterest": "3.42", "rRecommendMajor": "3.48", "rCourseQuality": "3.31", "rWorkRequired": "1.26", "rInstructorAccess": "2.57", "rReadingsValue": "2.97", "rRecommendNonMajor": "2.60", "rCommAbility": "3.44", "rInstructorQuality": "3.29"}, "section": {"name": "Advanced Seminar on Private Equity", "sectionnum": "401", "primary_alias": "FNCE-895-401", "path": "/courses/30343/sections/401", "id": "30343-401", "aliases": ["FNCE-895-401", "FNCE-395-401"]}, "comments": "", "num_students": 63, "path": "/courses/30343/sections/401/reviews/4652-BULENT-GULTEKIN", "instructor": {"path": "/instructors/4652-BULENT-GULTEKIN", "first_name": "BULENT", "last_name": "GULTEKIN", "id": "4652-BULENT-GULTEKIN", "name": "BULENT GULTEKIN"}, "num_reviewers": 58, "id": "30343-401-4652-BULENT-GULTEKIN"}]}, "credits": null, "primary_alias": "FNCE-895", "path": "/courses/30343", "sections": {"path": "/courses/30343/sections", "values": [{"name": "Advanced Seminar on Private Equity", "sectionnum": "401", "primary_alias": "FNCE-895-401", "path": "/courses/30343/sections/401", "id": "30343-401", "aliases": ["FNCE-895-401", "FNCE-395-401"]}]}, "id": 30343, "aliases": ["FNCE-895", "FNCE-395"]}