{"coursehistories": {"path": "/coursehistories/5276"}, "description": "The goal of this course is to understand and to investigate both historical and contemporary issues related to a culture of consumption. Reading topics cover both contemporary and scholarly issues in cultural anthropology, popular culture, consumer behavior, off-shore production, social networking, media and communications, financial and real estate markets and marketing. Class distinctions are equally interdisciplinary as we focus on investigating and identifying critical global/local linkages. We analyze the various ways in which Philadelphia and other \"global cities\" are competing for consumer revenues. We ask what factors have led contemporary society reaching its current stage of mass consumption and how have certain goods and services been reconfigured, packaged or re-packaged to attract new consumers. In order to better understand the link between consumption and production factors we explore the relationship between outsourcing and/or offshore production and modern consumption. Approximately sixty percent of the seminar takes place in the classroom and will include lecture, class discussion, and films. The remaining half of the class meetings will involve local and regional travel. \n\nResearch assignments emphasize the use of anthropological participant-observation techniques to investigate the relationships between culture and contemporary mass consumption within the contexts of re-gentrification, urbanization and globalization. \n\n", "semester": "2013A", "name": "CULTURE, PRODUCTION, AND CONSUMPTION IN THE GLOBAL MARKETPLACE", "reviews": {"path": "/courses/29850/reviews", "values": [{"ratings": {"rDifficulty": "1.67", "rTAQuality": "4.00", "rStimulateInterest": "2.56", "rCourseQuality": "2.44", "rWorkRequired": "2.06", "rInstructorQuality": "2.61", "rCommAbility": "2.44", "rInstructorAccess": "2.41"}, "section": {"name": "CULTURE, PRODUCTION, AND CONSUMPTION IN THE GLOBAL MARKETPLACE", "sectionnum": "601", "primary_alias": "ANTH-386-601", "path": "/courses/29850/sections/601", "id": "29850-601", "aliases": ["ANTH-386-601"]}, "comments": "", "num_students": 24, "path": "/courses/29850/sections/601/reviews/2850-MARILYNNE-DIGGS-THOMPSON", "instructor": {"path": "/instructors/2850-MARILYNNE-DIGGS-THOMPSON", "first_name": "MARILYNNE", "last_name": "DIGGS-THOMPSON", "id": "2850-MARILYNNE-DIGGS-THOMPSON", "name": "MARILYNNE DIGGS-THOMPSON"}, "num_reviewers": 20, "id": "29850-601-2850-MARILYNNE-DIGGS-THOMPSON"}]}, "credits": null, "primary_alias": "ANTH-386", "path": "/courses/29850", "sections": {"path": "/courses/29850/sections", "values": [{"name": "CULTURE, PRODUCTION, AND CONSUMPTION IN THE GLOBAL MARKETPLACE", "sectionnum": "601", "primary_alias": "ANTH-386-601", "path": "/courses/29850/sections/601", "id": "29850-601", "aliases": ["ANTH-386-601"]}]}, "id": 29850, "aliases": ["ANTH-386"]}