{"coursehistories": {"path": "/coursehistories/1916"}, "description": "This course will survey the history of relations among the great powers in East Asia from 1600 to the present. Special emphasis will be played upon the peculiarities of cross-national exchange in Asia (as compared to Europe), particularly the difficulties of relations among states possessing fundamentally different cultural traditions. We will explore the many informal, as well as formal, means of diplomacy in Asia over the past 400 years. \n\n", "semester": "2010C", "name": "EAST ASIAN DIPLOMACY", "reviews": {"path": "/courses/23236/reviews", "values": [{"ratings": {"rAmountLearned": "2.84", "rDifficulty": "2.33", "rStimulateInterest": "3.02", "rRecommendMajor": "3.36", "rCourseQuality": "2.96", "rWorkRequired": "2.48", "rInstructorAccess": "2.91", "rReadingsValue": "2.98", "rRecommendNonMajor": "2.68", "rCommAbility": "3.18", "rInstructorQuality": "3.18"}, "section": {"name": "EAST ASIAN DIPLOMACY", "sectionnum": "401", "primary_alias": "HIST-395-401", "path": "/courses/23236/sections/401", "id": "23236-401", "aliases": ["HIST-395-401", "EALC-105-401"]}, "comments": "This course surveys the history of relations among the great powers in East Asia from 1600 to the present. Special emphasis is played upon the peculiarities of cross-national exchange in Asia (as compared to Europe), particularly the difficulties of relations among states possessing fundamentally different cultural traditions. The course explores the many informal, as well as formal, means of diplomacy in Asia over the past 400 years. &#8232;&#8232;\r\n\r\nOverall students enjoyed this course. Students did feel that the breadth of the material made exams challenging, but nonetheless, the students found the material to be “interesting.” Several students did warn that the course is a “basic survey,” and therefore it “glosses over” a lot of information. &#8232;&#8232;\r\n\r\nStudents praised Professor Dickinson for his “enthusiasm.” One student wrote, “he always brings a fresh perspective on history.” Students praised Professor Dickinson for incorporating multimedia, such as video clips, into his presentations. However, some students did note that Professor Dickinson has a tendency to spend extra time on video clips and other “housekeeping matters at the beginning of class and not get through all the material the lecture was meant to cover.” Although most students found Professor Dickinson to be engaging, some mentioned that he had a tendency to read off of his slides. Students also noted that Professor Dickinson is very, “accessible and offers interesting insights on the subject matter.”&#8232;&#8232;\r\n\r\nStudents found this course to be “challenging” and “interesting.” Students overall believed that the assignments were fair. Several students did recommend the course to other students interested in the area because it provides a great “basic overview” on the topic. There are no prerequisites for this course and it is open to Freshmen and Upperclassmen.\r\n", "num_students": 64, "path": "/courses/23236/sections/401/reviews/619-FREDERICK-R--DICKINSON", "instructor": {"path": "/instructors/619-FREDERICK-R--DICKINSON", "first_name": "FREDERICK R.", "last_name": "DICKINSON", "id": "619-FREDERICK-R--DICKINSON", "name": "FREDERICK R. DICKINSON"}, "num_reviewers": 57, "id": "23236-401-619-FREDERICK-R--DICKINSON"}]}, "credits": null, "primary_alias": "HIST-395", "path": "/courses/23236", "sections": {"path": "/courses/23236/sections", "values": [{"name": "EAST ASIAN DIPLOMACY", "sectionnum": "401", "primary_alias": "HIST-395-401", "path": "/courses/23236/sections/401", "id": "23236-401", "aliases": ["HIST-395-401", "EALC-105-401"]}]}, "id": 23236, "aliases": ["HIST-395", "EALC-105"]}