{"coursehistories": {"path": "/coursehistories/1984"}, "description": "This course is intended for students in mechanical engineering, civil-systems, materials science, and other fields. It continues the treatment of the statics of rigid bodies begun in Physics 150 and MEAM 110 and leads to the treatment of deformable bodies and their response to loads. The concepts of stress, strain, and linearly elastic response are introduced and they are applied to the behavior of rods, beams, shafts and pressure valves. Safety factors and the onset of mechanical failure are discussed. The course incorporates the use of computers to solve problems, and includes a written library research assignment and a team design project. \n\n", "semester": "2008C", "name": "STATICS & STRENTH OF MAT", "reviews": {"path": "/courses/18955/reviews", "values": [{"ratings": {"rAmountLearned": "2.89", "rDifficulty": "2.62", "rStimulateInterest": "2.39", "rRecommendMajor": "3.45", "rCourseQuality": "2.45", "rWorkRequired": "3.04", "rInstructorAccess": "2.59", "rReadingsValue": "2.33", "rRecommendNonMajor": "1.13", "rCommAbility": "2.96", "rInstructorQuality": "2.80"}, "section": {"name": "STATICS & STRENTH OF MAT", "sectionnum": "001", "primary_alias": "MEAM-210-001", "path": "/courses/18955/sections/001", "id": "18955-001", "aliases": ["MEAM-210-001"]}, "comments": "MEAM210 is a continuation of the study of static rigid bodies begun in the prerequisite PHYS150 or MEAM110, and moves into the study of deformable bodies and their reactions to loads. Key concepts of stress, strain, and linearly elastic responses are applied to different forms, as well as a discussion of safety factors and features.\r\n\r\nLecture is necessary and enjoyable. The professor was considered to be extremely engaging and knowledgable.\r\n\r\nMajor projects include a library research project as well as a team design project. Grading is not on a curve, which led students to comment that the final project was too large of a proportion of the grade. Most students enjoyed the class, but felt that the difficulty of the class merited a curve, which would balance out the currently uneven grade distribution.", "num_students": 64, "path": "/courses/18955/sections/001/reviews/4017-ROBERT-W--CARPICK", "instructor": {"path": "/instructors/4017-ROBERT-W--CARPICK", "first_name": "ROBERT W.", "last_name": "CARPICK", "id": "4017-ROBERT-W--CARPICK", "name": "ROBERT W. CARPICK"}, "num_reviewers": 56, "id": "18955-001-4017-ROBERT-W--CARPICK"}]}, "credits": null, "primary_alias": "MEAM-210", "path": "/courses/18955", "sections": {"path": "/courses/18955/sections", "values": [{"name": "STATICS & STRENTH OF MAT", "sectionnum": "001", "primary_alias": "MEAM-210-001", "path": "/courses/18955/sections/001", "id": "18955-001", "aliases": ["MEAM-210-001"]}]}, "id": 18955, "aliases": ["MEAM-210"]}