{"coursehistories": {"path": "/coursehistories/4910"}, "description": "Unix, in its many forms, runs much of the world's computer infrastructure, from cable modems and cell phones to the giant clusters that power Google and Amazon. This half-credit course provides a thorough introduction to Unix and Linux. Topics will range from critical basic skills such as examin and editing files, compiling programs and writing shell scripts, to higher level topics such as the architecture of Unix and its programming model. The material learned is applicable to many classes, including CIS 240, CIS 331, CIS 341, CIS 371, and CIS 380. \n\n", "semester": "2010A", "name": "LINUX/UNIX SKILLS", "reviews": {"path": "/courses/25797/reviews", "values": [{"ratings": {"rAmountLearned": "3.09", "rDifficulty": "2.71", "rStimulateInterest": "2.97", "rRecommendMajor": "3.29", "rCourseQuality": "2.32", "rWorkRequired": "2.88", "rInstructorAccess": "2.70", "rReadingsValue": "2.61", "rRecommendNonMajor": "1.41", "rCommAbility": "2.68", "rInstructorQuality": "2.49"}, "section": {"name": "LINUX/UNIX SKILLS", "sectionnum": "001", "primary_alias": "CIS-191-001", "path": "/courses/25797/sections/001", "id": "25797-001", "aliases": ["CIS-191-001"]}, "comments": "\r\nThis half credit course provides a thorough introduction to Unix and Linux. The course explores skills such as examining and editing files, compiling programs, writing shell scripts, and also discusses the architecture of Unix and its programming model.\r\n\r\nStudents generally found this class to be “very interesting and helpful,” and decided that the material was placed well into the “broader context” of its applications. Students indicated that the logistics of this course could be improved, and commented frequently on the decrease in content and homework as the semester passed. Overall, they considered the course to be “exceptional” nonetheless.\r\n\r\nPerry Metzger was overall judged to be an “excellent” instructor. Many students complimented his “expertise in Linux,” his passion for the material, and his “informative and amusing” lectures. Students were especially impressed with his presentation of material given that this was his first time teaching, and expect that his work will “improve dramatically” in the future. Students suggested that Metzger fix some logistical issues, such as running the class over its allotted time and posting homeworks more consistently, but seemed overwhelmingly forgiving of these “kinks” in his first year.\r\n\r\nStudents felt that this class required “too much work” relative to its half-credit status, and also disliked the regular quizzes at the beginning of each class. However, students seemed passionate enough about learning this material that many complaints regarding homework actually suggested having more near the end of the semester.\r\n", "num_students": 39, "path": "/courses/25797/sections/001/reviews/5977-PERRY-E--METZGER", "instructor": {"path": "/instructors/5977-PERRY-E--METZGER", "first_name": "PERRY E.", "last_name": "METZGER", "id": "5977-PERRY-E--METZGER", "name": "PERRY E. METZGER"}, "num_reviewers": 35, "id": "25797-001-5977-PERRY-E--METZGER"}]}, "credits": null, "primary_alias": "CIS-191", "path": "/courses/25797", "sections": {"path": "/courses/25797/sections", "values": [{"name": "LINUX/UNIX SKILLS", "sectionnum": "001", "primary_alias": "CIS-191-001", "path": "/courses/25797/sections/001", "id": "25797-001", "aliases": ["CIS-191-001"]}]}, "id": 25797, "aliases": ["CIS-191"]}