{"coursehistories": {"path": "/coursehistories/5727"}, "description": "Spring 2014 Topic: \"Native American Spirituality, Health, and Contemporary Concerns\" will focus on traditional and contemporary conceptions of Health in four Native American communities-- Lakota or Sioux, Navajo or Dine, Cherokee, and Ojibwe or Anishinaabe. The methodology will be interdisciplinary, drawing upon writings from the fields of health care, anthropology, literature, history, film studies, and religious studies. Students will learn about the the complex interrelationships between traditional knowledge systems' and modern, western conceptions of \"medicine.\" Some examples of this include the Lakota Ghost Dance, Navajo sand paintings, Cherokee protocols regarding sacred knowledge, and Anishinaabe herbal medicine. The readings will include anthropological studies of these forms of \"medicine,\" a history of Indian Health Services, first hand accounts of a female Navajo doctor trained in western medicine who then returned home to practice on the Navajo reservation, studies of historical trauma resulting from the massacre of Lakota at Wounded Knee, and contemporary studies of health care on Indian reservations. Students will be evaluated on the basis of in-class presentations and two research papers. \n\nThe class will also participate in an ongoing project to develop a Cultural Sensitivities workshop that is being implemented at the Indian Health Care clinic at the Cass Lake Hospital on the Leech Lake Ojibwe reservation. \n\n", "semester": "2013A", "name": "African American and Native American Oral History", "reviews": {"path": "/courses/30960/reviews", "values": [{"ratings": {"rDifficulty": "2.50", "rStimulateInterest": "3.50", "rCourseQuality": "3.50", "rWorkRequired": "3.50", "rInstructorQuality": "3.50", "rCommAbility": "3.50", "rInstructorAccess": "3.50"}, "section": {"name": "African American and Native American Oral History", "sectionnum": "401", "primary_alias": "RELS-409-401", "path": "/courses/30960/sections/401", "id": "30960-401", "aliases": ["RELS-409-401", "ANTH-409-401", "AFRC-409-401"]}, "comments": "", "num_students": 4, "path": "/courses/30960/sections/401/reviews/4161-TIMOTHY-B--POWELL", "instructor": {"path": "/instructors/4161-TIMOTHY-B--POWELL", "first_name": "TIMOTHY B.", "last_name": "POWELL", "id": "4161-TIMOTHY-B--POWELL", "name": "TIMOTHY B. POWELL"}, "num_reviewers": 2, "id": "30960-401-4161-TIMOTHY-B--POWELL"}]}, "credits": null, "primary_alias": "RELS-409", "path": "/courses/30960", "sections": {"path": "/courses/30960/sections", "values": [{"name": "African American and Native American Oral History", "sectionnum": "401", "primary_alias": "RELS-409-401", "path": "/courses/30960/sections/401", "id": "30960-401", "aliases": ["RELS-409-401", "ANTH-409-401", "AFRC-409-401"]}]}, "id": 30960, "aliases": ["RELS-409", "ANTH-409", "AFRC-409"]}