[{"ratings": {"rInstructorQuality": "3.50", "rCourseQuality": "3.50"}, "section": {"name": "RESEARCH EXP ABNORMAL: PSYCHOPATHOLOGY", "sectionnum": "301", "primary_alias": "PSYC-362-301", "path": "/courses/23712/sections/301", "id": "23712-301", "aliases": ["PSYC-362-301"]}, "comments": "", "num_students": 9, "path": "/courses/23712/sections/301/reviews/1040-MELISSA-HUNT", "instructor": {"path": "/instructors/1040-MELISSA-HUNT", "first_name": "MELISSA", "last_name": "HUNT", "id": "1040-MELISSA-HUNT", "name": "MELISSA HUNT"}, "num_reviewers": 8, "id": "23712-301-1040-MELISSA-HUNT"}, {"ratings": {"rAmountLearned": "3.38", "rDifficulty": "3.31", "rStimulateInterest": "2.92", "rRecommendMajor": "3.23", "rCourseQuality": "3.23", "rWorkRequired": "3.31", "rInstructorAccess": "3.85", "rReadingsValue": "3.15", "rRecommendNonMajor": "1.15", "rCommAbility": "3.08", "rInstructorQuality": "3.54"}, "section": {"name": "RESEARCH EXP ABNORMAL: CLOSE RELATIONSHIPS", "sectionnum": "302", "primary_alias": "PSYC-362-302", "path": "/courses/23712/sections/302", "id": "23712-302", "aliases": ["PSYC-362-302"]}, "comments": "We will examine the nature of close relationships (relationships with parents, spouses, and romantic partners) via observation of videotaped interactions and questionnaire measures completed by the participants. In particular we will look at the relationship of social support and criticism to important relationship features such as relationship satisfaction and maintenance. Senior and junior psych majors only.\r\n\r\nStudents generally enjoyed the class and found it to be very interesting, but felt that the course was a little rushed. One student said, \"This course encapsulated so many facets of research in this field, but because of the amount of work required, I found it very difficult to fully grasp any particular segment. I felt that this course would have benefited from being stretched over two semesters.\" Another student said, \"I learned a ton and it was really interesting stuff.”\r\n\r\nOverall, students liked Professor Chambless. Many commented on her ability to make herself available to her students. One student said, \"She was very flexible and we were able to tell that she wanted us to do well and would work with us for a long time to help us understand things.\" Another student said, \"She is incredibly knowledgeable, fair, and never makes anyone feel inferior while they are learning how to do something new.\"\r\n\r\nThe course requires students to have taken PSYC 162 and one semester of statistics. The class involves a good of amount of work including papers and lab research. The class is only open to senior and junior psych majors. Department permission is required to take the class.\r\n", "num_students": 13, "path": "/courses/23712/sections/302/reviews/2318-DIANNE-L-CHAMBLESS", "instructor": {"path": "/instructors/2318-DIANNE-L-CHAMBLESS", "first_name": "DIANNE L", "last_name": "CHAMBLESS", "id": "2318-DIANNE-L-CHAMBLESS", "name": "DIANNE L CHAMBLESS"}, "num_reviewers": 13, "id": "23712-302-2318-DIANNE-L-CHAMBLESS"}]