{"coursehistories": {"path": "/coursehistories/739"}, "description": "As a Wharton undergraduate, you are in a position to become a future business leader. Management 100 is designed to increase your understanding of leadership and communication in teams and to help you build skills that are necessary for professional success. You will study literature on leadership, management communication, and group dynamics and also complete a field project, an integral part of the course. Your field project provides the context in which you will develop as a leader, practice communication skills, learn about the nature of group work, and enhance your sensitivity to community issues. Management 100 will enrich your Wharton experience by providing many opportunities for interaction with peers, advanced students, alumni, faculty and the community. \n\n", "semester": "2012A", "name": "LDRSHIP COMM IN GRPS", "reviews": {"path": "/courses/27742/reviews", "values": [{"ratings": {"rAmountLearned": "2.90", "rDifficulty": "2.70", "rStimulateInterest": "3.48", "rRecommendMajor": "3.20", "rCourseQuality": "2.57", "rWorkRequired": "3.35", "rInstructorAccess": "3.25", "rReadingsValue": "2.10", "rRecommendNonMajor": "1.48", "rCommAbility": "3.65", "rInstructorQuality": "3.51"}, "section": {"name": "LDRSHIP COMM IN GRPS", "sectionnum": "001", "primary_alias": "MGMT-100-001", "path": "/courses/27742/sections/001", "id": "27742-001", "aliases": ["MGMT-100-001"]}, "comments": "MGMT 100 is designed to increase your understanding of leadership and communication in teams and to help you build skills that are necessary for professional success. You will study literature on leadership, management communication, and group dynamics and also complete a field project, an integral part of the course. Your field project provides the context in which you will develop as a leader, practice communication skills, learn about the nature of group work, and enhance your sensitivity to community issues. MGMT 100 will enrich your Wharton experience by providing many opportunities for interaction with peers, advanced students, alumni, faculty and the community. This course is exclusively reserved for Wharton undergraduate students.\r\nStudents mentioned that MGMT 100 was an interesting class because of “how much hands on work there is.” The course is “extremely engaging,” and students “enjoyed working in a team.” Another student mentioned that the course is “a crucial intro class to Wharton.” One student felt that readings could have been better “integrated,” and another felt that the course could have better aligned with the goal of “productive teamwork.”\r\nReviews for Professor Greenhalgh were positive. She “effectively motivated the class,” and one student mentioned the incredible value he derived from MGMT 100 “largely due to Professor Greenhalgh.” Professor Greenhalgh “genuinely cares about her students and always makes us feel comfortable in contributing to class.”\r\nMGMT 100 is generally taken the first semester of freshman year. This course is exclusively reserved for Wharton undergraduate students.\r\n", "num_students": 46, "path": "/courses/27742/sections/001/reviews/807-ANNE-M--GREENHALGH", "instructor": {"path": "/instructors/807-ANNE-M--GREENHALGH", "first_name": "ANNE M.", "last_name": "GREENHALGH", "id": "807-ANNE-M--GREENHALGH", "name": "ANNE M. GREENHALGH"}, "num_reviewers": 45, "id": "27742-001-807-ANNE-M--GREENHALGH"}, {"ratings": {"rAmountLearned": "1.65", "rDifficulty": "2.58", "rStimulateInterest": "2.11", "rRecommendMajor": "2.08", "rCourseQuality": "1.88", "rWorkRequired": "3.37", "rInstructorAccess": "2.14", "rReadingsValue": "1.89", "rRecommendNonMajor": "1.05", "rCommAbility": "2.50", "rInstructorQuality": "2.51"}, "section": {"name": "LDERSHIP COMM IN GRPS", "sectionnum": "002", "primary_alias": "MGMT-100-002", "path": "/courses/27742/sections/002", "id": "27742-002", "aliases": ["MGMT-100-002"]}, "comments": "Management 100 is designed to increase understanding of leadership and communication in teams and to help build skills that are necessary for professional success, because, as a Wharton undergraduate, students are in a position to become future business leaders. Students will study literature on leadership, management communication, and group dynamics and also complete a field project- an integral part of the course. The field project provides the context in which the students will develop as leaders, practice communication skills, learn about the nature of group work, and enhance sensitivity to community issues. Management 100 will enrich the Wharton experience by providing many opportunities for interaction with peers, advanced students, alumni, faculty and the community.\r\n\r\nMany students in the class thought the course was “useless” and “terrible.” They said they learned very little from the class. Many students did say, however, that they gained some skills in teamwork and communication. Specifically, students thought it was useful that they “learned how to present in front of a class.”\r\n\r\nStudents overall like Professor Maxwell as they said he was an “interesting and good professor.” Some students complained that he did delegate a lot to the TA’s who were often not helpful. \r\n\r\nAll Wharton students are required to take this course in their first semester.\r\n", "num_students": 48, "path": "/courses/27742/sections/002/reviews/211-CHRISTOPHER-I--MAXWELL", "instructor": {"path": "/instructors/211-CHRISTOPHER-I--MAXWELL", "first_name": "CHRISTOPHER I.", "last_name": "MAXWELL", "id": "211-CHRISTOPHER-I--MAXWELL", "name": "CHRISTOPHER I. MAXWELL"}, "num_reviewers": 47, "id": "27742-002-211-CHRISTOPHER-I--MAXWELL"}, {"ratings": {"rAmountLearned": "2.63", "rDifficulty": "2.83", "rStimulateInterest": "3.48", "rRecommendMajor": "3.23", "rCourseQuality": "2.95", "rWorkRequired": "3.53", "rInstructorAccess": "3.23", "rReadingsValue": "2.20", "rRecommendNonMajor": "2.10", "rCommAbility": "3.55", "rInstructorQuality": "3.56"}, "section": {"name": "LDRSHIP COMM IN GRPS", "sectionnum": "003", "primary_alias": "MGMT-100-003", "path": "/courses/27742/sections/003", "id": "27742-003", "aliases": ["MGMT-100-003"]}, "comments": "As a Wharton undergraduate, students are in a position to become future business leaders. MGMT 100 is designed to increase understanding of leadership and communication in teams and to help build skills that are necessary for professional success. This course will study literature on leadership, management communication, and group dynamics and also complete a field project, an integral part of the course. There will be a field project that provides the context in which you will develop as a leader, practice communication skills, learn about the nature of group work, and enhance sensitivity to community issues. Management 100 will enrich the Wharton experience by providing many opportunities for interaction with peers, advanced students, alumni, faculty and the community.\r\n\tOverall, the course was well liked and most students enjoyed the lectures as it taught them skills in terms of teamwork and leadership. As one student put it, the class “not only teaches you to realize your own strengths and weaknesses, but also provides you with tools to improve your skills.” Students also felt that the team project fostered a collective friendship as long as they were engaged and dedicated.\r\n\tStudents felt that Professor Myers was a good lecturer but complained that the grading was a bit arbitrary. Also, the class structure encouraged personal motivation based on grades rather than on deliberate project contributions. \r\nIn general, students felt that the course required a large amount of work outside the classroom. This course is exclusively reserved for Wharton undergraduate students.\r\n", "num_students": 47, "path": "/courses/27742/sections/003/reviews/4418-MEREDITH-MYERS", "instructor": {"path": "/instructors/4418-MEREDITH-MYERS", "first_name": "MEREDITH", "last_name": "MYERS", "id": "4418-MEREDITH-MYERS", "name": "MEREDITH MYERS"}, "num_reviewers": 46, "id": "27742-003-4418-MEREDITH-MYERS"}]}, "credits": null, "primary_alias": "MGMT-100", "path": "/courses/27742", "sections": {"path": "/courses/27742/sections", "values": [{"name": "LDRSHIP COMM IN GRPS", "sectionnum": "001", "primary_alias": "MGMT-100-001", "path": "/courses/27742/sections/001", "id": "27742-001", "aliases": ["MGMT-100-001"]}, {"name": "LDERSHIP COMM IN GRPS", "sectionnum": "002", "primary_alias": "MGMT-100-002", "path": "/courses/27742/sections/002", "id": "27742-002", "aliases": ["MGMT-100-002"]}, {"name": "LDRSHIP COMM IN GRPS", "sectionnum": "003", "primary_alias": "MGMT-100-003", "path": "/courses/27742/sections/003", "id": "27742-003", "aliases": ["MGMT-100-003"]}]}, "id": 27742, "aliases": ["MGMT-100"]}