{"coursehistories": {"path": "/coursehistories/641"}, "description": "This specialized course is usually only taken by Wharton students who plan to concentrate in actuarial science and Penn students who plan to minor in actuarial mathematics. It provides a comprehensive analysis of advanced life contingencies problems such as reserving, multiple life functions, multiple decrement theory with application to the valuation of pension plans. \n\n", "semester": "2010A", "name": "FUND OF ACTUARIAL SCI II", "reviews": {"path": "/courses/26240/reviews", "values": [{"ratings": {"rAmountLearned": "3.53", "rDifficulty": "2.94", "rStimulateInterest": "3.35", "rRecommendMajor": "3.59", "rCourseQuality": "3.20", "rWorkRequired": "2.12", "rInstructorAccess": "3.71", "rReadingsValue": "2.94", "rRecommendNonMajor": "1.59", "rCommAbility": "3.71", "rInstructorQuality": "3.55"}, "section": {"name": "FUND OF ACTUARIAL SCI II", "sectionnum": "401", "primary_alias": "INSR-252-401", "path": "/courses/26240/sections/401", "id": "26240-401", "aliases": ["INSR-252-401", "INSR-830-401"]}, "comments": "Fundamentals of Actuarial Science II, or INSR 252, is a specialized course, usually only taken by Wharton students who plan to concentrate in actuarial science and Penn students who plan to minor in actuarial mathematics. It provides a comprehensive analysis of advanced life contingencies problems such as reserving, multiple life functions, multiple decrement theory with application to the valuation of pension plans. INSR251 is the prerequisite. \r\n\r\nMany students felt that the course was very focused on the depth of topics and not as much on the breadth. They “learned a great deal about pricing insurance and reserves.” One recommended that “if you don’t want to be an actuary, do not take this course.” Others said it was “amazing” and “great.” Some wished there were more discussion based classes. \r\n\r\nMany students praised Professor Lemaire’s personal touch, explaining that he knew each student and could answer questions about their progress by memory, without consulting grades. One student praised him for being a “very knowledgeable actuary and an excellent teacher”. This review is based upon 6 student comments on the course.", "num_students": 21, "path": "/courses/26240/sections/401/reviews/675-JEAN-H--LEMAIRE", "instructor": {"path": "/instructors/675-JEAN-H--LEMAIRE", "first_name": "JEAN H.", "last_name": "LEMAIRE", "id": "675-JEAN-H--LEMAIRE", "name": "JEAN H. LEMAIRE"}, "num_reviewers": 21, "id": "26240-401-675-JEAN-H--LEMAIRE"}]}, "credits": null, "primary_alias": "INSR-252", "path": "/courses/26240", "sections": {"path": "/courses/26240/sections", "values": [{"name": "FUND OF ACTUARIAL SCI II", "sectionnum": "401", "primary_alias": "INSR-252-401", "path": "/courses/26240/sections/401", "id": "26240-401", "aliases": ["INSR-252-401", "INSR-830-401"]}]}, "id": 26240, "aliases": ["INSR-252", "INSR-830"]}