[{"ratings": {"rAmountLearned": "2.67", "rDifficulty": "2.44", "rStimulateInterest": "2.22", "rRecommendMajor": "2.98", "rCourseQuality": "2.46", "rWorkRequired": "1.98", "rInstructorAccess": "2.67", "rReadingsValue": "2.78", "rRecommendNonMajor": "2.20", "rCommAbility": "2.06", "rInstructorQuality": "2.26"}, "section": {"name": "FUNDING INVESTMENTS", "sectionnum": "001", "primary_alias": "FNCE-238-001", "path": "/courses/26066/sections/001", "id": "26066-001", "aliases": ["FNCE-238-001"]}, "comments": "\r\nFunding Investments, or FNCE 238, examines the available corporate securities that firms can use to finance investment. The course will focus on: (1) the design of these securities (Why do bonds have embedded options? What is the role of preferred stock?); (2) the issuing process for these securities (What do investment banks do? Is the underwriting process important for the cost of capital?); (3) the pricing of these securities (How are credit risk in bonds and loans priced?) The securities covered include corporate and junk bonds, bank loans, common and preferred equity, commercial paper, securitization, as well as some recent innovations. The course is designed to be complementary to Advanced Corporate Finance and Fixed Income Securities, and the two prerequisites are FNCE100 and FNCE101. \r\n\r\nStudents describe FNCE 238 as a “helpful course with a lot of relevant and helpful real-world information”. The course is lecture-based, and primarily focuses on the financial crisis of 2008. Students explain that because of the high emphasis on participation in the lecture-based course, one must be prepared to interject questions in order to secure the participation grade, and it gives the lecture a choppy feel. \r\n\r\nProfessor Schwarz was complimented for her “kindness” and good intentions. Her lecture slides included lots of material and were found “useful”. However, many students feel that she is not prepared for class and her “ability to communicate the subject matter is dangerously weak”. Several students note that she is frequently unable to answer class questions. \r\n\r\nStudents warn that, Professor Schwarz grades tests using a dual plus/minus points system, where points are deducted for wrong answers and also awarded for correct ones. Students called this system “atrocious” but overall had no other complaints.", "num_students": 68, "path": "/courses/26066/sections/001/reviews/5360-KRISTA-SCHWARZ", "instructor": {"path": "/instructors/5360-KRISTA-SCHWARZ", "first_name": "KRISTA", "last_name": "SCHWARZ", "id": "5360-KRISTA-SCHWARZ", "name": "KRISTA SCHWARZ"}, "num_reviewers": 64, "id": "26066-001-5360-KRISTA-SCHWARZ"}]