{"coursehistories": {"path": "/coursehistories/3836"}, "description": "This is an introductory course about Basic Algorithms and Data Structures using the Java programming language. We introduce elementary concepts about the complexity of an algorithm and methods for analyzing the running time of software. We describe data structures like stacks, queues, lists, trees, priority queues, maps, hash tables and graphs, and we discuss how to implement them efficiently and how to use them in problems-solving software. A larger project introducing students to some of the challenges of software development concludes the course. \n\n", "semester": "2010C", "name": "PROG LANG AND TECH II", "reviews": {"path": "/courses/22820/reviews", "values": [{"ratings": {"rAmountLearned": "2.81", "rDifficulty": "2.96", "rStimulateInterest": "2.00", "rRecommendMajor": "3.53", "rCourseQuality": "2.49", "rWorkRequired": "3.06", "rInstructorAccess": "2.40", "rReadingsValue": "1.94", "rRecommendNonMajor": "1.53", "rCommAbility": "1.94", "rInstructorQuality": "2.11"}, "section": {"name": "PROG LANG AND TECH II", "sectionnum": "001", "primary_alias": "CIS-121-001", "path": "/courses/22820/sections/001", "id": "22820-001", "aliases": ["CIS-121-001"]}, "comments": "CIS 121 is an introductory course about Basic Algorithms and Data Structures using the Java programming language. This class introduces elementary concepts about the complexity of an algorithm and methods for analyzing the running time of software. It describes data and discusses how to implement them efficiently and how to use them in problems-solving software. A larger project introducing students to some of the challenges of software development concludes the course. \r\n\r\nMany students felt that the class material was “interesting” but that there was “no interesting way to teach it.” The exam was not “well-written” and the lectures were “extremely dull.” Several students reported being dependent upon outside material to complete homework assignments. One student felt that too much of the learning “happened on our own, in our own time.” However, many students appreciated that the class was not “too intense” and that the exams “weren’t too hard.” \r\n\r\nAccording to a majority of students, the lectures were “low quality” and lacked “passion.” Students felt that Professor Daniilidis was a “very fair person” with “a nice sense of humor,” but that he was “unreachable outside of lecture, office hours, and recitation.” The quality of teaching was described as “a disappointment” and “subpar.” \r\n\r\nStudents generally agreed that this class was “very valuable” and “really good” for CIS majors. Many students did not understand why CIS 160 was a prerequisite, as material from the course was “hardly used.” \r\n\r\nThis review is based on the 7 student comments that were submitted.\r\n", "num_students": 71, "path": "/courses/22820/sections/001/reviews/312-KONSTANTINOS-DANIILIDIS", "instructor": {"path": "/instructors/312-KONSTANTINOS-DANIILIDIS", "first_name": "KONSTANTINOS", "last_name": "DANIILIDIS", "id": "312-KONSTANTINOS-DANIILIDIS", "name": "KONSTANTINOS DANIILIDIS"}, "num_reviewers": 63, "id": "22820-001-312-KONSTANTINOS-DANIILIDIS"}]}, "credits": null, "primary_alias": "CIS-121", "path": "/courses/22820", "sections": {"path": "/courses/22820/sections", "values": [{"name": "PROG LANG AND TECH II", "sectionnum": "001", "primary_alias": "CIS-121-001", "path": "/courses/22820/sections/001", "id": "22820-001", "aliases": ["CIS-121-001"]}]}, "id": 22820, "aliases": ["CIS-121"]}