[{"ratings": {"rAmountLearned": "2.41", "rDifficulty": "1.95", "rStimulateInterest": "1.86", "rRecommendMajor": "2.41", "rCourseQuality": "2.27", "rWorkRequired": "2.14", "rInstructorAccess": "2.00", "rReadingsValue": "2.09", "rRecommendNonMajor": "2.32", "rCommAbility": "1.86", "rInstructorQuality": "2.00"}, "section": {"name": "ADVANCED STUDY-EMGT: Building Future Markets: The Case for Africa", "sectionnum": "403", "primary_alias": "MGMT-893-403", "path": "/courses/27782/sections/403", "id": "27782-403", "aliases": ["MGMT-893-403"]}, "comments": "MGMT893 is an advanced study project focusing on entrepreneurial management. ASP topics can be individually selected by the student with the advice and consent of any instructor in the management Department. Since ASP topics can be individually selected, the course content can vary considerably by semester.\r\n\r\n\tMany students thought this class was “repetitive”, “slow”, “broad in nature,” and needs more planning.” Students did not like that it was not “focused on South Africa.” Students did not like that they felt “unsafe” and were “not provided water” during long visits. However, some students “thoroughly enjoyed” this class and “learned a lot”. \r\n\r\nMost students found Professor Shropshire to be “knowledgeable and helpful.” One student, however, commented that he “made some inappropriate comments” which some students found “offensive”. Students did not think that the speakers were “good quality” but also wished they had “more time to interact with guest speakers and students from USB and other cohorts.” Students also noted that the TA’s were “very rude” and “lack experience.” \r\n\r\nStudents thought this course had “high expectations”  but was “not outlined clearly” and that there was “little info available in advance.”  One student complained that there was “little info available in advance.” MGMT893 is an MBA course. All ASP registrations require the written consent of the instructor and appropriate course and section number on the registration form. If the student has the instructor’s written permission, he/she is not required to obtain written consent from the department. Students, however, should send an email to MGMT- Courseinfo@wharton.upenn.edu to request the course and section numbers.\r\n", "num_students": 55, "path": "/courses/27782/sections/403/reviews/718-KENNETH-L--SHROPSHIRE", "instructor": {"path": "/instructors/718-KENNETH-L--SHROPSHIRE", "first_name": "KENNETH L.", "last_name": "SHROPSHIRE", "id": "718-KENNETH-L--SHROPSHIRE", "name": "KENNETH L. SHROPSHIRE"}, "num_reviewers": 28, "id": "27782-403-718-KENNETH-L--SHROPSHIRE"}, {"ratings": {"rAmountLearned": "2.41", "rDifficulty": "1.95", "rStimulateInterest": "2.00", "rRecommendMajor": "2.41", "rCourseQuality": "2.27", "rWorkRequired": "2.14", "rInstructorAccess": "2.00", "rReadingsValue": "2.09", "rRecommendNonMajor": "2.32", "rCommAbility": "2.00", "rInstructorQuality": "2.00"}, "section": {"name": "ADVANCED STUDY-EMGT: Building Future Markets: The Case for Africa", "sectionnum": "403", "primary_alias": "MGMT-893-403", "path": "/courses/27782/sections/403", "id": "27782-403", "aliases": ["MGMT-893-403"]}, "comments": "", "num_students": 55, "path": "/courses/27782/sections/403/reviews/4431-HARBIR-SINGH", "instructor": {"path": "/instructors/4431-HARBIR-SINGH", "first_name": "HARBIR", "last_name": "SINGH", "id": "4431-HARBIR-SINGH", "name": "HARBIR SINGH"}, "num_reviewers": 28, "id": "27782-403-4431-HARBIR-SINGH"}, {"ratings": {"rAmountLearned": "2.41", "rDifficulty": "1.95", "rStimulateInterest": "1.95", "rRecommendMajor": "2.41", "rCourseQuality": "2.27", "rWorkRequired": "2.14", "rInstructorAccess": "2.57", "rReadingsValue": "2.09", "rRecommendNonMajor": "2.32", "rCommAbility": "2.18", "rInstructorQuality": "2.24"}, "section": {"name": "ADVANCED STUDY-EMGT: Building Future Markets: The Case for Africa", "sectionnum": "403", "primary_alias": "MGMT-893-403", "path": "/courses/27782/sections/403", "id": "27782-403", "aliases": ["MGMT-893-403"]}, "comments": "MGMT893 is an advanced study project focusing on entrepreneurial management. ASP topics can be individually selected by the student with the advice and consent of any instructor in the management Department. Since ASP topics can be individually selected, the course content can vary considerably by semester. This semester the topic was “Building Future Markets: The Case For Africa.”\r\n\r\n\tA majority of students did not enjoy this course as they said it was very “slow,” “repetitive,” and “broad.” Students shared some complaints concerning the trip to South Africa as well as the failure of the course to reach their high expectations. They said that there is little focus on theory. Students enjoyed some of the trips. Some students said the readings were “not clear” and not insightful.\r\n\r\n\tStudents overall liked Professor MacMillan as they said he had “great content and methodology.” Students did however complain about the quality of the guest lecturers.  \r\n\r\n\tThe course is an upper level course in the MGMT department. MGMT893 is an MBA course. All ASP registrations require the written consent of the instructor and appropriate course and section number on the registration form. If the student has the instructor’s written permission, he/she is not required to obtain written consent from the department. Students, however, should send an email to MGMT- Courseinfo@wharton.upenn.edu to request the course and section numbers.\r\n", "num_students": 55, "path": "/courses/27782/sections/403/reviews/4435-IAN-C-MACMILLAN", "instructor": {"path": "/instructors/4435-IAN-C-MACMILLAN", "first_name": "IAN C", "last_name": "MACMILLAN", "id": "4435-IAN-C-MACMILLAN", "name": "IAN C MACMILLAN"}, "num_reviewers": 28, "id": "27782-403-4435-IAN-C-MACMILLAN"}, {"ratings": {"rAmountLearned": "3.23", "rDifficulty": "2.18", "rStimulateInterest": "2.86", "rRecommendMajor": "3.45", "rCourseQuality": "3.36", "rWorkRequired": "2.62", "rInstructorAccess": "3.23", "rReadingsValue": "2.59", "rRecommendNonMajor": "3.24", "rCommAbility": "3.00", "rInstructorQuality": "3.00"}, "section": {"name": "ADVANCED STUDY-EMGT: Managing in Emerging Economies: Energy & Infrastructure in Brazil", "sectionnum": "404", "primary_alias": "MGMT-893-404", "path": "/courses/27782/sections/404", "id": "27782-404", "aliases": ["MGMT-893-404"]}, "comments": "Advanced Study Project - Entrepreneurial Management. Special permission is required.  ASP topics can be individually selected by the student with the advice and consent of any instructor in the Management Department. In addition, in any given semester, instructors in the Goergen Entrepreneurial Management Program may offer organized ASPs. All ASP registrations require the written consent of the instructor and appropriate section number on the registration form. Students should go to the Wharton Entrepreneurial Programs Office to receive faculty section numbers. If the proper approval is not obtained, registration is not valid.\r\nThis course provided students “with a better understanding of Brazil, how to do business there, and the dynamics (economically and politically) of Brazil.” The course also covered “the energy and infrastructure sectors, and what/how some emerging Brazilian multinationals were able to capture the opportunities.” Students found the course to contain a “truly stellar line-up of guest speakers and site visits, and who took the time to give just the right background context necessary to get the most out of those meetings.” \r\nProfessor Guillen had mixed positive reviews. Some students felt that Professor Guillen could have facilitated more discussion and critical analysis rather than summary of cases. Others were frustrated that students would show up “late for classes and events,” as the professor insisted on waiting for them and as a result wasted class time. However, most students appreciated the “incredible lengths [to which Professor Guilllen went] to secure a truly stellar line-up of guest speakers and site visits.” \r\nStudents would recommend this course to anyone (including non-Wharton students). \r\n", "num_students": 42, "path": "/courses/27782/sections/404/reviews/2425-MAURO-FEDERICO-GUILLEN", "instructor": {"path": "/instructors/2425-MAURO-FEDERICO-GUILLEN", "first_name": "MAURO FEDERICO", "last_name": "GUILLEN", "id": "2425-MAURO-FEDERICO-GUILLEN", "name": "MAURO FEDERICO GUILLEN"}, "num_reviewers": 22, "id": "27782-404-2425-MAURO-FEDERICO-GUILLEN"}, {"ratings": {"rAmountLearned": "3.23", "rDifficulty": "2.18", "rStimulateInterest": "2.95", "rRecommendMajor": "3.45", "rCourseQuality": "3.36", "rWorkRequired": "2.62", "rInstructorAccess": "3.32", "rReadingsValue": "2.59", "rRecommendNonMajor": "3.24", "rCommAbility": "2.91", "rInstructorQuality": "2.95"}, "section": {"name": "ADVANCED STUDY-EMGT: Managing in Emerging Economies: Energy & Infrastructure in Brazil", "sectionnum": "404", "primary_alias": "MGMT-893-404", "path": "/courses/27782/sections/404", "id": "27782-404", "aliases": ["MGMT-893-404"]}, "comments": "MGMT 893 is a two part series. The first part concentrating on the Indian Consumer will be offered in December 2011. The second part, concentrating on the Chinese Consumer will be offered in March 2012. India and China add up to half of the world's population. Each presents its own challenges and opportunities. US and European MNCs have been in both countries for many years, but emerging market MNC's are becoming stronger and in many cases overtaking US and European companies despite their strong brands and know-how. Marketing to the Indian Consumer will provide a careful understanding of: The opportunity and challenges in the Indian consumer market 2) Various segments within the Indian consumer market. 3) Consumer psychology and decision making processes in each segment 4) Distribution channels in Indi Media in India: Mass, Local and non-traditional. 6) Bottom of the pyramid consumers and rural markets. 7) Product design and development decisions. The course will focus on the following industries: consumer packaged goods, mobile phones, financial services (insurance and banking), healthcare, sports and entertainment, and transportation. The course will involve case studies from local and international companies, guest lecturers, and visits to consumer homes to observe their tastes, habits, and preferences. Marketing to the Chinese Consumer will provide students with a critical understanding of the Chinese consumer, distribution channels, pricing environment, branding and competitive dynamics so as to enhance their ability to market to the Chinese consumer successfully. The course will consist of a combination of lectures, case studies, presentations by industry experts, and a short evening field trip.\r\n\tThe majority of students thoroughly enjoyed the class, with many students calling it “one of the best courses taken at Wharton.” Most students thought highly of the class organization and especially looked forward to the speakers and case studies. Each speaker came from the top of their respective fields and there was always extended Q&A access after the meetings. The class was viewed as a great experience, and in general, students felt that the content from the speakers provided very rich content and depth.\r\n\tStudents depicted Professor Monteiro as a very engaging lecturer that knew exactly how to “provide the space to learn a great deal at a meaningful depth.” Professor Monteiro was seen to go to “incredible lengths to secure a truly stellar line-up of guest speakers,” and always left time for further discussions. \r\n\tThe class is for Wharton graduate management students. However, a few students felt that the case studies did not lead to meaningful discussions. Overall, the speakers brought in sparked thoughtful insight and students looked forward to each class. There are no prerequisites for this course.\r\n", "num_students": 42, "path": "/courses/27782/sections/404/reviews/5642-LUIZ-FELIPE-MONTEIRO", "instructor": {"path": "/instructors/5642-LUIZ-FELIPE-MONTEIRO", "first_name": "LUIZ FELIPE", "last_name": "MONTEIRO", "id": "5642-LUIZ-FELIPE-MONTEIRO", "name": "LUIZ FELIPE MONTEIRO"}, "num_reviewers": 22, "id": "27782-404-5642-LUIZ-FELIPE-MONTEIRO"}]