{"coursehistories": {"path": "/coursehistories/5626"}, "description": "The nonprofit sector plays a key role in the provision of many goods and services which are fundamental in our society and which may be difficult to provide using market mechanisms alone. Education, health care, charitable services, and the arts are some primary examples of these. Nonprofit organizations operate in service of specific social missions rather than profit maximization, but in order to serve those missions effectively while ensuring their own survival, they must also make many of the decisions typically associated with private firms. That is, they must compete for funding, human resources, and consumers of their services, they must manage and invest their resources efficiently, and they must innovate new products and services over time. Importantly, the latter requirements may at times come in conflict with the organizations' social values. As a result, nonprofit organizations as economic decision-makers confront a number of unique challenges to their success and growth. The goal of this course is to give students a broad overview of the economic, organizational, and strategic concerns facing the non-profit sector. \n\nOur objective is to characterize the unique economic environment, identify effective strategic governance, and management approaches, and explore how appropriate measurement techniques can inform the policy treatment of nonprofits. This course is organized around a number of lectures, readings and outside speakers, a midterm exam and a required project. \n\n", "semester": "2013A", "name": "NONPROFIT SECTOR: ECONOM", "reviews": {"path": "/courses/29928/reviews", "values": [{"ratings": {"rAmountLearned": "2.57", "rDifficulty": "2.14", "rTAQuality": "3.08", "rStimulateInterest": "1.79", "rRecommendMajor": "2.79", "rCourseQuality": "2.33", "rWorkRequired": "1.86", "rInstructorAccess": "3.36", "rReadingsValue": "2.14", "rRecommendNonMajor": "2.00", "rCommAbility": "2.36", "rInstructorQuality": "2.39"}, "section": {"name": "NONPROFIT SECTOR: ECONOM", "sectionnum": "001", "primary_alias": "BEPP-214-001", "path": "/courses/29928/sections/001", "id": "29928-001", "aliases": ["BEPP-214-001"]}, "comments": "", "num_students": 24, "path": "/courses/29928/sections/001/reviews/6288-ASHLEY-SWANSON", "instructor": {"path": "/instructors/6288-ASHLEY-SWANSON", "first_name": "ASHLEY", "last_name": "SWANSON", "id": "6288-ASHLEY-SWANSON", "name": "ASHLEY SWANSON"}, "num_reviewers": 19, "id": "29928-001-6288-ASHLEY-SWANSON"}]}, "credits": null, "primary_alias": "BEPP-214", "path": "/courses/29928", "sections": {"path": "/courses/29928/sections", "values": [{"name": "NONPROFIT SECTOR: ECONOM", "sectionnum": "001", "primary_alias": "BEPP-214-001", "path": "/courses/29928/sections/001", "id": "29928-001", "aliases": ["BEPP-214-001"]}]}, "id": 29928, "aliases": ["BEPP-214"]}