{"coursehistories": {"path": "/coursehistories/4916"}, "description": "Myths are traditional stories that have endured many years. Some of them have to do with events of great importance, such as the founding of a nation. Others tell the stories of great heroes and heroines and their exploits and courage in the face of adversity. Still others are simple tales about otherwise unremarkable people who get into trouble or do some great deed. What are we to make of all these tales, and why do people seem to like to hear them? This course will focus on the myths of ancient Greece and Rome, as well as a few contemporary American ones, as a way of exploring the nature of myth and the function it plays for individuals, societies, and nations. We will also pay some attention to the way the Greeks and Romans themselves understood their own myths. Are myths subtle codes that contain some universal truth? Are they a window on the deep recesses of a particular culture? Are they entertaining stories that people like to tell over and over? Are they a set of blinders that all of us wear, though we do not realize it? Investigate these questions through a variety of topics creation of the universe between gods and mortals, religion and family, sex, love, madness, and death. \n\n", "semester": "2012A", "name": "GREEK & ROMAN MYTHOLOGY", "reviews": {"path": "/courses/27185/reviews", "values": [{"ratings": {"rAmountLearned": "2.85", "rDifficulty": "2.28", "rStimulateInterest": "3.41", "rRecommendMajor": "3.62", "rCourseQuality": "3.05", "rWorkRequired": "2.74", "rInstructorAccess": "3.46", "rReadingsValue": "3.04", "rRecommendNonMajor": "2.98", "rCommAbility": "3.51", "rInstructorQuality": "3.55"}, "section": {"name": "GREEK & ROMAN MYTHOLOGY", "sectionnum": "401", "primary_alias": "CLST-100-401", "path": "/courses/27185/sections/401", "id": "27185-401", "aliases": ["CLST-100-401", "COML-108-401"]}, "comments": "Myths are traditional stories that have endured many years. Some of them have to do with events of great importance, such as the founding of a nation. Others tell the stories of great heroes and heroines and their exploits and courage in the face of adversity. Still others are simple tales about otherwise unremarkable people who get into trouble or do some great deed. What are we to make of all these tales, and why do people seem to like to hear them? This course will focus on the myths of ancient Greece and Rome, as well as a few contemporary American ones, as a way of exploring the nature of myth and the function it plays for individuals, societies, and nations. We will also pay some attention to the way the Greeks and Romans themselves understood their own myths. Are myths subtle codes that contain some universal truth? Are they a window on the deep recesses of a particular culture? Are they entertaining stories that people like to tell over and over? Are they a set of blinders that all of us wear, though we do not realize it? Investigate these questions through a variety of topics creation of the universe between gods and mortals, religion and family, sex, love, madness, and death.\r\n\r\nThis course serves as an introduction to Greek and Roman mythology.  Students generally expressed satisfaction with the course.  Most students found the readings and lectures interesting; however, several students noted that certain topics (namely Homer’s Odyssey) were simply a review for most students.  Most agreed that they came away from the course with a new appreciation for mythology, although some failed to see how the course would advance their overall studies.  Students found the course generally well-structured, describing the lectures as “captivating.”  Students were generally less enthusiastic about the out-of-class work, occasionally perceiving it as “overkill.”\r\n\r\nProfessor Struck received rather positive reviews.  Students regarded him as “brilliant” and “engaging.”  Participants found his lectures greatly enhanced by his “overwhelming passion for the material.”  He was further lauded as “clear,” “humble,” and “simply the best professor at Penn.”  Even students who were slightly frustrated by certain elements of the course had enormous praise for Professor Struck.\r\n\r\nThe class’s main pitfall, according to most respondents, was the frequency of assignments.  Weekly written responses and quizzes caused students to feel “overwhelmed” or “aggravated” by the course.  Readings were described as “very interesting, but simply too long.”  While students considered the grading generally “fair,” most noted that they wished they had been given fewer, more thorough assignments, as opposed to such frequent assessments.  Students from a variety of disciplines enrolled in the course, most of whom recommended the course to peers.", "num_students": 223, "path": "/courses/27185/sections/401/reviews/259-PETER-T--STRUCK", "instructor": {"path": "/instructors/259-PETER-T--STRUCK", "first_name": "PETER T.", "last_name": "STRUCK", "id": "259-PETER-T--STRUCK", "name": "PETER T. STRUCK"}, "num_reviewers": 208, "id": "27185-401-259-PETER-T--STRUCK"}]}, "credits": null, "primary_alias": "CLST-100", "path": "/courses/27185", "sections": {"path": "/courses/27185/sections", "values": [{"name": "GREEK & ROMAN MYTHOLOGY", "sectionnum": "401", "primary_alias": "CLST-100-401", "path": "/courses/27185/sections/401", "id": "27185-401", "aliases": ["CLST-100-401", "COML-108-401"]}]}, "id": 27185, "aliases": ["CLST-100", "COML-108"]}