{"coursehistories": {"path": "/coursehistories/927"}, "description": "This course is an introduction to the most prominent historical, cultural, institutional, and ideological features of Middle Eastern politics. Typical of the questions we shall address are why processes of modernization and economic change have not produced liberal democracies, why Islamic movements have gained enormous strength in some countries and not others, why conflicts in the region--between Israel and the Arabs, Iran and Iraq, or inside of Lebanon--have been so bitter and protracted; why the era of military coups was brought to an end but transitions to democracy have been difficult to achieve; why Arab unity has been so elusive and yet so insistent a theme; and why oil wealth in the Gulf, in the Arabian Peninsula, and in North Africa, has not produced industrialized or self-sustaining economic growth. \n\n", "semester": "2010A", "name": "POL IN CONTEMP MID EAST", "reviews": {"path": "/courses/26661/reviews", "values": [{"ratings": {"rAmountLearned": "2.94", "rDifficulty": "3.00", "rStimulateInterest": "3.27", "rRecommendMajor": "3.15", "rCourseQuality": "2.74", "rWorkRequired": "2.97", "rInstructorAccess": "2.79", "rReadingsValue": "3.09", "rRecommendNonMajor": "2.45", "rCommAbility": "2.97", "rInstructorQuality": "2.97"}, "section": {"name": "POL IN CONTEMP MID EAST", "sectionnum": "001", "primary_alias": "PSCI-211-001", "path": "/courses/26661/sections/001", "id": "26661-001", "aliases": ["PSCI-211-001"]}, "comments": "This course is an introduction to the most prominent historical, cultural, institutional, and ideological features of Middle Eastern politics. Typical of the questions we shall address are why processes of modernization and economic change have not produced liberal democracies, why Islamic movements have gained enormous strength in some countries and not others, why conflicts in the region--between Israel and the Arabs, Iran and Iraq, or inside of Lebanon--have been so bitter and protracted; why the era of military coups was brought to an end but transitions to democracy have been difficult to achieve; why Arab unity has been so elusive and yet so insistent a theme; and why oil wealth in the Gulf, in the Arabian Peninsula, and in North Africa, has not produced industrialization or self-sustaining economic growth. By careful consideration of recent scholarly research on Middle Eastern politics students will gain an appreciation for the special challenges, opportunities, and responsibilities associated with systematic analysis of politics in a comparative setting.\r\nStudents who took the class agreed that Professor Vitalis generally followed the syllabus and course description.\r\n\r\nReviews were mixed regarding the lecture style. Some students described the discussion-heavy format as engaging and conducive to Professor Vitalis’ “unique” style. Others found that the “attempt to run a medium-sized lecture as a seminar was at times very frustrating,” leading to a class that could feel “unstructured.” A number of students were very impressed with Professor Vitalis, noting that he “does an excellent job of communicating important and complex subject matter,” and that he is “lively and entertaining.”\r\n\r\nStudents’ main criticisms pertained to the assignments, with many finding the critical book reviews difficult and strictly graded, considering the class “focused little on how exactly to write a book review.” On the other hand, some felt that the assignments were very helpful in improving critical writing skills. A few students noted that this class is so worthwhile that it should be considered “a must” for political science majors interested in the Middle East.\r\n", "num_students": 45, "path": "/courses/26661/sections/001/reviews/1014-ROBERT-VITALIS", "instructor": {"path": "/instructors/1014-ROBERT-VITALIS", "first_name": "ROBERT", "last_name": "VITALIS", "id": "1014-ROBERT-VITALIS", "name": "ROBERT VITALIS"}, "num_reviewers": 39, "id": "26661-001-1014-ROBERT-VITALIS"}]}, "credits": null, "primary_alias": "PSCI-211", "path": "/courses/26661", "sections": {"path": "/courses/26661/sections", "values": [{"name": "POL IN CONTEMP MID EAST", "sectionnum": "001", "primary_alias": "PSCI-211-001", "path": "/courses/26661/sections/001", "id": "26661-001", "aliases": ["PSCI-211-001"]}]}, "id": 26661, "aliases": ["PSCI-211"]}