[{"ratings": {"rAmountLearned": "2.62", "rDifficulty": "0.97", "rStimulateInterest": "3.17", "rRecommendMajor": "3.26", "rCourseQuality": "3.13", "rWorkRequired": "1.03", "rInstructorAccess": "2.61", "rReadingsValue": "2.41", "rRecommendNonMajor": "2.14", "rCommAbility": "2.91", "rInstructorQuality": "2.89"}, "section": {"name": "Advanced Seminar on Private Equity", "sectionnum": "401", "primary_alias": "FNCE-895-401", "path": "/courses/27452/sections/401", "id": "27452-401", "aliases": ["FNCE-895-401", "FNCE-395-401"]}, "comments": "The course will be a survey of the private equity asset class. Its objective is to provide an understanding of the concepts, agents, and institutions involved in the late stage corporate private equity market in the U.S. and around the globe. It will examine the buyout market and the activities of buyout funds from the differing perspectives of private equity investors, private equity fund sponsors, and managers of the portfolio companies. The course will be taught almost entirely with cases. Distinguished Wharton alumni in the private equity industry will be guest speakers for many of the cases based on transactions they concluded. While this course is primarily intended for graduate students, admission may be granted to a limited number of interested undergraduate students. PLEASE NOTE: this course may be recorded for live or subsequent distribution, display, broadcast, or commercialization in any media, including video, audio, or electronic media. Prerequisites: FNCE 726 and FNCE 751 or permission from the instructor.\r\nStudents enjoyed the guest speakers and” getting to learn about the industry from some significant players in the industry.” It was a “great opportunity to network” but the guest speakers were “varied in the ability to present well” and some students felt like they were “promoting their funds.”\r\nProfessor Gultekin was difficult to “evaluate the professor since pretty much every class was a guest speaker.” He did not attend class in the last few sessions.\r\nStudents found the class “only relevant if you are interested in Private Equity.” There is a “final project where you pitch a PE deal.” The class was an “easy half credit.”\r\n", "num_students": 58, "path": "/courses/27452/sections/401/reviews/4652-BULENT-GULTEKIN", "instructor": {"path": "/instructors/4652-BULENT-GULTEKIN", "first_name": "BULENT", "last_name": "GULTEKIN", "id": "4652-BULENT-GULTEKIN", "name": "BULENT GULTEKIN"}, "num_reviewers": 58, "id": "27452-401-4652-BULENT-GULTEKIN"}]