[{"ratings": {"rAmountLearned": "3.11", "rDifficulty": "2.68", "rStimulateInterest": "3.59", "rRecommendMajor": "3.63", "rCourseQuality": "3.20", "rWorkRequired": "2.73", "rInstructorAccess": "3.19", "rReadingsValue": "2.74", "rRecommendNonMajor": "2.94", "rCommAbility": "3.60", "rInstructorQuality": "3.49"}, "section": {"name": "Critical Approaches to Popular Culture", "sectionnum": "001", "primary_alias": "COMM-123-001", "path": "/courses/24215/sections/001", "id": "24215-001", "aliases": ["COMM-123-001"]}, "comments": "Communications 123 considers the critique of popular culture as mere trivia and \"just entertainment;\" it has been condemned as propaganda, a tool of mass deception; and its consumers have been dubbed fashion victims and couch potatoes. It also examines evaluations that suggest that popular culture offers valuable material for the study of social life. This course will consider the meanings and impact of popular culture, including its effects on how we see ourselves, others, and American life; who makes distinctions between high, middlebrow, and low or mass culture; and how power and resistance structure the production and consumption of popular texts.\r\n\r\nMost students really enjoyed this “interesting, entertaining, and thought-provoking” class. Considered by many to be one of the best classes they have taken at Penn, students still claimed that the workload for this course was “a bit much for an introductory Communications course” and that the grading on the tests and papers was “harsh.” Overall, students found the readings and lectures “extremely engaging” and claimed that they were “never bored.”\r\n\r\nProfessor Paxton was viewed by her students as “exciting,” for she “frequently had the class in laughter.” She was able to keep students awake and present in class because the material and the way it was presented was “educationally stimulating, while still being entertaining.” Most students also commented on Professor Paxton’s approachability or willingness to help them with the material on her own time. It was noted, however, that she is “demanding of her students” and “expects a lot.”\r\n\r\nThis course is recommended for students interested in pop culture or communications, but is “challenging for an introductory course.” Many students felt that they had to work hard to get an A in this class and that the grading was purposefully difficult. With two papers, three tests, and many readings, students often felt overwhelmed with work that ultimately didn’t pay off due to the harsh grading. However, students commented that they generally “enjoyed the readings” and the “curve for the course helped.”\r\n", "num_students": 109, "path": "/courses/24215/sections/001/reviews/1770-FELICITY-PAXTON", "instructor": {"path": "/instructors/1770-FELICITY-PAXTON", "first_name": "FELICITY", "last_name": "PAXTON", "id": "1770-FELICITY-PAXTON", "name": "FELICITY PAXTON"}, "num_reviewers": 106, "id": "24215-001-1770-FELICITY-PAXTON"}]