[{"ratings": {"rAmountLearned": "3.46", "rDifficulty": "3.25", "rStimulateInterest": "3.73", "rRecommendMajor": "3.77", "rCourseQuality": "3.69", "rWorkRequired": "3.13", "rInstructorAccess": "3.88", "rReadingsValue": "4.00", "rRecommendNonMajor": "3.19", "rCommAbility": "3.92", "rInstructorQuality": "3.73"}, "section": {"name": "EURO INTELL HIST 18TH C", "sectionnum": "001", "primary_alias": "HIST-416-001", "path": "/courses/20351/sections/001", "id": "20351-001", "aliases": ["HIST-416-001"]}, "comments": "This survey course is based solely on primary sources from the main currents of eighteenth-century European thought which includes deism, natural religion, skepticism, evangelical revival, political reform, Utilitarianism, and materialism. The course focuses on works widely read in the eighteenth century and of enduring historical significance.\r\n\r\nStudents raved about this course. More than one student proclaimed that it was the best class they had taken at Penn. Many found the course “intellectually stimulating,” that it required “independent and critical thinking,” and that they learned a lot from it. One student did say that “the pace of the lectures could be faster and a more in depth historical perspective would be nice,” while another student yearned for more discussion. Both these students were in the minority. \r\n\r\nStudents unanimously applauded Professor Kors’ teaching style. Not a single critique was given. All the students found him to be “brilliant, inspiring, passionate, an amazing lecturer.” They admired his expertise and in depth knowledge about his subject matter and the fact that he “genuinely cares about his students.” General sentiment can be summed up in one student’s proclamation: “Kors is as good as it gets. He is a professor who you’ll want to take at least one course with before graduating.”\r\n\r\nThe distribution of grades in this course was a point of concern for students. They wanted the distribution to become more balanced and not have the final worth 75% of their grade. 300-400 level courses are on special topics and are more advanced. They often presuppose some basic knowledge in the field and should be more difficult courses than courses at the 1-199 levels. ", "num_students": 30, "path": "/courses/20351/sections/001/reviews/645-ALAN-C--KORS", "instructor": {"path": "/instructors/645-ALAN-C--KORS", "first_name": "ALAN C.", "last_name": "KORS", "id": "645-ALAN-C--KORS", "name": "ALAN C. KORS"}, "num_reviewers": 26, "id": "20351-001-645-ALAN-C--KORS"}]