[{"ratings": {"rAmountLearned": "2.34", "rDifficulty": "1.57", "rStimulateInterest": "2.93", "rRecommendMajor": "3.46", "rCourseQuality": "2.61", "rWorkRequired": "1.36", "rInstructorAccess": "2.63", "rReadingsValue": "1.83", "rRecommendNonMajor": "2.88", "rCommAbility": "2.93", "rInstructorQuality": "3.10"}, "section": {"name": "INTRO ARCHAEOLOGY", "sectionnum": "001", "primary_alias": "ANTH-001-001", "path": "/courses/22606/sections/001", "id": "22606-001", "aliases": ["ANTH-001-001"]}, "comments": "This course is an introduction to the history, concepts, and methods of the anthropological study of ancient peoples. Throughout the course, archaeological illustrations are used to indicate the relationships of archaeological interpretations with cultural and physical anthropology. However, much of this course is directed at Paleolithic archaeology, and less on archaeology as a general field. There are two papers required for the course, as well as a field trip to the museum. \r\n\r\nThe general consensus of students was that this was an enjoyable course as an introduction to anthropology and to archaeology. Though many would have liked a broader range of material, many reported that the subject matter was not as dry as they suspected. Though multiple students did not know anything about archaeology going into the course, they came out knowing the “basic concepts, facts and ongoing debates” within the field. \r\n\r\nProfessor Dibble was described as “hilarious”, “captivating” and “entertaining.” Many students felt that his lectures were what made the course for them. They also said he was understanding about conflicts and grading and that the TAs were quite good as well. The only complaint was that Dibble went through lecture material very quickly and his lectures were based mostly on images, sometimes making the class hard to follow. \r\n\r\nExams were easy and the workload was not found to be particularly demanding. One student said that there was not much reading required for the course, but because of this, extra research was required for the papers. This course often is taken to satisfy the History and Tradition sector requirement.\r\n", "num_students": 76, "path": "/courses/22606/sections/001/reviews/85-HAROLD-LEWIS-DIBBLE", "instructor": {"path": "/instructors/85-HAROLD-LEWIS-DIBBLE", "first_name": "HAROLD LEWIS", "last_name": "DIBBLE", "id": "85-HAROLD-LEWIS-DIBBLE", "name": "HAROLD LEWIS DIBBLE"}, "num_reviewers": 71, "id": "22606-001-85-HAROLD-LEWIS-DIBBLE"}, {"ratings": {"rAmountLearned": "2.77", "rDifficulty": "2.68", "rStimulateInterest": "2.35", "rRecommendMajor": "3.12", "rCourseQuality": "2.53", "rWorkRequired": "2.52", "rInstructorAccess": "2.73", "rReadingsValue": "2.65", "rRecommendNonMajor": "2.27", "rCommAbility": "2.69", "rInstructorQuality": "2.67"}, "section": {"name": "INTRO TO ARCHAEOLOGY", "sectionnum": "601", "primary_alias": "ANTH-001-601", "path": "/courses/22606/sections/601", "id": "22606-601", "aliases": ["ANTH-001-601"]}, "comments": "This class is an introduction to the history, concepts, and methods of the anthropological study of early man using archaeological illustrations to indicate the relationships of archaeological interpretations with cultural and physical anthropology.\r\n\r\nSome students felt that the course was “heavily geared towards memorization.” One student complained that the structure of classes created a stressful environment, because Professor Possehl “flipped through the slides far too fast to copy and then comprehend the material.”\r\n\r\nStudents noted that Professor Possehl was “very interesting” and “passionate about the material,” praising his ability to “give life to the subject matter” through stories of his experience in the field.\r\n\r\nThe high expectations for memorization led one student to call this a “pretty difficult class.” Another felt that the pace and structure of the lectures “made the class a drag.” Others, however, claimed that the course surpassed their expectations, and were quick to recommend it to interested students. This review was based on the 6 student comments that were submitted.\r\n", "num_students": 31, "path": "/courses/22606/sections/601/reviews/1244-GREGORY-L-POSSEHL", "instructor": {"path": "/instructors/1244-GREGORY-L-POSSEHL", "first_name": "GREGORY L", "last_name": "POSSEHL", "id": "1244-GREGORY-L-POSSEHL", "name": "GREGORY L POSSEHL"}, "num_reviewers": 30, "id": "22606-601-1244-GREGORY-L-POSSEHL"}]