{"coursehistories": {"path": "/coursehistories/4556"}, "description": "This course is designed to introduce students to econometric techniques and their applications in economic analysis and decision-making. The main objective of the course is to train the student in (i) handling economic data; (ii) quantitative analyses of economic models with probabilistic tools; (iii) econometric techniques, their application as well as their statistical and practical interpretation; (iv) implementing these techniques on a computer. Estimation and inference procedures are formally analyzed for simple econometric models and illustrated by empirical case studies using real-life data. The course covers linear regression models, simultaneous-equations models, discrete choice models and univariate time series models. Estimation and Inference is conducted using least squares and likelihood based techniques. Students are required to perform several econometric analyses of their own. \n\n", "semester": "2012A", "name": "ECONOMETRICS", "reviews": {"path": "/courses/27265/reviews", "values": [{"ratings": {"rAmountLearned": "2.27", "rDifficulty": "2.65", "rStimulateInterest": "1.74", "rRecommendMajor": "3.08", "rCourseQuality": "1.98", "rWorkRequired": "2.36", "rInstructorAccess": "2.94", "rReadingsValue": "2.29", "rRecommendNonMajor": "1.15", "rCommAbility": "2.23", "rInstructorQuality": "2.24"}, "section": {"name": "ECONOMETRICS", "sectionnum": "001", "primary_alias": "ECON-104-001", "path": "/courses/27265/sections/001", "id": "27265-001", "aliases": ["ECON-104-001"]}, "comments": "This course is designed to introduce students to econometric techniques and their applications in economic analysis and decision-making. The main objective of the course is to train the student in (i) handling economic data; (ii) quantitative analyses of economic models with probabilistic tools; (iii) econometric techniques, their application as well as their statistical and practical interpretation; (iv) implementing these techniques on a computer. Prerequisites are ECON 101, 103, MATH 104 and MATH 114 or MATH 115 or permission from instructor.\r\n\tThe course concepts are \"helpful in understanding how statistics and mathematics integrate with economic research.\"  However, while some students found that the material was \"useful,\" many students also found it to be \"dull.\"  \r\n\tThe majority of students praised Cheng as a \"very clear lecturer\" and \"really approachable.\"  Her lectures were \"well-organized\" and students appreciated that she posted her lecture slides on Blackboard. While a majority of students did not enjoy the material, they almost all praised Professor Cheng for making it as enjoyable as possible. \r\n\tStudents warned that because test averages were very high in this course, small mistakes could have a big influence on grades. Students found the class to be rather difficult for this reason. ", "num_students": 102, "path": "/courses/27265/sections/001/reviews/4783-XU-CHENG", "instructor": {"path": "/instructors/4783-XU-CHENG", "first_name": "XU", "last_name": "CHENG", "id": "4783-XU-CHENG", "name": "XU CHENG"}, "num_reviewers": 89, "id": "27265-001-4783-XU-CHENG"}]}, "credits": null, "primary_alias": "ECON-104", "path": "/courses/27265", "sections": {"path": "/courses/27265/sections", "values": [{"name": "ECONOMETRICS", "sectionnum": "001", "primary_alias": "ECON-104-001", "path": "/courses/27265/sections/001", "id": "27265-001", "aliases": ["ECON-104-001"]}]}, "id": 27265, "aliases": ["ECON-104"]}