{"coursehistories": {"path": "/coursehistories/3318"}, "description": "This topic course explores aspects of Film Practice intensively. Specific course topics vary from year to year. See the Cinema Studies website at <http://cinemastudies.sas.upenn.edu/> for a description of the current offerings. \n\n", "semester": "2009A", "name": "TOPICS IN FILM PRACTICE: CINEMA OF THE BALKANS", "reviews": {"path": "/courses/15491/reviews", "values": [{"ratings": {"rAmountLearned": "3.41", "rDifficulty": "2.06", "rStimulateInterest": "3.59", "rRecommendMajor": "3.76", "rCourseQuality": "3.59", "rWorkRequired": "2.18", "rInstructorAccess": "3.76", "rReadingsValue": "3.18", "rRecommendNonMajor": "3.12", "rCommAbility": "3.71", "rInstructorQuality": "3.82"}, "section": {"name": "TOPICS IN FILM PRACTICE: CINEMA OF THE BALKANS", "sectionnum": "402", "primary_alias": "CINE-202-402", "path": "/courses/15491/sections/402", "id": "15491-402", "aliases": ["CINE-202-402", "ENGL-292-402"]}, "comments": "This course will be a study of Balkan cinema, with a focus on a wide range of films that were made in response to the 1990s crisis in the Balkans. While the Balkans may be familiar as one of Hollywood’s favorite fantasy nightmares—the bloodthirsty Transylvanian count and vampire, Vlad Tepes-Dracula, or Cat People’s horrific historical Serbs who morphed into ferocious black panthers now living in the heart of Manhattan—Balkan cinema is an often overlooked but one of the richest and most significant cinemas of Europe today. While tracing the history of Balkan cinema, the main focus of the course will be on films made during and after the Balkan war in the 1990s, by filmmakers such as Milcho Manchevski, EmirKusturica, Srdjan Dragojevic, Goran Peskaljevic, and Danis Tanovic. These directors achieved great success in their native countries as well as abroad, and started appearing regularly at all major international film festivals. As such they not only mark a significant moment in thinking about the nation but show how a nation has come to depend on the persuasive power of cinema to articulate itself. As we recognize the difficulties in asserting Balkan culture as a unified one, the aim of the course will be to explore an astonishing thematic and stylistic consistency in the cinematic output of the Balkan region. Looking at these shared issues—the turbulent history and volatile politics, a semi-Orientalist positioning sometimes seen as marginality and sometimes as a bridge between East and West, encounters between Christianity and Islam, a legacy of patriarchy and economic dependency--we will examine how cinema of the Balkans testifies to a specific artistic sensibility that comes from a shared socio-cultural space.&#8232;&#8232;\r\n\r\nThis course incorporates readings on Balkan history with “analysis of the films, their impact, and how to understand them from the shoes of both a Balkanite and a resident of the world.” Students found that the “supplemental readings to the one required textbook illuminated the topics discussed in class.” They appreciated the “interdisciplinary nature of the readings” and the “amazing” Balkan films on the syllabus, most of which they admit they would not have seen had it not been for the course.&#8232;&#8232;\r\n\r\nStudents universally praised Professor Mazaj for her “organization,” “enthusiasm,” and “immense knowledge of film theory and history.” One student was “most impressed with Dr. Mazaj’s creating of the perfect course ‘arc’” in which “she started out with students who knew nothing about the region and accumulatively taught them more and more about the region and its art form” to the point “students were consistently engaged throughout the class.” Another student noted how Professor Mazaj’s teaching ability consistently “translated into stimulating discussions” and how her comprehensive knowledge was well transferred to her class.&#8232;", "num_students": 18, "path": "/courses/15491/sections/402/reviews/3224-META-MAZAJ", "instructor": {"path": "/instructors/3224-META-MAZAJ", "first_name": "META", "last_name": "MAZAJ", "id": "3224-META-MAZAJ", "name": "META MAZAJ"}, "num_reviewers": 17, "id": "15491-402-3224-META-MAZAJ"}]}, "credits": null, "primary_alias": "CINE-202", "path": "/courses/15491", "sections": {"path": "/courses/15491/sections", "values": [{"name": "TOPICS IN FILM PRACTICE: CINEMA OF THE BALKANS", "sectionnum": "402", "primary_alias": "CINE-202-402", "path": "/courses/15491/sections/402", "id": "15491-402", "aliases": ["CINE-202-402", "ENGL-292-402"]}]}, "id": 15491, "aliases": ["CINE-202", "ENGL-292"]}