{"coursehistories": {"path": "/coursehistories/577"}, "description": "From an empire to a republic, from communism to socialist-style capitalism, few countries have ever witnessed so much change in a hundred year period as China during the twentieth century. How are we to make sense out of this seeming chaos? This course will offer an overview of the upheavals that China has experienced from the late Qing to the Post-Mao era, interspersed with personal perspectives revealed in primary source readings such as memoirs, novels, and oral accounts. We will start with an analysis of the painful transition from the last empire, the Qing Dynasty (1644-1911), to a modern nation state, followed by exploration of a century-long tale of incessant reform and revolution. The survey will focus on three main themes: 1) the repositioning of China in the new East Asian and world orders; 2) the emergence of a modern Chinese state and nationalistic identity shaped and reshaped by a series of cultural crises; and finally, 3) the development and transformation of Chinese modernity. \n\nMajor historical developments include: the Opium War and drug trade in the age of imperialism, reform and revolution, the Nationalist regime, Mao's China, the Cultural Revolution, and the ongoing efforts of post-Mao China to move beyond Communism. We will conclude with a critical review of the concept of \"Greater China\" that takes into account Taiwan, Hong Kong, and the Chinese diaspora in order to attain a more comprehensive understanding of modern China, however defined, at the end of the last century. \n\n", "semester": "2003A", "name": "LECTURE", "reviews": {"path": "/courses/1749/reviews", "values": [{"ratings": {"rAmountLearned": "3.05", "rDifficulty": "1.93", "rStimulateInterest": "3.53", "rRecommendMajor": "3.58", "rCourseQuality": "3.28", "rWorkRequired": "1.72", "rInstructorAccess": "3.53", "rReadingsValue": "2.95", "rRecommendNonMajor": "3.33", "rCommAbility": "3.51", "rInstructorQuality": "3.60"}, "section": {"name": "LECTURE", "sectionnum": "401", "primary_alias": "HIST-097-401", "path": "/courses/1749/sections/401", "id": "1749-401", "aliases": ["HIST-097-401", "AMES-089-401"]}, "comments": "", "num_students": 64, "path": "/courses/1749/sections/401/reviews/1496-YANGWEN-ZHENG", "instructor": {"path": "/instructors/1496-YANGWEN-ZHENG", "first_name": "YANGWEN", "last_name": "ZHENG", "id": "1496-YANGWEN-ZHENG", "name": "YANGWEN ZHENG"}, "num_reviewers": 44, "id": "1749-401-1496-YANGWEN-ZHENG"}]}, "credits": null, "primary_alias": "HIST-097", "path": "/courses/1749", "sections": {"path": "/courses/1749/sections", "values": [{"name": "LECTURE", "sectionnum": "401", "primary_alias": "HIST-097-401", "path": "/courses/1749/sections/401", "id": "1749-401", "aliases": ["HIST-097-401", "AMES-089-401"]}]}, "id": 1749, "aliases": ["HIST-097", "AMES-089"]}