{"coursehistories": {"path": "/coursehistories/893"}, "description": "An introduction to the classical laws of motion requiring a background in calculus. Suggested for students in a pre-health program. \n\n", "semester": "2009A", "name": "CLASSICAL PHYSICS", "reviews": {"path": "/courses/16315/reviews", "values": [{"ratings": {"rAmountLearned": "2.70", "rDifficulty": "3.25", "rStimulateInterest": "3.05", "rRecommendMajor": "3.25", "rCourseQuality": "2.36", "rWorkRequired": "3.03", "rInstructorAccess": "2.68", "rReadingsValue": "2.23", "rRecommendNonMajor": "1.28", "rCommAbility": "3.03", "rInstructorQuality": "3.06"}, "section": {"name": "CLASSICAL PHYSICS", "sectionnum": "001", "primary_alias": "PHYS-101-001", "path": "/courses/16315/sections/001", "id": "16315-001", "aliases": ["PHYS-101-001"]}, "comments": "This course, which fulfills the Physical World requirement, is an introductory course to the classical laws of motion. Prerequisites are entrance credits in algebra and trigonometry, as well as a background in calculus. It must be taken with the Phys-101 lab. This course is a prerequisite for Physics 102, and is suggested for pre-health students.\r\n\r\nThe course generally covers kinematics, Newton’s laws of motion, momentum, rotational motion, fluids, vibrations, and sound. Students didn’t have much to say about the course content, though one described it as “good for an intro course.”\r\n\r\nStudents described Professor Klein as “great,” “superb,” and “amazing.” As one student wrote, Klein “is quite stimulating and makes the lectures something to look forward to.” Several students commented on Klein’s interactive teaching style, which encouraged class participation even in the large lecture. Students felt that Klein made the difficult topics “easy to understand” and that he was very accessible for help before exams.\r\n\r\nStudents’ one complaint was exam difficulty. Exams were multiple-choice, non-calculator, and without partial credit, so “a simple mistake could have meant the difference between getting a good grade and failing.” There also was no curve applied, and “test averages were around 70.”", "num_students": 72, "path": "/courses/16315/sections/001/reviews/149-JOSHUA-R--KLEIN", "instructor": {"path": "/instructors/149-JOSHUA-R--KLEIN", "first_name": "JOSHUA R.", "last_name": "KLEIN", "id": "149-JOSHUA-R--KLEIN", "name": "JOSHUA R. KLEIN"}, "num_reviewers": 66, "id": "16315-001-149-JOSHUA-R--KLEIN"}]}, "credits": null, "primary_alias": "PHYS-101", "path": "/courses/16315", "sections": {"path": "/courses/16315/sections", "values": [{"name": "CLASSICAL PHYSICS", "sectionnum": "001", "primary_alias": "PHYS-101-001", "path": "/courses/16315/sections/001", "id": "16315-001", "aliases": ["PHYS-101-001"]}]}, "id": 16315, "aliases": ["PHYS-101"]}