[{"ratings": {"rAmountLearned": "2.41", "rDifficulty": "2.56", "rStimulateInterest": "2.31", "rRecommendMajor": "3.28", "rCourseQuality": "2.31", "rWorkRequired": "2.22", "rInstructorAccess": "3.19", "rReadingsValue": "2.23", "rRecommendNonMajor": "2.09", "rCommAbility": "2.56", "rInstructorQuality": "2.86"}, "section": {"name": "INTRO TO FORMAL LING", "sectionnum": "001", "primary_alias": "LING-106-001", "path": "/courses/17613/sections/001", "id": "17613-001", "aliases": ["LING-106-001"]}, "comments": "This course is intended as an introduction to the application of formal language theory, automata theory, and other computational models to the understanding of natural human language. Topics include regular languages and finite state automata; context-free languages and pushdown automata; recursive transition networks; augmented transition networks; tree-adjoining grammars.&#8232;&#8232;\r\n\r\nDespite the challenging nature of this course, students expressed having learned a lot in this “incredible” and “fascinating” class. Students credited its difficulty to being caught off guard by how much math and logic would be required of them to know and understand.&#8232;&#8232;\r\n\r\nOverall, students had nothing but positive remarks to say about Professor Schwarz, calling him “wonderful,” “brilliant,” and “able to communicate some very difficult concepts.” Students also appreciated his grading policy, which consisted of a large portion of the grades being based on homework, and a significantly less portion designated to the midterm and final.&#8232;&#8232;\r\n\r\nBecause of the aforementioned grading policy, students said that sometimes homework assignments were more stressful than they desired. Also, students found the recitation unnecessary for a class that also consisted of two hour-and-a-half lectures per week. \r\n", "num_students": 38, "path": "/courses/17613/sections/001/reviews/4866-FLORIAN-SCHWARZ", "instructor": {"path": "/instructors/4866-FLORIAN-SCHWARZ", "first_name": "FLORIAN", "last_name": "SCHWARZ", "id": "4866-FLORIAN-SCHWARZ", "name": "FLORIAN SCHWARZ"}, "num_reviewers": 37, "id": "17613-001-4866-FLORIAN-SCHWARZ"}]