{"coursehistories": {"path": "/coursehistories/3273"}, "description": "In this class, you will conduct an in-depth exploration of memory and narrative in America. We will approach our topic through the lens of a fundamental American genre: the captivity narrative. The most popular story form of Colonial times, captivity narratives still remain vital in America. In the genre's most typical case, a captive from a majority goup is kidnapped and taken on a journey by members of a minority group, reporting on the ordeal until she or he is rescued, killed or adopted into the captors' world. The most widely-read form of the genre, however -- in which a white person is kidnapped by Native Americans -- often obscures other stories, in which Native Americans were kidnapped by Europeans. In this class, captivity narratives will help us, first, to think about how one kind of story becomes a tradition. Next, we will look at American captivity narratives from many eras ad they appear in non-fiction, fiction, film and the news -- from UFO abduction narratives, to stories of incarceration, to media items such as kidnappings in Iraq. We will explore the metaphors and material practices of \"freedom\" and \"being caught\" in America, and analyze the ways in which people make meaning of the travel and contact between worlds. \n\nWe will also ask questions that transcend the genre itself to think about problems raised by seemingly self-evident personal narratives. What is the role of fantasy and the uncanny in stories of American life? How do stories create fields of social meaning? Why are the themes of \"captivity\" and \"release\" central in so many different kinds of American imagination? Making use of anthropology, literature, psychoanalysis and film studies, the course will approach and explore various ideas of social containment and freedom, and the narrative expressions of power, desire, and trauma in America. \n\n", "semester": "2006C", "name": "American Narrative Cultures: Captivity & Release", "reviews": {"path": "/courses/8495/reviews", "values": [{"ratings": {"rAmountLearned": "3.33", "rDifficulty": "2.22", "rStimulateInterest": "3.33", "rRecommendMajor": "3.44", "rCourseQuality": "3.22", "rWorkRequired": "2.56", "rInstructorAccess": "3.67", "rReadingsValue": "3.00", "rRecommendNonMajor": "3.22", "rCommAbility": "3.67", "rInstructorQuality": "3.89"}, "section": {"name": "American Narrative Cultures: Captivity & Release", "sectionnum": "301", "primary_alias": "ANTH-062-301", "path": "/courses/8495/sections/301", "id": "8495-301", "aliases": ["ANTH-062-301"]}, "comments": "In general, reviewers were in favor of Professor Lepselter’s teaching style and reading material. They commented on her success in stimulating students’ interest throughout the course and displaying her knowledge of the material.", "num_students": 9, "path": "/courses/8495/sections/301/reviews/3214-SUSAN-C-LEPSELTER", "instructor": {"path": "/instructors/3214-SUSAN-C-LEPSELTER", "first_name": "SUSAN C", "last_name": "LEPSELTER", "id": "3214-SUSAN-C-LEPSELTER", "name": "SUSAN C LEPSELTER"}, "num_reviewers": 9, "id": "8495-301-3214-SUSAN-C-LEPSELTER"}]}, "credits": null, "primary_alias": "ANTH-062", "path": "/courses/8495", "sections": {"path": "/courses/8495/sections", "values": [{"name": "American Narrative Cultures: Captivity & Release", "sectionnum": "301", "primary_alias": "ANTH-062-301", "path": "/courses/8495/sections/301", "id": "8495-301", "aliases": ["ANTH-062-301"]}]}, "id": 8495, "aliases": ["ANTH-062"]}