[{"ratings": {"rAmountLearned": "3.75", "rDifficulty": "2.80", "rStimulateInterest": "3.48", "rRecommendMajor": "3.84", "rCourseQuality": "3.71", "rWorkRequired": "3.36", "rInstructorAccess": "3.71", "rReadingsValue": "3.36", "rRecommendNonMajor": "3.64", "rCommAbility": "3.40", "rInstructorQuality": "3.36"}, "section": {"name": "INDEPENDENT STUDY: GLOBAL SUPPLY CHAIN MANAGEMENT IN CHINA", "sectionnum": "401", "primary_alias": "OPIM-899-401", "path": "/courses/27976/sections/401", "id": "27976-401", "aliases": ["OPIM-899-401"]}, "comments": "OPIM 899 will focus on operations strategy for supply chains that begin or end in China. More information can be found through advising about the course offering each semester.\r\nStudents called this course a “phenomenal” course that is among “the best courses” they have taken at Wharton. The class gave students a great opportunity to learn about business and “companies in China” and that it provides a “once in a lifetime opportunity.” The course integrates concepts across disciplines, “Finance, OPIM, Management, and Legal Studies,” “using both the market and non-market environmental impacts that affect doing business in China.” One student mentioned that the course was great and would have appreciated a longer meeting time.\r\nStudent reviews focused on the course, but students had mainly positive reviews for the course professors. Students praised the efforts that the Professor Fisher went to “create unique experiences” for each person. A few students went on to mention how it was clear that the class was positively shaped by Professor Fisher’s “industry connections.”\r\nFrom the reviews, students would recommend this course to peers. One review specifies that “anyone with an interest in China or supply chains should not think twice about signing up.”", "num_students": 42, "path": "/courses/27976/sections/401/reviews/4955-MARSHALL-L--FISHER", "instructor": {"path": "/instructors/4955-MARSHALL-L--FISHER", "first_name": "MARSHALL L.", "last_name": "FISHER", "id": "4955-MARSHALL-L--FISHER", "name": "MARSHALL L. FISHER"}, "num_reviewers": 28, "id": "27976-401-4955-MARSHALL-L--FISHER"}]