[{"ratings": {"rAmountLearned": "2.46", "rDifficulty": "3.11", "rStimulateInterest": "2.67", "rRecommendMajor": "3.07", "rCourseQuality": "2.74", "rWorkRequired": "2.85", "rInstructorAccess": "3.48", "rReadingsValue": "2.52", "rRecommendNonMajor": "1.56", "rCommAbility": "3.08", "rInstructorQuality": "3.15"}, "section": {"name": "LINEAR SYSTEMS THEORY", "sectionnum": "001", "primary_alias": "ESE-500-001", "path": "/courses/18645/sections/001", "id": "18645-001", "aliases": ["ESE-500-001"]}, "comments": "ESE 500 focuses primarily on linear systems theory in time domain based on linear operators. First, the fundamental mathematics of linear spaces and linear operator theory are introduced. Next, the course focuses on concepts of stability, controllability, and observability.\r\n\r\nGenerally, students found the content of the class to be enjoyable. Many found the material to be extremely useful and “great” to learn. Homework assignments were excellent but “very difficult” and required a lot of time. Some complained that the course could have included more examples and a greater focus on concepts rather than formulas. The textbook was also described as “poor.”\r\n\r\nProfessor Kothmann received great praise from his students. He was described as “extremely helpful” and very willing to meet outside of class to discuss problems. Many students enjoyed his teaching style. One student explained that his “dynamic teaching style” is “highly engaging.”\r\n\r\nThe gradate level course is designed for advanced undergraduates and graduate students with a strong background in linear algebra and differential equations. Overall, the course was described as “very difficult” in general and “extremely challenging” for undergraduates.", "num_students": 28, "path": "/courses/18645/sections/001/reviews/3294-BRUCE-D--KOTHMANN", "instructor": {"path": "/instructors/3294-BRUCE-D--KOTHMANN", "first_name": "BRUCE D.", "last_name": "KOTHMANN", "id": "3294-BRUCE-D--KOTHMANN", "name": "BRUCE D. KOTHMANN"}, "num_reviewers": 27, "id": "18645-001-3294-BRUCE-D--KOTHMANN"}]