{"coursehistories": {"path": "/coursehistories/2746"}, "description": "This course explores the transition from discovery of fundamental knowledge to its ultimate application in a clinical device or drug. Emphasis is placed upon factors that influence this transition and upon the integrative requirements across many fields necessary to achieve commercial success. Special emphasis is placed on entrepreneurial strategies, intellectual property, financing and the FDA process of proving safety and efficacy. Current public companies in the medical device and drug industry are studies in detail and critiqued against principles developed in class. \n\n", "semester": "2012A", "name": "FROM LAB TO MKT PLACE", "reviews": {"path": "/courses/27019/reviews", "values": [{"ratings": {"rAmountLearned": "1.67", "rDifficulty": "1.76", "rStimulateInterest": "1.27", "rRecommendMajor": "1.89", "rCourseQuality": "1.56", "rWorkRequired": "2.33", "rInstructorAccess": "2.25", "rReadingsValue": "1.73", "rRecommendNonMajor": "1.48", "rCommAbility": "1.49", "rInstructorQuality": "1.67"}, "section": {"name": "FROM LAB TO MKT PLACE", "sectionnum": "001", "primary_alias": "BE-502-001", "path": "/courses/27019/sections/001", "id": "27019-001", "aliases": ["BE-502-001"]}, "comments": "This course explores the transition from discovery of fundamental knowledge to its ultimate application in a clinical device or drug. Emphasis is placed upon factors that influence this transition and upon the integrative requirements across many fields necessary to achieve commercial success. Special emphasis is placed on entrepreneurial strategies, intellectual property, financing and the FDA process of proving safety and efficacy. Current public companies in the medical device and drug industry are studied in detail and critiqued against principles developed in class.\r\n\r\nOne student found the course to be “great.” However, students overall felt the course “had a lot of potential” and could have been “better organized.”\r\n\r\nStudents felt that the professor gave “good feedback on project material,” but lectures didn’t go “into enough detail.”\r\n\r\nOne student felt that overall “the team you are in really matters,” while another student felt that “prior knowledge” were important in determining course difficulty and workload.\r\n", "num_students": 51, "path": "/courses/27019/sections/001/reviews/1798-PAUL-L-R--DUCHEYNE", "instructor": {"path": "/instructors/1798-PAUL-L-R--DUCHEYNE", "first_name": "PAUL L.R.", "last_name": "DUCHEYNE", "id": "1798-PAUL-L-R--DUCHEYNE", "name": "PAUL L.R. DUCHEYNE"}, "num_reviewers": 49, "id": "27019-001-1798-PAUL-L-R--DUCHEYNE"}]}, "credits": null, "primary_alias": "BE-502", "path": "/courses/27019", "sections": {"path": "/courses/27019/sections", "values": [{"name": "FROM LAB TO MKT PLACE", "sectionnum": "001", "primary_alias": "BE-502-001", "path": "/courses/27019/sections/001", "id": "27019-001", "aliases": ["BE-502-001"]}]}, "id": 27019, "aliases": ["BE-502"]}