[{"ratings": {"rAmountLearned": "1.80", "rDifficulty": "1.77", "rStimulateInterest": "1.34", "rRecommendMajor": "2.13", "rCourseQuality": "1.67", "rWorkRequired": "1.89", "rInstructorAccess": "3.06", "rReadingsValue": "2.13", "rRecommendNonMajor": "1.51", "rCommAbility": "2.00", "rInstructorQuality": "2.08"}, "section": {"name": "COLONIAL LATIN AMERICA", "sectionnum": "401", "primary_alias": "HIST-070-401", "path": "/courses/23203/sections/401", "id": "23203-401", "aliases": ["HIST-070-401", "LALS-070-401", "AFRC-070-401"]}, "comments": "This course covers the development of Latin America from pre-Columbian times to 1850. Emphasis is on the interaction between European, Indian, and African elements in colonial society, the growth of national consciousness, and the related phenomena of political instability and economic underdevelopment. &#8232;\r\n\r\nStudents found the seminar-like format of the course unsuitable for a 75-person lecture. Discussions were hard in the class, and students would have preferred more of a lecture-based course. But overall, students commented that the material covered in class was interesting. They also appreciated the fact that the class, although more of a survey course, addressed topics in more depth.&#8232;\r\n\r\nStudents agreed that Professor Walker was very \"knowledgeable about the subject matter\" and that \"her passion for the subject was apparent in class,\" making the course \"a more enriching experience.\" However, due to the unfortunate class structure, she was \"not as engaging as she could have been.\"&#8232;&#8232;\r\n\r\nThis course fulfills the History and Tradition general requirement. Although there are many readings assigned, the course grade depends mostly on the essays and final assignments. Students recommended this course to anyone looking to fulfill a history requirement and to history majors.\r\n", "num_students": 65, "path": "/courses/23203/sections/401/reviews/3987-TAMARA-J--WALKER", "instructor": {"path": "/instructors/3987-TAMARA-J--WALKER", "first_name": "TAMARA J.", "last_name": "WALKER", "id": "3987-TAMARA-J--WALKER", "name": "TAMARA J. WALKER"}, "num_reviewers": 56, "id": "23203-401-3987-TAMARA-J--WALKER"}]