{"coursehistories": {"path": "/coursehistories/3031"}, "description": "This course examines how the criminal justice system responds to crime in society. The course reviews the historical development of criminal justice agencies in the United States and Europe and the available scientific evidence on the effect these agencies have on controlling crime. The course places an emphasis onthe functional creation of criminal justice agencies and the discretionary role decision makers in these agencies have in deciding how to enforce criminal laws and whom to punish. Evidence on how society measures crime and the role that each major criminal justice agency plays in controlling crime is examined from the perspective of crime victims, police, prosecutors, jurors, judges, prison officials, probation officers and parole board members. Using the model of social policy evaluation, the course asks students to consider how the results of criminal justice could be more effectively delivered to reduce the social and economic costs of crime. \n\n", "semester": "2008A", "name": "CRIMINAL JUSTICE", "reviews": {"path": "/courses/19981/reviews", "values": [{"ratings": {"rAmountLearned": "2.91", "rDifficulty": "1.56", "rStimulateInterest": "3.10", "rRecommendMajor": "3.62", "rCourseQuality": "3.04", "rWorkRequired": "1.51", "rInstructorAccess": "3.41", "rReadingsValue": "2.06", "rRecommendNonMajor": "3.44", "rCommAbility": "3.47", "rInstructorQuality": "3.44"}, "section": {"name": "CRIMINAL JUSTICE", "sectionnum": "401", "primary_alias": "CRIM-200-401", "path": "/courses/19981/sections/401", "id": "19981-401", "aliases": ["CRIM-200-401", "SOCI-200-401"]}, "comments": "This course examines the causes and consequences of the millions of decisions made annually by the legally empowered decision-makers of the criminal justice system. The course places students in the role of one decision-maker after another, emphasizing the decisions they would make with all the scientific research on these decisions at their disposal. Research on 15 different decision-makers is examined, from crime victims to police, prosecutors, jurors, judges, wardens, probation and parole officers. Using a medical model of evidence-based practice, the course asks students to consider how the results of criminal justice could more effectively reduce the sum of human misery.\r\n\r\nStudents overwhelmingly enjoyed this class and found it to be both interesting and fun. Some did find that there was little incentive to go to class. However, most who attended found the information presented in lecture to be stimulating and relevant.\r\n\r\nStudents praised Professor MacDonald’s teaching style and most felt that the lectures were easy to follow, interesting and lively. One student claimed, “MacDonald is by far one of the best professors I have had at Penn. He truly understands how to stimulate and foster interest in his students.” Many cited his humor and enthusiasm and integration of current events as reasons why other students should take this class. Students also appreciated how Professor MacDonald was “excellent at providing real life examples to supplement material.” \r\n\r\nThis class fulfills the Society Sector requirement and has no prerequisites. Most students did not think that there was much of a workload associated with this class and recommended it to both major and non-major students. Some did, however, feel that the textbook readings were dry and unnecessary.", "num_students": 145, "path": "/courses/19981/sections/401/reviews/4292-JOHN-M--MACDONALD", "instructor": {"path": "/instructors/4292-JOHN-M--MACDONALD", "first_name": "JOHN M.", "last_name": "MACDONALD", "id": "4292-JOHN-M--MACDONALD", "name": "JOHN M. MACDONALD"}, "num_reviewers": 90, "id": "19981-401-4292-JOHN-M--MACDONALD"}]}, "credits": null, "primary_alias": "CRIM-200", "path": "/courses/19981", "sections": {"path": "/courses/19981/sections", "values": [{"name": "CRIMINAL JUSTICE", "sectionnum": "401", "primary_alias": "CRIM-200-401", "path": "/courses/19981/sections/401", "id": "19981-401", "aliases": ["CRIM-200-401", "SOCI-200-401"]}]}, "id": 19981, "aliases": ["CRIM-200", "SOCI-200"]}