[{"ratings": {"rAmountLearned": "2.63", "rDifficulty": "2.28", "rStimulateInterest": "2.81", "rRecommendMajor": "3.27", "rCourseQuality": "2.53", "rWorkRequired": "1.74", "rInstructorAccess": "3.08", "rReadingsValue": "2.36", "rRecommendNonMajor": "2.53", "rCommAbility": "2.72", "rInstructorQuality": "2.94"}, "section": {"name": "INTRO TO HUMAN EVOLUTION", "sectionnum": "001", "primary_alias": "ANTH-003-001", "path": "/courses/15305/sections/001", "id": "15305-001", "aliases": ["ANTH-003-001"]}, "comments": "This course focuses on the scientific study of human evolution describing the emergence, development, and diversification of Homo sapiens. The course begins by covering the fundamental principles of evolutionary theory and some of the basics of genetics and heredity as they relate to human morphological, physiological, and genetic variation. It also examines what studies of nonhuman primates (monkeys and apes) can reveal about our own evolutionary past, reviewing the behavioral and ecological diversity seen among living primates. The course concludes by examining the \\\"hard\\\" evidence of human evolution.\r\nThis sector requirement course was described as “an excellent overview of anatomical evolution from greater apes to humans.” Some students complained that it “focused too much on paleontology and fossil evidence and not enough on the theory of evolution,” but also said that it would able to appeal to all types of students. Students enjoyed the field trip required saying it was “very helpful in explaining the course material from a different point of view.” One of the most prevalent complaints was that recitations were unorganized and poorly run. Several people also commented that the lecture slides were confusing and not useful.\r\nStudents liked Professor Fernandez-Duque saying he presented complicated information in a way that was interesting and easily understood. One student described him as “a great professor who understands the academic pressure students face.”\r\nThis course fills a Living World sector requirement. There are two midterms and one final exam. Most people agreed that the exam questions were very specific. “I spent hours and hours studying but still found the multiple choice questions difficult,” said one student.", "num_students": 135, "path": "/courses/15305/sections/001/reviews/2848-EDUARDO-FERNANDEZ-DUQUE", "instructor": {"path": "/instructors/2848-EDUARDO-FERNANDEZ-DUQUE", "first_name": "EDUARDO", "last_name": "FERNANDEZ-DUQUE", "id": "2848-EDUARDO-FERNANDEZ-DUQUE", "name": "EDUARDO FERNANDEZ-DUQUE"}, "num_reviewers": 126, "id": "15305-001-2848-EDUARDO-FERNANDEZ-DUQUE"}, {"ratings": {"rAmountLearned": "2.88", "rDifficulty": "2.60", "rStimulateInterest": "3.19", "rRecommendMajor": "3.35", "rCourseQuality": "2.92", "rWorkRequired": "1.96", "rInstructorAccess": "3.16", "rReadingsValue": "3.00", "rRecommendNonMajor": "2.85", "rCommAbility": "3.42", "rInstructorQuality": "3.31"}, "section": {"name": "INTRO HUMAN EVOLUTION", "sectionnum": "601", "primary_alias": "ANTH-003-601", "path": "/courses/15305/sections/601", "id": "15305-601", "aliases": ["ANTH-003-601"]}, "comments": "This course focuses on the scientific study of human evolution describing the emergence,\r\ndevelopment, and diversification of our species, Homo sapiens. The class first covers the fundamental principles of evolutionary theory and some of the basics of genetics and heredity as they relate to human morphological, physiological, and genetic variation. It then examines what studies of nonhuman primates (monkeys and apes) can reveal about our own evolutionary past by reviewing the behavioral and ecological diversity seen among living primates. The end of the course focuses on the \"hard\" evidence of human evolution—the fossil and material culture record of human history from our earliest primate ancestors to the emergence of modern Homo sapiens. Student also have the opportunity, during recitations, to conduct hands-on exercises collecting and analyzing behavioral, morphological, and genetic data on both humans and nonhuman primates and working with the Department of Anthropology's extensive collection of fossil casts.\r\n\r\nOverall, students found this class very interesting and enjoyed learning about aspects of evolution that they had never heard of before Many described the class as “instructive” and “hands on,” but some felt that the research paper and exams did not adequately asses their knowledge of the subject matter.\r\n\r\nProfessor Renschler was described as well prepared and enthusiastic and was given an “A+ in her teaching ability.”\r\n\r\nAlmost everyone felt the course load was appropriate and but one felt that the 3 hour session was too long and would have been better as two 1.5 hour sessions.", "num_students": 27, "path": "/courses/15305/sections/601/reviews/3525-EMILY-RENSCHLER", "instructor": {"path": "/instructors/3525-EMILY-RENSCHLER", "first_name": "EMILY", "last_name": "RENSCHLER", "id": "3525-EMILY-RENSCHLER", "name": "EMILY RENSCHLER"}, "num_reviewers": 27, "id": "15305-601-3525-EMILY-RENSCHLER"}]