[{"ratings": {"rAmountLearned": "3.05", "rDifficulty": "2.59", "rStimulateInterest": "3.13", "rRecommendMajor": "3.24", "rCourseQuality": "3.06", "rWorkRequired": "2.13", "rInstructorAccess": "3.03", "rReadingsValue": "2.78", "rRecommendNonMajor": "2.70", "rCommAbility": "3.03", "rInstructorQuality": "3.23"}, "section": {"name": "EVOLUTIONARY PSYCHOLOGY", "sectionnum": "001", "primary_alias": "PSYC-172-001", "path": "/courses/26694/sections/001", "id": "26694-001", "aliases": ["PSYC-172-001"]}, "comments": "The goal of this course is to introduce students to the field of Evolutionary Psychology, which is an approach to the study of human behavior, drawing on Darwin's theory of evolution by natural selection to understand the design of the human mind. The course will look at the theoretical underpinnings of the field, and sample some of the recent contributions to this growing area. It will cover areas ranging from reasoning to relationships to culture.\r\n\r\nStudents overwhelmingly liked the course, describing it as “wonderful,” “strongly recommended,” and “one of the best at Penn.” The material was reportedly very interesting, but often difficult to grasp and theoretical in nature. Students praised how the material was unlike any other PSYC class and taught new ways of thinking.\r\n\r\nAs a whole, students loved Professor Kurzban, describing him as a truly excellent professor. In particular, they lauded his “entertaining” lecture style that was spiced up by his “great sense of humor.” Students also were impressed with Kurzban’s knowledge and willingness to meet with students for help. However, one student did complain that the professor wouldn’t discuss the grading of essays on tests with the students.\r\n\r\nStudents seemed to regard the class as quite difficult, reporting that the multiple-choice exams were “tricky.” One student relates that “the exam questions were fairly difficult but the ability to drop one of the three midterms is appreciated.” One student complained of a “ton of reading” in the beginning of the semester, suggesting that it be cut down. This class is open to all students and has PSYC-001 as a prerequisite. ", "num_students": 76, "path": "/courses/26694/sections/001/reviews/1946-ROBERT-O--KURZBAN", "instructor": {"path": "/instructors/1946-ROBERT-O--KURZBAN", "first_name": "ROBERT O.", "last_name": "KURZBAN", "id": "1946-ROBERT-O--KURZBAN", "name": "ROBERT O. KURZBAN"}, "num_reviewers": 66, "id": "26694-001-1946-ROBERT-O--KURZBAN"}]