{"coursehistories": {"path": "/coursehistories/5473"}, "description": "\"Native American Religion and Literature\" will explore the spiritual dimensions of three tribes-- Ojibwe, Cherokee, and Sioux-- using an interdisciplinary focus that includes literature, religious studies, film, and anthropology. We will focus on masterful stories in which Cherokee people turn into bears, thunderbirds talk, and invisible forces are made visible. Rather than seeing these stories as \"myths\" they will be treated as highly sophisticated forms of philosophy. The class will include two 7-8 analytic essays and one shorter, more descriptive paper. \n\n", "semester": "2012A", "name": "NATIVE AMERICAN REL/LIT", "reviews": {"path": "/courses/28105/reviews", "values": [{"ratings": {"rAmountLearned": "2.30", "rDifficulty": "2.89", "rStimulateInterest": "2.19", "rRecommendMajor": "2.59", "rCourseQuality": "2.04", "rWorkRequired": "2.56", "rInstructorAccess": "3.26", "rReadingsValue": "2.70", "rRecommendNonMajor": "2.15", "rCommAbility": "2.33", "rInstructorQuality": "2.48"}, "section": {"name": "NATIVE AMERICAN REL/LIT", "sectionnum": "401", "primary_alias": "RELS-208-401", "path": "/courses/28105/sections/401", "id": "28105-401", "aliases": ["RELS-208-401", "ENGL-282-401", "ANTH-282-401"]}, "comments": "\"Native American Religion and Literature\" explores the spiritual dimensions of three tribes-- Ojibwe, Cherokee, and Sioux--using an interdisciplinary focus that includes literature, religious studies, film, and anthropology.  The course focuses on masterful stories in which Cherokee people turn into bears, thunderbirds talk, and invisible forces are made visible. Rather than seeing these stories as \"myths\" they are treated as highly sophisticated forms of philosophy.  The class includes two 7-8 page analytic essays and one shorter, more descriptive paper.\r\n\r\n\tThis class received mixed reviews, with many students calling the subject matter “absolutely fascinating” but finding the course structure seriously lacking. Many students liked being able to “learn a lot about a culture [they didn’t] have any background in” but lamented the “vast lack of structure” in lectures. Students noted how “the constant emphasis on assignments completely detracted from the course,” making the experience “come across more like a writing seminar.” Multiple students described the pace of the course as “tedious” and wished they had more time to actually delve into its content.\r\n\r\n\tProfessor Powell received negative reviews from students, who felt he did not focus lectures and assignments in effective ways. Though “he [was] very knowledgeable on the material,” he was “consistently unprepared for class” and didn’t seem to “have more than a vague idea of what he wanted to accomplish in each class.” Students also did not appreciate his lateness in returning multiple assignments when those seemed to be the course’s focus.\r\n\r\n\tThe course required multiple papers of varying lengths, which amounted to a “ridiculous amount of work.” Students struggled with “a strange format for essays” and received little guidance on how to write them, despite class time taken up by discussing assignments. Grading was also found to be “slightly harsh without any real justification” and “one assignment took over six weeks to be returned.” These issues led multiple students to sum up the class as “awful,” largely because of its format and professor.", "num_students": 29, "path": "/courses/28105/sections/401/reviews/4161-TIMOTHY-B--POWELL", "instructor": {"path": "/instructors/4161-TIMOTHY-B--POWELL", "first_name": "TIMOTHY B.", "last_name": "POWELL", "id": "4161-TIMOTHY-B--POWELL", "name": "TIMOTHY B. POWELL"}, "num_reviewers": 27, "id": "28105-401-4161-TIMOTHY-B--POWELL"}]}, "credits": null, "primary_alias": "RELS-208", "path": "/courses/28105", "sections": {"path": "/courses/28105/sections", "values": [{"name": "NATIVE AMERICAN REL/LIT", "sectionnum": "401", "primary_alias": "RELS-208-401", "path": "/courses/28105/sections/401", "id": "28105-401", "aliases": ["RELS-208-401", "ENGL-282-401", "ANTH-282-401"]}]}, "id": 28105, "aliases": ["RELS-208", "ENGL-282", "ANTH-282"]}