[{"ratings": {"rAmountLearned": "3.21", "rDifficulty": "3.14", "rStimulateInterest": "3.07", "rRecommendMajor": "3.69", "rCourseQuality": "2.89", "rWorkRequired": "2.52", "rInstructorAccess": "3.10", "rReadingsValue": "2.93", "rRecommendNonMajor": "1.52", "rCommAbility": "3.45", "rInstructorQuality": "3.28"}, "section": {"name": "CHEMICAL REACTOR DESIGN", "sectionnum": "001", "primary_alias": "CBE-451-001", "path": "/courses/22754/sections/001", "id": "22754-001", "aliases": ["CBE-451-001"]}, "comments": "This course covers the design of reactors for the production of chemical products, continuous and batch reactors, chemical kinetics, effects of back-mixing and non-ideal flow in tubular reactors, heterogeneous reactions, and construction and economic analysis of reactors.\r\n\r\nStudents generally found many of the concepts covered in this course to be conceptually difficult but not impossible to understand. Some students felt that the course could have moved faster and covered more material, citing the fact very little new content was covered between the first and second midterm exams.\r\n\r\nStudents were generally enthusiastic about Professor Sinno’s teaching ability. The way he was able to guide students through problems and complex topics was praised by many. One reviewer even declared Professor Sinno “hands down the best ‘teacher’ in the CBE department.” Students found it helpful that he taught in a way that followed the required textbook for the course. Some found him a bit hard to reach in his office, but they reported that he was open to questions right after class.\r\n\r\nStudents generally agreed that the exams required a good understanding of the material, but they were fair in content and grading. Many felt that the homework assignments were helpful in instilling the concepts covered in class. This course is a requirement for CBE majors and is generally taken by seniors. CBE 231 and CBE 351 are prerequisites.\r\n", "num_students": 41, "path": "/courses/22754/sections/001/reviews/217-TALID-R--SINNO", "instructor": {"path": "/instructors/217-TALID-R--SINNO", "first_name": "TALID R.", "last_name": "SINNO", "id": "217-TALID-R--SINNO", "name": "TALID R. SINNO"}, "num_reviewers": 36, "id": "22754-001-217-TALID-R--SINNO"}]