[{"ratings": {"rAmountLearned": "3.08", "rDifficulty": "3.44", "rStimulateInterest": "2.95", "rRecommendMajor": "3.36", "rCourseQuality": "2.94", "rWorkRequired": "3.55", "rInstructorAccess": "3.77", "rReadingsValue": "2.34", "rRecommendNonMajor": "1.11", "rCommAbility": "3.36", "rInstructorQuality": "3.42"}, "section": {"name": "BIOENGINEERING SYSTEMS", "sectionnum": "001", "primary_alias": "BE-301-001", "path": "/courses/16994/sections/001", "id": "16994-001", "aliases": ["BE-301-001"]}, "comments": "This course explores the properties of signals and systems with applications to biological and biomedical systems. Topics such as Fourier analysis of signals and systems, frequency analysis, frequency response, digital and analog filtering, and sampling are covered. \r\n\r\nStudents raved about Professor Rizk, agreeing that he is “one of the best professors at Penn and definitely a huge asset to the BE department” and that “whoever hired this professor deserves a reward.” Students described Professor Rizk as “amazing”, “friendly and approachable,” “a great communicator,” and “enthusiastic about the subject material.” Many came in hearing horror stories about the material, but were amazed by Professor Rizk’s ability to communicate the difficult information. Students commented about Professor Rizk’s great availability outside of his office hours and wish to have them understand the material. However, students did wish that more examples could be given in class, including those that were more representative of exam questions.\r\n\r\nStudents acknowledged that this course was difficult and that the homework required up to 10-15 hours to complete.  Overall, the work was “challenging but fair.” Students were receptive to the final project, “a great choice since it allowed us to apply the very abstract concepts we learned in class.”  However, students felt that Professor Rizk “did his best to try and make it interesting” and “making such a complex topic more manageable.”\r\n\r\nThis course is intended for BSE Bioengineering majors in their junior year. The prerequisites are BE 210 and MATH 241. Students complained about the workload for the course and the lack of examples that were representative of exam questions. \r\n", "num_students": 77, "path": "/courses/16994/sections/001/reviews/4750-MICHAEL-RIZK", "instructor": {"path": "/instructors/4750-MICHAEL-RIZK", "first_name": "MICHAEL", "last_name": "RIZK", "id": "4750-MICHAEL-RIZK", "name": "MICHAEL RIZK"}, "num_reviewers": 69, "id": "16994-001-4750-MICHAEL-RIZK"}]