{"coursehistories": {"path": "/coursehistories/396"}, "description": "This is an introduction to literary study through a survey of works from a specific historical period. (For offerings in a given semester, please see the on-line course descriptions on the English Department website.) Some versions will begin with traditional stories or poems, including a sampling of works in translation. Others will focus exclusively on modern and contemporary American short fiction or poetry. This course is designed or the General Requirement, and is ideal for student wishing to take an English course but not necessarily intending to major. \n\nSee the English Department's website at www.english.upenn.edu for a description of the current offerings. \n\n", "semester": "2008A", "name": "STUDY OF A PERIOD: MONSTERS IN FILM & LIT.", "reviews": {"path": "/courses/20062/reviews", "values": [{"ratings": {"rAmountLearned": "2.67", "rDifficulty": "2.19", "rStimulateInterest": "2.76", "rRecommendMajor": "3.14", "rCourseQuality": "2.84", "rWorkRequired": "2.72", "rInstructorAccess": "3.00", "rReadingsValue": "2.74", "rRecommendNonMajor": "2.70", "rCommAbility": "2.83", "rInstructorQuality": "2.81"}, "section": {"name": "STUDY OF A PERIOD: MONSTERS IN FILM & LIT.", "sectionnum": "401", "primary_alias": "ENGL-104-401", "path": "/courses/20062/sections/401", "id": "20062-401", "aliases": ["ENGL-104-401", "COML-104-401", "CINE-104-401"]}, "comments": "This is an introduction to literary study through a survey of works from a specific historical period. (For offerings in a given semester, please see the on-line course descriptions on the English Department website.) Some versions will begin with traditional stories or poems, including a sampling of works in translation. Others will focus exclusively on modern and contemporary American short fiction or poetry. This course is designed or the General Requirement, and is ideal for student wishing to take an English course but not necessarily intending to major. See the English Department\\'s website at www.english.upenn.edu for a description of the current offerings.\r\n\r\nStudents described this class as “really fun and interesting” with a unique syllabus and interesting films.  The course analyzed how monsters are often used as an outlet for social and moral injustice in films and literature.  Some students complained that key motifs needed for the final were not highlighted enough and there was not enough open discussion.  \r\n\r\nStudents commented that Professor Yang has “an enthusiastic passion” for the topic and that her “energy translates well to stimulating student interest.”  Others described the instructor as “articulate” and “accessible,” successfully teaching students how to analyze literature and film.  Students complained that Professor Yang “jumped around too much on the subject matter” and sometimes spoke in too abstract of terms.  \r\n\r\nOne student commented that it was “too hard for a class labeled ‘for non-English majors’- A lot of work and time outside class especially with film screenings.”  Overall, students felt that the “huge workload” took away from the course because it was too difficult to keep up to date with the material.  This course, which varies in topic from semester to semester, fulfills the Writing requirement.", "num_students": 58, "path": "/courses/20062/sections/401/reviews/3282-CHI-MING-YANG", "instructor": {"path": "/instructors/3282-CHI-MING-YANG", "first_name": "CHI-MING", "last_name": "YANG", "id": "3282-CHI-MING-YANG", "name": "CHI-MING YANG"}, "num_reviewers": 43, "id": "20062-401-3282-CHI-MING-YANG"}]}, "credits": null, "primary_alias": "ENGL-104", "path": "/courses/20062", "sections": {"path": "/courses/20062/sections", "values": [{"name": "STUDY OF A PERIOD: MONSTERS IN FILM & LIT.", "sectionnum": "401", "primary_alias": "ENGL-104-401", "path": "/courses/20062/sections/401", "id": "20062-401", "aliases": ["ENGL-104-401", "COML-104-401", "CINE-104-401"]}]}, "id": 20062, "aliases": ["ENGL-104", "COML-104", "CINE-104"]}