{"coursehistories": {"path": "/coursehistories/4613"}, "description": "This course provides brief but intensive information of some of the largest business firms in the Peoples Republic of China. From 1949 to 1988, business firms as we know them did not exist in the PRC. In 1988, independent legal status was granted to state-owned enterprises, which were made responsible for profits and losses; in 1993, state enterprises were redefined as business corporations, and private businesses were allowed to incorporate as limited liability or stockholding companies. China's economy has grown rapidly since, but the development of Chinese firms has been uneven. A few have large domestic market share and are global competitors, but most outside of industries like electrical power, petroleum and telecommunications remain regional competitors at best and are small by Western standards. The governance of Chinese firms remains work in progress. Repeated reforms aimed at corporatizing firms while preserving state control have created extremely complicated ownership and governance practices, which differ from industry to industry and from region to region. This course will acquaint students with the governance and management of some of the largest and best known Chinese firms, and with the capabilities and liabilities of Chinese firms and hence their strategic options. It will provide students tools needed to assess the \n\ninvestment potential of Chinese firms and the opportunity to do original research on issues of governance and management of Chinese firms. \n\n", "semester": "2012C", "name": "GOV.& MGMT. OF CHIN FRMS", "reviews": {"path": "/courses/29294/reviews", "values": [{"ratings": {"rAmountLearned": "2.70", "rDifficulty": "2.00", "rStimulateInterest": "2.50", "rRecommendMajor": "3.00", "rCourseQuality": "2.62", "rWorkRequired": "2.00", "rInstructorAccess": "3.50", "rReadingsValue": "2.40", "rRecommendNonMajor": "2.44", "rCommAbility": "2.50", "rInstructorQuality": "2.77"}, "section": {"name": "GOV.& MGMT. OF CHIN FRMS", "sectionnum": "401", "primary_alias": "MGMT-788-401", "path": "/courses/29294/sections/401", "id": "29294-401", "aliases": ["MGMT-788-401", "MGMT-288-401"]}, "comments": "", "num_students": 17, "path": "/courses/29294/sections/401/reviews/4890-MARSHALL-W--MEYER", "instructor": {"path": "/instructors/4890-MARSHALL-W--MEYER", "first_name": "MARSHALL W.", "last_name": "MEYER", "id": "4890-MARSHALL-W--MEYER", "name": "MARSHALL W. MEYER"}, "num_reviewers": 13, "id": "29294-401-4890-MARSHALL-W--MEYER"}]}, "credits": null, "primary_alias": "MGMT-788", "path": "/courses/29294", "sections": {"path": "/courses/29294/sections", "values": [{"name": "GOV.& MGMT. OF CHIN FRMS", "sectionnum": "401", "primary_alias": "MGMT-788-401", "path": "/courses/29294/sections/401", "id": "29294-401", "aliases": ["MGMT-788-401", "MGMT-288-401"]}]}, "id": 29294, "aliases": ["MGMT-788", "MGMT-288"]}