{"coursehistories": {"path": "/coursehistories/1194"}, "description": "An introduction to the diversity of cultures in the world. This course is divided into two parts. The first briefly examines different models of understanding human diversity: ethnicities, religions, languages, political forms, economic structures, cultures, and \"civilizations\". Students will learn to think about the world as an interconnected whole, and know the significance of culture on a global scale. The second part is an introduction to area studies, in which we undertake a survey of the different regions of theworld. We conduct the survey paying attention to the different aspects of human diversities, which we examine in the first part of this course. Students will acquire a greater appreciation and understanding of cultural differences in the more comprehensive social context. \n\n", "semester": "2010A", "name": "MDRN WRLD & CULTRE BKGRD: The Modern World and Its Cultural Background", "reviews": {"path": "/courses/25582/reviews", "values": [{"ratings": {"rAmountLearned": "2.41", "rDifficulty": "2.22", "rStimulateInterest": "2.30", "rRecommendMajor": "2.85", "rCourseQuality": "2.42", "rWorkRequired": "2.48", "rInstructorAccess": "2.67", "rReadingsValue": "2.13", "rRecommendNonMajor": "2.35", "rCommAbility": "2.76", "rInstructorQuality": "2.70"}, "section": {"name": "MDRN WRLD & CULTRE BKGRD: The Modern World and Its Cultural Background", "sectionnum": "001", "primary_alias": "ANTH-004-001", "path": "/courses/25582/sections/001", "id": "25582-001", "aliases": ["ANTH-004-001"]}, "comments": "This course is an introduction to the diversity of cultures in the world, and it is divided into two parts. The first briefly examines different models of understanding human diversity: ethnicities, religions, languages, political forms, economic structures, cultures, and \"civilizations.\" Students will learn to think about the world as an interconnected whole and know the significance of culture on a global scale. The second part is an introduction to area studies, in which students undertake a survey of the different regions of the world. Students will acquire a greater appreciation and understanding of cultural differences in the more comprehensive social context.\r\n\r\nMany students described this course as “boring.” Some found the material “interesting,” but many felt the material covered was “too broad” and was studied at a “slow pace”\r\n\r\nIn general, students thought Professor Urban was a “wonderful guy” and an “excellent instructor who obviously has a passion for the field.” Some complained that Professor Urban “read off the slides” and was “not particularly engaging” in lecture.\r\n\r\nThe readings for this course were described as “dry” and “way too long.” Students with experience in this field found the class easy, while others felt the tests were “graded extremely hard” and required “too much memorization.” This course fulfills the Humanities and Social Sciences sector requirement.", "num_students": 112, "path": "/courses/25582/sections/001/reviews/267-GREGORY-P--URBAN", "instructor": {"path": "/instructors/267-GREGORY-P--URBAN", "first_name": "GREGORY P.", "last_name": "URBAN", "id": "267-GREGORY-P--URBAN", "name": "GREGORY P. URBAN"}, "num_reviewers": 104, "id": "25582-001-267-GREGORY-P--URBAN"}]}, "credits": null, "primary_alias": "ANTH-004", "path": "/courses/25582", "sections": {"path": "/courses/25582/sections", "values": [{"name": "MDRN WRLD & CULTRE BKGRD: The Modern World and Its Cultural Background", "sectionnum": "001", "primary_alias": "ANTH-004-001", "path": "/courses/25582/sections/001", "id": "25582-001", "aliases": ["ANTH-004-001"]}]}, "id": 25582, "aliases": ["ANTH-004"]}