[{"ratings": {"rAmountLearned": "3.85", "rDifficulty": "3.27", "rStimulateInterest": "3.77", "rRecommendMajor": "3.92", "rCourseQuality": "3.77", "rWorkRequired": "3.65", "rInstructorAccess": "3.81", "rReadingsValue": "3.08", "rRecommendNonMajor": "1.88", "rCommAbility": "4.00", "rInstructorQuality": "3.96"}, "section": {"name": "ALGEBRA", "sectionnum": "001", "primary_alias": "MATH-371-001", "path": "/courses/20466/sections/001", "id": "20466-001", "aliases": ["MATH-371-001"]}, "comments": "Wrapping up a year-long sequence in algebra, this course takes a deeper look at abstract algebra topics concerning groups, rings and fields. Material is taught from a variety of approaches, including theory, computation and examples. The main textbook for Spring 2008 was Topics in Algebra 2nd ed. Students may take Math 503 as an alternative, which is more advanced and theoretical in nature.\r\n\r\nStudents found the course challenging but “thoroughly [enjoyable].” Grades were determined by two midterms, a final and weekly problem sets. Although some students found the problem sets to be very time consuming, most found them relevant and useful to the course. \r\n\r\nStudents raved about Professor Harbater. Many students described him as the best professor they’ve had, either within the Math department, at Penn in general or even simply “ever.” Students also repeatedly used the words “excellent,” “great,” and “awesome” in their reviews of him. One student commented that he has “a knack for helping students understand material,” while another lauded him for being “personable and quick to identify what is needed for the class to succeed.”", "num_students": 37, "path": "/courses/20466/sections/001/reviews/3362-DAVID-HARBATER", "instructor": {"path": "/instructors/3362-DAVID-HARBATER", "first_name": "DAVID", "last_name": "HARBATER", "id": "3362-DAVID-HARBATER", "name": "DAVID HARBATER"}, "num_reviewers": 26, "id": "20466-001-3362-DAVID-HARBATER"}]