{"coursehistories": {"path": "/coursehistories/741"}, "description": "The focus of Management 104 is the economic and institutional constraints on organizations in the formulation and implementation of human resources management policies and strategies in the United States and, as appropriate, internationally. The specific constraints discussed are labor markets (external and internal), labor laws (governing employment policies and employee relations), and labor unions (and the threat thereof). Particular attention is paid to the relationship of these constraints to the competitiveness of American enterprise in the global economy. \n\n", "semester": "2011C", "name": "INDUS REL & HUM RES MGMT", "reviews": {"path": "/courses/24735/reviews", "values": [{"ratings": {"rAmountLearned": "2.56", "rDifficulty": "2.10", "rStimulateInterest": "3.44", "rRecommendMajor": "3.13", "rCourseQuality": "2.89", "rWorkRequired": "2.35", "rInstructorAccess": "3.37", "rReadingsValue": "2.12", "rRecommendNonMajor": "2.06", "rCommAbility": "3.39", "rInstructorQuality": "3.30"}, "section": {"name": "INDUS REL & HUM RES MGMT", "sectionnum": "001", "primary_alias": "MGMT-104-001", "path": "/courses/24735/sections/001", "id": "24735-001", "aliases": ["MGMT-104-001"]}, "comments": "Management 104 focuses on the economic and institutional constraints on organizations in the formulation and implementation of human resources management policies and strategies in the United States and, as appropriate, internationally.  The specific constraints discussed are labor markets (external and internal), labor laws (governing employment policies and employee relations), and labor unions (and the threat thereof).  Particular attention is paid to the relationship of these constraints to the competitiveness of American enterprise in the global economy.\r\n\r\nStudents felt that they would retain the information learned in this class even after the semester. The course is relevant to those going into \"consulting or other industry jobs (other than banking).” Some of the information was closely tied to material taught in MGMT 101 and 238.\r\n\r\nProfessor Cobb was able to \"mold the course around his students\" and oftentimes used current events to make examples relevant. He is passionate about the subject matter and very enthusiastic. Some students criticized how opinionated he was, because it made them hold back their political opinions. Students raved about his personality and energy. \r\n\r\nStudents said that there were many readings and that the readings were long. \r\n", "num_students": 57, "path": "/courses/24735/sections/001/reviews/5796-J--ADAM-COBB", "instructor": {"path": "/instructors/5796-J--ADAM-COBB", "first_name": "J. ADAM", "last_name": "COBB", "id": "5796-J--ADAM-COBB", "name": "J. ADAM COBB"}, "num_reviewers": 56, "id": "24735-001-5796-J--ADAM-COBB"}, {"ratings": {"rAmountLearned": "2.68", "rDifficulty": "2.11", "rStimulateInterest": "3.14", "rRecommendMajor": "2.86", "rCourseQuality": "2.73", "rWorkRequired": "2.18", "rInstructorAccess": "3.23", "rReadingsValue": "2.48", "rRecommendNonMajor": "1.95", "rCommAbility": "3.07", "rInstructorQuality": "3.04"}, "section": {"name": "INDUS REL & HUM RES MGMT", "sectionnum": "002", "primary_alias": "MGMT-104-002", "path": "/courses/24735/sections/002", "id": "24735-002", "aliases": ["MGMT-104-002"]}, "comments": "The focus of Management 104 is the economic and institutional constraints on\r\norganizations in the formulation and implementation of human resources management\r\npolicies and strategies in the United States and, as appropriate, internationally. The\r\nspecific constraints discussed are labor markets (external and internal), labor laws\r\n(governing employment policies and employee relations), and labor unions (and the\r\nthreat thereof). Particular attention is paid to the relationship of these constraints to the\r\ncompetitiveness of American enterprise in the global economy.\r\nStudents enjoyed the course and discussions in class.\r\nProfessor Cobb was \"great at making the material relevant and was very attune to\r\nstudents' needs and conflicts.\" He was humorous, engaging, and good at maintaining\r\ninterest among students. However, some students felt he tried to \"push his political\r\nopinions in class.\" Some students felt that classes were not a \"safe space for discussion,\"\r\nespecially pointing to an Occupy Wall Street discussion in class.\r\nStudents found the slides and lecture material \"approachable and easy to understand.\"", "num_students": 53, "path": "/courses/24735/sections/002/reviews/5796-J--ADAM-COBB", "instructor": {"path": "/instructors/5796-J--ADAM-COBB", "first_name": "J. ADAM", "last_name": "COBB", "id": "5796-J--ADAM-COBB", "name": "J. ADAM COBB"}, "num_reviewers": 51, "id": "24735-002-5796-J--ADAM-COBB"}]}, "credits": null, "primary_alias": "MGMT-104", "path": "/courses/24735", "sections": {"path": "/courses/24735/sections", "values": [{"name": "INDUS REL & HUM RES MGMT", "sectionnum": "001", "primary_alias": "MGMT-104-001", "path": "/courses/24735/sections/001", "id": "24735-001", "aliases": ["MGMT-104-001"]}, {"name": "INDUS REL & HUM RES MGMT", "sectionnum": "002", "primary_alias": "MGMT-104-002", "path": "/courses/24735/sections/002", "id": "24735-002", "aliases": ["MGMT-104-002"]}]}, "id": 24735, "aliases": ["MGMT-104"]}