{"coursehistories": {"path": "/coursehistories/4303"}, "description": "This course focuses on the areas of association, contract, constitutional, labor, antitrust, and agency law as they apply to the sports industry. This course exposes the student to many of the legal issues facing stakeholders in sport organizations. Special attention is given to the regulation of professional sports leagues promoting competitive balance, as well as antitrust law and labor-management relations dealing with the organization structure of sports leagues. The course also takes an inside look at previous and newly formed collective bargaining agreements and the use of Salary Cap or lack thereof in professional sports leagues. The development of effective communication skills will be emphasized through class presentations, written assignments, and quizzes; leadership and interpersonal communications will be cultivated through small group projects and meetings, and critical thinking and problem solving skills will be fostered through the careful study of case law impacting the sports industry in a variety of facets. \n\n", "semester": "2011A", "name": "SPORTS LAW", "reviews": {"path": "/courses/21956/reviews", "values": [{"ratings": {"rAmountLearned": "2.80", "rDifficulty": "2.20", "rStimulateInterest": "3.43", "rRecommendMajor": "3.59", "rCourseQuality": "3.15", "rWorkRequired": "1.57", "rInstructorAccess": "2.96", "rReadingsValue": "2.43", "rRecommendNonMajor": "3.53", "rCommAbility": "3.46", "rInstructorQuality": "3.24"}, "section": {"name": "SPORTS LAW", "sectionnum": "001", "primary_alias": "LGST-228-001", "path": "/courses/21956/sections/001", "id": "21956-001", "aliases": ["LGST-228-001"]}, "comments": "&#8232;&#8232;This course focuses on the areas of association, contract, constitutional, labor, antitrust, and agency law as they apply to the sports industry. This course exposes the student to many of the legal issues facing those in sport organizations. Special attention is given to the regulation of professional and amateur athletics, agency law, antitrust law, the organizational structure of sports leagues and associations, labor-management relations, and Title IX. The development of effective communication skills will be emphasized through class presentations and written assignments, leadership and interpersonal communications will be developed through small group projects and meetings, and critical thinking and problem solving skills will be fostered through the careful study of numerous cases. In each class there will be a discussion about current events in the sports business and legal realm; these discussions are integral to real-world deliberations of these topics. Through classroom lectures and interactive discussions, students will gain an understanding of the creation and regulation of professional athletics, antitrust and labor law, organizational structures of leagues and associations, and labor relations. In-class problem solving will be utilized extensively to expose students to the application of the law to particular situations. The required textbook is Weiler and Roberts’ Sports and the Law (3 Ed.), and additional cases and materials are assigned. &#8232;&#8232;Students overwhelmingly agreed that this was an “awesome class taught by an awesome professor.” Some commented that it was by far the best class they had taken at Penn. Due to the “incredibly interesting” material, students found this class to be a “great course even for those who do not know much about major league sports.” Students thoroughly enjoyed the “excellent” discussions that “really got the entire class engaged” and felt that they truly “learned a lot.” Students also found the PowerPoint presentations on specific cases to be quite useful, as they “made it easier to follow all the details of the cases.” Though students found the lectures “enjoyable to attend,” some commented that the discussions were occasionally more “unstructured and student-led” than they would have liked. &#8232;&#8232;Overall, students commented that Professor Brandt was “outstanding,” “extremely popular among the students,” and an “expert” in his field with “real experience in sports industry.” Students appreciated Brandt’s personal experiences, and found that he “has done a good job stimulating student interest about the laws and policies relating to professional sports,” even for those with little sports knowledge. Aside from stimulating student interest, students said that Professor Brandt was also always “willing to address any concerns.” &#8232;&#8232;While there was one major paper assignment for this course, students admitted that they “definitely would prefer to have a few short papers” rather than one large one, as well as more readings required. One student commented, “This would put people on a more level playing field for participating in class.” Students are assigned to present cases and/or arguments in negotiations in each class. Participation in class discussions/in class exercises is strongly encouraged and weighted in the final grades.", "num_students": 58, "path": "/courses/21956/sections/001/reviews/4401-ANDREW-D--BRANDT", "instructor": {"path": "/instructors/4401-ANDREW-D--BRANDT", "first_name": "ANDREW D.", "last_name": "BRANDT", "id": "4401-ANDREW-D--BRANDT", "name": "ANDREW D. BRANDT"}, "num_reviewers": 55, "id": "21956-001-4401-ANDREW-D--BRANDT"}]}, "credits": null, "primary_alias": "LGST-228", "path": "/courses/21956", "sections": {"path": "/courses/21956/sections", "values": [{"name": "SPORTS LAW", "sectionnum": "001", "primary_alias": "LGST-228-001", "path": "/courses/21956/sections/001", "id": "21956-001", "aliases": ["LGST-228-001"]}]}, "id": 21956, "aliases": ["LGST-228"]}