{"coursehistories": {"path": "/coursehistories/867"}, "description": "Philosophers ask difficult questions about the most basic issues in human life. Does God exist? What does it mean to live a good life? How should I treat non-human animals? Do I have free will? How do I know that the world I see is really there? This course is an introduction to some of these questions and to the methods philosophers have developed for thinking clearly about them. \n\n", "semester": "2012A", "name": "INTRO TO PHILOSOPHY", "reviews": {"path": "/courses/27980/reviews", "values": [{"ratings": {"rAmountLearned": "3.06", "rDifficulty": "2.19", "rStimulateInterest": "3.24", "rRecommendMajor": "3.35", "rCourseQuality": "3.04", "rWorkRequired": "2.31", "rInstructorAccess": "3.19", "rReadingsValue": "2.85", "rRecommendNonMajor": "2.97", "rCommAbility": "3.37", "rInstructorQuality": "3.30"}, "section": {"name": "INTRO TO PHILOSOPHY", "sectionnum": "001", "primary_alias": "PHIL-001-001", "path": "/courses/27980/sections/001", "id": "27980-001", "aliases": ["PHIL-001-001"]}, "comments": "Philosophers ask difficult questions about the most basic issues in human life. Does God exist? What does it mean to live a good life? How should I treat non-human animals? Do I have free will? How do I know that the world I see is really there? This course was an introduction to some of these questions and to the methods philosophers have developed for thinking clearly about them.\r\n\r\nFor the most part, students enjoyed the lectures of this class, especially the \"funny anecdotes\" and the video clips shown by the professor for the \"demonstration of philosophical concepts.\" Though the class covered \"a lot of ground,\" students considered the pace manageable and appropriate for an introductory course. Some students expected \"more historical context\" because of the course's introductory nature. Despite the large number of students in the class, the professor managed to facilitate \"interesting discussions\" during lectures. \r\n\r\nStudents generally appreciated Professor Weisberg, and multiple class members mentioned his desire to \"make his students engage with the material meaningfully.\" One student called him \"a dedicated and creative educator,\" while another expressed admiration for the fact that he \"genuinely cared about the course material.” Some students found Professor Weisberg \"strongly biased\" and they felt that \"a lot of the material was geared towards what Professor Weisberg believed\" rather than \"a more objective stance.\" A few students found the lectures tangential at times. \r\n\r\nMany of the students enrolled in this class took the course to fulfill a general requirement. Nonetheless, class members found the \"material interesting for students who probably have no prior experience with the subject.\" The workload was not too demanding; assignments included a midterm, a paper, and a final. Some students felt frustrated that through most of the class, they only had their grade for their midterm because students received the \"paper grade a few days before the final.\" Multiple students recommended this course \"particularly to freshman\" and some felt that the course was \"useful to any student regardless of major.\"", "num_students": 78, "path": "/courses/27980/sections/001/reviews/2302-MICHAEL-WEISBERG", "instructor": {"path": "/instructors/2302-MICHAEL-WEISBERG", "first_name": "MICHAEL", "last_name": "WEISBERG", "id": "2302-MICHAEL-WEISBERG", "name": "MICHAEL WEISBERG"}, "num_reviewers": 77, "id": "27980-001-2302-MICHAEL-WEISBERG"}, {"ratings": {"rAmountLearned": "2.56", "rDifficulty": "2.38", "rStimulateInterest": "2.56", "rRecommendMajor": "3.19", "rCourseQuality": "2.35", "rWorkRequired": "2.13", "rInstructorAccess": "3.25", "rReadingsValue": "2.81", "rRecommendNonMajor": "2.50", "rCommAbility": "2.81", "rInstructorQuality": "2.59"}, "section": {"name": "INTRO TO PHILOSOPHY", "sectionnum": "601", "primary_alias": "PHIL-001-601", "path": "/courses/27980/sections/601", "id": "27980-601", "aliases": ["PHIL-001-601"]}, "comments": "", "num_students": 24, "path": "/courses/27980/sections/601/reviews/4704-JEROME-M--NANCE", "instructor": {"path": "/instructors/4704-JEROME-M--NANCE", "first_name": "JEROME M.", "last_name": "NANCE", "id": "4704-JEROME-M--NANCE", "name": "JEROME M. NANCE"}, "num_reviewers": 17, "id": "27980-601-4704-JEROME-M--NANCE"}]}, "credits": null, "primary_alias": "PHIL-001", "path": "/courses/27980", "sections": {"path": "/courses/27980/sections", "values": [{"name": "INTRO TO PHILOSOPHY", "sectionnum": "001", "primary_alias": "PHIL-001-001", "path": "/courses/27980/sections/001", "id": "27980-001", "aliases": ["PHIL-001-001"]}, {"name": "INTRO TO PHILOSOPHY", "sectionnum": "601", "primary_alias": "PHIL-001-601", "path": "/courses/27980/sections/601", "id": "27980-601", "aliases": ["PHIL-001-601"]}]}, "id": 27980, "aliases": ["PHIL-001"]}