{"coursehistories": {"path": "/coursehistories/4328"}, "description": "This course explores the various modes of corporate development available to managers to drive firm growth and change, including alliances, outsourcing, corpocorporate venturing, and particularly mergers and acquisitions. The objectives are three-fold: (1) to arm you with a set of tools to facilitate the selection of the appropriate growth strategy in a given situation; (2) to provide you with insights as to how to manage partnerships like alliances, outsourcing, and corporate venturing; and, (3) to develop a comprehensive framework for executing M&As, from initiation to implementation. The emphasis is on strategic and operational aspects of these transactions, rather than financial considerations. We begin by examining the different modes of corporate development, including the applicability and management approaches for each, particularly various types of partnerships. We then delve into acquisition screening and deal-making. Afterwards, we consider in detail post-merger integration. The course ends with the presentation of project work and a review of the course learnings. In terms of its pedagogical approach, this is designed to be an interactive, applied, case-based course with accompanying conceptual readings to help structure your thinking. Given the nature of the course, we will also apply the lessons from the cases to \n\nunderstand the challenges and implications of relevant recent and on-going deals. In addition, guest speakers with experience in investment banking, consulting, and industry will be invited to share their perspectives. A semester-long group project is intended to give you the opportunity to apply your learning from the course to a context that is most interesting and relevant to you. \n\n", "semester": "2009C", "name": "CORP DEV: MERG & ACQUIS", "reviews": {"path": "/courses/17704/reviews", "values": [{"ratings": {"rAmountLearned": "2.15", "rDifficulty": "2.18", "rStimulateInterest": "2.43", "rRecommendMajor": "2.48", "rCourseQuality": "2.28", "rWorkRequired": "2.55", "rInstructorAccess": "2.72", "rReadingsValue": "2.62", "rRecommendNonMajor": "1.86", "rCommAbility": "2.62", "rInstructorQuality": "2.55"}, "section": {"name": "CORP DEV: MERG & ACQUIS", "sectionnum": "751", "primary_alias": "MGMT-721-751", "path": "/courses/17704/sections/751", "id": "17704-751", "aliases": ["MGMT-721-751"]}, "comments": "", "num_students": 41, "path": "/courses/17704/sections/751/reviews/4431-HARBIR-SINGH", "instructor": {"path": "/instructors/4431-HARBIR-SINGH", "first_name": "HARBIR", "last_name": "SINGH", "id": "4431-HARBIR-SINGH", "name": "HARBIR SINGH"}, "num_reviewers": 29, "id": "17704-751-4431-HARBIR-SINGH"}]}, "credits": null, "primary_alias": "MGMT-721", "path": "/courses/17704", "sections": {"path": "/courses/17704/sections", "values": [{"name": "CORP DEV: MERG & ACQUIS", "sectionnum": "751", "primary_alias": "MGMT-721-751", "path": "/courses/17704/sections/751", "id": "17704-751", "aliases": ["MGMT-721-751"]}]}, "id": 17704, "aliases": ["MGMT-721"]}