[{"ratings": {"rAmountLearned": "3.18", "rDifficulty": "2.25", "rStimulateInterest": "3.36", "rRecommendMajor": "3.77", "rCourseQuality": "3.18", "rWorkRequired": "1.80", "rInstructorAccess": "3.67", "rReadingsValue": "2.25", "rRecommendNonMajor": "2.75", "rCommAbility": "3.48", "rInstructorQuality": "3.54"}, "section": {"name": "INTRO TO LANGUAGE CHANGE", "sectionnum": "001", "primary_alias": "LING-110-001", "path": "/courses/26309/sections/001", "id": "26309-001", "aliases": ["LING-110-001"]}, "comments": "This course covers the principles of language change and the methods of historical linguistics on an elementary level. The systematic regularity of change, the reasons for that regularity, and the exploitation of regularity in linguistic reconstruction are especially emphasized. Examples are drawn from a wide variety of languages, both familiar and unfamiliar. Since there are no prerequisites, the course includes mini-introductions to articulatory phonetics, basic phonology (especially the principle of contrast), and basic morphology (especially inflection), all of which must be understood in order to understand the ways in which they change.\r\n\r\nOverall, students felt that the course was “excellent,” with one student remarking that they “wouldn’t have missed [the] class for the world.” A couple of students remarked that “class [could] be boring at times,” but that this was only the case because of the subject matter, which was “possibly the driest facet of linguistics.” In general, students thought that “anyone can enjoy this class,” but that “previous Linguistics knowledge” would be helpful. \r\n\r\nStudents were overwhelmingly impressed by Professor Ringe, oftentimes praising him as “brilliant,” “compelling,” and “incredibly knowledgeable.” They appreciated his ability to make a potentially “tedious” subject very interesting by being “a good storyteller” who “kept [their] attention.” One student noted that “the hearty demeanor of the professor was inviting” and that the student “felt at ease to discuss the course” with Professor Ringe after class.\r\n\r\nWhile handouts were reported to be “high quality,” there were “a lot of them” and some students thought that Professor Ringe used “way too much paper.” Despite the high volume of handouts, students did not report feeling overwhelmed by reading, instead noting that Professor Ringe allowed them to “focus on learning the material” without “weighing too heavily on homework or exams,” and that the class was generally “not very demanding” in terms of workload", "num_students": 53, "path": "/courses/26309/sections/001/reviews/728-DONALD-A--RINGE", "instructor": {"path": "/instructors/728-DONALD-A--RINGE", "first_name": "DONALD A.", "last_name": "RINGE", "id": "728-DONALD-A--RINGE", "name": "DONALD A. RINGE"}, "num_reviewers": 46, "id": "26309-001-728-DONALD-A--RINGE"}]