[{"ratings": {"rAmountLearned": "3.09", "rDifficulty": "2.84", "rStimulateInterest": "3.36", "rRecommendMajor": "3.65", "rCourseQuality": "3.08", "rWorkRequired": "3.11", "rInstructorAccess": "3.79", "rReadingsValue": "2.57", "rRecommendNonMajor": "1.61", "rCommAbility": "3.37", "rInstructorQuality": "3.50"}, "section": {"name": "ENG MECHANICS: DYNAMICS", "sectionnum": "001", "primary_alias": "MEAM-211-001", "path": "/courses/26356/sections/001", "id": "26356-001", "aliases": ["MEAM-211-001"]}, "comments": "This course introduces the basic concepts in kinematics and dynamics that are necessary to understand, analyze and design mechanisms and machines. These concepts are also fundamental to the modeling and analysis of human movement, biomechanics, animation of synthetic human models and robotics. The topics covered include: Particle dynamics using energy and momentum methods of analysis; Dynamics of systems of particles; Impact; Systems of variable mass; Kinematics and dynamics of rigid bodies in plane motion; Computer-aided dynamic simulation and animation.\r\n\r\nThe course was described to be extremely “enjoyable” and “educational.” Furthermore, the material seemed to incorporate much more than what was taught in lecture. As well, a significant portion of the coursework was done in MatLab, which was “frustrating, but useful” for some students.\r\n\r\nStudents described Professor Kuchenbecker as “one of the best professors at Penn.” She “really cares about her students,” and is always “willing to help.” In addition, students felt that she was extremely “engaging” and “stimulating,” so she was able to keep the students’ interest throughout the lecture. She really enjoys what she teaches and she is “passionate about the subject.” Overall, students really enjoyed having Professor Kuchenbecker teaching the course.\r\n\r\nThe workload for this course was considered to be quite heavy. This is partially because almost every assignment incorporated MatLab in some way, which requires a lot of time commitment. Students say that “spending a lot of time on homework and studying really pays off.” The course was recommended for both Majors and Non-majors. ", "num_students": 68, "path": "/courses/26356/sections/001/reviews/4016-KATHERINE-J--KUCHENBECKER", "instructor": {"path": "/instructors/4016-KATHERINE-J--KUCHENBECKER", "first_name": "KATHERINE J.", "last_name": "KUCHENBECKER", "id": "4016-KATHERINE-J--KUCHENBECKER", "name": "KATHERINE J. KUCHENBECKER"}, "num_reviewers": 64, "id": "26356-001-4016-KATHERINE-J--KUCHENBECKER"}]