{"coursehistories": {"path": "/coursehistories/1510"}, "description": "This course is concerned with the structure, the causes and correlates, and the government policies to alleviate discrimination by race and gender in the United States.The central focus of the course is on employment differences by race and gender and the extent to which they arise from labor market discrimination versus other causes, although racial discrimination in housing is also considered. After a comprehensive overview of the structures of labor and housing markets and of nondiscriminatory reasons (that is, the cumulative effects of past discrimination and/or experiences) for the existence of group differentials in employment, wages and residential locations, various theories ofthe sources of current discrimination are reviewed and evaluated. Actual government policies and alternatives policies are evaluated in light of both the empirical evidence on group differences and the alternative theories of discrimination. \n\n", "semester": "2010C", "name": "DISCRIM: SEX RACE/CONFL", "reviews": {"path": "/courses/23787/reviews", "values": [{"ratings": {"rAmountLearned": "2.97", "rDifficulty": "2.35", "rStimulateInterest": "2.74", "rRecommendMajor": "3.48", "rCourseQuality": "2.85", "rWorkRequired": "2.52", "rInstructorAccess": "3.00", "rReadingsValue": "2.10", "rRecommendNonMajor": "2.90", "rCommAbility": "3.32", "rInstructorQuality": "3.15"}, "section": {"name": "DISCRIM: SEX RACE/CONFL", "sectionnum": "401", "primary_alias": "SOCI-112-401", "path": "/courses/23787/sections/401", "id": "23787-401", "aliases": ["SOCI-112-401", "URBS-114-401", "GSOC-114-401", "AFRC-112-401"]}, "comments": "\r\nSOCI 112 explores the nature of gender and race discrimination in the United States. This course emphasizes the causes and correlates of discrimination and the role of government policies in alleviating discrimination. The main concentration of this course is employment differences by race and gender and the extent to which they arise from labor market discrimination versus other causes. Racial discrimination in housing is also considered. \r\n\r\nStudents reported that this class was “extremely interesting.\" Many students claimed that they learned a lot from this class, describing it as “valuable” and thought-provoking.\r\n\r\nMost students found Professor Madden to be interesting, engaging, and passionate. Professor Madden is “excellent in communicating with students” and available to students outside of class during office hours and via email. Additionally, students Professor Madden to be very knowledgeable in her field.\r\n\r\nHowever, one student cautioned that the class requires a great deal of research and writing. Additionally, there is a large amount of reading required prior to each class, although the reading topics are covered during the lectures. This course is highly recommended to fulfill the Society Sector requirement.\r\n", "num_students": 35, "path": "/courses/23787/sections/401/reviews/1960-JANICE-FANNING-MADDEN", "instructor": {"path": "/instructors/1960-JANICE-FANNING-MADDEN", "first_name": "JANICE FANNING", "last_name": "MADDEN", "id": "1960-JANICE-FANNING-MADDEN", "name": "JANICE FANNING MADDEN"}, "num_reviewers": 33, "id": "23787-401-1960-JANICE-FANNING-MADDEN"}]}, "credits": null, "primary_alias": "SOCI-112", "path": "/courses/23787", "sections": {"path": "/courses/23787/sections", "values": [{"name": "DISCRIM: SEX RACE/CONFL", "sectionnum": "401", "primary_alias": "SOCI-112-401", "path": "/courses/23787/sections/401", "id": "23787-401", "aliases": ["SOCI-112-401", "URBS-114-401", "GSOC-114-401", "AFRC-112-401"]}]}, "id": 23787, "aliases": ["SOCI-112", "URBS-114", "GSOC-114", "AFRC-112"]}