{"coursehistories": {"path": "/coursehistories/920"}, "description": "This course is intended to introduce students to the national institutions and political processes of American government. What are the historical and philosophical foundations of the American Republic? How does American public policy get made, who makes it, and who benefits? Is a constitutional fabric woven in 1787 good enough for today? How, if at all, should American government be changed, and why? What is politics and why bother to study it? If these sorts of questions interest you, then this course will be a congenial home. It is designed to explore such questions while teaching students the basics of American politics and government. \n\n", "semester": "2010C", "name": "INTRO TO AMER POLITICS", "reviews": {"path": "/courses/23662/reviews", "values": [{"ratings": {"rAmountLearned": "2.99", "rDifficulty": "2.71", "rStimulateInterest": "3.14", "rRecommendMajor": "3.65", "rCourseQuality": "3.00", "rWorkRequired": "3.03", "rInstructorAccess": "2.92", "rReadingsValue": "2.79", "rRecommendNonMajor": "2.96", "rCommAbility": "3.42", "rInstructorQuality": "3.41"}, "section": {"name": "INTRO TO AMER POLITICS", "sectionnum": "001", "primary_alias": "PSCI-130-001", "path": "/courses/23662/sections/001", "id": "23662-001", "aliases": ["PSCI-130-001"]}, "comments": "This course is intended to introduce students to the national institutions and political processes of American government: the historical and philosophical foundations of the American Republic: the significance of politics; how American public policy is made, who makes it, and who benefits; the modern application of the constitutional fabric woven in 1787; how, if at all, should American government be changed. \r\n\r\nOverall, students felt generally positive about the course material, calling the class “thought-provoking” and “valuable.” One student wrote that it was “a perfect starting point for anyone interested in American politics.” Several, however, expressed their dissatisfaction that the course did not live up to their high expectations. “This class is a lot of hype,” wrote one student, calling the lectures “forgettable.” Many complained that “the two-hour lecture was too long” to hold their attention, despite their interest in the material.\r\n\r\nReactions to Professor DiIulio were overwhelmingly positive. Students called him “inspiring,” “extremely powerful,” and “a phenomenal lecturer.” Several proclaimed him “the best professor I’ve had at Penn.”\r\n\r\nMany students found the amount of reading required for this course “unreasonable” and the extra-credit policy “horribly unfair.” Most recognized that “this course is designed for freshmen and sophomores,” which some found “constricting,” and felt led to “too much hand-holding” on the part of the TAs. Despite these observations, many students recommended this class to majors and non-majors alike.\r\n", "num_students": 246, "path": "/courses/23662/sections/001/reviews/994-JOHN-J--DIIULIO", "instructor": {"path": "/instructors/994-JOHN-J--DIIULIO", "first_name": "JOHN J.", "last_name": "DIIULIO", "id": "994-JOHN-J--DIIULIO", "name": "JOHN J. DIIULIO"}, "num_reviewers": 224, "id": "23662-001-994-JOHN-J--DIIULIO"}]}, "credits": null, "primary_alias": "PSCI-130", "path": "/courses/23662", "sections": {"path": "/courses/23662/sections", "values": [{"name": "INTRO TO AMER POLITICS", "sectionnum": "001", "primary_alias": "PSCI-130-001", "path": "/courses/23662/sections/001", "id": "23662-001", "aliases": ["PSCI-130-001"]}]}, "id": 23662, "aliases": ["PSCI-130"]}