[{"ratings": {"rAmountLearned": "2.01", "rDifficulty": "2.16", "rStimulateInterest": "1.23", "rRecommendMajor": "2.19", "rCourseQuality": "1.63", "rWorkRequired": "1.75", "rInstructorAccess": "2.38", "rReadingsValue": "2.45", "rRecommendNonMajor": "1.25", "rCommAbility": "1.97", "rInstructorQuality": "1.73"}, "section": {"name": "INTRODUCTION TO STATISTICS", "sectionnum": "001", "primary_alias": "NURS-230-001", "path": "/courses/23522/sections/001", "id": "23522-001", "aliases": ["NURS-230-001"]}, "comments": "Nursing 230 focuses on application of statistical methods to health care data. This course focuses on descriptive statistics, including correlation and simple linear regression. This class examines models that underlie inference, including laws of probability and probability distributions for dichotomous and continuous data. The class will also study confidence intervals for percentages, means, and testing hypotheses using normal and chi square distributions.\r\n\r\nReviews for this course were very mixed. Some felt the material was “dry,” while others found the problem to be the presentation of the material, which was not “stimulating” enough. Some found the class to be particularly boring because it was three hours long. One student felt that there was “too much time put toward the simple statistics concepts, and not enough spent on the more important tools in this subject area.”\r\n\r\nReviews for Dr. Tulman were just as varied. While some said that she was “the best,” others felt that she did not do a great job teaching the course.\r\n\r\nOne student strongly disliked the format of the tests and how they were counted toward the final grade. There were “only three tests worth 30 percent, 30 percent and 40 percent respectfully,” and there were only “32 questions in which 30 were multiple choice and worth 3 points each,” thus seeming “unfair.” According to many, the course seemed more theoretical than practical.\r\n", "num_students": 85, "path": "/courses/23522/sections/001/reviews/875-LORRAINE-J-TULMAN", "instructor": {"path": "/instructors/875-LORRAINE-J-TULMAN", "first_name": "LORRAINE J", "last_name": "TULMAN", "id": "875-LORRAINE-J-TULMAN", "name": "LORRAINE J TULMAN"}, "num_reviewers": 81, "id": "23522-001-875-LORRAINE-J-TULMAN"}]