{"coursehistories": {"path": "/coursehistories/2098"}, "description": "The evolution of social behavior in animals, with special emphasis on group formation, cooperation among kin, mating systems, territoriality and communication. \n\n", "semester": "2010C", "name": "ANIMAL BEHAVIOR", "reviews": {"path": "/courses/23699/reviews", "values": [{"ratings": {"rAmountLearned": "3.03", "rDifficulty": "2.83", "rStimulateInterest": "3.44", "rRecommendMajor": "3.53", "rCourseQuality": "3.04", "rWorkRequired": "2.47", "rInstructorAccess": "3.02", "rReadingsValue": "2.87", "rRecommendNonMajor": "2.57", "rCommAbility": "3.47", "rInstructorQuality": "3.55"}, "section": {"name": "ANIMAL BEHAVIOR", "sectionnum": "401", "primary_alias": "PSYC-131-401", "path": "/courses/23699/sections/401", "id": "23699-401", "aliases": ["PSYC-131-401", "BIBB-231-401", "BIOL-231-401"]}, "comments": "This course will provide an introduction to the major areas of the study of animal behavior with attention to evolution and ecology. The course will study the diversity of behavior across animals of many taxa and give special focus to social interactions, mating, and communication. The main texts are Animal Behavior: An evolutionary Approach by Alcock and Exploring Animal Behavior by Sherman and Alcock. There are three midterms and no finals. \r\n\r\nStudents enjoyed the readings in this course and the additional readings were “for the most part beneficial.” Most of the students enjoyed the content covered in the class but said that it was too “one-sided,” mostly focusing on birds and primates. \r\n\r\nA large number of students praised Professor White for his ability to make the topic interesting. He is “fantastic” and “hilarious,” often incorporating videos to demonstrate concepts. Some students described Professor White as their favorite teacher at Penn and the course as their best course of the semester. On the other hand, students also thought Professor White could spend his lectures “more wisely and efficiently”, as he spends too much times going over examples. \r\n\r\nAlmost all of the students think the midterms and quizzes were “incredibly difficult” and “very poorly written”. Grading is inconsistent and often contains “ambiguous open questions” that were not mentioned in class. Students coming into this course expected easier exams and were surprised by their difficulty.\r\n", "num_students": 140, "path": "/courses/23699/sections/401/reviews/2665-DAVID-J-WHITE", "instructor": {"path": "/instructors/2665-DAVID-J-WHITE", "first_name": "DAVID J", "last_name": "WHITE", "id": "2665-DAVID-J-WHITE", "name": "DAVID J WHITE"}, "num_reviewers": 132, "id": "23699-401-2665-DAVID-J-WHITE"}]}, "credits": null, "primary_alias": "PSYC-131", "path": "/courses/23699", "sections": {"path": "/courses/23699/sections", "values": [{"name": "ANIMAL BEHAVIOR", "sectionnum": "401", "primary_alias": "PSYC-131-401", "path": "/courses/23699/sections/401", "id": "23699-401", "aliases": ["PSYC-131-401", "BIBB-231-401", "BIOL-231-401"]}]}, "id": 23699, "aliases": ["PSYC-131", "BIBB-231", "BIOL-231"]}