[{"ratings": {"rAmountLearned": "3.25", "rDifficulty": "2.33", "rStimulateInterest": "3.42", "rRecommendMajor": "3.83", "rCourseQuality": "3.41", "rWorkRequired": "2.06", "rInstructorAccess": "3.52", "rReadingsValue": "2.84", "rRecommendNonMajor": "3.21", "rCommAbility": "3.58", "rInstructorQuality": "3.67"}, "section": {"name": "BIOSOCIAL CRIMINOLOGY", "sectionnum": "001", "primary_alias": "CRIM-370-001", "path": "/courses/17181/sections/001", "id": "17181-001", "aliases": ["CRIM-370-001"]}, "comments": "Is there a “natural-born killer”? What makes a successful psychopath? And is it morally wrong for us to punish those who are biologically-wired for a life of crime? This course argues that answers to these inscrutable questions will ultimately be found in an interdisciplinary perspective that examines the interface between the social, clinical, and neurosciences. We will explore new biosocial treatments for violence, and analyze the controversial neuroethical, legal, and philosophical issues surrounding neurocriminology. The course presents perspectives from fields of psychology, neurobiology, sociology, neurochemistry, anthropology, law, neuroanatomy, cinema, public health, neuroendocrinology, criminology, forensics, pediatrics, and psychiatry. Only by integrating knowledge from multiple domains will we fully understand, predict, and prevent future criminal behavior.\r\n\r\nStudents commented that despite being a 3-hour lecture, this course was “engaging,” and “stimulating.” Students especially enjoyed the field trip, guest lecturer, and video clips. \r\n\r\nMost students enjoyed Professor Raine’s lectures, calling him, “a wonderful lecturer,” “entertaining,” and “knowledgeable.” Students described Professor Raine as a, “leader in the field of Biosocial Criminology,” and “able to stimulate interest about some material that can be considered a little dry.” \r\n\r\nSome students complained that the due dates for the final exam and final paper were “too close to each other.” However, students highly recommended the course, even to students who do not already have an interest in criminology. \r\n", "num_students": 60, "path": "/courses/17181/sections/001/reviews/4771-ADRIAN-RAINE", "instructor": {"path": "/instructors/4771-ADRIAN-RAINE", "first_name": "ADRIAN", "last_name": "RAINE", "id": "4771-ADRIAN-RAINE", "name": "ADRIAN RAINE"}, "num_reviewers": 55, "id": "17181-001-4771-ADRIAN-RAINE"}]