[{"ratings": {"rAmountLearned": "3.56", "rDifficulty": "3.36", "rStimulateInterest": "3.60", "rRecommendMajor": "3.56", "rCourseQuality": "3.59", "rWorkRequired": "3.68", "rInstructorAccess": "2.92", "rReadingsValue": "3.08", "rRecommendNonMajor": "2.56", "rCommAbility": "3.52", "rInstructorQuality": "3.66"}, "section": {"name": "BRAIN-COMPUTER INTERFACE", "sectionnum": "401", "primary_alias": "BE-521-401", "path": "/courses/27023/sections/401", "id": "27023-401", "aliases": ["BE-521-401", "NGG-521-401"]}, "comments": "The course is geared to advanced undergraduate and graduate students interested in understanding the basics ofimplantable neuro-devices, their design, practical implementation, approval, and use. Readings cover the basics of neuro signals, recording, analysis, classification, modulation, and fundamental principels of Brain-Machine Interfaces. The course is  based upon twice weekly lectures and \"hands-on\" weekly assignments that teach basic signal recording, feature extraction, classification and practical implementation in clinical systems. Assignments build incrementally toward constructing a complete, functional BMI system. Fundamental concepts in neurosignals, hardware and software will be reinforced by practical examples and in-depth study. Guest lecturers and demonstrations supplement regular lectures.\r\n\r\nThis high-level course was described as “an amazing course that is a perfect segue into the medical device and BCI arena.” Students stated that they learned a lot in this course in comments like, “The course was instrumental in making the students aware of the entire field, the current projects and people working in the field.”\r\n\r\nDr. Litt received high remarks as a teacher. One student said, “Dr. Litt was an incredible professor who really emphasized and cared about learning.” The TA Drausin was highly lauded as a huge aid with accessible office hours and prompt responsiveness to emails. It was highly recommended you see him due to the difficult homework assignments. Although lectures were said to be informative, students also felt that “There is a huge gap between content taught in lecture and what you are expected to accomplish in the homework.”\r\n\r\nThis course is intended for undergraduate upperclassmen and graduate students in the Bioengineering department. The prerequisites listed BE301, MATLAB experience in classes such as BE209, BE 210, or BE310, and some neuroscience background. Students noted that this class contained very difficult and time-consuming homework assignments that could take 10-15 hours a week.\r\n", "num_students": 36, "path": "/courses/27023/sections/401/reviews/4252-BRIAN-LITT", "instructor": {"path": "/instructors/4252-BRIAN-LITT", "first_name": "BRIAN", "last_name": "LITT", "id": "4252-BRIAN-LITT", "name": "BRIAN LITT"}, "num_reviewers": 30, "id": "27023-401-4252-BRIAN-LITT"}]