{"coursehistories": {"path": "/coursehistories/2664"}, "description": "A developmental perspective on the general empirical and theoretical psychologyof perception, cognition, language, learning, comparative ethology, and socialization. \n\n", "semester": "2012A", "name": "DEVELOPMENTAL PSYCHOLOGY", "reviews": {"path": "/courses/28077/reviews", "values": [{"ratings": {"rAmountLearned": "2.48", "rDifficulty": "2.00", "rStimulateInterest": "2.19", "rRecommendMajor": "3.14", "rCourseQuality": "2.32", "rWorkRequired": "2.14", "rInstructorAccess": "3.19", "rReadingsValue": "2.48", "rRecommendNonMajor": "2.14", "rCommAbility": "2.29", "rInstructorQuality": "2.41"}, "section": {"name": "DEVELOPMENTAL PSYCHOLOGY", "sectionnum": "601", "primary_alias": "PSYC-280-601", "path": "/courses/28077/sections/601", "id": "28077-601", "aliases": ["PSYC-280-601"]}, "comments": "This course offers a developmental perspective on the general empirical and theoretical psychology of perception, cognition, language, learning, comparative ethology, and socialization. Students are required to have taken PYSC001 before they can enroll in this course.\r\nStudents seemed to be somewhat split on the course. Some appreciated the “general foundation of material” provided, while others were less enthusiastic about the “painful” guest lecturers and the amount of reading. Some complained about how students were unable to have their own copies of lecture slides, which were “copyrighted so that students could not have printed copies to refer to.” Certain students complained about the article review assignments, which they felt were “awful” and unhelpful. Textbooks were criticized as “scattered” and unorganized.\r\nStudents criticized Professor Jackson for often teaching too fast, “raising the stress level” of the class by talking faster than students could take notes. Other students praised her accessibility, referring to her as “one of the most approachable.” The main criticisms of Professor Jackson stemmed from the unavailability of the lecture slides and her speed.\r\nThe perquisite for PSYC 280 is PSYC 001. Students described the workload as “perfect,” while also mentioning that Professor Jackson seemed to be an easy grader. Students all seemed to enjoy the actual material of the course. The problems were in the manner and speed at which it was presented.", "num_students": 24, "path": "/courses/28077/sections/601/reviews/5865-LEELA-JACKSON", "instructor": {"path": "/instructors/5865-LEELA-JACKSON", "first_name": "LEELA", "last_name": "JACKSON", "id": "5865-LEELA-JACKSON", "name": "LEELA JACKSON"}, "num_reviewers": 22, "id": "28077-601-5865-LEELA-JACKSON"}]}, "credits": null, "primary_alias": "PSYC-280", "path": "/courses/28077", "sections": {"path": "/courses/28077/sections", "values": [{"name": "DEVELOPMENTAL PSYCHOLOGY", "sectionnum": "601", "primary_alias": "PSYC-280-601", "path": "/courses/28077/sections/601", "id": "28077-601", "aliases": ["PSYC-280-601"]}]}, "id": 28077, "aliases": ["PSYC-280"]}