[{"ratings": {"rAmountLearned": "3.56", "rDifficulty": "3.31", "rStimulateInterest": "3.63", "rRecommendMajor": "3.50", "rCourseQuality": "3.56", "rWorkRequired": "3.69", "rInstructorAccess": "3.25", "rReadingsValue": "3.19", "rRecommendNonMajor": "1.93", "rCommAbility": "3.81", "rInstructorQuality": "3.44"}, "section": {"name": "CASE STUDY: BREAST FEEDING & HUMAN LACTATION", "sectionnum": "001", "primary_alias": "NURS-361-001", "path": "/courses/23536/sections/001", "id": "23536-001", "aliases": ["NURS-361-001"]}, "comments": "Nursing 361 concentrates on the study of breastfeeding. Human milk is recognized universally as the optimal diet for newborn infants. The health benefits of breastfeeding are so significant that a National Health Objective set forth by the Surgeon General of the United States for the year 2010 is to increase the proportion of mothers who breastfeed their babies in the postpartum period. Through classroom and clinical experiences, this course provides an in-depth examination of the anatomy and physiology of lactation, essential aspects of establishing and maintaining lactation, and the nurses' role in counseling the breastfeeding family. This class emphasizes current research findings in the content area.\r\n\r\nStudents overall felt that they “never knew there was so much to learn about breastfeeding” and that they recognized the importance of the material. Many “learned a lot” in terms of theory and practice and felt that the research articles were “beneficial.” Some reported that shadowing lactation consultants could be “stressful trying to schedule all of the hours,” but that it was a rewarding experience regardless. One student remarked that she “loved clinical hours.”\r\n\r\nProfessor Spatz was praised for having “wonderful course structure” and “effectively integrating students into the field of study.” One student did note that “office hours are short and at inconvenient times.” \r\n\r\nStudents generally liked that they could focus “more on the content as a whole and enjoy the lectures” since there were no tests. One student commented that she had a “much better grasp on being able to read, interpret, and analyze an article to make suggestions for future studies.” Students completed 1-page “research critiques” and a large project. Students agreed that the course was “work-heavy” and “stressful,” but that it was overall beneficial and a “great course for anyone who thinks that they are going to work with women and babies.”\r\n", "num_students": 21, "path": "/courses/23536/sections/001/reviews/873-DIANE-L--SPATZ", "instructor": {"path": "/instructors/873-DIANE-L--SPATZ", "first_name": "DIANE L.", "last_name": "SPATZ", "id": "873-DIANE-L--SPATZ", "name": "DIANE L. SPATZ"}, "num_reviewers": 18, "id": "23536-001-873-DIANE-L--SPATZ"}]