[{"ratings": {"rAmountLearned": "3.02", "rDifficulty": "2.64", "rStimulateInterest": "3.27", "rRecommendMajor": "3.78", "rCourseQuality": "2.92", "rWorkRequired": "3.25", "rInstructorAccess": "2.85", "rReadingsValue": "2.78", "rRecommendNonMajor": "2.49", "rCommAbility": "3.27", "rInstructorQuality": "3.23"}, "section": {"name": "HEALTH & SOCIETIES", "sectionnum": "001", "primary_alias": "HSOC-010-001", "path": "/courses/21887/sections/001", "id": "21887-001", "aliases": ["HSOC-010-001"]}, "comments": "Two fundamental questions structure this course: (1) what kinds of factors shape population health in various parts of the world in the twenty-first century? And (2) What kinds of intellectual tools are necessary in order to study global health? Grasping the deeper \"socialness\" of health and health care in a variety of cultures and time periods requires a sustained interdisciplinary approach. This course blends the methods of history, sociology, anthropology and related disciplines in order to expose the layers of causation and meaning beneath what we often see as straightforward, common-sense responses to biological phenomena. Assignments throughout the semester provide a hands-on introduction to research strategies in these core disciplines. The course culminates with pragmatic, student-led assessments of global health policies designed to identify creative and cost effective solutions to the most persistent health problems in the world today.\r\n\r\nStudents described the course as “awesome.” Students “want to go to lectures,” although some felt it could have been better organized and less repetitive. One student felt the course “completely changed” his view on global health. It is “a good class to take regardless of major.” \r\n\r\nMany students raved about what an “amazing professor” Dr. Barnes is. “You could tell that he really loved what he was teaching,” and that passion was contagious. He is a stimulating lecturer and is “truly concerned about the well-being of his students.”\r\n\r\nStudents felt “the amount of work if you are not interested would be overwhelming.” The class “has a TON of assignments, many of which seem unrelated to the course work.” However, students were pleased that the readings remained “relevant” and did not seem like “they had been in the course pack for years without being updated.” One student mentioned that the “end of the semester is very work-heavy, with two major projects within two weeks of each other.” This course fulfills the Humanities and Social Science sector.\r\n", "num_students": 107, "path": "/courses/21887/sections/001/reviews/1520-DAVID-S--BARNES", "instructor": {"path": "/instructors/1520-DAVID-S--BARNES", "first_name": "DAVID S.", "last_name": "BARNES", "id": "1520-DAVID-S--BARNES", "name": "DAVID S. BARNES"}, "num_reviewers": 91, "id": "21887-001-1520-DAVID-S--BARNES"}]