{"coursehistories": {"path": "/coursehistories/1895"}, "description": "A survey of the modern Middle East with special emphasis on the experiences of ordinary men and women as articulated in biographies, novels, and regional case studies. Issues covered include the collapse of empires and the rise of a new state system following WWI, and the roots and consequences of the Palestinian-Israeli conflict, the Iranian revolution and the U.S.-Iraq War. Themes include: the colonial encounter with Europe and the emergence of nationalist movements, the relationship between state and society, economic development and international relations, and religion and cultural identity. \n\n", "semester": "2010C", "name": "HIST MID EAST SINCE 1800", "reviews": {"path": "/courses/23205/reviews", "values": [{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "2.92", "rStimulateInterest": "3.19", "rRecommendMajor": "3.52", "rCourseQuality": "3.05", "rWorkRequired": "3.31", "rInstructorAccess": "3.12", "rReadingsValue": "2.62", "rRecommendNonMajor": "2.74", "rCommAbility": "3.16", "rInstructorQuality": "3.21"}, "section": {"name": "HIST MID EAST SINCE 1800", "sectionnum": "401", "primary_alias": "HIST-081-401", "path": "/courses/23205/sections/401", "id": "23205-401", "aliases": ["HIST-081-401", "NELC-031-401"]}, "comments": "This course is a survey of the modern Middle East with special emphasis on the experiences of ordinary men and women as articulated in biographies, novels, and regional case studies. Issues covered include the collapse of empires and the rise of a new state system following WWI, and the roots and consequences of the Palestinian-Israeli conflict, the Iranian revolution and the U.S.-Iraq War. Themes include: the colonial encounter with Europe and the emergence of nationalist movements, the relationship between state and society, economic development and international relations, and religion and cultural identity.&#8232;&#8232;\r\n\r\nOverall, students found this course to be interesting. However, a student did mentioned that the course was “extremely broad,” and a couple mentioned that they thought there was too much emphasis placed on the Ottoman Empire. &#8232;&#8232;\r\n\r\nMost of the students in this course found Professor Trout-Powell to be enthusiastic and a great lecturer. However, there were also a few students who said Professor Trout-Powell was a poor lecturer, and that taking notes could be difficult because of the amount of information given during lecture. Students found Professor Trout-Powell’s accessibility to be inconsistent. A couple of students also commented that Professor Trout-Powell “truly cares about her students,” and is available during office hours, while another student commented that Professor Trout-Powell was “often unavailable, [did] not respond to email, and cancel[ed] her office hours.” &#8232;\r\n\r\nMost of the students who commented on this course said that the reading load was very heavy, and could therefore easily “get overwhelming.” One student also said that many of the assigned readings did not seem to have value. Another student also mentioned that the exams and papers were “pretty hard,” while another stated that as a “non major [they] found it very challenging.” This course fulfills the History & Tradition Sector.\r\n", "num_students": 79, "path": "/courses/23205/sections/401/reviews/3326-EVE-TROUTT-POWELL", "instructor": {"path": "/instructors/3326-EVE-TROUTT-POWELL", "first_name": "EVE", "last_name": "TROUTT POWELL", "id": "3326-EVE-TROUTT-POWELL", "name": "EVE TROUTT POWELL"}, "num_reviewers": 69, "id": "23205-401-3326-EVE-TROUTT-POWELL"}]}, "credits": null, "primary_alias": "HIST-081", "path": "/courses/23205", "sections": {"path": "/courses/23205/sections", "values": [{"name": "HIST MID EAST SINCE 1800", "sectionnum": "401", "primary_alias": "HIST-081-401", "path": "/courses/23205/sections/401", "id": "23205-401", "aliases": ["HIST-081-401", "NELC-031-401"]}]}, "id": 23205, "aliases": ["HIST-081", "NELC-031"]}