[{"ratings": {"rAmountLearned": "3.33", "rDifficulty": "2.22", "rStimulateInterest": "3.78", "rRecommendMajor": "3.61", "rCourseQuality": "3.50", "rWorkRequired": "2.00", "rInstructorAccess": "3.61", "rReadingsValue": "3.00", "rRecommendNonMajor": "3.11", "rCommAbility": "3.47", "rInstructorQuality": "3.85"}, "section": {"name": "EUROPE 1789-1890", "sectionnum": "001", "primary_alias": "HIST-126-001", "path": "/courses/23213/sections/001", "id": "23213-001", "aliases": ["HIST-126-001"]}, "comments": "This course covers the social, political, and cultural history of Europe during the \"long\" nineteenth-century from 1789-1890. Beginning with the French Revolution and ending on the eve of the First World War, the class focuses on long-term developments such as the industrial revolution, urbanization, and imperialism as well as key events like the revolutions of 1848 and the Paris Commune. Readings draw on both primary and secondary material so as to introduce students to the many divergent perspectives necessary for an understanding of the past. \r\nAll students found the course to be \"excellent.\" Students said it was a \"collaborative attempt to discover and understand the past.\" The conversational format of the class also immensely helped the students with the comprehension of the material.&#8232;&#8232;\r\nStudents described Professor Steinberg as knowing \"everything there is to know about everything.\" He was engaging and invested in the class, and he never failed to \"deliver flawless insight into the main themes and trends of the historical periods.\" Students commended Dr. Steinberg for his ability to \"[draw] historical parallels between what we learn in class and other periods.\"&#8232;One student called this course \"a must-take for every student at Penn.\" Students strongly recommended this class to anyone, regardless of their interests or majors.\r\n\r\n", "num_students": 26, "path": "/courses/23213/sections/001/reviews/625-JONATHAN-STEINBERG", "instructor": {"path": "/instructors/625-JONATHAN-STEINBERG", "first_name": "JONATHAN", "last_name": "STEINBERG", "id": "625-JONATHAN-STEINBERG", "name": "JONATHAN STEINBERG"}, "num_reviewers": 20, "id": "23213-001-625-JONATHAN-STEINBERG"}]