{"coursehistories": {"path": "/coursehistories/4269"}, "description": "\"A spectre is haunting Europe--the spectre of Communism\": This, the famous opening line of The Communist Manifesto, will guide this course's exploration of the history, legacy, and potential future of Karl Marx's most important texts and ideas, even long after Communism has been pronounced dead. Contextualizing Marx within a tradition of radical thought regarding politics, religion, and sexuality, we will focus on the philosophical, political, and cultural origins and implications of his ideas. Our work will center on the question of how his writings seek to counter or exploit various tendencies of the time; how they align with the work of Nietzsche, Freud, and other radical thinkers to follow; and how they might continue to haunt us today. We will begin by discussing key works by Marx himself, examining ways in which he is both influenced by and appeals to many of the same fantasies, desires, and anxieties encoded in the literature, arts and intellectual currents of the time. In examining his legacy, we will focus on elaborations or challenges to his ideas, particularly within cultural criticism, postwar protest movements, and the cultural politics of the Cold War. In conclusion, we will turn to the question of Marxism or Post-Marxism today, asking what promise Marx's ideas might still hold in a world vastly different from his own. \n\n", "semester": "2012C", "name": "MARX", "reviews": {"path": "/courses/29034/reviews", "values": [{"ratings": {"rDifficulty": "2.22", "rStimulateInterest": "3.75", "rCourseQuality": "3.32", "rWorkRequired": "2.38", "rInstructorQuality": "3.63", "rCommAbility": "3.35", "rInstructorAccess": "3.66"}, "section": {"name": "MARX", "sectionnum": "401", "primary_alias": "GRMN-247-401", "path": "/courses/29034/sections/401", "id": "29034-401", "aliases": ["GRMN-247-401", "PHIL-247-401", "COML-247-401"]}, "comments": "", "num_students": 44, "path": "/courses/29034/sections/401/reviews/3980-ERIC-JAROSINSKI", "instructor": {"path": "/instructors/3980-ERIC-JAROSINSKI", "first_name": "ERIC", "last_name": "JAROSINSKI", "id": "3980-ERIC-JAROSINSKI", "name": "ERIC JAROSINSKI"}, "num_reviewers": 35, "id": "29034-401-3980-ERIC-JAROSINSKI"}]}, "credits": null, "primary_alias": "GRMN-247", "path": "/courses/29034", "sections": {"path": "/courses/29034/sections", "values": [{"name": "MARX", "sectionnum": "401", "primary_alias": "GRMN-247-401", "path": "/courses/29034/sections/401", "id": "29034-401", "aliases": ["GRMN-247-401", "PHIL-247-401", "COML-247-401"]}]}, "id": 29034, "aliases": ["GRMN-247", "PHIL-247", "COML-247"]}