[{"ratings": {"rAmountLearned": "3.52", "rDifficulty": "2.39", "rStimulateInterest": "3.87", "rRecommendMajor": "3.78", "rCourseQuality": "3.61", "rWorkRequired": "2.17", "rInstructorAccess": "3.52", "rReadingsValue": "3.39", "rRecommendNonMajor": "3.26", "rCommAbility": "3.70", "rInstructorQuality": "3.78"}, "section": {"name": "INTRO TO INT REL", "sectionnum": "601", "primary_alias": "PSCI-150-601", "path": "/courses/22320/sections/601", "id": "22320-601", "aliases": ["PSCI-150-601"]}, "comments": "&#8232;&#8232;&#8232;This course is an introduction to the major theories and issues in international politics. The goals of the course are to give students a broad familiarity with the field of international relations, and to help them develop the analytical skills necessary to think critically about international politics. The course is divided into four parts: 1) Concepts and Theories of International Relations; 2) War and Security; 3) The Global Economy; and 4) Emerging Issues in International Relations.&#8232;&#8232;&#8232;Most students reported loving this “fascinating” course. According to one student, “the class was so good that I always looked forward to it even though it was three hours on Monday nights,” and another commented: “I wish I had taken this class earlier…as I feel like I could have wanted to take more political science classes.” Another described class discussions as “deep, engaging and though-provoking.” Students generally reported learning a lot from the course; however, one student found the readings to be “too boring and lengthy to complete.” &#8232;&#8232;&#8232;Students enthusiastically praised Dr. Doherty-Sil, describing her as “phenomenal” and “the best lecturer I have ever had.” Students agreed that she was extremely “passionate” and energetic and also “very knowledgeable” in her field. Students found her to be an effective communicator of the material and always available for questions. One student found her passion off-putting, commenting that it bordered on “eccentric” and was “hard to keep pace with.”&#8232;&#8232;&#8232;This class fulfills the Society Sector and was well-received by both political science majors and non-majors. According to one student, the course “did not require much work.” &#8232;&#8232;**Class only reviewed by 6 students.", "num_students": 24, "path": "/courses/22320/sections/601/reviews/3336-EILEEN-M--DOHERTY-SIL", "instructor": {"path": "/instructors/3336-EILEEN-M--DOHERTY-SIL", "first_name": "EILEEN M.", "last_name": "DOHERTY-SIL", "id": "3336-EILEEN-M--DOHERTY-SIL", "name": "EILEEN M. DOHERTY-SIL"}, "num_reviewers": 23, "id": "22320-601-3336-EILEEN-M--DOHERTY-SIL"}]