[{"ratings": {"rAmountLearned": "3.29", "rDifficulty": "3.24", "rStimulateInterest": "3.48", "rRecommendMajor": "3.71", "rCourseQuality": "3.38", "rWorkRequired": "3.08", "rInstructorAccess": "3.36", "rReadingsValue": "2.88", "rRecommendNonMajor": "2.96", "rCommAbility": "3.56", "rInstructorQuality": "3.65"}, "section": {"name": "THE MODERN CITY", "sectionnum": "401", "primary_alias": "ARTH-283-401", "path": "/courses/22661/sections/401", "id": "22661-401", "aliases": ["ARTH-283-401", "ARTH-683-401"]}, "comments": "This course is a study of the European and American city in the eighteenth, nineteenth, and twentieth centuries. Emphasis will be placed on the history of architecture and urban design, but political, sociological, and economic factors will also receive attention. The class will consider the development of London, St. Petersburg, Washington, Boston, Paris, Vienna and Philadelphia.&#8232;&#8232;\r\n\r\nMost of the students who commented on the course said that it was a fantastic and very interesting course, with one student further describing it as “an extremely interesting course with wide appeal.” One student even said that they were very glad that they had taken it. Another student also mentioned that there was a “very interesting course set up.” \r\n\r\n&#8232;Students commented that Professor Brownlee was a great lecturer and very passionate about the subject matter. One student also mentioned that Professor Brownlee’s “lecture style is thoroughly engaging, approaching an air of storytelling at times.” Another student mentioned that Professor Brownlee’s “use of PowerPoint is a valuable addition.”\r\n\r\nSeveral students mentioned that the workload was very heavy for the course, especially that there was a lot of reading. A couple of students also mentioned that the exams were very hard to study for, as they “had to memorize about 400 images for the midterm, supplemented by about 600 for the cumulative final, reaching a grand total of somewhere around 1000 images.” Others also mentioned that the grading was harsh. Still, one student said that they would recommend this course to “anyone interested in architecture, city planning, modern city issues, art, history, American studies, or even just traveling.” A different student said they would be less likely to recommend this course to a non-major due to the fact that “the sheer breadth of material may result in lesser comprehension, particular among the undergraduates.”\r\n", "num_students": 31, "path": "/courses/22661/sections/401/reviews/1271-DAVID-B-BROWNLEE", "instructor": {"path": "/instructors/1271-DAVID-B-BROWNLEE", "first_name": "DAVID B", "last_name": "BROWNLEE", "id": "1271-DAVID-B-BROWNLEE", "name": "DAVID B BROWNLEE"}, "num_reviewers": 26, "id": "22661-401-1271-DAVID-B-BROWNLEE"}]