[{"ratings": {"rAmountLearned": "2.72", "rDifficulty": "3.05", "rTAQuality": "1.90", "rStimulateInterest": "2.73", "rRecommendMajor": "3.17", "rCourseQuality": "2.54", "rWorkRequired": "2.81", "rInstructorAccess": "2.36", "rReadingsValue": "2.01", "rRecommendNonMajor": "1.48", "rCommAbility": "2.82", "rInstructorQuality": "2.74"}, "section": {"name": "ADVANCED PHARMACOLOGY IN NURSING PRACTICE", "sectionnum": "001", "primary_alias": "NURS-508-001", "path": "/courses/27889/sections/001", "id": "27889-001", "aliases": ["NURS-508-001"]}, "comments": "Principles of clinical pharmacology are applied to the nursing care of family members.  Proper prescribing and monitoring procedures for the various drug regimens used to treat various disease states are reviewed.  Problems inherent in self-medication, overuse and abuse of drugs are also considered.\r\nStudents found this class engaging and relevant to their fields of study.  They occasionally felt overwhelmed by the material, but were able to recognize the purpose it served.  The majority of students thought this class presented extremely “important information” and that it should have been taught over the course of two semesters.  A guest speaker who covered the Endocrine system was particularly memorable and a popular favorite.  Despite the usefulness of the information, many students were not satisfied with their grasps of the information and felt “unprepared” to apply the material in clinical settings.\r\nDr. Boullata was “stimulating and engaging” and presented the material well.\r\nThere were only two exams in this course and students found this frustrating.  They felt that administering a third or even fourth exam would split up the material more effectively and allow a more constant study schedule.  Prerequisite: NURS 607.\r\n", "num_students": 87, "path": "/courses/27889/sections/001/reviews/3123-JOSEPH-I--BOULLATA", "instructor": {"path": "/instructors/3123-JOSEPH-I--BOULLATA", "first_name": "JOSEPH I.", "last_name": "BOULLATA", "id": "3123-JOSEPH-I--BOULLATA", "name": "JOSEPH I. BOULLATA"}, "num_reviewers": 81, "id": "27889-001-3123-JOSEPH-I--BOULLATA"}, {"ratings": {"rAmountLearned": "2.72", "rDifficulty": "3.05", "rTAQuality": "1.90", "rStimulateInterest": "3.64", "rRecommendMajor": "3.17", "rCourseQuality": "2.54", "rWorkRequired": "2.81", "rInstructorAccess": "2.76", "rReadingsValue": "2.01", "rRecommendNonMajor": "1.48", "rCommAbility": "3.69", "rInstructorQuality": "3.59"}, "section": {"name": "ADVANCED PHARMACOLOGY IN NURSING PRACTICE", "sectionnum": "001", "primary_alias": "NURS-508-001", "path": "/courses/27889/sections/001", "id": "27889-001", "aliases": ["NURS-508-001"]}, "comments": "Principles of clinical pharmacology are applied to the nursing care of family members. Proper prescribing and monitoring procedures for the various drug regimens used to treat various disease states are reviewed. Problems inherent in self-medication, overuse and abuse of drugs are also considered.\r\n\r\nStudents agreed that this course introduced a lot of information, perhaps too much to absorb at times. Some also complained that this course emphasized memorization over application and thus failed to enhance knowledge.\r\n\r\nThere are several instructors for this course, and students expressed varying levels of satisfaction. However, Dr. Carey was well liked all around, giving lectures that were described as “stimulating” and “fantastic.” \r\n\r\nThis course is a requirement for most nurse practitioner programs. NURS 607 is a prerequisite.\r\n", "num_students": 87, "path": "/courses/27889/sections/001/reviews/3441-LAWRENCE-P-CAREY", "instructor": {"path": "/instructors/3441-LAWRENCE-P-CAREY", "first_name": "LAWRENCE P", "last_name": "CAREY", "id": "3441-LAWRENCE-P-CAREY", "name": "LAWRENCE P CAREY"}, "num_reviewers": 81, "id": "27889-001-3441-LAWRENCE-P-CAREY"}]