[{"ratings": {"rAmountLearned": "3.36", "rDifficulty": "2.60", "rStimulateInterest": "3.30", "rRecommendMajor": "3.74", "rCourseQuality": "3.17", "rWorkRequired": "2.66", "rInstructorAccess": "3.21", "rReadingsValue": "2.62", "rRecommendNonMajor": "2.71", "rCommAbility": "3.15", "rInstructorQuality": "3.51"}, "section": {"name": "ARCHITECT AND HISTORY", "sectionnum": "001", "primary_alias": "ARTH-106-001", "path": "/courses/22654/sections/001", "id": "22654-001", "aliases": ["ARTH-106-001"]}, "comments": "This course, designed specifically for majors and minors in the fields of Architecture, art history, and engineering, explores great architectural monuments from the ancient to the modern period, from India across the Mediterranean and Europe to the US. The focus is on understanding these works in their structure and function, both as products of individual ingenuity and reflections of Zeitgeist. Questioning these monuments from a present-day perspective across the cultures is an important ingredient, as are podium discussions, guest lectures, excursions, and all kinds of visualizations, from digital walk-throughs to practical rope-laying experiments. There are no prerequisites for this course. &#8232;&#8232;\r\n\r\nFor the most part, students enjoyed the class, with one student calling it “one of the best classes I’ve taken at Penn.” Students also emphasized the volume of knowledge they gained from this course. However, one student did criticize the course as being “repetitive.” But overall, students appreciated their “improved ability to conceptualize and analyze architecture.”&#8232; Some students disliked the level of detail in the material, calling it “unnecessary.” One student found Professor Haselberger’s lectures “hard to follow because he uses a lot of qualifiers and filler words.” \r\n\r\n&#8232;All of the students in the course heaped praise on Professor Haselberger, calling him “enthusiastic,” “passionate,” “incredible,” “friendly,” “caring,” “inspiring” and “amazing.” Students commended Professor Haselberger for his command of the material and his “eloquent” lectures.&#8232;&#8232;\r\n\r\nStudents were divided over the course’s oral exams: some “enjoyed” the exams, while others disliked the testing style but understood the purpose of the exam style. Many students felt concerned about the workload of the course being too much for an introductory class. While the course is required for architecture students and is therefore technically driven, some students wished for more of an introduction to concepts as an aid to non-architect students. Students also had difficulty with class discussion due to the size of the class and felt that discussion would work better in a smaller setting. Students, however, enjoyed the interactive component of the course that involved field trips to buildings in Philadelphia.\r\n", "num_students": 84, "path": "/courses/22654/sections/001/reviews/127-LOTHAR-HASELBERGER", "instructor": {"path": "/instructors/127-LOTHAR-HASELBERGER", "first_name": "LOTHAR", "last_name": "HASELBERGER", "id": "127-LOTHAR-HASELBERGER", "name": "LOTHAR HASELBERGER"}, "num_reviewers": 81, "id": "22654-001-127-LOTHAR-HASELBERGER"}]