[{"ratings": {"rAmountLearned": "2.81", "rDifficulty": "3.60", "rStimulateInterest": "2.19", "rRecommendMajor": "2.97", "rCourseQuality": "2.72", "rWorkRequired": "3.31", "rInstructorAccess": "2.86", "rReadingsValue": "2.53", "rRecommendNonMajor": "1.50", "rCommAbility": "2.58", "rInstructorQuality": "2.74"}, "section": {"name": "DIGITAL SIGNAL PROC", "sectionnum": "001", "primary_alias": "ESE-531-001", "path": "/courses/24382/sections/001", "id": "24382-001", "aliases": ["ESE-531-001"]}, "comments": "Digital Signal Processing covers the fundamentals of discrete-time signals and\r\nsystems and digital filters. Specific topics covered include: review of discrete-time signal\r\nand linear system representations in the time and frequency domain, and convolution;\r\ndiscrete-time Fourier transform (DTFT); Z-transforms; frequency response of linear\r\ndiscrete-time systems; sampling of continuous-time signals, analog to digital conversion,\r\nsampling-rate conversion; basic discrete-time filter structures and types; finite impulse\r\nresponse (FIR) and infinite impulse response (IIR) filters; design of FIR and IIR filters;\r\ndiscrete Fourier transform (DFT), the fast Fourier transform (FFT) algorithm and its\r\napplications in filtering and spectrum estimation.\r\nThis course offered “great depth” and knowledge on signal processing. Highly\r\nrecommended by students, this class blends into many fields and is “definitely worth\r\nstudying” for it.\r\nProfessor Kassam received no complaints from the students, and students\r\ngenerally appreciated his teaching style.\r\nThe homework was comprehensive and time-intensive, and some students\r\ncommented that they wished it counted more toward the final grade because it required so\r\nmuch time. The midterm was not reflective of the focuses of the course and many felt\r\nthat the course was very theoretical.", "num_students": 44, "path": "/courses/24382/sections/001/reviews/358-SALEEM-A-KASSAM", "instructor": {"path": "/instructors/358-SALEEM-A-KASSAM", "first_name": "SALEEM A", "last_name": "KASSAM", "id": "358-SALEEM-A-KASSAM", "name": "SALEEM A KASSAM"}, "num_reviewers": 39, "id": "24382-001-358-SALEEM-A-KASSAM"}]