[{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "1.33", "rStimulateInterest": "3.50", "rRecommendMajor": "3.25", "rCourseQuality": "3.31", "rWorkRequired": "1.75", "rInstructorAccess": "3.75", "rReadingsValue": "3.00", "rRecommendNonMajor": "3.25", "rCommAbility": "3.27", "rInstructorQuality": "3.46"}, "section": {"name": "ENVIRONMENTAL GEOLOGY", "sectionnum": "001", "primary_alias": "GEOL-401-001", "path": "/courses/21781/sections/001", "id": "21781-001", "aliases": ["GEOL-401-001"]}, "comments": "The purpose of this course is to better understand the interactions of humans and the environment through an examination of geologic processes and features as they influence, and are influenced, by human activities. The ultimate goal of such study is to make better land use decisions. Following a review of some basic geologic concepts, we study hazardous geologic processes including volcanic eruptions, earthquakes, river flooding, coastal flooding and erosion, landslides, and subsidence. Next, we discuss environmental impacts associated with the use of fossil fuels, water, and soils. The course concludes with student presentations of selected topics in environmental geology.\r\n\r\nStudents felt the course was very good in terms of “covering a broad range of topics.”\r\n\r\nStudents heaped praise upon Professor Willig, citing her “passion for the subject,” and “unbridled, contagious enthusiasm.” Furthermore, students could tell Professor Willig “really cared about her students’ ability to comprehend material and enjoy the topics.”\r\n\r\nClass time included a combination of lecturing by the Professor and student presentations, as well as field trips.\r\n\r\n*8 respondents\r\n", "num_students": 16, "path": "/courses/21781/sections/001/reviews/572-SARAH-A--WILLIG", "instructor": {"path": "/instructors/572-SARAH-A--WILLIG", "first_name": "SARAH A.", "last_name": "WILLIG", "id": "572-SARAH-A--WILLIG", "name": "SARAH A. WILLIG"}, "num_reviewers": 14, "id": "21781-001-572-SARAH-A--WILLIG"}]