[{"ratings": {"rAmountLearned": "2.73", "rDifficulty": "2.06", "rStimulateInterest": "3.02", "rRecommendMajor": "3.14", "rCourseQuality": "2.90", "rWorkRequired": "1.14", "rInstructorAccess": "3.19", "rReadingsValue": "2.51", "rRecommendNonMajor": "3.03", "rCommAbility": "3.34", "rInstructorQuality": "3.34"}, "section": {"name": "PHIL OF SPACE & TIME", "sectionnum": "401", "primary_alias": "PHIL-026-401", "path": "/courses/23616/sections/401", "id": "23616-401", "aliases": ["PHIL-026-401", "STSC-026-401"]}, "comments": "This course provides an introduction to the philosophy and intellectual history of space-time and cosmological models from ancient to modern times with special emphasis on paradigm shifts. The course also covers Einstein’s theories of special and general relativity and cosmology. Other topics include Big Bang, black holes stellar structure, the metaphysics of substance, particles, fields, and superstrings, unification and grand unification of modern physical theories. No philosophy of physics background is presupposed. \r\n\r\nMany students felt that this course did not live up to its interesting description. Students reported that this course did not spark interest in the subject matter and the course “was not worth getting up for.” Some students especially interested in philosophy, astronomy, or cosmology enjoyed the course, but they were a minority. \r\n\r\nAlthough students did not like the course’s subject matter, they thought Professor Domotor was a good lecturer. Professor Domotor was “extremely nice and willing to answer questions.” They praised Professor Domotor for his passion and reported that he was approachable. \r\n\r\nStudents complained that although there was not a lot of work throughout the semester, the class was hard because their grade depended on only two exams, which were generally seen as difficult.", "num_students": 103, "path": "/courses/23616/sections/401/reviews/954-ZOLTAN-DOMOTOR", "instructor": {"path": "/instructors/954-ZOLTAN-DOMOTOR", "first_name": "ZOLTAN", "last_name": "DOMOTOR", "id": "954-ZOLTAN-DOMOTOR", "name": "ZOLTAN DOMOTOR"}, "num_reviewers": 90, "id": "23616-401-954-ZOLTAN-DOMOTOR"}]