[{"ratings": {"rAmountLearned": "1.64", "rDifficulty": "2.00", "rStimulateInterest": "1.06", "rRecommendMajor": "1.74", "rCourseQuality": "1.44", "rWorkRequired": "2.31", "rInstructorAccess": "1.86", "rReadingsValue": "1.71", "rRecommendNonMajor": "1.22", "rCommAbility": "1.47", "rInstructorQuality": "1.39"}, "section": {"name": "FROM LAB TO MKT PLACE", "sectionnum": "001", "primary_alias": "BE-502-001", "path": "/courses/21326/sections/001", "id": "21326-001", "aliases": ["BE-502-001"]}, "comments": "This course explores the transition from the discovery of fundamental knowledge to its ultimate application in a clinical device or drug. Emphasis is placed upon factors that influence this transition and upon the integrative requirements across many fields necessary to achieve commercial success. Special emphasis is placed on entrepreneurial strategies, intellectual property, financing, and the FDA process of proving safety and efficacy. Current public companies in the medical device and drug industry are studied in detail and critiqued against principles developed in class.&#8232;&#8232;Most students felt that the broad topics of this course were very interesting, but that the course did not go into as much detailed analysis as they would have liked. More specifically, students expressed that “more business perspective would have been helpful.”&#8232;&#8232;Students generally felt that Professor Ducheyne was “boring” and presented information “poorly.” Some even felt that the way he progressed with the material throughout the course was “disjointed” and that his lectures were “hard to follow.” &#8232;&#8232;Students thought that Professor Ducheyne did not provide enough useful feedback on small assignments that were integral to the final paper. This course is only open to BE graduate students, seniors, and undergraduates with permission from the instructor.", "num_students": 50, "path": "/courses/21326/sections/001/reviews/1798-PAUL-L-R--DUCHEYNE", "instructor": {"path": "/instructors/1798-PAUL-L-R--DUCHEYNE", "first_name": "PAUL L.R.", "last_name": "DUCHEYNE", "id": "1798-PAUL-L-R--DUCHEYNE", "name": "PAUL L.R. DUCHEYNE"}, "num_reviewers": 46, "id": "21326-001-1798-PAUL-L-R--DUCHEYNE"}]