{"coursehistories": {"path": "/coursehistories/2892"}, "description": "Contemporary debates over the mind-body problem were launched over fifty years ago. But of course the classic positions began to emerge as early as the pre-Socratic Greeks. The problem is not getting any easier. There are some fasinating solutions, to be sure. But there are no uncontroversial ones in sight. The aim of this seminar is to examine leading solutions to the mind-bodyproblem in light of their metaphysical credentials. In particular, the solutions will be considered in relation to theories of the nature of substance and properties in contemporary metaphysics. Most answers to the mind-body problem are claims about the nature of mental properties and mental substances, after all. The seminar will illustrate that certain leading approaches to the mind-body problem look quite different - in certain cases they are even incoherent-- once their metaphysical commitments are better understood. Philosophy of mind originally grew out ot metaphysics; we will approach the mind-body problem by piecing them back together. I shall see fit to rule out some customary solutions: we must discard non-reductive physicalism, together with a qualia-based property dualism that aspires to a physicalism about substance. These cannot be genuinely physicalist about \n\nsubstances, at least given the state of play in the domain of the metaphysics of substance. I will then construct what I believe to be more plausible, if neglected, solutions. Namely, I will develop a trope-based physicalism as well as a form of \"naturalistic substance dualism\"--one motivated by the irreducibility of phenomenal properties, in particular. \n\n", "semester": "2004A", "name": "PHILOSOPHY OF MIND: Scientific Explanations & Philosophical Perspectives", "reviews": {"path": "/courses/6974/reviews", "values": [{"ratings": {"rAmountLearned": "3.44", "rDifficulty": "2.75", "rStimulateInterest": "3.89", "rRecommendMajor": "3.67", "rCourseQuality": "3.44", "rWorkRequired": "2.44", "rInstructorAccess": "3.89", "rReadingsValue": "3.56", "rRecommendNonMajor": "3.33", "rCommAbility": "3.78", "rInstructorQuality": "3.89"}, "section": {"name": "PHILOSOPHY OF MIND: Scientific Explanations & Philosophical Perspectives", "sectionnum": "640", "primary_alias": "PHIL-430-640", "path": "/courses/6974/sections/640", "id": "6974-640", "aliases": ["PHIL-430-640"]}, "comments": "", "num_students": 12, "path": "/courses/6974/sections/640/reviews/943-GARY-PURPURA", "instructor": {"path": "/instructors/943-GARY-PURPURA", "first_name": "GARY", "last_name": "PURPURA", "id": "943-GARY-PURPURA", "name": "GARY PURPURA"}, "num_reviewers": 9, "id": "6974-640-943-GARY-PURPURA"}]}, "credits": null, "primary_alias": "PHIL-430", "path": "/courses/6974", "sections": {"path": "/courses/6974/sections", "values": [{"name": "PHILOSOPHY OF MIND: Scientific Explanations & Philosophical Perspectives", "sectionnum": "640", "primary_alias": "PHIL-430-640", "path": "/courses/6974/sections/640", "id": "6974-640", "aliases": ["PHIL-430-640"]}]}, "id": 6974, "aliases": ["PHIL-430"]}