{"coursehistories": {"path": "/coursehistories/4706"}, "description": "You know how to program, but do you know how to implement a programming language? In CIS341 you'll learn how to build a compiler. Topics covered include: lexical analysis, grammars and parsing, intermediate representations, syntax-directed translation, code generation, type checking, simple dataflow and control-flow analyses, and optimizations. Along the way, we study objects and inheritance, first-class functions (closures), data representation and runtime-support issues such as garbage collection. This is a challenging, implementation-oriented course in which students build a full compiler from a simple, typed object-oriented language to fully operational x86 assembly. The course projects are implemented using OCaml, but no knowledge of OCaml is assumed. \n\n", "semester": "2011A", "name": "COMPILERS & INTERPRETER", "reviews": {"path": "/courses/21454/reviews", "values": [{"ratings": {"rAmountLearned": "3.76", "rDifficulty": "3.24", "rStimulateInterest": "3.00", "rRecommendMajor": "3.69", "rCourseQuality": "3.41", "rWorkRequired": "3.82", "rInstructorAccess": "3.81", "rReadingsValue": "2.79", "rRecommendNonMajor": "0.59", "rCommAbility": "3.35", "rInstructorQuality": "3.59"}, "section": {"name": "COMPILERS & INTERPRETER", "sectionnum": "001", "primary_alias": "CIS-341-001", "path": "/courses/21454/sections/001", "id": "21454-001", "aliases": ["CIS-341-001"]}, "comments": "Officially titled “Compilers and Interpreters,” CIS341 aims to show students what goes into implementing a programming language. Rather than learning a new language, students taking this course learn how to build a compiler. The course covers objects and inheritance, data representation, lexical analysis, syntax-directed translation, and optimizations. The course projects are implemented using OCaml, but no knowledge of OCaml is assumed.&#8232;&#8232;Students generally found the course to be difficult and challenging, although many reported that “the class finally explained a number [of] things that seemed very mysterious to [them].” One student reported that this course “is the most intense course in [the CIS] undergrad department,” but that it was very rewarding nevertheless. Many students found it difficult to transition to using OCaml, as it was “very different [from] the majority of [programming] languages, which are imperative, such as C, Java, Python, etc.”&#8232;&#8232;Professor Zdancewic’s lecturing was reported as “not phenomenal,” even though the material was great. Many students felt that he would put too much information on the slides, and they would have “loved to have those slides as hand-outs and have [Professor Zdancewic] lecture using a board and nothing else.” Although some students found Professor Zdancewic “inaccessible and distant at times,” the same students reported that the “course staff (instructor and TA) put enormous amounts of work into making the assignments.”&#8232;&#8232;CIS341 is an undergraduate level Computer Science course that can be taken either as an elective or to satisfy the Computer Science project course requirement. Students found the course to be heavily project-oriented and much more time consuming than other courses. The projects in the class were extensive and required “quite a bit of work,” although students reported that “[they] were warned.”", "num_students": 24, "path": "/courses/21454/sections/001/reviews/1357-STEPHAN-A--ZDANCEWIC", "instructor": {"path": "/instructors/1357-STEPHAN-A--ZDANCEWIC", "first_name": "STEPHAN A.", "last_name": "ZDANCEWIC", "id": "1357-STEPHAN-A--ZDANCEWIC", "name": "STEPHAN A. ZDANCEWIC"}, "num_reviewers": 18, "id": "21454-001-1357-STEPHAN-A--ZDANCEWIC"}]}, "credits": null, "primary_alias": "CIS-341", "path": "/courses/21454", "sections": {"path": "/courses/21454/sections", "values": [{"name": "COMPILERS & INTERPRETER", "sectionnum": "001", "primary_alias": "CIS-341-001", "path": "/courses/21454/sections/001", "id": "21454-001", "aliases": ["CIS-341-001"]}]}, "id": 21454, "aliases": ["CIS-341"]}