{"coursehistories": {"path": "/coursehistories/2901"}, "description": "This class examines the strategy and politics of warfare, focusing on the way actors plan military campaigns and the factors that are likely to lead to victory and defeat. The course readings center in particular on the factors driving changes in warfare and civil-military relations. The course will cover a wide range of topics from theories of war-fighting to historical military campaigns to insurgency warfare, terrorism, and the future of war. \n\n", "semester": "2011C", "name": "WAR, STRATEGY & POLITICS", "reviews": {"path": "/courses/25013/reviews", "values": [{"ratings": {"rAmountLearned": "3.38", "rDifficulty": "3.34", "rStimulateInterest": "3.78", "rRecommendMajor": "3.88", "rCourseQuality": "3.68", "rWorkRequired": "3.75", "rInstructorAccess": "3.65", "rReadingsValue": "2.78", "rRecommendNonMajor": "2.81", "rCommAbility": "3.91", "rInstructorQuality": "3.90"}, "section": {"name": "WAR, STRATEGY & POLITICS", "sectionnum": "001", "primary_alias": "PSCI-252-001", "path": "/courses/25013/sections/001", "id": "25013-001", "aliases": ["PSCI-252-001"]}, "comments": "Political Science 252 examines the strategy and politics of warfare, focusing on the way actors plan military campaigns and the factors that are likely to lead to victory and defeat. The course readings center in particular on the factors driving changes in warfare and civil-military relations. The course will cover a wide range of topics from theories of war-fighting to historical military campaigns to insurgency warfare, terrorism, and the future of war.\r\n\r\nWhile most students noted that this class was “tough,” many praised it for its “uniqueness” and thoroughly enjoyed it. The wealth of knowledge offered by this class was said to be both “comprehensible and fascinating in every way.” While students liked the lecture very much, they almost exclusively thought that the amount of reading was “ridiculous” and “unbelievable,” stating that it was “impossible to get through all of the assigned readings.” Students believed that, had the amount of readings been cut down, they would have gotten much more out of this class.\r\n\r\nProfessor Horowitz was described as “smart, compelling, and approachable,” as well as a “great professor.” He was very forward with his assignments and organized, but he “expected a lot from his students.” He was easily understandable and presented the material in a way that was both “fascinating and exciting.”\r\n\r\nAside from the amount of readings, students remarked that the grading in this class could have been better, with almost the entire grade coming from a single midterm and final. Students expressed that they wished they had a small paper to detract from the weight of the tests.\r\n", "num_students": 50, "path": "/courses/25013/sections/001/reviews/4083-MICHAEL-HOROWITZ", "instructor": {"path": "/instructors/4083-MICHAEL-HOROWITZ", "first_name": "MICHAEL", "last_name": "HOROWITZ", "id": "4083-MICHAEL-HOROWITZ", "name": "MICHAEL HOROWITZ"}, "num_reviewers": 40, "id": "25013-001-4083-MICHAEL-HOROWITZ"}]}, "credits": null, "primary_alias": "PSCI-252", "path": "/courses/25013", "sections": {"path": "/courses/25013/sections", "values": [{"name": "WAR, STRATEGY & POLITICS", "sectionnum": "001", "primary_alias": "PSCI-252-001", "path": "/courses/25013/sections/001", "id": "25013-001", "aliases": ["PSCI-252-001"]}]}, "id": 25013, "aliases": ["PSCI-252"]}