{"coursehistories": {"path": "/coursehistories/2623"}, "description": "", "semester": "2011A", "name": "PERSONNE/HUM RES MGMT", "reviews": {"path": "/courses/22042/reviews", "values": [{"ratings": {"rAmountLearned": "2.67", "rDifficulty": "2.36", "rStimulateInterest": "2.59", "rRecommendMajor": "2.76", "rCourseQuality": "2.36", "rWorkRequired": "2.55", "rInstructorAccess": "2.86", "rReadingsValue": "2.32", "rRecommendNonMajor": "2.52", "rCommAbility": "2.77", "rInstructorQuality": "2.73"}, "section": {"name": "PERSONNE/HUM RES MGMT", "sectionnum": "001", "primary_alias": "MGMT-422-001", "path": "/courses/22042/sections/001", "id": "22042-001", "aliases": ["MGMT-422-001"]}, "comments": "This class focuses on the theory and practice of personnel management and\r\nhuman resource issues in organizations of all types. The course aims to enable managers\r\nto understand the human aspects of his or her job and adapt this knowledge to the\r\nefficient use of human resources. It emphasizes overall management responsibilities\r\nrelating to HR rather than the procedural aspects of personnel management.\r\nStudents found the subject area of this course to be “dry,” especially the way it\r\nwas presented in the textbook. Students felt that an inordinate amount of time was spent\r\non legal topics, which were especially dull. However, students also reported that this\r\nclass with be helpful because it “covered all the pertinent areas of HR.”\r\nOverall, students found Professor Francesco to be a knowledgeable and\r\ninteresting professor. They applauded Professor Francesco’s “ability to express the\r\nmaterial,” and thought she was “very passionate about HR.” In addition, they thought\r\nProfessor Francesco was organized, and that her assignments were helpful in learning the\r\nmaterial.\r\nThough students enjoyed Professor Francesco’s presentation of the material, they\r\nfound that the projects assigned were too time consuming to only count for 25% of the\r\noverall grade. One student reported that the class “rarely made it through an entire\r\nlecture, which is a shame,” and that there were several topics that were self-taught.\r\nStudents thought that this class would be worthwhile for anyone who has never had\r\nexposure to Human Resource Management, as it covers a wealth of relevant material.\r\nThis course is part of the Wharton Program for Working Professionals.\r\n*Based on 7 written reviews.", "num_students": 26, "path": "/courses/22042/sections/001/reviews/1573-ANGELA-FRANCESCO", "instructor": {"path": "/instructors/1573-ANGELA-FRANCESCO", "first_name": "ANGELA", "last_name": "FRANCESCO", "id": "1573-ANGELA-FRANCESCO", "name": "ANGELA FRANCESCO"}, "num_reviewers": 23, "id": "22042-001-1573-ANGELA-FRANCESCO"}]}, "credits": null, "primary_alias": "MGMT-422", "path": "/courses/22042", "sections": {"path": "/courses/22042/sections", "values": [{"name": "PERSONNE/HUM RES MGMT", "sectionnum": "001", "primary_alias": "MGMT-422-001", "path": "/courses/22042/sections/001", "id": "22042-001", "aliases": ["MGMT-422-001"]}]}, "id": 22042, "aliases": ["MGMT-422"]}