{"coursehistories": {"path": "/coursehistories/295"}, "description": "This course examines children's relationship to media in its historic, economic, political and social contexts. The class begins with an exploration of the ways in which \"childhood\" is created and understood as a time of life that is qualitatively unique and socially constructed over time. It continues with a review of various theories of child development as they inform children's relationship with and understanding of television and other household media. It next reviews public policies designed to empower parents and limit children's exposure to potentially problematic media content and simultaneously considers the economic forces that shape what children see and buy. Children and Media concludes with a critical examination of research on the impact of media on children's physical, cognitive, social and psychological development. \n\n", "semester": "2012A", "name": "CHILDREN & MEDIA", "reviews": {"path": "/courses/27204/reviews", "values": [{"ratings": {"rAmountLearned": "3.34", "rDifficulty": "2.36", "rStimulateInterest": "3.61", "rRecommendMajor": "3.84", "rCourseQuality": "3.65", "rWorkRequired": "2.36", "rInstructorAccess": "3.42", "rReadingsValue": "2.82", "rRecommendNonMajor": "3.20", "rCommAbility": "3.79", "rInstructorQuality": "3.78"}, "section": {"name": "CHILDREN & MEDIA", "sectionnum": "001", "primary_alias": "COMM-225-001", "path": "/courses/27204/sections/001", "id": "27204-001", "aliases": ["COMM-225-001"]}, "comments": "This course examines children's relationship to media in its historic, economic, political and social contexts. The class explores the ways in which \"childhood\" is created and understood as a time of life that is qualitatively unique and socially constructed over time. It continues with a review of various theories of child development as they inform children's relationship with and understanding of television and other household media. It next reviews public policies designed to empower parents and limit children's exposure to potentially problematic media content and simultaneously considers the economic forces that shape what children see and buy. The course concludes with a critical examination of research on the impact of media on children's physical, cognitive, social and psychological development.\r\n\tStudents very much enjoyed this course: it was described as a “wonderful course” and “amazing.” The material covered was “relevant and applicable” and was also described as “really interesting.” The exams were described as “very fair.”\r\n\tProfessor Jordan was universally praised by her students, who found her to be “brilliant, kind and accessible” as well as “understanding and clear” and a “terrific lecturer.” She was lauded for encouraging “students to participate by asking questions and by facilitating discussion.” \r\n\tThis course was praised by all students who commented: not one negative comment was made. Professor Jordan received great reviews, and the course material was described as both interesting and “worth it.”", "num_students": 51, "path": "/courses/27204/sections/001/reviews/281-AMY-B--JORDAN", "instructor": {"path": "/instructors/281-AMY-B--JORDAN", "first_name": "AMY B.", "last_name": "JORDAN", "id": "281-AMY-B--JORDAN", "name": "AMY B. JORDAN"}, "num_reviewers": 49, "id": "27204-001-281-AMY-B--JORDAN"}]}, "credits": null, "primary_alias": "COMM-225", "path": "/courses/27204", "sections": {"path": "/courses/27204/sections", "values": [{"name": "CHILDREN & MEDIA", "sectionnum": "001", "primary_alias": "COMM-225-001", "path": "/courses/27204/sections/001", "id": "27204-001", "aliases": ["COMM-225-001"]}]}, "id": 27204, "aliases": ["COMM-225"]}