{"coursehistories": {"path": "/coursehistories/112"}, "description": "How did humans evolve? When did humans start to walk on two legs? How are humans related to non-human primates? This course focuses on the scientific study of human evolution describing the emergence, development, and diversification of our species, Homo sapiens. First we cover the fundamental principles of evolutionary theory and some of the basics of genetics and heredity as they relate to human morphological, physiological, and genetic variation. We then examine what studies of nonhuman primates (monkeys and apes) can reveal about our own evolutionary past, reviewing the behavioral and ecological diversity seen among living primates. We conclude the course examining the \"hard\" evidence of human evolution - the fossil and material culture record of human history from our earliest primate ancestors to the emergence of modern Homo sapiens. You will also have the opportunity, during recitations, to conduct hands-on exercises collecting and analyzing behavioral, morphological, and genetic data on both humans and nonhuman primates and working with the Department of Anthropology's extensive collection of fossil casts. \n\n", "semester": "2008A", "name": "INTRO HUMAN EVOLUTION", "reviews": {"path": "/courses/19732/reviews", "values": [{"ratings": {"rAmountLearned": "2.68", "rDifficulty": "2.22", "rStimulateInterest": "2.71", "rRecommendMajor": "3.25", "rCourseQuality": "2.65", "rWorkRequired": "1.94", "rInstructorAccess": "3.09", "rReadingsValue": "2.62", "rRecommendNonMajor": "2.31", "rCommAbility": "2.79", "rInstructorQuality": "2.92"}, "section": {"name": "INTRO HUMAN EVOLUTION", "sectionnum": "001", "primary_alias": "ANTH-003-001", "path": "/courses/19732/sections/001", "id": "19732-001", "aliases": ["ANTH-003-001"]}, "comments": "How did humans evolve? When did humans start to walk on two legs? How are humans related to non-human primates? This course focuses on the scientific study of human evolution describing the emergence, development, and diversification of our species, Homo sapiens. First we cover the fundamental principles of evolutionary theory and some of the basics of genetics and heredity as they relate to human morphological, physiological, and genetic variation. We then examine what studies of nonhuman primates (monkeys and apes) can reveal about our own evolutionary past, reviewing the behavioral and ecological diversity seen among living primates. We conclude the course examining the \\\"hard\\\" evidence of human evolution - the fossil and material culture record of human history from our earliest primate ancestors to the emergence of modern Homo sapiens. You will also have the opportunity, during recitations, to conduct hands-on exercises collecting and analyzing behavioral, morphological, and genetic data on both humans and nonhuman primates and working with the Department of Anthropology\\'s extensive collection of fossil casts.\r\n\r\nMost students found this course’s concepts to be “fun” and “engaging,” first focusing on basic biology, then primatology, and finally human evolution.  While interesting, some found lectures to be too detailed, covering a large amount of material and sometimes getting “caught up in the minor detailed descriptions” of species.  Despite this, one student commented that she “loved this class” and judged it to be “definitely one of the best at Penn.”\r\n\r\nStudents consistently praised Professor Fernandez-Duque for his “enthusiasm” and “passion” for both his subject and students.  They could see he “clearly put a lot of effort into preparing for and teaching this course” and made it “very related to contemporary issues.” While some students thought his lectures were “conducted at a good speed,” others believed he “needed to slow down and explain more.”\r\n\r\nRegarding exams, some students felt they were “not a good gauge of knowledge for the course” and were often unclear as to what material would be tested. Exams tended to be text-heavy and graded strictly. This class is recommended for majors and non-majors alike.  Many non-Anthropology students took this class in order to fulfill the Living World sector requirement.", "num_students": 104, "path": "/courses/19732/sections/001/reviews/2848-EDUARDO-FERNANDEZ-DUQUE", "instructor": {"path": "/instructors/2848-EDUARDO-FERNANDEZ-DUQUE", "first_name": "EDUARDO", "last_name": "FERNANDEZ-DUQUE", "id": "2848-EDUARDO-FERNANDEZ-DUQUE", "name": "EDUARDO FERNANDEZ-DUQUE"}, "num_reviewers": 72, "id": "19732-001-2848-EDUARDO-FERNANDEZ-DUQUE"}, {"ratings": {"rAmountLearned": "3.04", "rDifficulty": "2.70", "rStimulateInterest": "3.30", "rRecommendMajor": "3.44", "rCourseQuality": "2.89", "rWorkRequired": "2.22", "rInstructorAccess": "3.52", "rReadingsValue": "2.85", "rRecommendNonMajor": "2.78", "rCommAbility": "3.41", "rInstructorQuality": "3.56"}, "section": {"name": "INTRO HUMAN EVOLUTION", "sectionnum": "601", "primary_alias": "ANTH-003-601", "path": "/courses/19732/sections/601", "id": "19732-601", "aliases": ["ANTH-003-601"]}, "comments": "", "num_students": 29, "path": "/courses/19732/sections/601/reviews/3525-EMILY-RENSCHLER", "instructor": {"path": "/instructors/3525-EMILY-RENSCHLER", "first_name": "EMILY", "last_name": "RENSCHLER", "id": "3525-EMILY-RENSCHLER", "name": "EMILY RENSCHLER"}, "num_reviewers": 27, "id": "19732-601-3525-EMILY-RENSCHLER"}]}, "credits": null, "primary_alias": "ANTH-003", "path": "/courses/19732", "sections": {"path": "/courses/19732/sections", "values": [{"name": "INTRO HUMAN EVOLUTION", "sectionnum": "001", "primary_alias": "ANTH-003-001", "path": "/courses/19732/sections/001", "id": "19732-001", "aliases": ["ANTH-003-001"]}, {"name": "INTRO HUMAN EVOLUTION", "sectionnum": "601", "primary_alias": "ANTH-003-601", "path": "/courses/19732/sections/601", "id": "19732-601", "aliases": ["ANTH-003-601"]}]}, "id": 19732, "aliases": ["ANTH-003"]}