[{"ratings": {"rAmountLearned": "3.23", "rDifficulty": "1.77", "rStimulateInterest": "3.65", "rRecommendMajor": "3.65", "rCourseQuality": "3.56", "rWorkRequired": "2.19", "rInstructorAccess": "3.77", "rReadingsValue": "3.04", "rRecommendNonMajor": "3.38", "rCommAbility": "3.50", "rInstructorQuality": "3.67"}, "section": {"name": "ART AND BUSINESS OF FILM", "sectionnum": "401", "primary_alias": "CINE-285-401", "path": "/courses/27140/sections/401", "id": "27140-401", "aliases": ["CINE-285-401", "MGMT-253-401"]}, "comments": "", "num_students": 31, "path": "/courses/27140/sections/401/reviews/3285-KATHLEEN-DEMARCO-VAN-CLEVE", "instructor": {"path": "/instructors/3285-KATHLEEN-DEMARCO-VAN-CLEVE", "first_name": "KATHLEEN DEMARCO", "last_name": "VAN CLEVE", "id": "3285-KATHLEEN-DEMARCO-VAN-CLEVE", "name": "KATHLEEN DEMARCO VAN CLEVE"}, "num_reviewers": 29, "id": "27140-401-3285-KATHLEEN-DEMARCO-VAN-CLEVE"}, {"ratings": {"rAmountLearned": "3.23", "rDifficulty": "1.77", "rStimulateInterest": "3.42", "rRecommendMajor": "3.65", "rCourseQuality": "3.56", "rWorkRequired": "2.19", "rInstructorAccess": "3.63", "rReadingsValue": "3.04", "rRecommendNonMajor": "3.38", "rCommAbility": "3.54", "rInstructorQuality": "3.67"}, "section": {"name": "ART AND BUSINESS OF FILM", "sectionnum": "401", "primary_alias": "CINE-285-401", "path": "/courses/27140/sections/401", "id": "27140-401", "aliases": ["CINE-285-401", "MGMT-253-401"]}, "comments": "This course explores how a screenplay is conceptualized and developed, the role of agency relationships in the film business, and - casting as wide a net as possible - the financing, production, direction, distribution, exhibition and marketing of both independent and studio films. A combination of lectures by instructors and practitioners, case studies, film screenings, and consulting projects with independent and Hollywood creators, packagers, financiers, exhibitors, distributors and publicists will illustrate the relationship between the art of film and the business of film. Guests will include screenwriters, agents, producers, directors, distributors, film festival curators and film critics. In short, the course tries to cover all aspects of making a film, and explores that often-tricky intersection of art and commerce.\r\n\r\n\tOverall, students really enjoyed this course, many of them describing it as the best class they had taken at Penn.  The class was described as “useful” and “a lot of fun,” and a great course for “anyone with an interest in the entertainment business.”  Several students noted that “the class could benefit from a lot more organization and structure,” but one student believed the disorganization was due to the fact that this was only “the second time the course [had] been taught in its current format.”  While most students found the level of the class to be appropriate, one student felt that the “expectations for the movie filming were too high.”\r\n\r\n\tBoth professors were described as “kind, intelligent, knowledgeable, funny, and down to earth,” and were said to “know their subject matter very well.”  Because of their experience in the film industry, the professors were thought to “bring a grounded and practical approach to teaching a class about how the film industry actually works.”\r\n\r\n\tNot much was said about the assignments, except that they “were great because they simulated real world situations in the film industry, such as working with groups and having to collaborate with others.”  Additionally, one student wished there had been “more guest speakers in addition to the professors.”  This review was based on eight student comments.", "num_students": 31, "path": "/courses/27140/sections/401/reviews/3296-EMORY-B-VAN-CLEVE", "instructor": {"path": "/instructors/3296-EMORY-B-VAN-CLEVE", "first_name": "EMORY B", "last_name": "VAN CLEVE", "id": "3296-EMORY-B-VAN-CLEVE", "name": "EMORY B VAN CLEVE"}, "num_reviewers": 29, "id": "27140-401-3296-EMORY-B-VAN-CLEVE"}]