[{"ratings": {"rAmountLearned": "3.39", "rDifficulty": "3.29", "rStimulateInterest": "3.58", "rRecommendMajor": "3.87", "rCourseQuality": "3.41", "rWorkRequired": "3.48", "rInstructorAccess": "3.90", "rReadingsValue": "2.29", "rRecommendNonMajor": "1.55", "rCommAbility": "3.65", "rInstructorQuality": "3.79"}, "section": {"name": "COMPLEX ANALYSIS", "sectionnum": "001", "primary_alias": "MATH-410-001", "path": "/courses/17651/sections/001", "id": "17651-001", "aliases": ["MATH-410-001"]}, "comments": "MATH410 exposes students to complex analysis, looking at functions and calculus in the complex numbers. Topics include complex numbers, DeMoivre’s theorem, complex-valued functions of complex variables, derivatives, analytic functions, the Cauchy-Riemann equations, complex integration, Cauchy’s integral theorem, residues, computation of definite integrals by residues, and elementary conformal mapping. The textbook used was Complex Analysis (Princeton Lectures in Analysis), by Stein.\r\n\r\nIn general, students rated the course positively and described it as “excellent.” One student suggested that the class could have a better introduction to complex functions.\r\n\r\nProfessor DeTurck was rated positively by students, who described him as “the model of a good math teacher.” Many said he was a great lecturer who was also very approachable and willing to help during office hours. The one criticism that emerged was that Professor DeTurck went through some of the more complicated proofs a bit too quickly.\r\n\r\nMATH241 is listed as a prerequisite for MATH410, but MATH240 will also suffice. Most students taking this class were mathematics majors. Students found homework to be “very difficult,” but said exams were “fairly forgiving.”", "num_students": 36, "path": "/courses/17651/sections/001/reviews/1555-DENNIS-M--DETURCK", "instructor": {"path": "/instructors/1555-DENNIS-M--DETURCK", "first_name": "DENNIS M.", "last_name": "DETURCK", "id": "1555-DENNIS-M--DETURCK", "name": "DENNIS M. DETURCK"}, "num_reviewers": 33, "id": "17651-001-1555-DENNIS-M--DETURCK"}]