{"coursehistories": {"path": "/coursehistories/2567"}, "description": "Overview of existing device and manufacturing technologies in microelectronics, optoelectronics, magnetic storage, Microsystems, and biotechnology. Overview of near- and long-term challenges facing those fields. Near- and long-term prospects of nanoscience and related technologies for the evolutionary sustension of current approaches, and for the development of revolutionary designs and applications. \n\n", "semester": "2011C", "name": "NANOSCALE SCIENCE & ENG", "reviews": {"path": "/courses/24379/reviews", "values": [{"ratings": {"rAmountLearned": "3.19", "rDifficulty": "3.26", "rStimulateInterest": "2.82", "rRecommendMajor": "3.24", "rCourseQuality": "2.90", "rWorkRequired": "3.14", "rInstructorAccess": "3.32", "rReadingsValue": "2.87", "rRecommendNonMajor": "1.95", "rCommAbility": "2.97", "rInstructorQuality": "3.08"}, "section": {"name": "NANOSCALE SCIENCE & ENG", "sectionnum": "401", "primary_alias": "ESE-525-401", "path": "/courses/24379/sections/401", "id": "24379-401", "aliases": ["ESE-525-401", "MSE-525-401"]}, "comments": "Nanoscale Science and Engineering provides an overview of existing device and\r\nmanufacturing technologies in microelectronics, optoelectronics, magnetic storage,\r\nMicrosystems, and biotechnology, along with an overview of near- and long-term\r\nchallenges facing those fields. Near- and long-term prospects of nanoscience and related\r\ntechnologies for the evolutionary sustention of current approaches, and for the\r\ndevelopment of revolutionary designs and applications are discussed during this course.\r\nStudents viewed this class as “very insightful” and “enjoyable.” This course was\r\nwell structured and covered a broad range of material, leaving students with a great deal\r\nof “different kinds of nanomaterial” knowledge.\r\nStudents appreciated that Professor Kagan kept her Blackboard page so organized\r\nand up-to-date; the notes and readings for this course were posted so that students could\r\nread them before class and come prepared.\r\nOverall, students appreciated this course, but wished that the material aligned\r\nwith the homework and tests better. The exams were often thought to be too long, and\r\nstudents had a difficult time trying to follow some of the material if they had not been\r\nexposed to semiconductor and transistor concepts before this course.", "num_students": 48, "path": "/courses/24379/sections/401/reviews/3961-CHERIE-R--KAGAN", "instructor": {"path": "/instructors/3961-CHERIE-R--KAGAN", "first_name": "CHERIE R.", "last_name": "KAGAN", "id": "3961-CHERIE-R--KAGAN", "name": "CHERIE R. KAGAN"}, "num_reviewers": 39, "id": "24379-401-3961-CHERIE-R--KAGAN"}]}, "credits": null, "primary_alias": "ESE-525", "path": "/courses/24379", "sections": {"path": "/courses/24379/sections", "values": [{"name": "NANOSCALE SCIENCE & ENG", "sectionnum": "401", "primary_alias": "ESE-525-401", "path": "/courses/24379/sections/401", "id": "24379-401", "aliases": ["ESE-525-401", "MSE-525-401"]}]}, "id": 24379, "aliases": ["ESE-525", "MSE-525"]}