{"coursehistories": {"path": "/coursehistories/4556"}, "description": "This course is designed to introduce students to econometric techniques and their applications in economic analysis and decision-making. The main objective of the course is to train the student in (i) handling economic data; (ii) quantitative analyses of economic models with probabilistic tools; (iii) econometric techniques, their application as well as their statistical and practical interpretation; (iv) implementing these techniques on a computer. Estimation and inference procedures are formally analyzed for simple econometric models and illustrated by empirical case studies using real-life data. The course covers linear regression models, simultaneous-equations models, discrete choice models and univariate time series models. Estimation and Inference is conducted using least squares and likelihood based techniques. Students are required to perform several econometric analyses of their own. \n\n", "semester": "2010C", "name": "ECONOMETRICS", "reviews": {"path": "/courses/22926/reviews", "values": [{"ratings": {"rAmountLearned": "2.21", "rDifficulty": "2.60", "rStimulateInterest": "1.33", "rRecommendMajor": "2.77", "rCourseQuality": "2.02", "rWorkRequired": "2.30", "rInstructorAccess": "2.60", "rReadingsValue": "2.29", "rRecommendNonMajor": "1.23", "rCommAbility": "1.79", "rInstructorQuality": "1.98"}, "section": {"name": "ECONOMETRICS", "sectionnum": "001", "primary_alias": "ECON-104-001", "path": "/courses/22926/sections/001", "id": "22926-001", "aliases": ["ECON-104-001"]}, "comments": "This course is designed to introduce students to econometric techniques and their applications in economic analysis and decision-making. The main objective of the course is to train the student in (i) handling economic data; (ii) quantitative analyses of economic models with probabilistic tools; (iii) econometric techniques, their application as well as their statistical and practical interpretation; (iv) implementing these techniques on a computer. Students are required to perform several econometric analyses of their own.\r\n\r\nMost students found the course both “interesting” and “useful”. However, several complained that while the course material was not technically difficult, the manner in which it was taught made it so. Some students regretted that they were not given a chance to use the practical applications of concepts and abilities learned in lecture. Some found that the exams were not adequate measures of what they had learned in class.\r\n\r\nSeveral students praised Professor Cheng, calling her “focused” and “caring”. Another noted that she “explained the material well.” However, the majority of students found that she was unable to stimulate interest in her students, and that she was often inaccessible during office hours.\r\n\r\nMost of the students taking this course were taking it for their major or minor. The majority of students would not recommend this course to a non-major.\r\n", "num_students": 60, "path": "/courses/22926/sections/001/reviews/4783-XU-CHENG", "instructor": {"path": "/instructors/4783-XU-CHENG", "first_name": "XU", "last_name": "CHENG", "id": "4783-XU-CHENG", "name": "XU CHENG"}, "num_reviewers": 53, "id": "22926-001-4783-XU-CHENG"}]}, "credits": null, "primary_alias": "ECON-104", "path": "/courses/22926", "sections": {"path": "/courses/22926/sections", "values": [{"name": "ECONOMETRICS", "sectionnum": "001", "primary_alias": "ECON-104-001", "path": "/courses/22926/sections/001", "id": "22926-001", "aliases": ["ECON-104-001"]}]}, "id": 22926, "aliases": ["ECON-104"]}