[{"ratings": {"rAmountLearned": "1.64", "rDifficulty": "2.28", "rStimulateInterest": "1.61", "rRecommendMajor": "2.19", "rCourseQuality": "1.68", "rWorkRequired": "3.28", "rInstructorAccess": "2.29", "rReadingsValue": "1.49", "rRecommendNonMajor": "0.94", "rCommAbility": "1.92", "rInstructorQuality": "2.13"}, "section": {"name": "ETH/SOC/PRO RES FOR ENG", "sectionnum": "401", "primary_alias": "BE-303-401", "path": "/courses/24029/sections/401", "id": "24029-401", "aliases": ["BE-303-401", "EAS-303-401"]}, "comments": "This course provides an overview of the ethical and professional responsibilities\r\nof engineers, as engineering professionals, as members of engineering organizations, and\r\nas researchers and developers and users of technology. The course emphasizes ethical\r\nissues related to the creation and use of technology, although other issues related to the\r\nprofessional development of engineers are also considered. The course involves\r\nextensive student presentations, analysis of case studies, role-playing, and debates in the\r\nanalysis of real-world situations involving ethical conflicts.\r\nStudents generally found the assigned readings lengthy and detached from the\r\nlecture material. In addition, many felt that the questions regarding the readings in the\r\nquizzes included too many details. Most of them found that the class required lots of\r\nrepetitive work and therefore was time consuming and discouraging. Some students,\r\nhowever, indicated that some of the readings were “very much applicable or enjoyable”\r\nand that group presentations and Skype interviews were very interesting. One student\r\npointed out that the recitation and the lecture “were like two separate classes” and this\r\n“discontinuity” confused many students.\r\nStudents agreed that Professor Foster was good at giving lectures and was very\r\napproachable. Yet, some concerns focused on the TA, whose comments on the students’\r\npresentation slides were “never helpful.”\r\nMost of the students reported that the workload of this course was “difficult to\r\nmanage.” One student commented “students in Professor Foster’s recitation section\r\ntended to receive high marks on their presentations and papers than students in the TA’s\r\nsection.” This course is required for bioengineering majors but would not be\r\nrecommended for non-majors.", "num_students": 46, "path": "/courses/24029/sections/401/reviews/166-KENNETH-R-FOSTER", "instructor": {"path": "/instructors/166-KENNETH-R-FOSTER", "first_name": "KENNETH R", "last_name": "FOSTER", "id": "166-KENNETH-R-FOSTER", "name": "KENNETH R FOSTER"}, "num_reviewers": 40, "id": "24029-401-166-KENNETH-R-FOSTER"}]