[{"ratings": {"rAmountLearned": "3.69", "rDifficulty": "3.35", "rStimulateInterest": "3.73", "rRecommendMajor": "3.81", "rCourseQuality": "3.63", "rWorkRequired": "3.95", "rInstructorAccess": "3.50", "rReadingsValue": "2.81", "rRecommendNonMajor": "2.46", "rCommAbility": "3.30", "rInstructorQuality": "3.68"}, "section": {"name": "DSGN OF MECHATRONIC SYS", "sectionnum": "401", "primary_alias": "MEAM-410-401", "path": "/courses/17674/sections/401", "id": "17674-401", "aliases": ["MEAM-410-401", "MEAM-510-401"]}, "comments": "In many modern systems, mechanical elements are tightly coupled with electronic components and embedded computers. Mechatronics is the study of how these domains are interconnected, and this hands-on, project-based course provides an integrated introduction to the fundamental components within each of the three domains, including: mechanical elements (prototyping, materials, actuators and sensors, transmissions, and fundamental kinematics), electronics(basic circuits, filters, op amps, discrete logic, and interfacing with mechanical elements), and computing (interfacing with the analog world, microprocessor technology, basic control theory, and programming).\r\n\r\nThis course was applauded as “a mix of theory and a great hands-on component.” This class was considered “a great way to delve into prototyping and programming of applied mechatronic systems,” and a “capstone course to take for any engineer, because it involves so many interdisciplinary skills from mechanical engineering, electrical engineering, computer science, and robotics.”\r\n\r\nProfessor Fiene was described as “unparalleled in his teaching abilities in engineering,” and students noted that he “genuinely cares about each and every student and their learning.” He was a very accessible and helpful resource.\r\n\r\nStudents found this course very time consuming but found the time spent “worthwhile” and generally had “a lot of fun” leading up to the final competition. \r\n\r\n", "num_students": 45, "path": "/courses/17674/sections/401/reviews/3916-JONATHAN-FIENE", "instructor": {"path": "/instructors/3916-JONATHAN-FIENE", "first_name": "JONATHAN", "last_name": "FIENE", "id": "3916-JONATHAN-FIENE", "name": "JONATHAN FIENE"}, "num_reviewers": 39, "id": "17674-401-3916-JONATHAN-FIENE"}]