[{"ratings": {"rAmountLearned": "2.53", "rDifficulty": "2.89", "rStimulateInterest": "2.79", "rRecommendMajor": "2.89", "rCourseQuality": "2.38", "rWorkRequired": "3.05", "rInstructorAccess": "3.00", "rReadingsValue": "2.18", "rRecommendNonMajor": "1.26", "rCommAbility": "2.79", "rInstructorQuality": "2.71"}, "section": {"name": "PRINCIPLES IV: MOD.PHYS.", "sectionnum": "001", "primary_alias": "PHYS-250-001", "path": "/courses/22293/sections/001", "id": "22293-001", "aliases": ["PHYS-250-001"]}, "comments": "This course covers special relativity, an introduction to the principle of quantum mechanics, properties of electrons, protons, neutrons, and the elements of atomic structure and nuclear structure. Electromagnetic radiation and photons, and interaction of photons with electrons, atoms, and nuclei are also studied.\r\n\r\nStudents remarked that \"this course is a very superficial introduction to many different topics\" and wished the course was divided into (at least) two separate courses. The syllabus \"tried to cover too much material in not enough detail\" so some topics were not well-linked together. Students thought the material was interesting though. \r\n\r\nProfessor Heiney was \"very knowledgeable.\" Students remarked that the professor was \"definitely a smart and capable lecturer,\" but some students wished he had not used PowerPoint slides to present the material, especially in a physics class. \r\n\r\nBy using PowerPoint slides, students felt it difficult to absorb the material. Also, sometimes students felt that they were put \"on the spot in the middle of class.\" Additionally, it was “hard to differentiate the important stuff from the random topics that were just thrown in.”\r\n\r\n*This review was based on less than 8 comments\r\n", "num_students": 21, "path": "/courses/22293/sections/001/reviews/272-PAUL-A-HEINEY", "instructor": {"path": "/instructors/272-PAUL-A-HEINEY", "first_name": "PAUL A", "last_name": "HEINEY", "id": "272-PAUL-A-HEINEY", "name": "PAUL A HEINEY"}, "num_reviewers": 21, "id": "22293-001-272-PAUL-A-HEINEY"}]