[{"ratings": {"rAmountLearned": "2.43", "rDifficulty": "1.39", "rStimulateInterest": "2.16", "rRecommendMajor": "3.34", "rCourseQuality": "2.45", "rWorkRequired": "1.16", "rInstructorAccess": "2.41", "rReadingsValue": "2.39", "rRecommendNonMajor": "2.95", "rCommAbility": "2.45", "rInstructorQuality": "2.51"}, "section": {"name": "CRIMINOLOGY", "sectionnum": "401", "primary_alias": "CRIM-100-401", "path": "/courses/22885/sections/401", "id": "22885-401", "aliases": ["CRIM-100-401", "SOCI-233-401"]}, "comments": "This introductory course examines the multi-disciplinary science of law-making, law-breaking, and law-enforcing. It reviews theories and data predicting where, when, by whom and against whom crimes happen. It also addresses the prevention of different offense types by different kinds of offenders against different kinds of people. Police, courts, prisons, and other institutions are critically examined as both preventing and causing crime. This course meets the general distribution requirement for the society sector.\r\n\r\nStudents reported that overall the course was “interesting,” and described the course material as “stimulating” and “fascinating.” Students found that the guest lecturers that Professor Adler frequently brought in to lecture about specific aspects of criminology were particularly interesting.\r\n\r\nWhile students complimented Professor Adler for bringing in interesting guest lecturers, many students commented that Professor Adler herself was not a very captivating speaker, especially given the three-hour format of the class. Many also complained that her classes were difficult to follow and were “all over the place,” describing her lecturing style as “rambling” and her PowerPoints as “disorganized.” Slides were not made available to students online, which students found potentially problematic because Professor Adler often went through slides too quickly for students to copy down relevant information. On a personal level, however, students found Adler to be very friendly and accessible to students who went to her office hours. Most complaints were aimed at the TAs of this course, who did not return exams in a timely fashion.\r\n\r\nStudents found that this class was an easy way to fulfill a sector requirement. It was recommended to both majors and non-majors because the material is applicable to other social science courses and provides insight into current events. The workload was described as “very manageable,” and many students noted it was not necessary to read the textbook as all exams were open-book. Students felt grading could be improved, as it was often unclear why a given answer received a certain grade.\r\n", "num_students": 163, "path": "/courses/22885/sections/401/reviews/4770-FREDA-ADLER", "instructor": {"path": "/instructors/4770-FREDA-ADLER", "first_name": "FREDA", "last_name": "ADLER", "id": "4770-FREDA-ADLER", "name": "FREDA ADLER"}, "num_reviewers": 150, "id": "22885-401-4770-FREDA-ADLER"}]