[{"ratings": {"rAmountLearned": "2.74", "rDifficulty": "2.38", "rStimulateInterest": "2.94", "rRecommendMajor": "3.57", "rCourseQuality": "2.80", "rWorkRequired": "2.07", "rInstructorAccess": "2.61", "rReadingsValue": "2.26", "rRecommendNonMajor": "2.81", "rCommAbility": "3.23", "rInstructorQuality": "3.08"}, "section": {"name": "SOCIAL PSYCHOLOGY", "sectionnum": "001", "primary_alias": "PSYC-170-001", "path": "/courses/22348/sections/001", "id": "22348-001", "aliases": ["PSYC-170-001"]}, "comments": "This course is an overview of theories and research across the range of social behavior from intra-individual to the group level including the effects of culture, social environment, and groups on social interaction.&#8232;&#8232;Overall, students found the material “engaging.” One student said it was “some of the most interesting stuff I ever learned.” That said, some students felt that this course repeated a lot of material covered in the introductory psychology class. Many felt that the textbook was “dry” or “worthless,” as there was “considerable overlap between lectures and the assigned book readings.”&#8232;&#8232;Many students had only positive things to say about Professor Goodwin. They called him “upbeat,” “enthusiastic,” and “humorous.” In the words of one student, he “communicates the course material concisely and entertainingly in every lecture.”&#8232;&#8232;Students held mixed opinions about the grading system and the expectations for the course. While some called the exams “very fair,” others felt that the grading was “a mystery” and that the curve was unnecessarily harsh.", "num_students": 272, "path": "/courses/22348/sections/001/reviews/4544-GEOFFREY-P--GOODWIN", "instructor": {"path": "/instructors/4544-GEOFFREY-P--GOODWIN", "first_name": "GEOFFREY P.", "last_name": "GOODWIN", "id": "4544-GEOFFREY-P--GOODWIN", "name": "GEOFFREY P. GOODWIN"}, "num_reviewers": 241, "id": "22348-001-4544-GEOFFREY-P--GOODWIN"}]