{"coursehistories": {"path": "/coursehistories/4580"}, "description": "This mini course is designed to provide students with an appreciation of the good, the bad and the ugly of how our current health care system cares for one of our nation's most precious resources - our seniors! This course will review care provided to seniors within a variety of institutional settings (hospitals, nursing facilities, various senior housing levels) as well as outpatient and home care services. Special attention will be paid to nursing homes and senior housing options and their past, present and future role within the overall health care system in the United States. The course will start with an overview of the senior population with special attention to theirhealth and social needs. Several classes will be held off campus at selected nursing facilities and senior housing complexes. In addition, a broad range of special programs and services will be reviewed such as sub-acute care, long term care insurance, Medicare Risk Programs, elderly housing, adult day care, managed care, Medicare Part D, case management, hospice and other recent developments. Throughout the course, emphasis will be placed on entrepreneurial opportunities to serve the senior market at all levels. \n\nStudents are required to produce a paper for this course that focuses on a specific area impacting the senior market. This is a wonderful opportunity for students to select an area of personal interest and conduct an in depth review of that area including making direct contact with national experts within the topic selected. All student topics must be approved during the first two weeks of class and the depth of research required agreed upon by the by the student and the instructor.Interested students not in the HCMG major are urged to speak to the instructor before enrolling in the course. \n\n", "semester": "2010C", "name": "MGMT HLTH CRE FOR ELDRLY", "reviews": {"path": "/courses/23182/reviews", "values": [{"ratings": {"rAmountLearned": "2.32", "rDifficulty": "1.33", "rStimulateInterest": "2.89", "rRecommendMajor": "2.42", "rCourseQuality": "2.43", "rWorkRequired": "1.63", "rInstructorAccess": "3.33", "rReadingsValue": "2.06", "rRecommendNonMajor": "1.84", "rCommAbility": "2.84", "rInstructorQuality": "2.65"}, "section": {"name": "MGMT HLTH CRE FOR ELDRLY", "sectionnum": "002", "primary_alias": "HCMG-855-002", "path": "/courses/23182/sections/002", "id": "23182-002", "aliases": ["HCMG-855-002"]}, "comments": "", "num_students": 30, "path": "/courses/23182/sections/002/reviews/4836-JOHN-J-WHITMAN", "instructor": {"path": "/instructors/4836-JOHN-J-WHITMAN", "first_name": "JOHN J", "last_name": "WHITMAN", "id": "4836-JOHN-J-WHITMAN", "name": "JOHN J WHITMAN"}, "num_reviewers": 24, "id": "23182-002-4836-JOHN-J-WHITMAN"}]}, "credits": null, "primary_alias": "HCMG-855", "path": "/courses/23182", "sections": {"path": "/courses/23182/sections", "values": [{"name": "MGMT HLTH CRE FOR ELDRLY", "sectionnum": "002", "primary_alias": "HCMG-855-002", "path": "/courses/23182/sections/002", "id": "23182-002", "aliases": ["HCMG-855-002"]}]}, "id": 23182, "aliases": ["HCMG-855"]}