{"coursehistories": {"path": "/coursehistories/1994"}, "description": "This course focuses on the creation of competitive advantage in the multinational firm. It examines the nature of global competition by exploring the characteristics of global versus non-global industries and firms. We also explore different types of international strategy and structure and examine the specific challenges of managing in multiple countries and markets. Finally, we consider the strategic allocation of resources along the value chain and the role of strategic alliances as a crucial element of an effective global strategy. \n\n", "semester": "2009A", "name": "MULTINATL CORP STRATEG", "reviews": {"path": "/courses/16072/reviews", "values": [{"ratings": {"rAmountLearned": "3.26", "rDifficulty": "2.36", "rStimulateInterest": "3.14", "rRecommendMajor": "3.61", "rCourseQuality": "3.13", "rWorkRequired": "2.79", "rInstructorAccess": "3.46", "rReadingsValue": "3.25", "rRecommendNonMajor": "2.71", "rCommAbility": "3.61", "rInstructorQuality": "3.53"}, "section": {"name": "MULTINATL CORP STRATEG", "sectionnum": "001", "primary_alias": "MGMT-205-001", "path": "/courses/16072/sections/001", "id": "16072-001", "aliases": ["MGMT-205-001"]}, "comments": "This course focuses on the creation of competitive advantage in the multinational firm. It examines the nature of global competition by exploring the characteristics of global versus non-global industries and firms. It explores different types of international strategy and structure and examines the specific challenges of managing in multiple countries and markets. Finally, it considers the strategic allocation of resources along the value chain and the role of strategic alliances as a crucial element of an effective global strategy.\r\n\r\nStudents can “foresee using concepts” from this “enriching” course in the future. Students also liked the “case-based nature of the course” and the “focus on peer learning” in each class.\r\n\r\nStudents “commend” Professor Berry on “engaging the class” and “effectively facilitating discussion.” She is “great at explaining concepts” and “stimulating interest.”\r\n\r\nAlthough a few students comment that “some readings could be done without,” most felt “the assignments were valuable,” pushing students to “read and understand course concepts,” and that the project was “highly relevant.”", "num_students": 33, "path": "/courses/16072/sections/001/reviews/1894-HEATHER-BERRY", "instructor": {"path": "/instructors/1894-HEATHER-BERRY", "first_name": "HEATHER", "last_name": "BERRY", "id": "1894-HEATHER-BERRY", "name": "HEATHER BERRY"}, "num_reviewers": 32, "id": "16072-001-1894-HEATHER-BERRY"}]}, "credits": null, "primary_alias": "MGMT-205", "path": "/courses/16072", "sections": {"path": "/courses/16072/sections", "values": [{"name": "MULTINATL CORP STRATEG", "sectionnum": "001", "primary_alias": "MGMT-205-001", "path": "/courses/16072/sections/001", "id": "16072-001", "aliases": ["MGMT-205-001"]}]}, "id": 16072, "aliases": ["MGMT-205"]}