{"coursehistories": {"path": "/coursehistories/162"}, "description": "Many people experience the art of our time as bewildering, shocking, too ordinary (my kid could do that), too intellectual (elitist), or simply not as art. Yet what makes this art engaging is that it raises the question of what art is or can be, employs a range of new materials and technologies, and addresses previously excluded audiences. It invades non-art spaces, blurs the boundaries between text and image, document and performance, asks questions about institutional frames (the museum, gallery, and art journal), and generates new forms of criticism. Much of the \"canon\" of what counts as important is still in flux, especially for the last twenty years. And the stage is no longer centered only on the United States and Europe, but is becoming increasingly global. The course will introduce students to the major movements and artists of the post-war period, with emphasis on social and historical context, critical debates, new media, and the changing role of the spectator/participant. \n\n", "semester": "2011A", "name": "CONTEMP ART:1945-PRESENT", "reviews": {"path": "/courses/21293/reviews", "values": [{"ratings": {"rAmountLearned": "3.38", "rDifficulty": "3.08", "rStimulateInterest": "3.33", "rRecommendMajor": "3.93", "rCourseQuality": "3.45", "rWorkRequired": "2.77", "rInstructorAccess": "2.77", "rReadingsValue": "3.23", "rRecommendNonMajor": "3.03", "rCommAbility": "3.35", "rInstructorQuality": "3.55"}, "section": {"name": "CONTEMP ART:1945-PRESENT", "sectionnum": "401", "primary_alias": "ARTH-287-401", "path": "/courses/21293/sections/401", "id": "21293-401", "aliases": ["ARTH-287-401"]}, "comments": "Contemporary Art refers neither to a specific historical period, nor a recognizable aesthetic but seeks to focus upon the “now.” This course introduces students to the major movements and artists of the post-war period, with emphasis on social and historical context, critical debates, new media, and the changing role of the spectator/participant. In this course, the history of our photographic present is traced, beginning with Pop Art, and concluding with Thomas Ruff's jpegs. \r\n\r\nThough “challenging,” many students described Professor Silverman’s course as the “best class” they had taken at Penn. Despite it’s broad title, the course focused heavily upon contemporary photography and covered difficult theories and philosophies. Students said the course provoked thought on how contemporary artists approach the “issues of today's world.” \r\n\r\nStudents found Professor Silverman to be “an extraordinary addition” to the Art History faculty. They championed her “breadth of knowledge,” calling her “brilliant.” They called her lectures “riveting” and deemed her ability to transmit ideas “second to none.” A minority of students was displeased with her teaching style, finding that she “runs away with herself at times.”\r\n\r\nSome students commented that they “loved” the readings though others called them “difficult.” Though the class requires a “fair amount of work,” many students suggested it to all Art History majors as well as anyone with interest in Contemporary Art.\r\n", "num_students": 47, "path": "/courses/21293/sections/401/reviews/5288-KAJA-SILVERMAN", "instructor": {"path": "/instructors/5288-KAJA-SILVERMAN", "first_name": "KAJA", "last_name": "SILVERMAN", "id": "5288-KAJA-SILVERMAN", "name": "KAJA SILVERMAN"}, "num_reviewers": 42, "id": "21293-401-5288-KAJA-SILVERMAN"}]}, "credits": null, "primary_alias": "ARTH-287", "path": "/courses/21293", "sections": {"path": "/courses/21293/sections", "values": [{"name": "CONTEMP ART:1945-PRESENT", "sectionnum": "401", "primary_alias": "ARTH-287-401", "path": "/courses/21293/sections/401", "id": "21293-401", "aliases": ["ARTH-287-401"]}]}, "id": 21293, "aliases": ["ARTH-287"]}