{"coursehistories": {"path": "/coursehistories/3147"}, "description": "Markets play a central role in the life of a capitalist democracy. But is this a good thing? Should we let markets decide who is rich and who is poor? Who makes decisions and who follows them? Whose ideas get heard and whose ideas do not? The goal of this class will be to examine the market from the perspective of various social values to see whether we should want a market system and, if so, what kind of market system we should want. Among the issues we will examine are the following. Does the market contribute to the common good? If so, how? Does the market conflict with the idea that all human beings are of equal value? What is the relation between the market and freedom? Does the market liberate us or oppress us? Can we reconcile the market with our democratic ideals? What role should corporations play in a healthy democracy? What role should markets play in an increasingly globalized world? We will read several important philosophers, economists and political theorists writing on these issues, including Adam Smith, John Rawls, Amartya Sen, Friedrich Hayek, Karl Marx, Robert Nozick, Jurgen Habermas, and others. Grades will be based on three papers and class participation. \n\n", "semester": "2010A", "name": "MARKETS,MORALITY&CAPITAL: Markets, Morality & the Future of Capitalism", "reviews": {"path": "/courses/26289/reviews", "values": [{"ratings": {"rAmountLearned": "3.12", "rDifficulty": "2.82", "rStimulateInterest": "3.18", "rRecommendMajor": "3.44", "rCourseQuality": "3.03", "rWorkRequired": "2.71", "rInstructorAccess": "3.03", "rReadingsValue": "3.12", "rRecommendNonMajor": "2.94", "rCommAbility": "3.47", "rInstructorQuality": "3.13"}, "section": {"name": "MARKETS,MORALITY&CAPITAL: Markets, Morality & the Future of Capitalism", "sectionnum": "401", "primary_alias": "LGST-226-401", "path": "/courses/26289/sections/401", "id": "26289-401", "aliases": ["LGST-226-401"]}, "comments": "Markets play a central role in the life of a capitalist democracy. But is this a good thing? Should we let markets decide who is rich and who is poor? Who makes decisions and who follows them? Whose ideas get heard and whose ideas do not? The goal of LGST226 will be to examine the market from the perspective of various social values to see whether we should want a market system and, if so, what kind of market system we should want. Among the issues we will examine are the following. Does the market contribute to the common good? If so, how? Does the market conflict with the idea that all human beings are of equal value? What is the relation between the market and freedom? Does the market liberate us or oppress us? Can we reconcile the market with our democratic ideals? What role should corporations play in a healthy democracy? What role should markets play in an increasingly globalized world? We will read several important philosophers, economists and political theorists writing on these issues, including Adam Smith, John Rawls, Amartya Sen, Friedrich Hayek, Karl Marx, Robert Nozick, Jürgen Habermas, Robert Dahl, and others. \r\n\r\nStudent feedback for this class was very positive overall. One student commented: “Great instruction, very important works, lively debate.” Another commented that the slides and readings were “well designed/selected.”\r\n\r\nStudents agreed that Professor Hussain was a “very articulate and engaging teacher.” Some commented that he was “not accepting of alternative viewpoints,” but overall he was well received.\r\n\r\nCourse requirements include class participation, a midterm paper, a final paper, and a final exam. Some students wished that the class had been smaller to facilitate better discussion. One student commented that “the course is very demanding, but also very enjoyable and rewarding.”", "num_students": 40, "path": "/courses/26289/sections/401/reviews/2538-WAHEED-HUSSAIN", "instructor": {"path": "/instructors/2538-WAHEED-HUSSAIN", "first_name": "WAHEED", "last_name": "HUSSAIN", "id": "2538-WAHEED-HUSSAIN", "name": "WAHEED HUSSAIN"}, "num_reviewers": 39, "id": "26289-401-2538-WAHEED-HUSSAIN"}]}, "credits": null, "primary_alias": "LGST-226", "path": "/courses/26289", "sections": {"path": "/courses/26289/sections", "values": [{"name": "MARKETS,MORALITY&CAPITAL: Markets, Morality & the Future of Capitalism", "sectionnum": "401", "primary_alias": "LGST-226-401", "path": "/courses/26289/sections/401", "id": "26289-401", "aliases": ["LGST-226-401"]}]}, "id": 26289, "aliases": ["LGST-226"]}