{"coursehistories": {"path": "/coursehistories/4139"}, "description": "This course will explore the emergence of modern science fiction as a genre, the ways it has reflected our evolving conceptions of ourselves and the universe, and its role as the mythology of modern technological civilization. We will discuss such characteristic themes as utopias, the explortion of space and time, biological engineering, superman, robots, aliens, and other worlds--and the differences between European and American treatment of these themes. \n\n", "semester": "2009A", "name": "SCIENCE & LITERATURE", "reviews": {"path": "/courses/16514/reviews", "values": [{"ratings": {"rAmountLearned": "2.66", "rDifficulty": "2.80", "rStimulateInterest": "3.34", "rRecommendMajor": "3.63", "rCourseQuality": "3.30", "rWorkRequired": "3.46", "rInstructorAccess": "2.83", "rReadingsValue": "3.37", "rRecommendNonMajor": "3.09", "rCommAbility": "3.37", "rInstructorQuality": "3.38"}, "section": {"name": "SCIENCE & LITERATURE", "sectionnum": "401", "primary_alias": "STSC-110-401", "path": "/courses/16514/sections/401", "id": "16514-401", "aliases": ["STSC-110-401", "ENGL-075-401", "HSOC-110-401", "HIST-117-401"]}, "comments": "The course explores the emergence of modern science fiction, the ways it has reflected our evolving conceptions of the universe, and its role as the mythology of modern technological civilization. Topics include: \\\"Science & Utopia,\\\" \\\"The Discovery of the Future,\\\" \\\"Imagining Mars,\\\" \\\"SF, Robots, & the Class Struggle,\\\" \\\"Superman & the Ubermensch,\\\" \\\"The American Hero,\\\" \\\"The Golden Age,\\\" \\\"Cold War SF\\\" and \\\"Gods, Aliens & Destiny.&#8232;&#8232;\r\nThe course received overwhelmingly positive reviews. Words like “incredible”, amazing,” and “fantastic” were used to describe the course. More than one student even called it their favorite course at Penn. “If you are tired of reading boring books for literature classes but still find yourself in need of one or wanting one, then this is the course for you,” said one student. While the course has a significant amount of reading and a weekly response paper, most students felt that the work was well worth the effort.&#8232;&#8232;\r\nProfessor Adams, like the course, received very positive reviews. Students described his teaching as “focused, in context, and appropriate” to the assigned reading, and said that he was “entertaining,” and “knowledgeable.”\r\nSome students felt over-whelmed by the amount of material, both assigned and in lectures, and some students mentioned they could have benefited from more information on Blackboard. The course consists of a good deal of work, requiring two books to read per week and a response paper. In addition, there was both a midterm and a final, which some students complained was too much work to do in a short period of time. While some thought the grading was fair, others believed it was too subjective and focused too much on details.", "num_students": 39, "path": "/courses/16514/sections/401/reviews/663-MARK-B-ADAMS", "instructor": {"path": "/instructors/663-MARK-B-ADAMS", "first_name": "MARK B", "last_name": "ADAMS", "id": "663-MARK-B-ADAMS", "name": "MARK B ADAMS"}, "num_reviewers": 37, "id": "16514-401-663-MARK-B-ADAMS"}]}, "credits": null, "primary_alias": "STSC-110", "path": "/courses/16514", "sections": {"path": "/courses/16514/sections", "values": [{"name": "SCIENCE & LITERATURE", "sectionnum": "401", "primary_alias": "STSC-110-401", "path": "/courses/16514/sections/401", "id": "16514-401", "aliases": ["STSC-110-401", "ENGL-075-401", "HSOC-110-401", "HIST-117-401"]}]}, "id": 16514, "aliases": ["STSC-110", "ENGL-075", "HSOC-110", "HIST-117"]}