{"coursehistories": {"path": "/coursehistories/2778"}, "description": "", "semester": "2009A", "name": "INTRO TO NANOTECHNOLOGY", "reviews": {"path": "/courses/15575/reviews", "values": [{"ratings": {"rAmountLearned": "2.42", "rDifficulty": "2.03", "rStimulateInterest": "2.45", "rRecommendMajor": "3.20", "rCourseQuality": "2.49", "rWorkRequired": "2.06", "rInstructorAccess": "3.05", "rReadingsValue": "2.42", "rRecommendNonMajor": "2.52", "rCommAbility": "2.90", "rInstructorQuality": "2.86"}, "section": {"name": "INTRO TO NANOTECHNOLOGY", "sectionnum": "001", "primary_alias": "EAS-210-001", "path": "/courses/15575/sections/001", "id": "15575-001", "aliases": ["EAS-210-001"]}, "comments": "The primary objective of this course is to provide a broad foundation of understanding in the field of nanotechnology, so that students are prepared to continually learn about this emerging field. To accomplish the first part of this goal the course will consist of background readings and instructional lectures. The second part will be achieved by allowing students to apply their new understanding as they evaluate new findings reported in various publications. Students will complete homework assignments, take four short exams, and write four essays during the class. This course does not use a textbook.\r\n\r\nStudents typically found this course to be “always interesting” and enjoyable. Students generally reported learning a lot from the class, but felt the material was oversimplified at times and lacked depth. Some students felt that the course readings were more complex than and sometimes irrelevant to tested material. However, most still felt convinced that this class was worthwhile, and many even mentioned its significance in persuading them to pursue nanotechnology.\r\n\r\nStudents spoke very highly of Dr. Winey’s “contagious enthusiasm” and ability to break down complex subject matter. Students felt that Dr. Winey made the course “accessible on an intellectual level to various majors.”\r\n\r\nStudents generally did not find the course to be difficult. Though the course is intended as an engineering course for an introduction to nanotechnology, people of all majors took and succeeded in the course. One student felt the grading was often inconsistent when compared against readings, but most students agreed that the course was generally not difficult.", "num_students": 79, "path": "/courses/15575/sections/001/reviews/842-KAREN-I--WINEY", "instructor": {"path": "/instructors/842-KAREN-I--WINEY", "first_name": "KAREN I.", "last_name": "WINEY", "id": "842-KAREN-I--WINEY", "name": "KAREN I. WINEY"}, "num_reviewers": 77, "id": "15575-001-842-KAREN-I--WINEY"}]}, "credits": null, "primary_alias": "EAS-210", "path": "/courses/15575", "sections": {"path": "/courses/15575/sections", "values": [{"name": "INTRO TO NANOTECHNOLOGY", "sectionnum": "001", "primary_alias": "EAS-210-001", "path": "/courses/15575/sections/001", "id": "15575-001", "aliases": ["EAS-210-001"]}]}, "id": 15575, "aliases": ["EAS-210"]}