{"coursehistories": {"path": "/coursehistories/4893"}, "description": "The course is geared to advanced undergraduate and graduate students interested in understanding the basics ofimplantable neuro-devices, their design, practical implementation, approval, and use. Reading will cover the basics of neuro signals, recording, analysis, classification, modulation, and fundamental principels of Brain-Machine Interfaces. The course will be based upon twic weekly lectures and \"hands-on\" weekly assignments that teach basic signal recording, feature extraction, classification and practical implementation in clinical systems. Assignments will build incrementally toward constructing a complete, functional BMI system. Fundamental concepts in neurosignals, hardware and software will be reinforced by practical examples and in-depth study. Guest lecturers and demonstrations will supplement regular lectures. \n\n", "semester": "2011A", "name": "BRAIN-COMPUTER INTERFACE", "reviews": {"path": "/courses/21327/reviews", "values": [{"ratings": {"rAmountLearned": "3.50", "rDifficulty": "3.09", "rStimulateInterest": "3.72", "rRecommendMajor": "3.69", "rCourseQuality": "3.59", "rWorkRequired": "3.40", "rInstructorAccess": "3.56", "rReadingsValue": "2.50", "rRecommendNonMajor": "2.11", "rCommAbility": "3.53", "rInstructorQuality": "3.54"}, "section": {"name": "BRAIN-COMPUTER INTERFACE", "sectionnum": "401", "primary_alias": "BE-521-401", "path": "/courses/21327/sections/401", "id": "21327-401", "aliases": ["BE-521-401", "NGG-521-401"]}, "comments": "This course is geared to advanced undergraduate and graduate students interested in understanding the basics of implantable neuro-devices, their design, practical implementation, approval, and use. Reading will cover the basics of neuro signals, recording, analysis, classification, modulation, and fundamental principles of Brain-Machine Interfaces. This course will be based upon twice weekly lectures and \"hands-on\" weekly assignments that teach basic signal recording, feature extraction, classification and practical implementation in clinical systems. Assignments will build incrementally toward constructing a complete, functional BMI system. Fundamental concepts in neurosignals, hardware and software are reinforced by practical examples and in-depth study. Guest lecturers and demonstrations supplement regular lectures.&#8232;&#8232;This class received much praise from virtually all students who reviewed it. An overwhelming majority described it as “one of the best courses [they] have taken at Penn.” Everyone enjoyed the content, and a student said that “the amount learned from this class far exceeds the amount learned from all [their] other BE electives combined.” The course material was also described as highly applicable. In general, this course was highly recommended by many students.&#8232;&#8232;Professor Litt was described as “wonderful” and “organized.” People enjoyed his lecture style and claimed to have learned a lot from him. They found him interesting and enjoyed the guest lecturers for his course. Many students also said he was “helpful and nice.”&#8232;&#8232;Overall, the workload for this course was quite heavy. Many students described the work as “time consuming,” but at the same time very “rewarding.” This course was recommended to all who have an interest in the subject; students remarked that one “[does not] need to be a graduate student to take the course.” The grading was described as fair.", "num_students": 42, "path": "/courses/21327/sections/401/reviews/4252-BRIAN-LITT", "instructor": {"path": "/instructors/4252-BRIAN-LITT", "first_name": "BRIAN", "last_name": "LITT", "id": "4252-BRIAN-LITT", "name": "BRIAN LITT"}, "num_reviewers": 39, "id": "21327-401-4252-BRIAN-LITT"}]}, "credits": null, "primary_alias": "BE-521", "path": "/courses/21327", "sections": {"path": "/courses/21327/sections", "values": [{"name": "BRAIN-COMPUTER INTERFACE", "sectionnum": "401", "primary_alias": "BE-521-401", "path": "/courses/21327/sections/401", "id": "21327-401", "aliases": ["BE-521-401", "NGG-521-401"]}]}, "id": 21327, "aliases": ["BE-521", "NGG-521"]}