[{"ratings": {"rAmountLearned": "3.03", "rDifficulty": "1.65", "rStimulateInterest": "3.13", "rRecommendMajor": "3.32", "rCourseQuality": "3.28", "rWorkRequired": "2.23", "rInstructorAccess": "3.20", "rReadingsValue": "2.93", "rRecommendNonMajor": "3.13", "rCommAbility": "2.94", "rInstructorQuality": "3.09"}, "section": {"name": "Feature-Length Motion Picture Production Laboratory I", "sectionnum": "001", "primary_alias": "COMM-241-001", "path": "/courses/15536/sections/001", "id": "15536-001", "aliases": ["COMM-241-001", "CINE-241-001"]}, "comments": "This course gives students the opportunity to participate in the production of a feature-length fiction film. Students engage in all aspects of production, including: screenplay writing, production design, cinematography, production sound, acting, and directing. &#8232;&#8232;\r\n\r\nStudents thought that this course was \\\"excellent\\\" and \\\"a lot of fun,\\\" with some calling it one of their \\\"favorite classes\\\" taken at Penn. Although most thought the course was \\\"enjoyable\\\" and \\\"wonderful,\\\" some were \\\"disappointed,\\\" describing the class as \\\"disorganized\\\" and in need of \\\"more structure.\\\"&#8232;&#8232;\r\n\r\nStudents described Professor Messaris as \\\"great,\\\" \\\"excellent,\\\" and \\\"amazing.\\\" However, students also criticized his lack of cohesion for this course.&#8232;\r\n\r\nStudents felt that the course had an \\\"uneven work load.\\\" They found the shoots to be \\\"sometimes disorganized,\\\" and that the inexperienced students often ended up with \\\"unsuccessful shoots\\\" because of a lack of organization. The course is intended as a follow-up to COMM 140, Film Forms and Contexts, and COMM 262, Visual Communication. Students who have not taken either of those courses should consult with the instructor before enrolling. COMM 241 is followed by COMM 242. Students may enroll in either or both.", "num_students": 33, "path": "/courses/15536/sections/001/reviews/1338-PAUL-MESSARIS", "instructor": {"path": "/instructors/1338-PAUL-MESSARIS", "first_name": "PAUL", "last_name": "MESSARIS", "id": "1338-PAUL-MESSARIS", "name": "PAUL MESSARIS"}, "num_reviewers": 33, "id": "15536-001-1338-PAUL-MESSARIS"}]