[{"ratings": {"rAmountLearned": "3.37", "rDifficulty": "2.61", "rStimulateInterest": "3.68", "rRecommendMajor": "3.78", "rCourseQuality": "3.46", "rWorkRequired": "2.37", "rInstructorAccess": "2.61", "rReadingsValue": "2.71", "rRecommendNonMajor": "3.24", "rCommAbility": "3.85", "rInstructorQuality": "3.80"}, "section": {"name": "EUROPEAN IR 1648 - 1914", "sectionnum": "001", "primary_alias": "HIST-420-001", "path": "/courses/17527/sections/001", "id": "17527-001", "aliases": ["HIST-420-001"]}, "comments": "This course examines the international politics of Europe in the 18th and 19th centuries, up to the outbreak of World War I. It will address the transformation of European diplomacy with special attention to the rivalries between the great powers, the impact of nationalism and emerging mass politics, the interplay between military and economic power, and the relationship between the European powers and the rest of the world.\r\n\r\nStudents who have taken this course in the past have given it excellent reviews, describing it as “extremely interesting, focused, and well-structured.” Most agreed that the class was not only enjoyable, but a wonderful learning experience as well.\r\n\r\nStudents reported that Professor McDougall really “brought the course material to life through his lectures” in a format that was organized well and revealed his own devotion to the subject.\r\n\r\n“A lot was expected of us, but this class was absolutely worth it,” one student commented. Many students who took the course agreed with this sentiment, noting that the reading was both informative and “stimulating.” Others observed that the coursework was free of any tedious busywork, and the assignments were “thoughtful, fair, and useful in the learning process.” This course is ideal for students interested in diplomatic and political history. \r\n", "num_students": 46, "path": "/courses/17527/sections/001/reviews/604-WALTER-A-MCDOUGALL", "instructor": {"path": "/instructors/604-WALTER-A-MCDOUGALL", "first_name": "WALTER A", "last_name": "MCDOUGALL", "id": "604-WALTER-A-MCDOUGALL", "name": "WALTER A MCDOUGALL"}, "num_reviewers": 42, "id": "17527-001-604-WALTER-A-MCDOUGALL"}]