[{"ratings": {"rAmountLearned": "2.41", "rDifficulty": "2.45", "rStimulateInterest": "2.31", "rRecommendMajor": "2.48", "rCourseQuality": "2.00", "rWorkRequired": "3.17", "rInstructorAccess": "2.79", "rReadingsValue": "2.14", "rRecommendNonMajor": "1.28", "rCommAbility": "2.66", "rInstructorQuality": "2.85"}, "section": {"name": "DESIGN FOR MANUF", "sectionnum": "401", "primary_alias": "MEAM-514-401", "path": "/courses/22027/sections/401", "id": "22027-401", "aliases": ["MEAM-514-401", "IPD-514-401"]}, "comments": "This course is aimed at providing current and future product design/development engineers, manufacturing engineers, and product development managers with an applied understanding of Design for Manufacturability (DFM) concepts and methods. The course content includes materials from multiple disciplines including engineering design, manufacturing, marketing, finance, project management, and quality systems.&#8232; Students generally found this three-hour course to be “dreadfully boring” and “painful.” The lectures were heavily based on PowerPoints and students felt the professor used it as a “crutch.” Outside of lecture, students appreciated Professor Yim’s willingness to help or explain something, calling him “great.” Students stated that grades in this course were heavily based off of pre-class homework and reading quizzes. Students were assigned groups, which many thought were “not fair, as it often left one or two students with the majority of the work. The homework was described as “repetitive and tedious” and “a ton of work.”&#8232;&#8232;This review is based on the 7 student comments which were submitted.", "num_students": 37, "path": "/courses/22027/sections/401/reviews/3053-MARK-YIM", "instructor": {"path": "/instructors/3053-MARK-YIM", "first_name": "MARK", "last_name": "YIM", "id": "3053-MARK-YIM", "name": "MARK YIM"}, "num_reviewers": 35, "id": "22027-401-3053-MARK-YIM"}, {"ratings": {"rAmountLearned": "2.41", "rDifficulty": "2.45", "rStimulateInterest": "1.21", "rRecommendMajor": "2.48", "rCourseQuality": "2.00", "rWorkRequired": "3.17", "rInstructorAccess": "2.00", "rReadingsValue": "2.14", "rRecommendNonMajor": "1.28", "rCommAbility": "2.00", "rInstructorQuality": "1.45"}, "section": {"name": "DESIGN FOR MANUF", "sectionnum": "401", "primary_alias": "MEAM-514-401", "path": "/courses/22027/sections/401", "id": "22027-401", "aliases": ["MEAM-514-401", "IPD-514-401"]}, "comments": "This course is aimed at providing current and future product design/development engineers, manufacturing engineers, and product development managers with an applied understanding of Design for Manufacturability (DFM) concepts and methods. The course content includes materials from multiple disciplines including: engineering design, manufacturing, marketing, finance, project management, and quality systems.&#8232;&#8232;Students generally found this three-hour course to be “dreadfully boring” and “painful.” The lectures were heavily based on PowerPoints and students felt the professor used it as a “crutch.” &#8232;&#8232;Several students felt that Professor Sarbacker’s lectures were “long-winded and convoluted.” Outside of lecture, students appreciated Prof. Sarbacker’s willingness to help or explain an idea, calling him “great.” &#8232;&#8232;Students stated that grades in this course were heavily based off of pre-class homework and reading quizzes. Students were assigned groups, which many thought were “not fair, as it often left one or two students with the majority of the work. The homework was described as “repetitive and tedious” and “a ton of work.”&#8232;&#8232;This review is based on the 7 student comments which were submitted.", "num_students": 37, "path": "/courses/22027/sections/401/reviews/4192-SHAWN-D--SARBACKER", "instructor": {"path": "/instructors/4192-SHAWN-D--SARBACKER", "first_name": "SHAWN D.", "last_name": "SARBACKER", "id": "4192-SHAWN-D--SARBACKER", "name": "SHAWN D. SARBACKER"}, "num_reviewers": 35, "id": "22027-401-4192-SHAWN-D--SARBACKER"}]