[{"ratings": {"rAmountLearned": "2.69", "rDifficulty": "1.83", "rStimulateInterest": "2.61", "rRecommendMajor": "3.00", "rCourseQuality": "2.86", "rWorkRequired": "1.72", "rInstructorAccess": "2.65", "rReadingsValue": "2.82", "rRecommendNonMajor": "2.33", "rCommAbility": "2.06", "rInstructorQuality": "2.48"}, "section": {"name": "ENABLING TECHNOLOGIES", "sectionnum": "001", "primary_alias": "OPIM-314-001", "path": "/courses/27963/sections/001", "id": "27963-001", "aliases": ["OPIM-314-001"]}, "comments": "Enabling Technologies focuses on understanding emerging technology enablers with a goal of stimulating thinking on new applications for commerce. OPIM 314 is mainly lecture-based and culminates in a class-driven identification of novel businesses that exploit enablers. The course covers network, data, and application infrastructure, and technology enablers. Network infrastructure includes fundamentals of wired and wireless infrastructure technologies such as protocols for networking, broadband technologies, and other miles and digital cellular communications. Data infrastructure includes usage tracking technologies, search technologies and data mining. Direct application includes personalization technologies, design technologies for content and exchanges, software renting enablers, application service provision, agents, and security mechanisms. Finally some emerging technology enablers (such as bluetooth, biometrics and virtual reality) are identified and discussed.\r\n\r\n\tThe majority of students found OPIM 314 “interesting” and “engaging.” However, a few students reported that the course material did not focus enough on basic concepts, and wished there were more supplemental readings assigned, particularly case studies that included practical applications. Overall, students said they learned a lot about “the up and coming technologies in the world.” Additionally, students commented that the guest speakers were “accomplished” and “interesting.” \r\n\r\nStudents described Professor Wu as “talented,” “humorous,” and “friendly,” as well as knowledgeable about tech. One student said that Professor Wu did “an outstanding job explaining the concepts related to emerging technologies and the technical explanations of existing systems.” Additionally, students reported that Professor Wu was helpful during office hours in answering questions related to course material and industry practices, as well as willing to discuss grading. However, a few students commented that Professor Wu could have been more organized. They noted that “readings were sometimes added last minute and were hard to access” and that assignments would often “come back without any comments.” Nevertheless, students appreciated Professor Wu’s passion for the subject and teaching ability.\r\n\r\n\tOPIM 314 comes recommended for those interested in a career in entrepreneurship, start-ups, or technology. Students commented that the course assignments were “fairly graded” and “asked relevant questions relating to readings.” However, one student reported that participation counted for 30 percent of the grade, and found it difficult to participate without a technological background. There is no prerequisite or technical background required for this course.\r\n", "num_students": 31, "path": "/courses/27963/sections/001/reviews/6161-LYNN-L--WU", "instructor": {"path": "/instructors/6161-LYNN-L--WU", "first_name": "LYNN L.", "last_name": "WU", "id": "6161-LYNN-L--WU", "name": "LYNN L. WU"}, "num_reviewers": 25, "id": "27963-001-6161-LYNN-L--WU"}]