{"coursehistories": {"path": "/coursehistories/112"}, "description": "How did humans evolve? When did humans start to walk on two legs? How are humans related to non-human primates? This course focuses on the scientific study of human evolution describing the emergence, development, and diversification of our species, Homo sapiens. First we cover the fundamental principles of evolutionary theory and some of the basics of genetics and heredity as they relate to human morphological, physiological, and genetic variation. We then examine what studies of nonhuman primates (monkeys and apes) can reveal about our own evolutionary past, reviewing the behavioral and ecological diversity seen among living primates. We conclude the course examining the \"hard\" evidence of human evolution - the fossil and material culture record of human history from our earliest primate ancestors to the emergence of modern Homo sapiens. You will also have the opportunity, during recitations, to conduct hands-on exercises collecting and analyzing behavioral, morphological, and genetic data on both humans and nonhuman primates and working with the Department of Anthropology's extensive collection of fossil casts. \n\n", "semester": "2010A", "name": "INTRO TO HUMAN EVOLUTION", "reviews": {"path": "/courses/25581/reviews", "values": [{"ratings": {"rAmountLearned": "2.39", "rDifficulty": "2.37", "rStimulateInterest": "2.93", "rRecommendMajor": "3.23", "rCourseQuality": "2.39", "rWorkRequired": "1.83", "rInstructorAccess": "2.85", "rReadingsValue": "2.15", "rRecommendNonMajor": "2.41", "rCommAbility": "2.57", "rInstructorQuality": "2.85"}, "section": {"name": "INTRO TO HUMAN EVOLUTION", "sectionnum": "001", "primary_alias": "ANTH-003-001", "path": "/courses/25581/sections/001", "id": "25581-001", "aliases": ["ANTH-003-001"]}, "comments": "How did humans evolve? When did humans start to walk on two legs? How are humans related to non-human primates? This course focuses on the scientific study of human evolution describing the emergence, development, and diversification of our species, Homo sapiens. First we cover the fundamental principles of evolutionary theory and some of the basics of genetics and heredity as they relate to human morphological, physiological, and genetic variation. We then examine what studies of non-human primates (monkeys and apes) can reveal about our own evolutionary past, reviewing the behavioral and ecological diversity seen among living primates. We conclude the course examining the \"hard\" evidence of human evolution - the fossil and material culture record of human history from our earliest primate ancestors to the emergence of modern Homo sapiens. You will also have the opportunity, during recitations, to conduct hands-on exercises collecting and analyzing behavioral, morphological, and genetic data on both humans and nonhuman primates and working with the Department of Anthropology's extensive collection of fossil casts.\r\n\r\nThough some students found the material repetitive with high school material, they loved the style and format of lectures. They found the classes to be very organized and informative.\r\n\r\nStudents really enjoyed Professor Monge’s teaching style and described her as a “dynamic lecturer.” One student described Professor Monge as the most engaging professor at Penn. They really enjoyed her incorporation of vignettes and personal anecdotes and found her to be very accessible.\r\nThis class satisfies the Living World sector. It is a very manageable courseload and is recommended for both majors and non-majors alike.", "num_students": 160, "path": "/courses/25581/sections/001/reviews/97-JANET-M--MONGE", "instructor": {"path": "/instructors/97-JANET-M--MONGE", "first_name": "JANET M.", "last_name": "MONGE", "id": "97-JANET-M--MONGE", "name": "JANET M. MONGE"}, "num_reviewers": 148, "id": "25581-001-97-JANET-M--MONGE"}, {"ratings": {"rAmountLearned": "3.11", "rDifficulty": "2.28", "rStimulateInterest": "3.10", "rRecommendMajor": "3.21", "rCourseQuality": "3.13", "rWorkRequired": "1.86", "rInstructorAccess": "3.38", "rReadingsValue": "3.14", "rRecommendNonMajor": "2.76", "rCommAbility": "3.34", "rInstructorQuality": "3.32"}, "section": {"name": "INTRO TO HUMAN EVOLUTION", "sectionnum": "601", "primary_alias": "ANTH-003-601", "path": "/courses/25581/sections/601", "id": "25581-601", "aliases": ["ANTH-003-601"]}, "comments": "", "num_students": 33, "path": "/courses/25581/sections/601/reviews/3525-EMILY-RENSCHLER", "instructor": {"path": "/instructors/3525-EMILY-RENSCHLER", "first_name": "EMILY", "last_name": "RENSCHLER", "id": "3525-EMILY-RENSCHLER", "name": "EMILY RENSCHLER"}, "num_reviewers": 31, "id": "25581-601-3525-EMILY-RENSCHLER"}]}, "credits": null, "primary_alias": "ANTH-003", "path": "/courses/25581", "sections": {"path": "/courses/25581/sections", "values": [{"name": "INTRO TO HUMAN EVOLUTION", "sectionnum": "001", "primary_alias": "ANTH-003-001", "path": "/courses/25581/sections/001", "id": "25581-001", "aliases": ["ANTH-003-001"]}, {"name": "INTRO TO HUMAN EVOLUTION", "sectionnum": "601", "primary_alias": "ANTH-003-601", "path": "/courses/25581/sections/601", "id": "25581-601", "aliases": ["ANTH-003-601"]}]}, "id": 25581, "aliases": ["ANTH-003"]}