[{"ratings": {"rAmountLearned": "3.21", "rDifficulty": "2.42", "rStimulateInterest": "3.67", "rRecommendMajor": "3.78", "rCourseQuality": "3.44", "rWorkRequired": "2.61", "rInstructorAccess": "2.38", "rReadingsValue": "2.75", "rRecommendNonMajor": "3.35", "rCommAbility": "3.60", "rInstructorQuality": "3.62"}, "section": {"name": "WHO GETS ELECTED AND WHY", "sectionnum": "401", "primary_alias": "URBS-320-401", "path": "/courses/18167/sections/401", "id": "18167-401", "aliases": ["URBS-320-401", "PSCI-320-401", "GAFL-710-401"]}, "comments": "In this course, students will study the strategies of running for public office and evaluate how finance and fundraising, demographics, party organization, affect election outcomes. Many assignments will focus on analyzing campaign case studies and even ask students to evaluate the career of Professor Rendell himself. Students will have the opportunity to hear influential speakers as well. \r\n\r\nFor the most part, student found the class “engaging.” They found the speakers very interesting; however, some complained that the class lacked structure. One student said, “Every student should take this course.” \r\n\r\nStudents really enjoyed having Governor Rendell as a professor. One student proclaimed, “Governor Rendell is a wonderful storyteller and is able to invite high impact guests and campaign veterans.” Students said that Governor Rendell was a fascinating and very knowledgeable lecturer. \r\n\r\nThis class is highly recommended for both majors and non-majors, but students complained that the final project was very time consuming and that much of the assignments and work tended to pile up near the end of the semester. \r\n", "num_students": 78, "path": "/courses/18167/sections/401/reviews/2373-EDWARD-G-RENDELL", "instructor": {"path": "/instructors/2373-EDWARD-G-RENDELL", "first_name": "EDWARD G", "last_name": "RENDELL", "id": "2373-EDWARD-G-RENDELL", "name": "EDWARD G RENDELL"}, "num_reviewers": 75, "id": "18167-401-2373-EDWARD-G-RENDELL"}]