[{"ratings": {"rAmountLearned": "2.85", "rDifficulty": "2.17", "rStimulateInterest": "3.09", "rRecommendMajor": "3.57", "rCourseQuality": "2.92", "rWorkRequired": "2.00", "rInstructorAccess": "3.26", "rReadingsValue": "2.94", "rRecommendNonMajor": "2.17", "rCommAbility": "3.36", "rInstructorQuality": "3.31"}, "section": {"name": "INTRO TO FILM THEORY", "sectionnum": "401", "primary_alias": "CINE-103-401", "path": "/courses/27134/sections/401", "id": "27134-401", "aliases": ["CINE-103-401", "COML-116-401", "ARTH-107-401", "ENGL-095-401"]}, "comments": "\tThis course offers students an introduction to the major texts in film theory across the 20th and 21st centuries.  The course gives students an opportunity to read these central texts closely, to understand the range of historical contexts in which film theories are developed, to explore the relationship between film theory and the major film movements, to grapple with the points of contention that have emerged among theorists, and finally to consider: what is the status of film theory today?  This course is required for all Cinema Studies majors, but is open to all students, and no prior knowledge of film theory is assumed.  Requirements: Close reading of all assigned texts; attendance and participation in section discussions; 1 midterm exam; 1 take-home final exam.\r\n\r\n\tStudents loved this “great course,” with many remarking how much they learned about cinema after taking it. Students described the content as “incredibly intellectually stimulating” and “very interesting,” and loved how the “subjects of philosophy, sociology and psychology” were all connected to cinema. One student called the course “essential to understanding culture,” and students felt they learned a lot from the sometimes “heady” readings. While one student said the material was “too dense,” most found the information and theories valuable and interesting.\r\n\r\n\tProfessor Mazaj received glowing reviews from students, who described her as “encouraging, brilliant, witty, and concise.” Students loved her “very organized” lecturing style and said she “was great at leading discussions.” Many students called her “the best professor I have had at Penn,” and praised her ability to “break down the topics for the class.”\r\n\r\n\tThough “some of the sources were dense and hard to get through,” students felt the content and professor made it easy to get through the course material. Midterms and the take home final were said to be “of fair difficulty,” and students felt the only drawback was limited participation on the part of certain students. Most of the students taking this class were Cinema Studies majors or minors, but the course was recommended to anyone interested in film theory, as well as an effective way to gain “exposure to a variety of intellectual discourses and inspire new ways of reading and thinking.”\r\n", "num_students": 61, "path": "/courses/27134/sections/401/reviews/3224-META-MAZAJ", "instructor": {"path": "/instructors/3224-META-MAZAJ", "first_name": "META", "last_name": "MAZAJ", "id": "3224-META-MAZAJ", "name": "META MAZAJ"}, "num_reviewers": 55, "id": "27134-401-3224-META-MAZAJ"}]