[{"ratings": {"rAmountLearned": "2.58", "rDifficulty": "2.17", "rStimulateInterest": "2.16", "rRecommendMajor": "2.82", "rCourseQuality": "2.22", "rWorkRequired": "2.55", "rInstructorAccess": "2.75", "rReadingsValue": "2.39", "rRecommendNonMajor": "2.20", "rCommAbility": "2.27", "rInstructorQuality": "2.39"}, "section": {"name": "CHINA IN THE 20TH CENT", "sectionnum": "401", "primary_alias": "HIST-097-401", "path": "/courses/15891/sections/401", "id": "15891-401", "aliases": ["HIST-097-401", "EALC-047-401"]}, "comments": "This lecture course, the second of a two-part sequence, provides a broad survey of China’s political history and social change from the fall of the imperial order to the \\\"market socialism\\\" of today. It includes themes such as the interplay of new and traditional forces; the political role of new social classes; the search for viable models; war with Japan, civil war, and rural revolution; socialist construction and the development of the two-line struggle; the impact of Cold War; the Cutural Revolution; the opening to the West, economic reforms, and social ferment since the death of Mao.&#8232;&#8232;\r\nThis “fun” and “interesting but tough” course provides an in-depth look at the history or China. Assignments include short essays and midterm and final exams. With so much material to cover, lectures remain “vague,” while readings prove to be most valuable. Overall, most called the class “disorganized,” with “digressive” lectures and “pointless” in-class role-plays. Still, students report that it improved their critical thinking and knowledge of Chinese history.&#8232;&#8232;\r\nProfessor Fei is “knowledgeable,” “sweet,” and “approachable.” She was “great one-on-one,” but “a large lecture is not suited to her style.” Students disliked her unstructured, dense, and speedy use of PowerPoint, and she does not post slides or handouts online. Some complained that Professor Fei often rambled and “consistently ran the class well over time,” but appreciated how she “combines real-life experience with theoretical discourse to engage her students in a unique way.” One student called her “one of the best professors at this institution.”&#8232;&#8232;\r\nThe course has an “astronomical” amount of “dense” reading; although some were important, one “can get by without doing some of the other readings.” Lectures had “lot of jumping around without any strong emphasis on what we should know.” It was “difficult to know where one stands grade-wise.” One student commented that it was challenging for someone who does not know Chinese to hear and differentiate all of the names and places immediately. In sum, it was a “fair” and “very interesting” course that “more American students should take.”", "num_students": 91, "path": "/courses/15891/sections/401/reviews/2997-SI-YEN-FEI", "instructor": {"path": "/instructors/2997-SI-YEN-FEI", "first_name": "SI-YEN", "last_name": "FEI", "id": "2997-SI-YEN-FEI", "name": "SI-YEN FEI"}, "num_reviewers": 89, "id": "15891-401-2997-SI-YEN-FEI"}]