{"coursehistories": {"path": "/coursehistories/3840"}, "description": "This course explores questions fundamental to computer science such as which problems cannot be solved by computers, can we formalize computing as a mathematical concept without relying upon the specifics of programming languages and computing platforms, and which problems can be solved efficiently. The topics include finite automata and regular languages, context-free grammars and pushdown automata, Turing machines and undecidability, tractability and NP-completeness. The course emphasizes rigorous mathematical reasoning as well as connections to practical computing problems such as test processing, parsing, XML query languages, and program verification. \n\n", "semester": "2010C", "name": "AUTOMATA,COMPUT.& COMPLX", "reviews": {"path": "/courses/22827/reviews", "values": [{"ratings": {"rAmountLearned": "2.70", "rDifficulty": "3.34", "rStimulateInterest": "1.89", "rRecommendMajor": "3.11", "rCourseQuality": "2.55", "rWorkRequired": "2.76", "rInstructorAccess": "2.78", "rReadingsValue": "2.42", "rRecommendNonMajor": "0.66", "rCommAbility": "2.71", "rInstructorQuality": "2.64"}, "section": {"name": "AUTOMATA,COMPUT.& COMPLX", "sectionnum": "001", "primary_alias": "CIS-262-001", "path": "/courses/22827/sections/001", "id": "22827-001", "aliases": ["CIS-262-001"]}, "comments": "This course tightly integrates the theory and applications of discrete probability, discrete stochastic processes, and discrete statistical inference in the study of computer science. It introduces the Minimum Description Length Paradigm to unite basic ideas about randomness, inference and computation. Students are expected to use the Maple programming environment in homework exercises, which includes numerical and symbolic computations, simulations, and graphical displays.\r\n\r\nStudents generally found the course to be “difficult” and “constantly challenging.” Many concurred that the material was dry at times, and some students wished that Professor Alur “mentioned relevant applications of the course material more often, such as the use of language theory in natural language processing or bioinformatics.”\r\n\r\nReviews for Professor Alur varied, ranging from “boring” and “a little dry and esoteric at times” to “extremely interesting and intellectually stimulating.” Several students felt that Professor Alur excelled at making some potentially very dense material comprehensible. Some students wished that the professor had returned graded homework assignments more promptly so that students would have a chance to learn from their mistakes before the next midterm. Most students claimed that his lectures were useful and “attendance at recitation is almost necessary to understand the concepts better and succeed on homework and exams.” Some students felt that Professor Alur always ensured that concepts were understood and that he made “such a large lecture a place in which students can ask questions and truly understand what is happening.”\r\n\r\nMany students believed that homework and test material were tough, and that it was necessary to “pay attention to minute details in proofs.” Students seemed to agree that the course was challenging and moved at a very fast pace, often with a strong emphasis on homework. About half of the students commented on the weight placed on homework, saying that “it negatively affects those who try to work to figure out the problems, as many people just go to office hours and pretty much get the answers.” As one student worded it, “While one of the harder classes I have taken at Penn, I found it to be without a doubt one of the fairest classes I've taken. The exams were very straightforward for the subject matter, and I felt like they represented the class work very well.”\r\n", "num_students": 96, "path": "/courses/22827/sections/001/reviews/1358-RAJEEV-S--ALUR", "instructor": {"path": "/instructors/1358-RAJEEV-S--ALUR", "first_name": "RAJEEV S.", "last_name": "ALUR", "id": "1358-RAJEEV-S--ALUR", "name": "RAJEEV S. ALUR"}, "num_reviewers": 86, "id": "22827-001-1358-RAJEEV-S--ALUR"}]}, "credits": null, "primary_alias": "CIS-262", "path": "/courses/22827", "sections": {"path": "/courses/22827/sections", "values": [{"name": "AUTOMATA,COMPUT.& COMPLX", "sectionnum": "001", "primary_alias": "CIS-262-001", "path": "/courses/22827/sections/001", "id": "22827-001", "aliases": ["CIS-262-001"]}]}, "id": 22827, "aliases": ["CIS-262"]}