{"coursehistories": {"path": "/coursehistories/2487"}, "description": "Analysis of processes used in the chemical and pharmaceutical industries. Mass and energy balances, properties of pure fluids, equations of state. Heat effects accompanying phase changes and chemical reactions. \n\n", "semester": "2010C", "name": "MATERIAL&ENERGY BALANCES", "reviews": {"path": "/courses/22749/reviews", "values": [{"ratings": {"rAmountLearned": "3.27", "rDifficulty": "3.02", "rStimulateInterest": "3.15", "rRecommendMajor": "3.77", "rCourseQuality": "3.13", "rWorkRequired": "3.03", "rInstructorAccess": "3.24", "rReadingsValue": "2.79", "rRecommendNonMajor": "0.88", "rCommAbility": "3.00", "rInstructorQuality": "3.44"}, "section": {"name": "MATERIAL&ENERGY BALANCES", "sectionnum": "001", "primary_alias": "CBE-230-001", "path": "/courses/22749/sections/001", "id": "22749-001", "aliases": ["CBE-230-001"]}, "comments": "This course is an analysis of processes used in the chemical and pharmaceutical industries. It focuses on mass and energy balances, properties of pure fluids, equations of state. It also looks at heat effects accompanying phase changes and chemical reactions.\r\n\r\nMany students indicated that the course material was interesting and relevant. One student reported that Dr. Shieh “always included real-world applications of the concepts in his lectures,” which was “clearly lacking in all previous freshmen engineering classes”.\r\n\r\nStudents generally commended Dr. Shieh for being a very knowledgeable and enthusiastic instructor who “often went out of his way” to help. One student described him as “one of the better chemical engineering professors.” According to another, he was excellent at “explaining concepts and methods to approach different problems,” and he did not hesitate to solve hard examples in class.\r\n\r\nMany students described homework for the class as difficult but fair due to Dr. Shieh’s excellent teaching. Students generally agreed that the exams were of “reasonable difficulty and length.” It was suggested that students read the summary at the end of Chapter 7 in the textbook in preparation for the exams. This course is a requirement for the CBE curriculum, and the prerequisites are CBE 160 and sophomore standing.\r\n\r\nThis course review is based on the 8 student comments that were submitted.\r\n\r\n", "num_students": 51, "path": "/courses/22749/sections/001/reviews/1168-WEN-K-SHIEH", "instructor": {"path": "/instructors/1168-WEN-K-SHIEH", "first_name": "WEN K", "last_name": "SHIEH", "id": "1168-WEN-K-SHIEH", "name": "WEN K SHIEH"}, "num_reviewers": 45, "id": "22749-001-1168-WEN-K-SHIEH"}]}, "credits": null, "primary_alias": "CBE-230", "path": "/courses/22749", "sections": {"path": "/courses/22749/sections", "values": [{"name": "MATERIAL&ENERGY BALANCES", "sectionnum": "001", "primary_alias": "CBE-230-001", "path": "/courses/22749/sections/001", "id": "22749-001", "aliases": ["CBE-230-001"]}]}, "id": 22749, "aliases": ["CBE-230"]}