[{"ratings": {"rAmountLearned": "3.29", "rDifficulty": "2.58", "rStimulateInterest": "2.94", "rRecommendMajor": "3.55", "rCourseQuality": "3.24", "rWorkRequired": "2.67", "rInstructorAccess": "2.74", "rReadingsValue": "3.25", "rRecommendNonMajor": "2.84", "rCommAbility": "3.33", "rInstructorQuality": "3.36"}, "section": {"name": "CIV/RIGHTS/CIV LIBERTIES", "sectionnum": "001", "primary_alias": "PSCI-234-001", "path": "/courses/16358/sections/001", "id": "16358-001", "aliases": ["PSCI-234-001"]}, "comments": "By examining Supreme Court decisions in light of works on American history, politics, and political theory, the class will explore legal, political, and philosophical debates on civil liberties today. Readings will consider litigation of the 1st, 2d, 4th, 5th, 8th, and 14th Amendments. Issues will include struggles over freedom of religion, speech, privacy, and property rights, analyzed in the context of American cultural traditions and hierarchies; and conflicts over the rights of suspects, criminals and citizens, analyzed in the context of racial and class tensions and criminal violence.\r\n\r\nStudents praised Professor Smith’s course calling it “my favorite course at Penn so far” and “simply fantastic.” Students also stated that the course was well-organized and structured. One student noted, “the course was well put together, the readings had a logical chronology and order”. One student said that the course structure and presentation really set it apart from similar classes, and commented, “I also got a good sense of the trends of the Court, which other constitutional law courses I have taken have failed to recognize.”&#8232;\r\n\r\nStudents raved about Professor Smith’s ability to teach and to liven the classroom setting. One student said, “Professor Smith is engaging and his subtle humor keeps class interesting. I especially appreciate the updates on current cases coming from the Supreme Court which highlight topics from class.” Students stated that Professor Smith’s incredible wealth of constitutional knowledge really set him apart from fellow professors as he did “a nice job of mixing the theoretical with the reality of the Court’s decisions over time.” &#8232;&#8232;\r\n\r\nStudents recommended this course to both majors and non-majors. Students emphasized their love for the Professor’s creativity and flexibility as one student said: “The midterm and final were both a strong assessment of what we had learned in the course and also extremely enjoyable. Pretending to be a justice handing down a decision is possibly the most exciting ‘test’ I could imagine. I would honestly not mind taking a test for this class everyday.”", "num_students": 103, "path": "/courses/16358/sections/001/reviews/1002-ROGERS-M-SMITH", "instructor": {"path": "/instructors/1002-ROGERS-M-SMITH", "first_name": "ROGERS M", "last_name": "SMITH", "id": "1002-ROGERS-M-SMITH", "name": "ROGERS M SMITH"}, "num_reviewers": 94, "id": "16358-001-1002-ROGERS-M-SMITH"}]