[{"ratings": {"rAmountLearned": "3.09", "rDifficulty": "2.55", "rStimulateInterest": "3.18", "rRecommendMajor": "3.45", "rCourseQuality": "3.04", "rWorkRequired": "1.91", "rInstructorAccess": "3.55", "rReadingsValue": "2.41", "rRecommendNonMajor": "2.82", "rCommAbility": "3.14", "rInstructorQuality": "3.69"}, "section": {"name": "ITALY:NAPOLEON-BERLUSCON", "sectionnum": "001", "primary_alias": "HIST-318-001", "path": "/courses/21870/sections/001", "id": "21870-001", "aliases": ["HIST-318-001", "ITAL-300-001"]}, "comments": "The seminar looks at the evolution of modern Italy from the Napoleonic Era through the unification of the Kingdom in 1861, through its crisis in the First World War and the subsequent struggle for control of the new mass society. It looks at the emergence of the first fascist regime and the first modern dictatorship under Benito Mussolini; the rise and consolidation of that dictatorship, its descent into anti-semitism, defeat in war and the civil war of 1943-45, which followed that defeat. Out of that crisis a new prosperous republic has grown. It traces that story to the latest stage, the curious media dictatorship of Silvio Berlusconi. Italian history contains in its history all the problems of modern Europe and some unique to it. Its culture through the pizza, the pasta and the fine consumer products has become world-wide, and its children live in large numbers in every major city in the world.&#8232;&#8232;&#8232;The course was considered highly interesting by many students, though taught in a way that differed from most history classes. Students noted that the material was not as focused on Italy as the course title would suggest, but rather Italy in the context of the other world. The course also did not focus just on chronological events, but about “theoretical models about what was happening”. &#8232;&#8232;&#8232;Professor Steinberg was commended for “[focusing] on teaching the material, rather than giving grades”. He is “extremely knowledgeable and often does a very good job of encouraging students to participate in discussion.”&#8232;&#8232;&#8232;This review was based on 8 or less student comments.", "num_students": 27, "path": "/courses/21870/sections/001/reviews/625-JONATHAN-STEINBERG", "instructor": {"path": "/instructors/625-JONATHAN-STEINBERG", "first_name": "JONATHAN", "last_name": "STEINBERG", "id": "625-JONATHAN-STEINBERG", "name": "JONATHAN STEINBERG"}, "num_reviewers": 26, "id": "21870-001-625-JONATHAN-STEINBERG"}]