[{"ratings": {"rAmountLearned": "3.03", "rDifficulty": "3.33", "rStimulateInterest": "1.97", "rRecommendMajor": "3.71", "rCourseQuality": "2.74", "rWorkRequired": "3.84", "rInstructorAccess": "2.65", "rReadingsValue": "2.25", "rRecommendNonMajor": "0.90", "rCommAbility": "2.29", "rInstructorQuality": "2.52"}, "section": {"name": "VISUALIZATION II", "sectionnum": "001", "primary_alias": "ARCH-202-001", "path": "/courses/21282/sections/001", "id": "21282-001", "aliases": ["ARCH-202-001"]}, "comments": "This course focuses on research into visualization with a special emphasis introducing the fabrication shop, tools and techniques. The capacity of materials, their manipulation and the consequences of their inter-relationships are explored as a fundamental issue in making. Through the analysis of precedents and the production of new works, visualizing these relationships complements drawing with a material imagination and vocabulary.\r\n\r\nOverall, students believed that this course was very good and definitely helpful for an architect major. However, students thought the course was a bit unstructured. The lecture portion of the class was often helpful in terms of visual examples of the task at hand, but many found that there was a disconnect between some of the loftier concepts and the assignments given in studio.\r\n\r\nStudents thought that Professor Wesley’s comments were extremely valuable, yet it was often difficult to grasp the entirety of his critique due to the students’ relative inexperience in the architecture field.\r\n\r\nThis course has a prerequisite of ARCH 201. Students surmised, “the course required confidence, diligence and strong communication skills both verbally and visually.”\r\n", "num_students": 33, "path": "/courses/21282/sections/001/reviews/120-RICHARD-WESLEY", "instructor": {"path": "/instructors/120-RICHARD-WESLEY", "first_name": "RICHARD", "last_name": "WESLEY", "id": "120-RICHARD-WESLEY", "name": "RICHARD WESLEY"}, "num_reviewers": 31, "id": "21282-001-120-RICHARD-WESLEY"}]