{"coursehistories": {"path": "/coursehistories/1245"}, "description": "This course is designed for students who are interested in pursuing an international career and for those who plan to work for industrial and financial corporations that operate in emerging markets. The course will deal with the economic and political problems of macroeconomic adjustment, corruption, the transition economies, and international financial transactions. All of these topics will be illustrated with in-depth studies of economies in Africa, Asia, Latin America, the Middle East, Eastern Europe, and China. \n\n", "semester": "2008A", "name": "NATIONS, POL AND MARKETS", "reviews": {"path": "/courses/19867/reviews", "values": [{"ratings": {"rAmountLearned": "2.89", "rDifficulty": "2.38", "rStimulateInterest": "3.00", "rRecommendMajor": "3.41", "rCourseQuality": "3.00", "rWorkRequired": "2.00", "rInstructorAccess": "2.65", "rReadingsValue": "2.78", "rRecommendNonMajor": "2.81", "rCommAbility": "2.92", "rInstructorQuality": "2.97"}, "section": {"name": "NATIONS, POL AND MARKETS", "sectionnum": "401", "primary_alias": "BPUB-289-401", "path": "/courses/19867/sections/401", "id": "19867-401", "aliases": ["BPUB-289-401"]}, "comments": "BPUB 289 is designed for students who are interested in pursuing an international career and for those who plan to work for industrial and financial corporations that operate in emerging markets. The course deals with the economic and political problems of macroeconomic adjustment, corruption, the transition economies, and international financial transactions. All of these topics are illustrated through in-depth studies of economies in Africa, Asia, Latin America, the Middle East, Eastern Europe, and China. Student presentations made up a significant component of the course. Students held mixed opinions about them. Some believed that they “stimulated discussion” and were “a welcome break from listening to lectures” while others stated that they would have preferred more lectures from Professor Pack. There was general agreement that the presentations could be improved with “some slides from Professor Pack on what he thinks is important” and “a more concrete grading system.” Professor Pack was seen as “extremely knowledgeable,” showing “great passion for the material.” Students who wanted more lectures often cited a desire to hear more from the professor himself.  However, a few students mentioned that he was “difficult to reach after class” and could be “more receptive.” Students generally felt that the workload was fair. This is an upper-level course in Business and Public Policy; therefore, the students tend to be upperclassmen.", "num_students": 45, "path": "/courses/19867/sections/401/reviews/1806-HOWARD-PACK", "instructor": {"path": "/instructors/1806-HOWARD-PACK", "first_name": "HOWARD", "last_name": "PACK", "id": "1806-HOWARD-PACK", "name": "HOWARD PACK"}, "num_reviewers": 38, "id": "19867-401-1806-HOWARD-PACK"}]}, "credits": null, "primary_alias": "BPUB-289", "path": "/courses/19867", "sections": {"path": "/courses/19867/sections", "values": [{"name": "NATIONS, POL AND MARKETS", "sectionnum": "401", "primary_alias": "BPUB-289-401", "path": "/courses/19867/sections/401", "id": "19867-401", "aliases": ["BPUB-289-401"]}]}, "id": 19867, "aliases": ["BPUB-289"]}