{"coursehistories": {"path": "/coursehistories/2261"}, "description": "This course presents an overview of the field of development economics. The general aim is to show how economic analysis has been applied to issues related to developing countries. Among the topics covered are: income distribution, poverty, health, population growth, migration, growth, and the rural economy. \n\n", "semester": "2010C", "name": "DEVELOPMENT ECONOMICS", "reviews": {"path": "/courses/22920/reviews", "values": [{"ratings": {"rAmountLearned": "2.32", "rDifficulty": "2.55", "rStimulateInterest": "2.23", "rRecommendMajor": "2.36", "rCourseQuality": "2.28", "rWorkRequired": "2.18", "rInstructorAccess": "1.82", "rReadingsValue": "1.86", "rRecommendNonMajor": "2.05", "rCommAbility": "2.09", "rInstructorQuality": "2.60"}, "section": {"name": "DEVELOPMENT ECONOMICS", "sectionnum": "001", "primary_alias": "ECON-024-001", "path": "/courses/22920/sections/001", "id": "22920-001", "aliases": ["ECON-024-001"]}, "comments": "This course presents an overview of the field of development economics. The general aim is to show how economic analysis has been applied to issues related to developing countries. Among the topics covered are: income distribution, poverty, health, population growth, migration, growth, and the rural economy. The prerequisites are Econ 001 or Econ 010.\r\n\r\nStudents reported that this course “addressed important questions” and made them “think critically.” Some students regretted that although it was a small class, “there was little to no discussion.” Others were disappointed by a lack of depth, as only one textbook was used and no outside readings were incorporated. Additionally, since the course covers “approximately 15 chapters in one semester,” it was difficult to cover any individual topic in much depth. Several students also expressed a desire for the course to be more structured.\r\n\r\nProfessor Cunha was generally described as a “nice guy” who is “excellent at conveying the material.” However, students complained about a lack of accessibility and communication with the professor. He “doesn’t believe in talking about grades or how you’re going to be graded,” and he “does not respond promptly or at all” to student emails. Many students also found him to be disorganized. One student noted that the “instructor is brilliant” but may not realize “that the class isn’t following along.” A few students commented that the professor follows the book very closely, even using PowerPoint slides from the book. \r\n\r\nThis upper-level economics class was recommended to economics majors. One student recommended this course to “anyone seeking to work in International Development…because it demonstrates the difficulty there is in achieving development.” Some students mentioned that assignments did not have much use because they were not returned to students and did not seem to reinforce concepts. Others expressed confusion over the system of grading used on exams.\r\n", "num_students": 28, "path": "/courses/22920/sections/001/reviews/4784-FLAVIO-CUNHA", "instructor": {"path": "/instructors/4784-FLAVIO-CUNHA", "first_name": "FLAVIO", "last_name": "CUNHA", "id": "4784-FLAVIO-CUNHA", "name": "FLAVIO CUNHA"}, "num_reviewers": 25, "id": "22920-001-4784-FLAVIO-CUNHA"}]}, "credits": null, "primary_alias": "ECON-024", "path": "/courses/22920", "sections": {"path": "/courses/22920/sections", "values": [{"name": "DEVELOPMENT ECONOMICS", "sectionnum": "001", "primary_alias": "ECON-024-001", "path": "/courses/22920/sections/001", "id": "22920-001", "aliases": ["ECON-024-001"]}]}, "id": 22920, "aliases": ["ECON-024"]}