{"coursehistories": {"path": "/coursehistories/4708"}, "description": "The objective of this course is to provide students with a solid technical foundation for developing, animating and controlling articulated systems used in interactive computer games, physical simulations and high-end animation applications. The course balances theory with practice by \"looking under the hood\" of a number of popular commercial animation packages and examines the technologies and techniques used from both a computer science and engineering perspective. Topics covered include: geometric coordinate systems and transformations; quaternions; parametric curves and surfaces; forward and inverse kinematics; dynamic systems and control; computer simulation; keyframe, motion capture and procedural animation; behavior-based animation and control; facial animation; smart characters and intelligent agents. \n\n", "semester": "2010C", "name": "SCALABLE&CLOUD COMPUTING", "reviews": {"path": "/courses/22831/reviews", "values": [{"ratings": {"rAmountLearned": "3.91", "rDifficulty": "2.82", "rStimulateInterest": "3.27", "rRecommendMajor": "3.73", "rCourseQuality": "3.36", "rWorkRequired": "3.27", "rInstructorAccess": "3.82", "rReadingsValue": "3.09", "rRecommendNonMajor": "2.27", "rCommAbility": "3.64", "rInstructorQuality": "3.55"}, "section": {"name": "SCALABLE&CLOUD COMPUTING", "sectionnum": "002", "primary_alias": "CIS-399-002", "path": "/courses/22831/sections/002", "id": "22831-002", "aliases": ["CIS-399-002"]}, "comments": "", "num_students": 11, "path": "/courses/22831/sections/002/reviews/2073-ZACHARY-G--IVES", "instructor": {"path": "/instructors/2073-ZACHARY-G--IVES", "first_name": "ZACHARY G.", "last_name": "IVES", "id": "2073-ZACHARY-G--IVES", "name": "ZACHARY G. IVES"}, "num_reviewers": 11, "id": "22831-002-2073-ZACHARY-G--IVES"}, {"ratings": {"rAmountLearned": "3.91", "rDifficulty": "2.82", "rStimulateInterest": "3.18", "rRecommendMajor": "3.73", "rCourseQuality": "3.36", "rWorkRequired": "3.27", "rInstructorAccess": "3.70", "rReadingsValue": "3.09", "rRecommendNonMajor": "2.27", "rCommAbility": "3.36", "rInstructorQuality": "3.45"}, "section": {"name": "SCALABLE&CLOUD COMPUTING", "sectionnum": "002", "primary_alias": "CIS-399-002", "path": "/courses/22831/sections/002", "id": "22831-002", "aliases": ["CIS-399-002"]}, "comments": "The objective of CIS 399 is to provide students with a solid technical foundation for developing, animating and controlling articulated systems used in interactive computer games, physical simulations and high-end animation applications. The course balances theory with practice by \"looking under the hood\" of a number of popular commercial animation packages and examines the technologies and techniques used from both a computer science and engineering perspective. Topics covered include geometric coordinate systems and transformations; quaternions; parametric curves and surfaces; forward and inverse kinematics; dynamic systems and control; computer simulation; keyframe, motion capture and procedural animation; behavior-based animation and control; facial animation; smart characters and intelligent agents. \r\n\r\nStudents seemed to have really enjoyed the course. Most concurred that it covered many interesting and relevant topics in computer science. Several students commented that the concepts covered in lecture and homework assignments were “very relevant to the real world” and to the “types of things that [computer science] students do after graduating from Penn.” However, some students found projects to be very difficult and time consuming. Many found the homework assignments to be hard because they required some background in Linux and software engineering. \r\n\r\nThis course was co-taught by Professors Haeberlen and Ives. Students found both professors to be “capable and interesting,” and both did a great job of providing helpful guidelines and advice, which made the class significantly easier to handle.\r\n\r\nThis course received high ratings and was very enthusiastically recommended to all majors. It was also recommended to non-majors who may have some background to be able to tackle the material.\r\n\r\nThis review was based on the 6 student comments that were submitted.\r\n", "num_students": 11, "path": "/courses/22831/sections/002/reviews/5319-ANDREAS-HAEBERLEN", "instructor": {"path": "/instructors/5319-ANDREAS-HAEBERLEN", "first_name": "ANDREAS", "last_name": "HAEBERLEN", "id": "5319-ANDREAS-HAEBERLEN", "name": "ANDREAS HAEBERLEN"}, "num_reviewers": 11, "id": "22831-002-5319-ANDREAS-HAEBERLEN"}]}, "credits": null, "primary_alias": "CIS-399", "path": "/courses/22831", "sections": {"path": "/courses/22831/sections", "values": [{"name": "SCALABLE&CLOUD COMPUTING", "sectionnum": "002", "primary_alias": "CIS-399-002", "path": "/courses/22831/sections/002", "id": "22831-002", "aliases": ["CIS-399-002"]}]}, "id": 22831, "aliases": ["CIS-399"]}