[{"ratings": {"rAmountLearned": "3.10", "rDifficulty": "2.40", "rStimulateInterest": "3.30", "rRecommendMajor": "3.10", "rCourseQuality": "2.90", "rWorkRequired": "2.90", "rInstructorAccess": "3.60", "rReadingsValue": "2.50", "rRecommendNonMajor": "3.10", "rCommAbility": "3.56", "rInstructorQuality": "3.40"}, "section": {"name": "PERSONNE/HUM RES MGMT", "sectionnum": "001", "primary_alias": "MGMT-422-001", "path": "/courses/24747/sections/001", "id": "24747-001", "aliases": ["MGMT-422-001"]}, "comments": "*Management 422 focuses on the theory and practice of personnel management and human resource issues in organizations of all types. The course aims to enable managers to understand the human aspects of his or her job and adapt this knowledge to the efficient use of human resources. It emphasizes overall management responsibilities relating to HR rather than the procedural aspects of personnel management.\r\n\r\nStudents found the subject area of this course to be “dry,” especially the way it was presented in the textbook. Students felt that an inordinate amount of time was spent on legal topics, which were especially dull. However, students also reported that this class is helpful because it “covered all the pertinent areas of HR.” \r\n\r\nOverall, students found Professor Francesco to be a knowledgeable and interesting professor. They applauded Professor Francesco’s “ability to express the material” and thought she was “very passionate about HR.” In addition, they thought Professor Francesco was organized, and that her assignments were helpful in learning the material. \r\n\r\nThough students enjoyed Professor Francesco’s presentation of the material, they found that the projects assigned were too time consuming to count for only 25% of the overall grade. One student reported that the class “rarely made it through an entire lecture, which was a shame,” and that there were several topics that were self-taught. Students thought that this class would be worthwhile for anyone who has never had exposure to Human Resource Management, as it covers a wealth of relevant material. This course is part of the Wharton Program for Working Professionals. \r\n\r\n\r\n*This review is based on 7 student comments\r\n", "num_students": 11, "path": "/courses/24747/sections/001/reviews/1573-ANGELA-FRANCESCO", "instructor": {"path": "/instructors/1573-ANGELA-FRANCESCO", "first_name": "ANGELA", "last_name": "FRANCESCO", "id": "1573-ANGELA-FRANCESCO", "name": "ANGELA FRANCESCO"}, "num_reviewers": 10, "id": "24747-001-1573-ANGELA-FRANCESCO"}]