[{"ratings": {"rAmountLearned": "2.77", "rDifficulty": "3.10", "rStimulateInterest": "2.94", "rRecommendMajor": "3.26", "rCourseQuality": "2.71", "rWorkRequired": "2.81", "rInstructorAccess": "3.52", "rReadingsValue": "2.48", "rRecommendNonMajor": "2.03", "rCommAbility": "3.00", "rInstructorQuality": "3.10"}, "section": {"name": "MECH PROP NANO/MACRO", "sectionnum": "401", "primary_alias": "MSE-405-401", "path": "/courses/23474/sections/401", "id": "23474-401", "aliases": ["MSE-405-401", "MEAM-405-401", "MEAM-505-401", "MSE-505-401"]}, "comments": "MSE 405 includes a review of tensors and elasticity with special emphasis on the effects of symmetry on tensor properties. Then deformation, fracture and degradation (fatique and wear) are treated, including mapping strategies for understanding the ranges of material properties. The textbook used in the course is Mechanical Behavior of Materials, by Keith Bowen. The grading is based on homework assignments and midterm and final exams. \r\n\r\nMost students enjoyed the course. Some students reported that there was “a lot of material [they] wished [had been covered], but there was no time.” Others reported that the lectures were “very full of material” and that they learned a great deal.\r\n\r\nProfessor Gianolo was regarded by most students as being “generally interested in the material, very accessible for questions, and willing to help in whatever way necessary for the students to understand the material.” Many students reported, however, that they wished the examples provided in class by the professor had been more representative of the difficulty of the problems given in the homework assignments and on the exams.\r\n\r\nThe course is generally aimed as an upper level undergraduate course and a graduate course. Students mostly found the course to be a “nice course for MSE students.” Students found homework assignments difficult, though not extremely time consuming.\r\n", "num_students": 40, "path": "/courses/23474/sections/401/reviews/5442-DANIEL-SANTIAGO-GIANOLA", "instructor": {"path": "/instructors/5442-DANIEL-SANTIAGO-GIANOLA", "first_name": "DANIEL SANTIAGO", "last_name": "GIANOLA", "id": "5442-DANIEL-SANTIAGO-GIANOLA", "name": "DANIEL SANTIAGO GIANOLA"}, "num_reviewers": 31, "id": "23474-401-5442-DANIEL-SANTIAGO-GIANOLA"}]