[{"ratings": {"rAmountLearned": "2.02", "rDifficulty": "3.19", "rStimulateInterest": "1.15", "rRecommendMajor": "3.15", "rCourseQuality": "1.67", "rWorkRequired": "2.87", "rInstructorAccess": "2.21", "rReadingsValue": "2.81", "rRecommendNonMajor": "0.94", "rCommAbility": "1.47", "rInstructorQuality": "1.62"}, "section": {"name": "GENERAL CHEMISTRY II", "sectionnum": "001", "primary_alias": "CHEM-102-001", "path": "/courses/24111/sections/001", "id": "24111-001", "aliases": ["CHEM-102-001"]}, "comments": "This course is a continuation of Chemistry 101. The second term stresses the\r\nthermodynamic approach to chemical reactions, electrochemical processes, and reaction\r\nrates and mechanisms. It includes special topics in chemistry.\r\nStudents reported that this course could be “very interesting,” but also that it\r\ntended to be “dry.” A biology major wrote that “it provided some chemical insight into\r\nbiological systems and in general was more applicable than CHEM101,” making it a\r\nuseful course.\r\nProfessor Saven was described as “occasionally humorous,” but for the most part\r\nwas “disorganized, monotonous and unclear.” Students also said he “did not know how\r\nto teach concepts in an appropriate way.” Many found his lectures to be exceedingly\r\ndifficult to follow or understand, and students were forced to only use the book to study.\r\nAdditionally, students said Professor Saven was unable “to cover everything on the\r\nsyllabus” due to the pace of the lecture. They did note, however, that he was very\r\n“knowledgeable.”\r\nMany students complained that there were not enough practice problems outside\r\nof homework, which made tests “too difficult.” They also tended to be much harder than\r\nthe material covered in class.", "num_students": 67, "path": "/courses/24111/sections/001/reviews/1317-JEFFERY-G--SAVEN", "instructor": {"path": "/instructors/1317-JEFFERY-G--SAVEN", "first_name": "JEFFERY G.", "last_name": "SAVEN", "id": "1317-JEFFERY-G--SAVEN", "name": "JEFFERY G. SAVEN"}, "num_reviewers": 63, "id": "24111-001-1317-JEFFERY-G--SAVEN"}]