{"coursehistories": {"path": "/coursehistories/293"}, "description": "This course is an introduction to the fundamentals of communication behavior. It focuses on social science studies relating to the processes and effects of mass communication. Research reviewed includes media use behavior and media influences on knowledge, perceptions of social reality, aggressive behavior, and political behavior. \n\n", "semester": "2011A", "name": "COMMUNICATION BEHAVIOR", "reviews": {"path": "/courses/21494/reviews", "values": [{"ratings": {"rAmountLearned": "2.22", "rDifficulty": "2.36", "rStimulateInterest": "1.56", "rRecommendMajor": "2.88", "rCourseQuality": "1.89", "rWorkRequired": "2.46", "rInstructorAccess": "2.16", "rReadingsValue": "1.63", "rRecommendNonMajor": "1.40", "rCommAbility": "2.18", "rInstructorQuality": "1.95"}, "section": {"name": "COMMUNICATION BEHAVIOR", "sectionnum": "001", "primary_alias": "COMM-125-001", "path": "/courses/21494/sections/001", "id": "21494-001", "aliases": ["COMM-125-001"]}, "comments": "This course is an introduction to the fundamentals of communication behavior. It focuses on social science studies relating to the processes and effects of mass communication. Research reviewed includes media use behavior and media influences on knowledge, perceptions of social reality, aggressive behavior, and political behavior. &#8232;&#8232;&#8232;&#8232;Students generally felt that while this course covered the basics of communication well and was a “necessary” course, it was not a particularly engaging one. Several students described the course as “dull” and with “the potential to be much more interesting.” Many students commented that the course only covered the “basics” and “oversimplified” complex theories. A few students commented on the redundancy of the information covered in the readings, lectures, and recitations, causing some students to feel that attendance was “unnecessary.” One student reported that the course material itself was “interesting” and allowed them to “learn a lot about mass media,” and another noted that it provided a “nice overview for a lot of communications-related topics.” Recitations were reported to be more enjoyable than lectures. The course includes a midterm, final exam, and a paper.&#8232;&#8232;Students had mixed opinions about Professor Moehler. While one student described her as “enthusiastic and engaging,” others faulted her for creating the dullness that characterized the course in most students’ opinions. One student reported that Professor Moehler could have made the class “more engaging and relatable to [students’] everyday lives.” Professor Moehler used lecture slides that she also posted online.&#8232;&#8232;&#8232;&#8232;Students generally agreed that this introductory course was a good way to learn the basics of communications and a particularly “helpful” foundation for freshmen planning to major in communications. This course fulfills the Society sector and is a requirement for the Communications major. Upperclassmen who took the course described it as easy. Students reported that the course “held students’ hands the entire way” and “spoon-fed” everything to them. While some students felt that the course was “fair” and described class expectations and goals as “clearly outlined,” several other students were frustrated by what they felt was a discrepancy between the oversimplification of the lectures and paper and the difficulty of the exam. One student described the exam as “astronomically harder” than the readings and information discussed, and another agreed that what was learned in class had to be “stretched for the exam.” However, nearly all students agreed that the paper was “pretty straightforward.” One student noted that a “helpful” study guide was provided for both the midterm and final. Readings for this course were described by one student as “typically very long.”", "num_students": 65, "path": "/courses/21494/sections/001/reviews/5325-DEVRA-C--MOEHLER", "instructor": {"path": "/instructors/5325-DEVRA-C--MOEHLER", "first_name": "DEVRA C.", "last_name": "MOEHLER", "id": "5325-DEVRA-C--MOEHLER", "name": "DEVRA C. MOEHLER"}, "num_reviewers": 57, "id": "21494-001-5325-DEVRA-C--MOEHLER"}]}, "credits": null, "primary_alias": "COMM-125", "path": "/courses/21494", "sections": {"path": "/courses/21494/sections", "values": [{"name": "COMMUNICATION BEHAVIOR", "sectionnum": "001", "primary_alias": "COMM-125-001", "path": "/courses/21494/sections/001", "id": "21494-001", "aliases": ["COMM-125-001"]}]}, "id": 21494, "aliases": ["COMM-125"]}