[{"ratings": {"rAmountLearned": "3.02", "rDifficulty": "2.49", "rStimulateInterest": "3.22", "rRecommendMajor": "3.37", "rCourseQuality": "3.27", "rWorkRequired": "2.73", "rInstructorAccess": "3.56", "rReadingsValue": "3.31", "rRecommendNonMajor": "3.00", "rCommAbility": "3.58", "rInstructorQuality": "3.60"}, "section": {"name": "TOPICS IN LIT. & SOCIETY: DISABILITY NARRATIVE", "sectionnum": "401", "primary_alias": "ENGL-105-401", "path": "/courses/25920/sections/401", "id": "25920-401", "aliases": ["ENGL-105-401", "GSOC-105-401"]}, "comments": "This course will introduce key questions in the field of disability studies, including representation, stigma, access, civil rights, health care, institutionalization, employment, illness and disability, and conceptions of the human. It will also cover how disability is inflected by other dimensions of identity including race, class, gender, and sexuality. It will focus on disability and literature, with attention to questions of framing and narrative strategy. The literature will consist of a range of twentieth-century novels, memoirs, and autobiographies. Readings may include: Helen Keller, The Story of My Life; Carson McCullers, The Heart is a Lonely Hunter; Katherine Butler Hathaway, The Little Locksmith; Audre Lorde, The Cancer Journals; Ken Kesey, One Flew over the Cuckoo’s Nest; William Styron, Darkness Visible; Simi Linton, My Body Politic; Katherine Dunn, Geek Love; Eli Clare, Exile and Pride; Terry Galloway, Mean Little Deaf Queer.\r\n\r\nAll the students were completely satisfied with this course, labeling it “amazing” and a “favorite class at Penn.” The readings were “interesting,” “important,” and “unique.” One student felt that though the “large lecture size can impede somewhat on having deep discussions,” the “lectures were incredible.” However, there was no “active participation.” Overall, students claimed to have learned “information that goes beyond just the English readings” and learned things that they “never went into the course expecting to learn.”\r\n\r\nProfessor Love is “brilliant” and “extremely passionate.” She is very “enthusiastic about the material and was able to stimulate interest in the subject.” Students agree she is a “good lecturer” and “approached the subject of disabled studies with sensitivity and enthusiasm.” Students are not short of complimentary adjectives to describe Professor Love. She is “accessible to discuss any questions” and is “very willing to help on papers.”\r\n\r\nVery few students discussed the amount of assigned work, though one student noted “the course was intense because of the amount of readings” assigned. However, the students seemed satisfied with other aspects of the course, though one felt that the “grading system seemed a bit arbitrary and rather difficult for an introductory English class.” This course fulfills the Humanities and Social Science Sector.\r\n", "num_students": 66, "path": "/courses/25920/sections/401/reviews/2120-HEATHER-K--LOVE", "instructor": {"path": "/instructors/2120-HEATHER-K--LOVE", "first_name": "HEATHER K.", "last_name": "LOVE", "id": "2120-HEATHER-K--LOVE", "name": "HEATHER K. LOVE"}, "num_reviewers": 56, "id": "25920-401-2120-HEATHER-K--LOVE"}]