[{"ratings": {"rAmountLearned": "2.26", "rDifficulty": "2.65", "rStimulateInterest": "2.50", "rRecommendMajor": "3.25", "rCourseQuality": "2.25", "rWorkRequired": "2.56", "rInstructorAccess": "2.53", "rReadingsValue": "1.97", "rRecommendNonMajor": "1.95", "rCommAbility": "2.97", "rInstructorQuality": "2.77"}, "section": {"name": "Introduction to Environmental Earth Science", "sectionnum": "001", "primary_alias": "ENVS-200-001", "path": "/courses/24345/sections/001", "id": "24345-001", "aliases": ["ENVS-200-001"]}, "comments": "ENVS 200 exposes students to the principles that underlie our understanding of\r\nhow the Earth works. The goal of this class is to obtain a scientific understanding of the\r\nentire Earth system by describing its component parts (lithosphere, hydrosphere,\r\natmosphere, biosphere) and their interactions, and describe how they have evolved, how\r\nthey function, and how they are expected to respond to human activity. Students work to\r\ndevelop the capability to predict those changes that will occur in the next decade, both\r\nnaturally and in response to human activity. Natural and human-generated energy is used\r\nas a unifying principle. Knowledge gained through this course helps students make\r\ninformed decisions in all spheres of human activity: science, policy, economics, etc.\r\nMany students commented that homework assignments involved a lot of busy\r\nwork and were very tedious. The class used clickers to gauge students’ understanding.\r\nMany found the grading on homework and exams “nitpicky.”\r\nStudents describe Professor Plante as “helpful” and “likeable.” They felt that\r\nProfessor Plante expressed enthusiasm for the subject and gave interesting lectures.\r\nEnvironmental studies majors seemed to find this course more interesting than nonmajors.\r\nThe course focuses on parts of the environment that won’t necessarily pique\r\nnon-majors’ interest, such as soil.", "num_students": 146, "path": "/courses/24345/sections/001/reviews/3958-ALAIN-F--PLANTE", "instructor": {"path": "/instructors/3958-ALAIN-F--PLANTE", "first_name": "ALAIN F.", "last_name": "PLANTE", "id": "3958-ALAIN-F--PLANTE", "name": "ALAIN F. PLANTE"}, "num_reviewers": 121, "id": "24345-001-3958-ALAIN-F--PLANTE"}]