{"coursehistories": {"path": "/coursehistories/256"}, "description": "A basic laboratory course in which both the theoretical and practical aspects of a variety of organic reactions and multistep syntheses are emphasized. Modern chromatographic, instrumental, and spectroscopic techniques are applied to experimental organic chemistry. Course should be taken concurrently with CHEM 242 or in the semester immediately following. For safety reasons students will not be permitted to wear contact lenses in the laboratory. \n\nPLEASE NOTE THE FOLLOWING: For the Summer and LPS offering of CHEM 245, it is a 2-semester course. Part 1 is taken in the first term for 0.0 CU and then Part 2 is taken in the second term immediately following the first for 1.0 CU. \n\n", "semester": "2011A", "name": "EXPERIMTL ORGAN CHEM I", "reviews": {"path": "/courses/21401/reviews", "values": [{"ratings": {"rAmountLearned": "2.80", "rDifficulty": "3.37", "rStimulateInterest": "2.44", "rRecommendMajor": "2.90", "rCourseQuality": "2.50", "rWorkRequired": "3.87", "rInstructorAccess": "2.80", "rReadingsValue": "2.72", "rRecommendNonMajor": "0.80", "rCommAbility": "2.97", "rInstructorQuality": "2.90"}, "section": {"name": "EXPERIMTL ORGAN CHEM I", "sectionnum": "001", "primary_alias": "CHEM-245-001", "path": "/courses/21401/sections/001", "id": "21401-001", "aliases": ["CHEM-245-001"]}, "comments": "This course is a basic laboratory course in which both the theoretical and practical aspects of a variety of organic reactions and multistep syntheses are emphasized. Modern chromatographic, instrumental, and spectroscopic techniques are applied to experimental organic chemistry. Course should be taken concurrently with CHEM 242 or in the semester immediately following.\r\n\r\nStudents said they “learned a lot” from this “well-run and well-organized” course, but many also said the amount of material covered was too much for a 1 credit course.\r\n\r\nStudents called Professor Mallory “excellent,” and said that “preparation and passion radiate from her.” One student noted that “she loves the material and she loves her students,” saying she was “very understanding of students’ problems.” Other students felt that Professor Mallory encouraged students to compete with one another rather than encouraging them to “truly appreciate the chemistry.”\r\n\r\nThis course included lab reports every week, as well as three exams and a final lab report. Students found the work load “difficult to handle with other classes/work,” and “required a lot of out-of-class time for work.” Furthermore, many students raised questions about the grading, and thought it was “harsh.” This course has a prerequisite of CHEM 241 and a co-requisite requirement of CHEM 242. It also contains a lab fee of $300.\r\n", "num_students": 137, "path": "/courses/21401/sections/001/reviews/239-CLELIA-W-MALLORY", "instructor": {"path": "/instructors/239-CLELIA-W-MALLORY", "first_name": "CLELIA W", "last_name": "MALLORY", "id": "239-CLELIA-W-MALLORY", "name": "CLELIA W MALLORY"}, "num_reviewers": 131, "id": "21401-001-239-CLELIA-W-MALLORY"}]}, "credits": null, "primary_alias": "CHEM-245", "path": "/courses/21401", "sections": {"path": "/courses/21401/sections", "values": [{"name": "EXPERIMTL ORGAN CHEM I", "sectionnum": "001", "primary_alias": "CHEM-245-001", "path": "/courses/21401/sections/001", "id": "21401-001", "aliases": ["CHEM-245-001"]}]}, "id": 21401, "aliases": ["CHEM-245"]}