{"coursehistories": {"path": "/coursehistories/1555"}, "description": "Introduction to probability. Expectation. Variance. Covariance. Joint probability. Moment generating functions. Stochastic models and applications. Markov chains. Renewal processes. Queuing models. Statistical inference. Linear regression. Computational probability. Discrete-event simulation. \n\n", "semester": "2008C", "name": "INTRO TO PROB & STAT", "reviews": {"path": "/courses/18615/reviews", "values": [{"ratings": {"rAmountLearned": "3.27", "rDifficulty": "2.87", "rStimulateInterest": "3.42", "rRecommendMajor": "2.97", "rCourseQuality": "3.32", "rWorkRequired": "3.05", "rInstructorAccess": "3.24", "rReadingsValue": "2.89", "rRecommendNonMajor": "2.45", "rCommAbility": "3.50", "rInstructorQuality": "3.66"}, "section": {"name": "INTRO TO PROB & STAT", "sectionnum": "001", "primary_alias": "ENM-503-001", "path": "/courses/18615/sections/001", "id": "18615-001", "aliases": ["ENM-503-001"]}, "comments": "ENM 503 provides an introduction to probability and is intended as a student’s first probability class. Some of the topics covered in the class include combinatorial probabilities, variance, covariance, stochastic models and applications, and Markov chains. The textbook required for the class is called A First Course in Probability.\r\n\r\nStudents found the content of the course to be interesting, but often the material became too theoretical and less practical. Many students called for more practical examples and applications to make the course more interesting. Most students learned very much from the class and found it beneficial to take.\r\n\r\nMost students greatly enjoyed Professor Venkatesh’s teaching style. One student remarked his classes were “some of the most interesting lectures I have ever attended.” Others described him as “excellent” and his lectures as full of “coherent and logical exposition.” Students also found him to be very accessible and helpful.\r\n\r\nAlthough it is an introduction to probability, this class is designed for advanced undergraduates and early graduate students that have not taken a probability class. Undergraduates need MATH 240 or an equivalent class as a prerequisite. Students described the class as “very challenging” and remarked that the homework was very time consuming. A number of students also disliked the textbook and the examples it provided.", "num_students": 46, "path": "/courses/18615/sections/001/reviews/1177-SANTOSH-S-VENKATESH", "instructor": {"path": "/instructors/1177-SANTOSH-S-VENKATESH", "first_name": "SANTOSH S", "last_name": "VENKATESH", "id": "1177-SANTOSH-S-VENKATESH", "name": "SANTOSH S VENKATESH"}, "num_reviewers": 38, "id": "18615-001-1177-SANTOSH-S-VENKATESH"}]}, "credits": null, "primary_alias": "ENM-503", "path": "/courses/18615", "sections": {"path": "/courses/18615/sections", "values": [{"name": "INTRO TO PROB & STAT", "sectionnum": "001", "primary_alias": "ENM-503-001", "path": "/courses/18615/sections/001", "id": "18615-001", "aliases": ["ENM-503-001"]}]}, "id": 18615, "aliases": ["ENM-503"]}