[{"ratings": {"rAmountLearned": "3.92", "rDifficulty": "3.75", "rStimulateInterest": "4.00", "rRecommendMajor": "3.85", "rCourseQuality": "3.93", "rWorkRequired": "3.46", "rInstructorAccess": "4.00", "rReadingsValue": "3.58", "rRecommendNonMajor": "3.62", "rCommAbility": "3.93", "rInstructorQuality": "4.00"}, "section": {"name": "Living Deliberately: Monk, Saints, and The Contemplative Life.", "sectionnum": "301", "primary_alias": "RELS-356-301", "path": "/courses/28107/sections/301", "id": "28107-301", "aliases": ["RELS-356-301"]}, "comments": "“The class, which is in the Religious Studies department, requires students to abstain from using electronic and verbal communication, the internet and alcohol.  The course requires no formal papers or examinations, but students are expected to adjust their lifestyles to a series of restrictions drawn from numerous historical monastic traditions.  Other assignments include waking up at 5 a.m. without an alarm clock, keeping a journal and meditating.” –The DP\r\n\r\n\tThis unique course was beloved by students, almost all of whom described it as “life-changing.” The course allows students “to honestly and unabashedly learn about themselves on their own terms” and shows students “a different way to live life.” It required a significant amount of work and adjustments to regular life at Penn, including “writing detailed journal entries every 30 minutes of every waking hour” as well as other sacrifices. While students commented on the intense nature of the course—one student warned to “expect no social life during most of this course”—nearly all said it was well worth it, with multiple students calling it “the best course I’ve taken at Penn.”\r\n\r\n\tProfessor McDaniel received similar accolades, being described as “an immaculate storyteller,” “a fantastic lecturer” and “singularly knowledgeable about the subject matter.” Students loved his intense dedication to students’ growth, saying “he will spend hours meeting with students outside of class.” Many loved his ability to direct the class in ways that maximized student learning and reflection, and appreciated how he “genuinely believes in his students.”\r\n\r\n\tThis course is described by most students as “not easy by any means,” with several students warning others not to enroll unless one is fully prepared for the commitment the class requires. Nonetheless, the intense amount of work and unique nature of the course made lasting impressions on its students, who asserted the class and professor changed their lives “in a profound and fundamental way.”", "num_students": 15, "path": "/courses/28107/sections/301/reviews/4968-JUSTIN-THOMAS-MCDANIEL", "instructor": {"path": "/instructors/4968-JUSTIN-THOMAS-MCDANIEL", "first_name": "JUSTIN THOMAS", "last_name": "MCDANIEL", "id": "4968-JUSTIN-THOMAS-MCDANIEL", "name": "JUSTIN THOMAS MCDANIEL"}, "num_reviewers": 15, "id": "28107-301-4968-JUSTIN-THOMAS-MCDANIEL"}]