[{"ratings": {"rAmountLearned": "3.91", "rDifficulty": "3.55", "rStimulateInterest": "3.82", "rRecommendMajor": "3.91", "rCourseQuality": "3.45", "rWorkRequired": "3.82", "rInstructorAccess": "3.36", "rReadingsValue": "3.36", "rRecommendNonMajor": "2.18", "rCommAbility": "3.82", "rInstructorQuality": "3.91"}, "section": {"name": "Power Sharing in Deeply Divided Places", "sectionnum": "301", "primary_alias": "PSCI-395-301", "path": "/courses/23685/sections/301", "id": "23685-301", "aliases": ["PSCI-395-301"]}, "comments": "This course examines conceptual, explanatory and normative debates over the merits and effectiveness of federations and consociations – and mixed systems. The course evaluates the traits of these systems and why they are formed or attempted, and why they may endure or fail, paying special attention to multi-national, multi-ethnic, multi-religious and multi-lingual environments. The course includes drafting short arguments, a midterm and final exam, a paper, and weekly reading. \r\n\r\nThis is a higher-level course so many of the students taking it had some knowledge of the subject already. Therefore, it was recommended that one should only take the course if you already know some background information or are a major. Most students felt that they gained a lot from the course; one student summarized, “I can’t recommend this class enough. It is so worth it”. \r\n\r\nProfessor O’Leary was regarded as an expert in his field and a “fantastic” teacher. Students said he was able to communicate the material effectively and clearly and though he often did not lecture on every topic he would always expand on what a group presented. He was described as “approachable” and very willing to discuss the material both inside and outside of the classroom. Some students even reported that O’Leary was their favorite professor at Penn. \r\n\r\nThis course has a seminar structure, so the lectures and discussion were cut short to make room for presentations from smaller groups. Some students enjoyed working in small groups and getting to know their fellow classmates, but others would have liked more lecture and time to discuss as a big group. The majority of students reported that they liked how the group activities made them apply their knowledge to real world situations. Students also felt there was a heavy workload of readings, though they increased what students gained from the course.\r\n", "num_students": 14, "path": "/courses/23685/sections/301/reviews/1933-BRENDAN-O-LEARY", "instructor": {"path": "/instructors/1933-BRENDAN-O-LEARY", "first_name": "BRENDAN", "last_name": "O'LEARY", "id": "1933-BRENDAN-O-LEARY", "name": "BRENDAN O'LEARY"}, "num_reviewers": 11, "id": "23685-301-1933-BRENDAN-O-LEARY"}]