{"coursehistories": {"path": "/coursehistories/772"}, "description": "The course is directed at the development of a background in basic physics required to understand the behavior of electrons in atoms, molecules and solids. Examples to illustrate the application of these techniques will be centered in the free and nearly free electron theory of solids. The application of modern physics to many state-of-the-art materials analysis techniques will be demonstrated throughout the course. \n\n", "semester": "2010C", "name": "QUANTUM PHYS OF MATLS", "reviews": {"path": "/courses/23471/reviews", "values": [{"ratings": {"rAmountLearned": "3.21", "rDifficulty": "2.83", "rStimulateInterest": "2.48", "rRecommendMajor": "3.62", "rCourseQuality": "2.81", "rWorkRequired": "2.29", "rInstructorAccess": "3.34", "rReadingsValue": "2.76", "rRecommendNonMajor": "2.28", "rCommAbility": "2.83", "rInstructorQuality": "3.03"}, "section": {"name": "QUANTUM PHYS OF MATLS", "sectionnum": "001", "primary_alias": "MSE-221-001", "path": "/courses/23471/sections/001", "id": "23471-001", "aliases": ["MSE-221-001"]}, "comments": "This course is directed at the development of a background in the basic physics required to understand the behavior of electrons in atoms, molecules and solids. Examples to illustrate the application of these techniques are centered in the free and nearly free electron theory of solids. The application of modern physics to many state-of-the-art materials analysis techniques is demonstrated throughout the course. Registration for recitation is also required.\r\n\r\nStudents generally reported learning a lot of useful information from this course, though some wished that more material could have been covered. The textbook used in this course was praised for being “engaging” and “good at breaking down the material.”\r\n\r\nLikewise, Professor Khantha was described as an “engaging and energetic” teacher who “knows this subject inside and out” and “sincerely wants students to learn.” One student proclaimed that “you can tell right away that Professor Khantha extremely enjoys her subject and is eager to pass the knowledge onto us.” A few students found the professor difficult to understand at times, but many fel that the TAs and textbook were very helpful in breaking down the material covered in lectures.\r\n\r\nMost students felt that the material was conceptually difficult and demanded a lot of time to fully understand. Students generally thought that the exams were “very difficult and definitely required a lot of set aside study time.” PHYS 150 and MATH 240 should be taken concurrently, although some students felt that those who take MATH 240 concurrently had more difficulty understanding some of the eigenvalue concepts. This course meets the Natural Science Requirement as an alternative to PHYS 240 and counts towards the MSE minor.\r\n", "num_students": 40, "path": "/courses/23471/sections/001/reviews/3392-MAHADEVAN-KHANTHA", "instructor": {"path": "/instructors/3392-MAHADEVAN-KHANTHA", "first_name": "MAHADEVAN", "last_name": "KHANTHA", "id": "3392-MAHADEVAN-KHANTHA", "name": "MAHADEVAN KHANTHA"}, "num_reviewers": 36, "id": "23471-001-3392-MAHADEVAN-KHANTHA"}]}, "credits": null, "primary_alias": "MSE-221", "path": "/courses/23471", "sections": {"path": "/courses/23471/sections", "values": [{"name": "QUANTUM PHYS OF MATLS", "sectionnum": "001", "primary_alias": "MSE-221-001", "path": "/courses/23471/sections/001", "id": "23471-001", "aliases": ["MSE-221-001"]}]}, "id": 23471, "aliases": ["MSE-221"]}