[{"ratings": {"rAmountLearned": "3.46", "rDifficulty": "2.43", "rStimulateInterest": "3.64", "rRecommendMajor": "3.64", "rCourseQuality": "3.47", "rWorkRequired": "2.25", "rInstructorAccess": "3.36", "rReadingsValue": "3.41", "rRecommendNonMajor": "3.07", "rCommAbility": "3.75", "rInstructorQuality": "3.61"}, "section": {"name": "AMERICAN POETRY", "sectionnum": "001", "primary_alias": "ENGL-088-001", "path": "/courses/22963/sections/001", "id": "22963-001", "aliases": ["ENGL-088-001"]}, "comments": "In this fast-paced course students will read and discuss a great range of modern and contemporary U.S. poets, starting with the proto-modernists Dickinson and Whitman and ending with 21st-century conceptual poetics. Aside from providing a survey and chronology of 20th- and 21st-century poetry, this version of English 88 will offer one way of understanding the transition from modernism to postmodernism. Thus some students may wish to enroll as much to gain an understanding of the modernism-postmodernism problem through a study of recent poetry as to gain access to the work of these many poets. Students do not need to have any prior knowledge of poetry or poetics. English 88 operates almost wholly as a discussion, the lecture having been replaced here by the web, by audio and video files and other info delivered digitally. Requirements may include many one-page \"position\" papers, and a wildly comprehensive final examination.\r\n\r\nMost of the students commented that this course was amazing, engaging, and said they learned a lot about poetry. One student commented that they also learned to “think about language and art in new ways.” A couple of students also mentioned that this was one of the best classes they had taken at Penn. One student also mentioned that the course was “conceptually difficult rather than physically demanding.” However, one student did mention that they felt this course was “entirely overhyped,” and didn’t learn anything from it.\r\n\r\nMost of the students who commented said that Professor Filreis was enthusiastic and a great professor. One student did mention that Professor Filreis picks out a few students as “pets,” but “sort of dismisses everyone else at face value.” In addition to this, another student commented that, “effort should be made to get everyone involved rather than calling on the same few students.”\r\n\r\nOne student mentioned that they “would recommend to anyone, whether or not they were an English major,” but more so to someone who has not had any experience in poetry.\r\n", "num_students": 32, "path": "/courses/22963/sections/001/reviews/446-ALAN-J--FILREIS", "instructor": {"path": "/instructors/446-ALAN-J--FILREIS", "first_name": "ALAN J.", "last_name": "FILREIS", "id": "446-ALAN-J--FILREIS", "name": "ALAN J. FILREIS"}, "num_reviewers": 31, "id": "22963-001-446-ALAN-J--FILREIS"}]