[{"ratings": {"rAmountLearned": "3.69", "rDifficulty": "2.75", "rStimulateInterest": "3.81", "rRecommendMajor": "4.00", "rCourseQuality": "3.76", "rWorkRequired": "2.75", "rInstructorAccess": "2.50", "rReadingsValue": "3.81", "rRecommendNonMajor": "2.56", "rCommAbility": "3.87", "rInstructorQuality": "3.82"}, "section": {"name": "CELLS TO TISSUES", "sectionnum": "401", "primary_alias": "BE-557-401", "path": "/courses/27025/sections/401", "id": "27025-401", "aliases": ["BE-557-401", "CBE-582-401"]}, "comments": "The goal of this course is to introduce students to quantitative concepts in understanding and manipulating the behavior of biological cells.  We will try to understand the interplay between molecules in cells and cell function.  A particular focus is on receptors - cell surface molecules that mediate cell responses.  We will also try to understand processes such as adhesion, motility, cytoskeleton, signal transduction, differentiation, and gene regulation. \r\n\r\nOne student described the course structure as “35 papers that [the professor] found meaningful and interesting throughout [his] career.” Another noted that it was the first grad course to teach him how to “critically evaluate literature.” Students appreciated the “in-depth talks” about each paper, and felt that after every lecture they “walked away learning one more thing about science.” They also highlighted the profound integration of biology into engineering in this course.\r\n\r\nStudents were universal in their praise for Dr. Chen, whom they described as having “worked at the forefront of his field,” and is “incredibly well-spoken with a gift to teach and stimulate interest.”\r\n\r\nThis is a graduate course in bioengineering, and was highly recommended for all in the department, even advanced undergraduates.\r\n\r\nThis course review was written based on the 7 students comments submitted.\r\n", "num_students": 17, "path": "/courses/27025/sections/401/reviews/2873-CHRISTOPHER-S--CHEN", "instructor": {"path": "/instructors/2873-CHRISTOPHER-S--CHEN", "first_name": "CHRISTOPHER S.", "last_name": "CHEN", "id": "2873-CHRISTOPHER-S--CHEN", "name": "CHRISTOPHER S. CHEN"}, "num_reviewers": 17, "id": "27025-401-2873-CHRISTOPHER-S--CHEN"}]