{"coursehistories": {"path": "/coursehistories/2874"}, "description": "This course is about business and economic development in lower income, and often economically distressed, high-risk locations in urban, metropolitan areas. It is also about public policies, programs, and public/private partnerships that can best support investment and entrepreneurship in such areas. \n\nThis course will give students an overview of economic inequality in urban settings, and the opportunity to think about such areas in a new way -- as a potential, promising location for a successful business start-up, acquisition, joint venture, investment, or expansion. The course will discuss how to promote investment entrepreneurial actions, and creative development in communities that have experienced structural dislocation, long term stagnation,and chronic underperformance, economic deterioration, and under investment. This course offers an opportunity to develop and practice consulting skills, and to complete a research project, or an internship with a local community development organization. You will have the opportunity to produce findings and recommendations that can be implemented, and might make a lasting, tangible difference in growth of jobs and income in distressed urban areas. The tools we study can be applied to many situations where there is chronic under investment or disinvestment, such as manufacturing facilities leaving a community with no businesses to replace them. \n\n", "semester": "2004A", "name": "COMMUNITY REINVESTMENT", "reviews": {"path": "/courses/6839/reviews", "values": [{"ratings": {"rAmountLearned": "2.82", "rDifficulty": "1.91", "rStimulateInterest": "2.27", "rRecommendMajor": "3.27", "rCourseQuality": "2.64", "rWorkRequired": "2.00", "rInstructorAccess": "3.09", "rReadingsValue": "2.64", "rRecommendNonMajor": "2.27", "rCommAbility": "3.00", "rInstructorQuality": "2.73"}, "section": {"name": "COMMUNITY REINVESTMENT", "sectionnum": "001", "primary_alias": "MGMT-255-001", "path": "/courses/6839/sections/001", "id": "6839-001", "aliases": ["MGMT-255-001"]}, "comments": "", "num_students": 12, "path": "/courses/6839/sections/001/reviews/1591-BERNARD-E--ANDERSON", "instructor": {"path": "/instructors/1591-BERNARD-E--ANDERSON", "first_name": "BERNARD E.", "last_name": "ANDERSON", "id": "1591-BERNARD-E--ANDERSON", "name": "BERNARD E. ANDERSON"}, "num_reviewers": 11, "id": "6839-001-1591-BERNARD-E--ANDERSON"}]}, "credits": null, "primary_alias": "MGMT-255", "path": "/courses/6839", "sections": {"path": "/courses/6839/sections", "values": [{"name": "COMMUNITY REINVESTMENT", "sectionnum": "001", "primary_alias": "MGMT-255-001", "path": "/courses/6839/sections/001", "id": "6839-001", "aliases": ["MGMT-255-001"]}]}, "id": 6839, "aliases": ["MGMT-255"]}