{"coursehistories": {"path": "/coursehistories/5013"}, "description": "This course is in the tradition of Operations courses as exercises in the systematic understanding of complex systems, rather than in the tools and techniques for understanding aspects of those systems. It draws upon the most recent experience in the impact of information technology upon diverse industries, ranging from securities trading to consumer packaged goods retailing. It integrates that experience with relevant theory to develop an approach to information-based strategies generally, including resurgent interest in strategies for Commerce. It is not a tools and techniques course; likewise it is not a technology or an implementation course. It provides a focused and modern complement to strategic planning. \n\nThe increase in consumer informedness is changing consumer behavior in a wide range of situations. Customers find the least expensive alternative in categories of little importance to them, while finding the perfect match with their wants and needs, cravings and longings, in categories they find salient. Online trust is a strong determinant of shopping behavior and will continue to be. Likewise, the increase in information available to firms, and the increasing variety of strategies available for the use of information - from dynamic repricing to online distribution, from labor productivity enhancements to labor arbitrage and outsourcing - requires a dramatic revision of managerial mental models of their competitive options. Revising mental models and enhancing mental agility are both essential to executive leadership, rather that mere conservation and management, in today's environment of rapid and discontinuous change in the competitive environment. \n\nThe ability to target profitable market segments and to identify individual customers is reducing the value of scale-based operations and the strategic advantage of large firms with existing market share. The ability to monitor the performance of units abroad is leading to greater reliance upon outsourcing, benefiting many service industries and once again reducing the advantage of many large firms. At the same time, the impact of information technology on the transparency and efficiency of securities markets is destroying the profits of entire segments of financial services. All aspects of the firm-production, service, sales, marketing, and strategy - will be affected. Clearly, some firms will win and others will lose; nearly all will have to change. And yet, fundamental laws of economics have not been repealed. How can previous economic theory, and previous experience with rapid technological change, provide insights for the development of strategy in an increasingly digital age? \n\n", "semester": "2011A", "name": "INFO: IND STR & COMP STR", "reviews": {"path": "/courses/22250/reviews", "values": [{"ratings": {"rAmountLearned": "2.64", "rDifficulty": "2.08", "rStimulateInterest": "3.04", "rRecommendMajor": "2.80", "rCourseQuality": "2.61", "rWorkRequired": "2.29", "rInstructorAccess": "2.92", "rReadingsValue": "2.36", "rRecommendNonMajor": "2.64", "rCommAbility": "2.72", "rInstructorQuality": "2.71"}, "section": {"name": "INFO: IND STR & COMP STR", "sectionnum": "001", "primary_alias": "OPIM-666-001", "path": "/courses/22250/sections/001", "id": "22250-001", "aliases": ["OPIM-666-001"]}, "comments": "", "num_students": 46, "path": "/courses/22250/sections/001/reviews/4075-ERIC-K-CLEMONS", "instructor": {"path": "/instructors/4075-ERIC-K-CLEMONS", "first_name": "ERIC K", "last_name": "CLEMONS", "id": "4075-ERIC-K-CLEMONS", "name": "ERIC K CLEMONS"}, "num_reviewers": 28, "id": "22250-001-4075-ERIC-K-CLEMONS"}]}, "credits": null, "primary_alias": "OPIM-666", "path": "/courses/22250", "sections": {"path": "/courses/22250/sections", "values": [{"name": "INFO: IND STR & COMP STR", "sectionnum": "001", "primary_alias": "OPIM-666-001", "path": "/courses/22250/sections/001", "id": "22250-001", "aliases": ["OPIM-666-001"]}]}, "id": 22250, "aliases": ["OPIM-666"]}