[{"ratings": {"rAmountLearned": "3.73", "rDifficulty": "2.47", "rStimulateInterest": "3.87", "rRecommendMajor": "3.87", "rCourseQuality": "3.67", "rWorkRequired": "3.27", "rInstructorAccess": "3.73", "rReadingsValue": "3.53", "rRecommendNonMajor": "3.20", "rCommAbility": "3.80", "rInstructorQuality": "3.73"}, "section": {"name": "CLINICAL PSYCHOPHARMACOL", "sectionnum": "601", "primary_alias": "BIBB-482-601", "path": "/courses/24055/sections/601", "id": "24055-601", "aliases": ["BIBB-482-601"]}, "comments": "This course examines the history, rationale and putative mechanism of action of\r\ndrugs used in the treatment of psychiatric disorders. Emphasis is placed on\r\nneurobiological processes underlying psychopathology and pharmacological intervention.\r\nDrugs currently in use as well as new drugs in development are covered. Strategies,\r\ntechniques, issues and challenges of clinical psychopharmacological research are\r\naddressed and new approaches to drug discovery, including the use of pharmacogenomics\r\nand proteomics to understand variability in drug response and identify new molecular\r\ndrug targets, are covered in depth. Specific drug classes considered include\r\nantidepressants, anxiolytics, typical and atypical antipsychotics, narcotic analgesics,\r\nsedative hypnotics, and antiepileptic medications. A contrasting theme throughout the\r\ncourse is the use of drugs as probes to identify neural substrates of behavior.\r\nThe course was described as “organized” and “interesting.” Students generally\r\nfelt that they really learned a lot about pharmacological research that they would be “able\r\nto use as a physician later on.” Students also felt that there was a lot of “great material”\r\ncovered and life advice provided during the course.\r\nProfessor Lexow received rave reviews from students. She was described as “one\r\nof the best” professors at Penn. Students commented that Professor Lexow was able to\r\narticulate her points and explain scientific concepts very well, had tons of life advice, and\r\n“always kept the big picture in mind.”\r\nStudents recommended this course for students both in and out of the major.\r\nStudents did say that there was a lot of work, but that it’s worth it. Please note that this\r\nreview was based on less than 8 student comments.", "num_students": 16, "path": "/courses/24055/sections/601/reviews/171-NEDRA-LEXOW", "instructor": {"path": "/instructors/171-NEDRA-LEXOW", "first_name": "NEDRA", "last_name": "LEXOW", "id": "171-NEDRA-LEXOW", "name": "NEDRA LEXOW"}, "num_reviewers": 16, "id": "24055-601-171-NEDRA-LEXOW"}]