{"coursehistories": {"path": "/coursehistories/907"}, "description": "Survey of electrodynamics, focusing on applications to research done in the Department. Topics include mathematical structure and relativistic invariance properties of Maxwell equations, tensor methods, and the generation and scattering of radiation, in vacuum and in materials. Applications vary from year to year but include optical manipulation, astrophysical phenomena, and the generalizations from Maxwell's theory to those of other fundamental interactions (strong, electroweak, and gravitational forces). \n\n", "semester": "2011A", "name": "ELECTROMAGNETIC PHENOMEN", "reviews": {"path": "/courses/22299/reviews", "values": [{"ratings": {"rAmountLearned": "2.13", "rDifficulty": "2.40", "rStimulateInterest": "2.80", "rRecommendMajor": "2.73", "rCourseQuality": "2.47", "rWorkRequired": "2.20", "rInstructorAccess": "3.53", "rReadingsValue": "2.13", "rRecommendNonMajor": "1.07", "rCommAbility": "2.67", "rInstructorQuality": "3.06"}, "section": {"name": "ELECTROMAGNETIC PHENOMEN", "sectionnum": "001", "primary_alias": "PHYS-516-001", "path": "/courses/22299/sections/001", "id": "22299-001", "aliases": ["PHYS-516-001"]}, "comments": "This course addresses the concepts associated with surveying electrodynamics, focusing on applications to research done in the Department. Topics include mathematical structure and relativistic invariance properties of Maxwell equations, tensor methods, and the generation and scattering of radiation, in vacuum and in materials. Applications vary from year to year but include optical manipulation, astrophysical phenomena, and the generalizations from Maxwell's theory to those of other fundamental interactions (strong, electroweak, and gravitational forces).\r\n\r\nStudents thought that the course started off slowly, but picked up in the second half of the semester.\r\n\r\nProfessor Nelson is a superb lecturer, and he truly wants to get students excited about the material. He invests in their success and urges them to come to office hours.\r\n\r\nMost students did not like being randomly called on in class. In addition, many students found that the exam material was much simpler than the material taught in class.\r\n\r\n*8 respondents\r\n", "num_students": 17, "path": "/courses/22299/sections/001/reviews/1675-PHILIP-NELSON", "instructor": {"path": "/instructors/1675-PHILIP-NELSON", "first_name": "PHILIP", "last_name": "NELSON", "id": "1675-PHILIP-NELSON", "name": "PHILIP NELSON"}, "num_reviewers": 17, "id": "22299-001-1675-PHILIP-NELSON"}]}, "credits": null, "primary_alias": "PHYS-516", "path": "/courses/22299", "sections": {"path": "/courses/22299/sections", "values": [{"name": "ELECTROMAGNETIC PHENOMEN", "sectionnum": "001", "primary_alias": "PHYS-516-001", "path": "/courses/22299/sections/001", "id": "22299-001", "aliases": ["PHYS-516-001"]}]}, "id": 22299, "aliases": ["PHYS-516"]}