{"coursehistories": {"path": "/coursehistories/1990"}, "description": "Rigid body kinematics; Newtonian formulations of laws of motion; concepts of momentum, energy and inertia properties; generalized coordinates, holonomic and nonholonomic constraints. Generalized forces, principle of virtual work, D'Alembert's principle. Lagrange's equations of motion and Hamilton's equations. Conservation laws and integrals of motion. Friction, impulsive forces and impact. Applications to systems of rigid bodies. \n\n", "semester": "2011C", "name": "ADVANCED DYNAMICS", "reviews": {"path": "/courses/24729/reviews", "values": [{"ratings": {"rAmountLearned": "3.23", "rDifficulty": "3.37", "rStimulateInterest": "3.13", "rRecommendMajor": "3.50", "rCourseQuality": "3.19", "rWorkRequired": "3.14", "rInstructorAccess": "3.30", "rReadingsValue": "3.03", "rRecommendNonMajor": "1.57", "rCommAbility": "3.40", "rInstructorQuality": "3.53"}, "section": {"name": "ADVANCED DYNAMICS", "sectionnum": "001", "primary_alias": "MEAM-535-001", "path": "/courses/24729/sections/001", "id": "24729-001", "aliases": ["MEAM-535-001"]}, "comments": "This course covers a wide range of topics related to advanced dynamics, including\r\nrigid body kinematics; Newton formulations of laws of motion; concepts of momentum,\r\nenergy and inertia properties; generalized coordinates, holonomic and nonholonomic\r\nconstraints. Other topics are generalized forces, principle of virtual work, D'Alembert's\r\nprinciple, Lagrange's equations of motion, Hamilton's equations, conservation laws,\r\nintegrals of motion, friction, impulsive forces and impact, and applications to systems of\r\nrigid bodies.\r\nMany students gave positive comments on this course, indicating that it was “very\r\npractical,” “challenging but useful,” and “educative and engaging.” Some noted, “the\r\nprogression of the material and the scope of the course are both well designed.” One\r\nstudent found it “an interesting and fun course especially for people interested in viewing\r\nthings intuitively.” However, students generally hoped to have “a more consistent\r\nsystem” featuring only one instructor rather than two.\r\nStudents considered the notes written by Professor Kumar as “very helpful and\r\ntremendously worth taking the time to read,” but hoped the solutions to the homework\r\nquestions could be thoroughly explained.\r\nThe amount of the homework was highly unpredictable and the homework\r\ngrading “seemed inconsistent and very unhelpful.” However, students found the test\r\ngrading to be fair. This is a graduate level course and is open to all engineering graduate\r\nstudents. Students are expected to have a basic background in physics.", "num_students": 35, "path": "/courses/24729/sections/001/reviews/311-VIJAY-KUMAR", "instructor": {"path": "/instructors/311-VIJAY-KUMAR", "first_name": "VIJAY", "last_name": "KUMAR", "id": "311-VIJAY-KUMAR", "name": "VIJAY KUMAR"}, "num_reviewers": 34, "id": "24729-001-311-VIJAY-KUMAR"}]}, "credits": null, "primary_alias": "MEAM-535", "path": "/courses/24729", "sections": {"path": "/courses/24729/sections", "values": [{"name": "ADVANCED DYNAMICS", "sectionnum": "001", "primary_alias": "MEAM-535-001", "path": "/courses/24729/sections/001", "id": "24729-001", "aliases": ["MEAM-535-001"]}]}, "id": 24729, "aliases": ["MEAM-535"]}