[{"ratings": {"rAmountLearned": "2.52", "rDifficulty": "1.81", "rStimulateInterest": "3.26", "rRecommendMajor": "3.22", "rCourseQuality": "2.97", "rWorkRequired": "2.87", "rInstructorAccess": "3.26", "rReadingsValue": "2.91", "rRecommendNonMajor": "3.13", "rCommAbility": "3.09", "rInstructorQuality": "3.17"}, "section": {"name": "GREAT STORY COLLECTIONS", "sectionnum": "601", "primary_alias": "FOLK-241-601", "path": "/courses/27454/sections/601", "id": "27454-601", "aliases": ["FOLK-241-601", "ENGL-099-601", "COML-193-601"]}, "comments": "This course was intended for those with no prior background in folklore or knowledge of various cultures. Texts ranged in age from the first century to the twentieth, and geographically from the Middle East to Europe to the United States. Each collection displayed various techniques of collecting folk materials and making them concrete. Each in its own way also raised different issues of genre, legitimacy, canon formation, cultural values and context.\r\n\r\nStudents lauded this course as “excellent” and “among the best” they had taken. One student especially liked the \"story-telling aspect of the class\" in which students listened to \"anecdotes, stories, and jokes from class members.\" Students found these activities made the class more \"entertaining and engaging.\" Multiple students noted that they \"learned a lot\" from the course, and one called it \"one of the best courses at Penn.\"\r\n\r\nStudents adored Professor Azzolina, describing him as \"wonderful,\" \"engaging and interesting.\" Class members praised his \"passion for the subject that only comes from true enjoyment and mastery.\" Another student explained that Dr. Azzolina was \"very approachable and always willing to help or accommodate students.\" Class members enjoyed Dr. Azzolina's ability to make \"classic tales so applicable to real life.\"\r\n\r\nA few students mentioned the \"fairly heavy workload\" of this course with \"too many papers.\" One student suggested \"spreading the papers out during the semester a little more.\" Another student found it difficult to attain \"a lot of class participation.\" Students disliked having \"no real rubric or assigned distribution of points,\" which made expected grades ambiguous, though they did appreciate the ability to \"revise papers multiple times.\"", "num_students": 35, "path": "/courses/27454/sections/601/reviews/527-DAVID-S--AZZOLINA", "instructor": {"path": "/instructors/527-DAVID-S--AZZOLINA", "first_name": "DAVID S.", "last_name": "AZZOLINA", "id": "527-DAVID-S--AZZOLINA", "name": "DAVID S. AZZOLINA"}, "num_reviewers": 29, "id": "27454-601-527-DAVID-S--AZZOLINA"}]