[{"ratings": {"rAmountLearned": "2.62", "rDifficulty": "2.42", "rStimulateInterest": "2.31", "rRecommendMajor": "3.31", "rCourseQuality": "2.65", "rWorkRequired": "2.62", "rInstructorAccess": "3.23", "rReadingsValue": "2.33", "rRecommendNonMajor": "2.54", "rCommAbility": "2.83", "rInstructorQuality": "3.06"}, "section": {"name": "ZEN BUDDHISM", "sectionnum": "401", "primary_alias": "EALC-265-401", "path": "/courses/21532/sections/401", "id": "21532-401", "aliases": ["EALC-265-401", "RELS-276-401", "EALC-665-401"]}, "comments": "This course examines the history, doctrines, and practices of Zen Buddhism in China, Japan and the West. Topics include the monastic life, notable Zen masters, Zen's cultural impact, and enlightenment. &#8232;&#8232;Students expressed mixed feelings about this course. Many students thought that the course needed restructuring because some weeks the reading was too heavy while on other weeks it was too light. While students felt that they learned a lot about Zen, one student reported that the breadth of the material was too great for a “beginning Zen follower.” &#8232;&#8232;Students generally thought that Professor Glassman created a fun class environment. According to many students, the time passed quickly. Students also reported that it was apparent that Professor Glassman was very knowledgeable and had a good understanding of religion. &#8232;&#8232;Students reported that there was a lot of reading in this course and that not all of it seemed to be necessary. Additionally, a large part of the grade seemed to come from the final term paper, and Professor Glassman’s grading was hard to predict, according to several students.&#8232;&#8232;This review is based on the 5 student comments that were submitted.", "num_students": 20, "path": "/courses/21532/sections/401/reviews/5335-HENRY-GLASSMAN", "instructor": {"path": "/instructors/5335-HENRY-GLASSMAN", "first_name": "HENRY", "last_name": "GLASSMAN", "id": "5335-HENRY-GLASSMAN", "name": "HENRY GLASSMAN"}, "num_reviewers": 17, "id": "21532-401-5335-HENRY-GLASSMAN"}]