{"coursehistories": {"path": "/coursehistories/269"}, "description": "This course explores various topics in modern operating systems and computer architecture, including multithreading and synchronization, interprocess communication, memory management (caching, virtual memory, etc.), I/O, and security. We also look at techniques that are used to enhance processor performance at the hardware and software level. You will learn a variety of C and C++ programming techniques that will make you a better IT professional, and will get an understanding of what's happening \"under the covers\" in modern computer systems. \n\n", "semester": "2012A", "name": "DIG SYSTEM ORG & DESIGN", "reviews": {"path": "/courses/27182/reviews", "values": [{"ratings": {"rAmountLearned": "2.39", "rDifficulty": "2.48", "rStimulateInterest": "2.58", "rRecommendMajor": "2.76", "rCourseQuality": "2.33", "rWorkRequired": "2.81", "rInstructorAccess": "3.42", "rReadingsValue": "2.52", "rRecommendNonMajor": "2.00", "rCommAbility": "2.53", "rInstructorQuality": "2.58"}, "section": {"name": "DIG SYSTEM ORG & DESIGN", "sectionnum": "001", "primary_alias": "CIT-595-001", "path": "/courses/27182/sections/001", "id": "27182-001", "aliases": ["CIT-595-001"]}, "comments": "This course explores various topics in modern operating systems and computer architecture, including multithreading and synchronization, interprocess communication, memory management (caching, virtual memory, etc.), I/O, and security. Students will also look at techniques that are used to enhance processor performance at the hardware and software level. Students will learn a variety of C and C++ programming techniques that will make them better IT professionals, and will get an understanding of what's happening \"under the covers\" in modern computer systems.\r\n\r\nOverall, students thought that the course content was interesting but not well-structured and rendered. Students thought that the course provided an informative and broad overview to the various topics in the in the field. Particularly, “the coverage of concurrent programming was timely and extremely useful.” However, students hoped that they had “moved on [more] quickly for those subjects that [were] conceptually easy,” and delved deeper into certain topics, since the pace of the course was a bit too slow at times. Some noted that they learnt a lot from doing the final project and would even recommend a larger one. The articles assigned were also quite helpful.\r\n\r\nThe majority of students liked Professor Mongan. They reported that Professor Mongan was nice and helpful both in and out of class. Furthermore, students liked the enthusiasm that he had for teaching and thought he did a great job of “lending practical tips in addition to providing a strong theoretical background.” Some also complimented him for providing good notes and diagrams.\r\n\r\nThis course is part of a two-course sequence starting with CIT 593. The homework assignments were tough but rewarding. However, materials and due dates “were spread between the course website and Blackboard,” which resulted in some confusion.\r\n", "num_students": 36, "path": "/courses/27182/sections/001/reviews/6074-WILLIAM-M--MONGAN", "instructor": {"path": "/instructors/6074-WILLIAM-M--MONGAN", "first_name": "WILLIAM M.", "last_name": "MONGAN", "id": "6074-WILLIAM-M--MONGAN", "name": "WILLIAM M. MONGAN"}, "num_reviewers": 34, "id": "27182-001-6074-WILLIAM-M--MONGAN"}]}, "credits": null, "primary_alias": "CIT-595", "path": "/courses/27182", "sections": {"path": "/courses/27182/sections", "values": [{"name": "DIG SYSTEM ORG & DESIGN", "sectionnum": "001", "primary_alias": "CIT-595-001", "path": "/courses/27182/sections/001", "id": "27182-001", "aliases": ["CIT-595-001"]}]}, "id": 27182, "aliases": ["CIT-595"]}