{"coursehistories": {"path": "/coursehistories/2214"}, "description": "In this course, Penn Undergraduates will explore and examine food habits, the intersection of culture, family, history, and the various meanings of food and eating, by working with a middle-school class in the Philadelphia public schools. The goal of the course will be to learn about the food habits of a diverse local community, to explore that community's history of food and eating, and to consider ways and means for understanding and changing food habits. Middle school students will learn about the food environment and about why culture matters when we talk about food. Topics include traditional and modern foodways, ethnic cuisine in America, food preferences, and 'American cuisine'. The course integrates classroom work about food culture and anthropological practice with frequent trips to middle school where undergraduates will colloborate with students, their teachers, and a teacher partner from the Agatson Urban Nutrition Initiative (UNI). Students will be required to attend one of two time blocks each week to fulfill the service learning requirement- Wednesday (12:15-2:00pm) or Thursday (1:15-3:00pm). \n\nUndergraduates will be responsible for weekly writing assignments responding to learning experience in the course, for preparing materials to use middle school children, being participant-learners with the middle school children, and for a final research project. The material for the course will address the ideas underlying university-community engagement, the relationships that exist between food/eating and culture, and research methods. \n\n", "semester": "2011A", "name": "FOOD HABITS IN PHIL COMM: Food Habits in Philadelphia Communities", "reviews": {"path": "/courses/21265/reviews", "values": [{"ratings": {"rAmountLearned": "2.00", "rDifficulty": "1.58", "rStimulateInterest": "2.08", "rRecommendMajor": "2.85", "rCourseQuality": "2.54", "rWorkRequired": "2.15", "rInstructorAccess": "2.92", "rReadingsValue": "1.58", "rRecommendNonMajor": "2.31", "rCommAbility": "1.69", "rInstructorQuality": "1.92"}, "section": {"name": "FOOD HABITS IN PHIL COMM: Food Habits in Philadelphia Communities", "sectionnum": "301", "primary_alias": "ANTH-252-301", "path": "/courses/21265/sections/301", "id": "21265-301", "aliases": ["ANTH-252-301"]}, "comments": "&#8232;Through partnership with a local public school 6th grade class, this course examines food culture in West Philadelphia via discussions, interviews, journaling, and research. It explores diversity in low-income neighborhoods and how food accessibility affects eating behavior. This class is an ABCS class. The course was divided between Thursdays spent working with the 6th grade students at the ABCS site and Tuesdays spent on Penn’s campus planning for Thursdays with the students and holding class discussions.&#8232;&#8232;&#8232;Students were required to complete various types of assignments, including reading articles, writing blog posts, uploading to the elementary school’s website, completing two journal posts each week, and writing a final research paper.", "num_students": 13, "path": "/courses/21265/sections/301/reviews/1253-JANE-KAUER", "instructor": {"path": "/instructors/1253-JANE-KAUER", "first_name": "JANE", "last_name": "KAUER", "id": "1253-JANE-KAUER", "name": "JANE KAUER"}, "num_reviewers": 13, "id": "21265-301-1253-JANE-KAUER"}]}, "credits": null, "primary_alias": "ANTH-252", "path": "/courses/21265", "sections": {"path": "/courses/21265/sections", "values": [{"name": "FOOD HABITS IN PHIL COMM: Food Habits in Philadelphia Communities", "sectionnum": "301", "primary_alias": "ANTH-252-301", "path": "/courses/21265/sections/301", "id": "21265-301", "aliases": ["ANTH-252-301"]}]}, "id": 21265, "aliases": ["ANTH-252"]}