[{"ratings": {"rAmountLearned": "3.05", "rDifficulty": "2.66", "rStimulateInterest": "3.56", "rRecommendMajor": "3.71", "rCourseQuality": "3.38", "rWorkRequired": "2.63", "rInstructorAccess": "2.69", "rReadingsValue": "2.91", "rRecommendNonMajor": "3.03", "rCommAbility": "3.74", "rInstructorQuality": "3.69"}, "section": {"name": "EURO INT'L REL SINCE WWI", "sectionnum": "001", "primary_alias": "HIST-421-001", "path": "/courses/26219/sections/001", "id": "26219-001", "aliases": ["HIST-421-001"]}, "comments": "This course examines the international politics of 20th Century Europe. It will cover the period in which Europe lots its dominant international position and was forced to adjust to its new place in world politics while struggling with violence in the forms of wars, genocide, and other conflicts. Specil emphasis will be placed on the decline and subsequent partial recovery of Europe’s international position, especially the contrasted between international competition and transnational cooperation within Europe, the impact of the two World Wars, the ambivalent legacy of the Cold War, and Europe’s role in the post-Cold War world. \r\n\r\nMany students enjoyed this class and described it as “awesome” and “great” and explained that it offered a great way of looking at this specific period in Europe was a whole. Others commented that “the overall set up of the course was great,” and found that they “learned a lot of valuable information\" and \"perspective in the topic.” \r\n\r\nStudents feedback was overwhelmingly positive for Professor McDougall. Students called him a “tremendous lecturer” and “one of the best lecturers… ever.” Another student explained that McDougall “does a great job of communicating the subject matter.” Every student enjoyed his lectures and found him “amazingly engaging.” Many students commented that McDougall was a “favorite teacher and the best lecturer.” Students also felt that McDougall “cares about his students.” One critique of McDougall was that he took a while to grade, and another student suggested that McDougall’s lecturing pace may be a little fast, and that it can be difficult to set up meetings with the professor. Other critiques on teaching were mainly directed towards the TA, as many students found it difficult to contact the TA and also felt that perhaps one TA was not enough. \r\n\r\nThe most common critique of this course focused on the assignments; namely, students found it difficult to determine the comparative importance of each assignment, and also difficult to determine expectations. Many students found that grades reflected “nit picky grammar and not enough on the actual content.” Also, some found it very difficult to calculate a final grade from the course and reported “[going[ into the final exam only knowing 25% of the [final] grade.” One student commented that the course \"is not extremely difficult.” Students felt they were prepared for the final and felt that the readings were reasonable and “sometimes helpful.” Many students recommended this course to all students although it does not fulfill the sector requirement.\r\n", "num_students": 83, "path": "/courses/26219/sections/001/reviews/604-WALTER-A-MCDOUGALL", "instructor": {"path": "/instructors/604-WALTER-A-MCDOUGALL", "first_name": "WALTER A", "last_name": "MCDOUGALL", "id": "604-WALTER-A-MCDOUGALL", "name": "WALTER A MCDOUGALL"}, "num_reviewers": 72, "id": "26219-001-604-WALTER-A-MCDOUGALL"}]