[{"ratings": {"rAmountLearned": "3.84", "rDifficulty": "3.72", "rStimulateInterest": "3.68", "rRecommendMajor": "3.87", "rCourseQuality": "3.74", "rWorkRequired": "3.78", "rInstructorAccess": "3.69", "rReadingsValue": "3.25", "rRecommendNonMajor": "2.07", "rCommAbility": "3.82", "rInstructorQuality": "3.82"}, "section": {"name": "HUMAN ANATOMY & PHYSIOLOGY-PART B", "sectionnum": "001", "primary_alias": "NURS-132-001", "path": "/courses/16185/sections/001", "id": "16185-001", "aliases": ["NURS-132-001"]}, "comments": "Part B of Human Anatomy and Physiology offers an exploration of the structural and functional organization of the human organism as well as the fundamentals of developmental anatomy. Both the histological and gross anatomical feature of each organ system will be studied. Pathophysiology is introduced within the context of clinical disorders.\r\n\r\nThe course is frequently described as “difficult” by students but an “interesting” and “important” part of the nursing curriculum as well. Students acknowledge that the course required a great deal of work. There are lab and lecture components to this course. Many reported that the knowledge gained from this course was important in clinical experiences.\r\n\r\nWithout exception, students praised Dr. Scanga’s commitment to the course. Students credited Dr. Scanga for her dedication and passion for the material. Dr. Scanga is willing and able to communicate with the students about the material and the class. One student wrote, “Dr. Scanga is an incredible instructor who is extremely knowledgeable and very active in helping students succeed.”\r\n\r\nHuman Anatomy and Physiology Part B is available to students who have completed Part A of the course as well as other pre-requisites. The class is generally composed of Nursing students but is open to all who satisfy the requirements. The class is time intensive but most students reported that the effort was worthwhile.\r\n", "num_students": 101, "path": "/courses/16185/sections/001/reviews/1637-CONNIE-B--SCANGA", "instructor": {"path": "/instructors/1637-CONNIE-B--SCANGA", "first_name": "CONNIE B.", "last_name": "SCANGA", "id": "1637-CONNIE-B--SCANGA", "name": "CONNIE B. SCANGA"}, "num_reviewers": 96, "id": "16185-001-1637-CONNIE-B--SCANGA"}]