{"coursehistories": {"path": "/coursehistories/1687"}, "description": "This course investigates the application of statics and dynamics to simple force analyses of the musculoskeletal system, introduces the fundamentals of the mechanics of materials, and introduces the biomechanics of soft and hard tissues (e.g, microstructure and mechanical properties). The first portion of the course will present fundamental concepts of force and mechanics of rigid and deformable bodies. The remainder of the course will consist of an introduction of materials science and engineering, including the classification and bulk properties of implantable materials. \n\n", "semester": "2010C", "name": "INTRO TO BIOMECHANICS", "reviews": {"path": "/courses/22680/reviews", "values": [{"ratings": {"rAmountLearned": "2.10", "rDifficulty": "3.49", "rStimulateInterest": "1.18", "rRecommendMajor": "2.73", "rCourseQuality": "1.34", "rWorkRequired": "3.10", "rInstructorAccess": "2.23", "rReadingsValue": "1.82", "rRecommendNonMajor": "0.33", "rCommAbility": "1.13", "rInstructorQuality": "1.25"}, "section": {"name": "INTRO TO BIOMECHANICS", "sectionnum": "001", "primary_alias": "BE-200-001", "path": "/courses/22680/sections/001", "id": "22680-001", "aliases": ["BE-200-001"]}, "comments": "This course investigates the application of statics and dynamics to simple force analyses of the musculoskeletal system. It also introduces the fundamentals of the mechanics of materials, and introduces the biomechanics of soft and hard tissues (e.g. microstructure and mechanical properties). The first portion of the course presents fundamental concepts of force and mechanics of rigid and deformable bodies. The remainder of the course consists of an introduction to materials science and engineering, including the classification and bulk properties of implantable materials.\r\n\r\nFor the most part, students did not enjoy their experience in this course. Some students thought that the class “could have been more interesting.” Many also expressed that they did not learn much from the lectures, and were forced learn the material on their own.\r\n\r\nStudents generally were not pleased with Professor Lampe’s teaching. Professor Lampe “was not articulate at communicating the course material,” and the information on his lecture slides was taken directly out of the textbook. Students also felt that lectures did not prepare them well enough for homework questions and they “felt very unprepared for the quizzes.” However, some students did feel that Dr. Lampe was “very clear and helpful” in his office hours. \r\n\r\nMost of the students who took this class were Bioengineering majors. They felt that the course was challenging, as they were pressured to master the material because “so much…was covered in…a short amount of time.” In fact, many students shared the opinion that “the sheer amount of content covered in this class was unreasonable.” The exams given in this course were difficult and lengthy.\r\n", "num_students": 98, "path": "/courses/22680/sections/001/reviews/5588-JOSHUA-W--LAMPE", "instructor": {"path": "/instructors/5588-JOSHUA-W--LAMPE", "first_name": "JOSHUA W.", "last_name": "LAMPE", "id": "5588-JOSHUA-W--LAMPE", "name": "JOSHUA W. LAMPE"}, "num_reviewers": 91, "id": "22680-001-5588-JOSHUA-W--LAMPE"}]}, "credits": null, "primary_alias": "BE-200", "path": "/courses/22680", "sections": {"path": "/courses/22680/sections", "values": [{"name": "INTRO TO BIOMECHANICS", "sectionnum": "001", "primary_alias": "BE-200-001", "path": "/courses/22680/sections/001", "id": "22680-001", "aliases": ["BE-200-001"]}]}, "id": 22680, "aliases": ["BE-200"]}