[{"ratings": {"rAmountLearned": "3.31", "rDifficulty": "2.41", "rStimulateInterest": "3.26", "rRecommendMajor": "3.59", "rCourseQuality": "3.35", "rWorkRequired": "2.38", "rInstructorAccess": "3.64", "rReadingsValue": "3.23", "rRecommendNonMajor": "3.05", "rCommAbility": "3.64", "rInstructorQuality": "3.46"}, "section": {"name": "POL ECON OF E. ASIA", "sectionnum": "401", "primary_alias": "PSCI-214-401", "path": "/courses/25008/sections/401", "id": "25008-401", "aliases": ["PSCI-214-401", "PSCI-514-401"]}, "comments": "Political Science 214 discusses the interplay between politics and economics in East Asia. One of the goals of the course is to explain current difficulties of these countries in light of past successes. In addition, the course will consider how the recent growth will illuminate the possibility for long-term success. The first half of the course begins by exploring the causes and consequences of the rise of industrial Asia. The second half of the course examines the challenges to sustained growth faced by many countries in this region in recent years. The course concludes by examining the challenges faced by China and Vietnam today in their attempt to embrace more market-oriented economic systems.\r\n\r\nStudents enjoyed the course material for the most part. A few mentioned that they appreciated how the graduate and undergraduate sections were separated, yielding a better experience for both parties. A couple students thought the readings were excessive, but there were few complaints on the whole.\r\n\r\nA vast majority of students adored Professor Wang. Almost everyone declared him a “great” instructor. While occasionally straying from the course material, he outlined key points thoroughly according to most students. There were no complaints.\r\n\r\nThe class includes five quizzes, a midterm, and a final. The course is “strongly recommended for majors” of Political Science, according to one evaluator. Some students wished that the professor had done the grading, as they never got to know the TAs. Overall, this course is highly ranked and mostly consists of upperclassmen.\r\n", "num_students": 51, "path": "/courses/25008/sections/401/reviews/5860-YUHUA-WANG", "instructor": {"path": "/instructors/5860-YUHUA-WANG", "first_name": "YUHUA", "last_name": "WANG", "id": "5860-YUHUA-WANG", "name": "YUHUA WANG"}, "num_reviewers": 47, "id": "25008-401-5860-YUHUA-WANG"}]