{"coursehistories": {"path": "/coursehistories/5161"}, "description": "This is an advanced course for upper level undergraduates and graduate students on various issues in the study of Buddhist texts, art, and history. Each semester the theme of the course changes. In recent years themes have included: Magic and Ritual, Art and Material Culture, Texts and Contexts, Manuscript Studies. \n\nFall 2013 Topic: Buddhist repertoires (idiosyncratic and personal assemblages of beliefs, reflections, wonderings, possessions, and practices) for a large part, material and sensual. Buddhists are often sustained by their collection, production, and trading of stuff amulets, images, posters, protective drawings, CDs, calendars, films, comic books, and even Buddhist-themed pillow cases, umbrellas, and coffee mugs. Aspirations are interconnected with objects. Beliefs are articulated through objects. Objects are not empty signifiers onto which meaning is placed. The followers and the objects, the collectors and their stuff, are overlooked in the study of religion, even in many studies in the growing field of material culture and religion. What is striking is that these objects of everyday religiosity are often overlooked by art historians as well. Art historians often remove (through photography or physical movement to museums or shops) images and ritual implements from their ritual context and are seen as objets d'art. \n\nWhile art historians influenced by Alfred Gell, Arjun Appadurai, and Daniel Miller have brought the study of ritual objects into the forefront of art historical studies, in terms of methodologies of studying Buddhist art, art historians have generally relegated themselves to the study of either the old and valuable or the static and the curated. This course aims to 1) bring a discussion of art into the study of living Buddhism. Art historians have primarily concentrated on the study of images, stupas, manuscripts, and murals produced by the elite, and primarily made before the twentieth century; 2) study art as it exists and operates in dynamic ritual activities and highly complex synchronic and diachronic relationships; 3) focus on the historical and material turn in the study of images, amulets, and murals in Buddhist monasteries and shrines. \n\n", "semester": "2013A", "name": "Advanced Studies in Buddhism The Body in Art, Ritual, and Literature.", "reviews": {"path": "/courses/30962/reviews", "values": [{"ratings": {"rDifficulty": "3.44", "rStimulateInterest": "3.78", "rCourseQuality": "3.80", "rWorkRequired": "3.56", "rInstructorQuality": "3.90", "rCommAbility": "4.00", "rInstructorAccess": "3.78"}, "section": {"name": "Advanced Studies in Buddhism The Body in Art, Ritual, and Literature.", "sectionnum": "401", "primary_alias": "RELS-571-401", "path": "/courses/30962/sections/401", "id": "30962-401", "aliases": ["RELS-571-401", "EALC-718-401"]}, "comments": "", "num_students": 11, "path": "/courses/30962/sections/401/reviews/4968-JUSTIN-THOMAS-MCDANIEL", "instructor": {"path": "/instructors/4968-JUSTIN-THOMAS-MCDANIEL", "first_name": "JUSTIN THOMAS", "last_name": "MCDANIEL", "id": "4968-JUSTIN-THOMAS-MCDANIEL", "name": "JUSTIN THOMAS MCDANIEL"}, "num_reviewers": 10, "id": "30962-401-4968-JUSTIN-THOMAS-MCDANIEL"}]}, "credits": null, "primary_alias": "RELS-571", "path": "/courses/30962", "sections": {"path": "/courses/30962/sections", "values": [{"name": "Advanced Studies in Buddhism The Body in Art, Ritual, and Literature.", "sectionnum": "401", "primary_alias": "RELS-571-401", "path": "/courses/30962/sections/401", "id": "30962-401", "aliases": ["RELS-571-401", "EALC-718-401"]}]}, "id": 30962, "aliases": ["RELS-571", "EALC-718"]}