{"coursehistories": {"path": "/coursehistories/3913"}, "description": "This is the second half of the Near East sequence. This course surveys Islamic civilization from circa 600 (the rise of Islam) to the start of the modern era and concentrates on political, social, and cultural trends. Although the emphasis will be on Middle Eastern societies, we will occasionally consider developments in other parts of the world, such as sub-Saharan Africa, Central Asia, and Spain, where Islamic civilization was or has been influential. Our goal is to understand the shared features that have distinguished Islamic civilization as well as the varieties of experience that have endowed it with so much diversity. \n\n", "semester": "2009A", "name": "INTRO TO MIDDLE EAST", "reviews": {"path": "/courses/16165/reviews", "values": [{"ratings": {"rAmountLearned": "3.07", "rDifficulty": "2.37", "rStimulateInterest": "3.27", "rRecommendMajor": "3.63", "rCourseQuality": "2.97", "rWorkRequired": "2.30", "rInstructorAccess": "3.55", "rReadingsValue": "2.83", "rRecommendNonMajor": "3.07", "rCommAbility": "3.50", "rInstructorQuality": "3.38"}, "section": {"name": "INTRO TO MIDDLE EAST", "sectionnum": "001", "primary_alias": "NELC-102-001", "path": "/courses/16165/sections/001", "id": "16165-001", "aliases": ["NELC-102-001"]}, "comments": "This is the second half of the Near East sequence. This course surveys Islamic civilization from circa 600 (the rise of Islam) to the start of the modern era and concentrates on political, social, and cultural trends. Although the emphasis is on Middle Eastern societies, the course occasionally considers developments in other parts of the world, such as sub-Saharan Africa, Central Asia, and Spain, where Islamic civilization was or has been influential. The goal is to understand the shared features that have distinguished Islamic civilization as well as the varieties of experience that have endowed it with so much diversity.&#8232;&#8232;\r\nStudents really enjoyed this “excellent” class. The course covers a “tremendous” amount of material spanning a 1400 year period; thus not all topics are explained in great detail, and some students wished that more current events could be discussed.\r\nProfessor Cobb is described as “truly committed to student learning and is able to engage the class in the course content.” One student explained, “Professor Cobb is a remarkably knowledgeable in the subject material… and a brilliant human being in general. Attending class (at 9AM, even!) was refreshing.” He is able to clearly communicate the class material. &#8232;&#8232;Assigned readings are effective for reinforcing course material but not necessary for success in the class. For those intimidated by history classes, students explain that the course is not “too date and name intensive.”\r\nThe reading assigned for this class could be “very tedious” but one student pointed out that “I really understood the purpose behind the homework assignments, so I didn’t mind doing them.” Some students thought the paper topics were too abstract, and wished for more relevant assignments.", "num_students": 33, "path": "/courses/16165/sections/001/reviews/4473-PAUL-MICHAEL-COBB", "instructor": {"path": "/instructors/4473-PAUL-MICHAEL-COBB", "first_name": "PAUL MICHAEL", "last_name": "COBB", "id": "4473-PAUL-MICHAEL-COBB", "name": "PAUL MICHAEL COBB"}, "num_reviewers": 32, "id": "16165-001-4473-PAUL-MICHAEL-COBB"}]}, "credits": null, "primary_alias": "NELC-102", "path": "/courses/16165", "sections": {"path": "/courses/16165/sections", "values": [{"name": "INTRO TO MIDDLE EAST", "sectionnum": "001", "primary_alias": "NELC-102-001", "path": "/courses/16165/sections/001", "id": "16165-001", "aliases": ["NELC-102-001"]}]}, "id": 16165, "aliases": ["NELC-102"]}