{"coursehistories": {"path": "/coursehistories/4117"}, "description": "This interdisciplinary social science course examines key topics, themes, and analytic methods in the study of South Asia by focusing on significant South Asian cities. With one-fifth of the worlds population,South Asia and its urban centers are playing an increasingly important role in recent global economic transformations, resulting in fundamental changes within both the subcontinent and the larger world. Drawing primarily on ethnographic studies of South Asia in the context of rapid historical change, the course also incorporates research drawn from urban studies, architecture, political science, and history, as well as fiction and film. \n\nTopics include globalization and new economic dynamics in South Asia; the formation of a new urban middle class; consumption and consumer culture; urban political formations, democratic institutions, and practices; criminality & the underworld; population growth, changes in the built environment, and demographic shifts; everyday life in South Asia and ethnic, cultural, and linguistic identities, differences, and violence in South Asia's urban environments. This is an introductory level course appropriate for students with no background in South Asia or for those seeking to better understand South Asia's urban environments in the context of recent globalization and rapid historical changes. No prerequisites. Fulfills College sector requirement in Society and foundational approach in Cross-Cultural Analysis. \n\n", "semester": "2013A", "name": "THE CITY IN SOUTH ASIA", "reviews": {"path": "/courses/30978/reviews", "values": [{"ratings": {"rDifficulty": "2.11", "rTAQuality": "3.56", "rStimulateInterest": "3.33", "rCourseQuality": "3.02", "rWorkRequired": "2.08", "rInstructorQuality": "3.61", "rCommAbility": "3.58", "rInstructorAccess": "3.47"}, "section": {"name": "THE CITY IN SOUTH ASIA", "sectionnum": "401", "primary_alias": "SAST-002-401", "path": "/courses/30978/sections/401", "id": "30978-401", "aliases": ["SAST-002-401", "URBS-122-401", "ANTH-107-401"]}, "comments": "", "num_students": 63, "path": "/courses/30978/sections/401/reviews/4096-LISA-MITCHELL", "instructor": {"path": "/instructors/4096-LISA-MITCHELL", "first_name": "LISA", "last_name": "MITCHELL", "id": "4096-LISA-MITCHELL", "name": "LISA MITCHELL"}, "num_reviewers": 48, "id": "30978-401-4096-LISA-MITCHELL"}]}, "credits": null, "primary_alias": "SAST-002", "path": "/courses/30978", "sections": {"path": "/courses/30978/sections", "values": [{"name": "THE CITY IN SOUTH ASIA", "sectionnum": "401", "primary_alias": "SAST-002-401", "path": "/courses/30978/sections/401", "id": "30978-401", "aliases": ["SAST-002-401", "URBS-122-401", "ANTH-107-401"]}]}, "id": 30978, "aliases": ["SAST-002", "URBS-122", "ANTH-107"]}