{"coursehistories": {"path": "/coursehistories/966"}, "description": "This course examines the fundamentals of real estate finance and development from a legal perspective. The course serves as a foundation course for real estate majors and provides an introduction to real estate for other students. It attempts to develop skills in using legal concepts in a real estate transactional setting. The course will be of interest to students contemplating careers in accounting, real estate development, real estate finance, city planning, or banking. The main topics covered may include the following: land acquisition, finance; choice of entity; tax aspects; management (leasing, environmental); disposition of real property (sale of mortgaged property, foreclosures, wraparound mortgages, sale-leasebacks); and recent legal developments. \n\n", "semester": "2009A", "name": "REAL ESTATE LAW", "reviews": {"path": "/courses/16396/reviews", "values": [{"ratings": {"rAmountLearned": "2.51", "rDifficulty": "2.65", "rStimulateInterest": "1.90", "rRecommendMajor": "2.98", "rCourseQuality": "2.21", "rWorkRequired": "2.53", "rInstructorAccess": "2.20", "rReadingsValue": "2.41", "rRecommendNonMajor": "1.73", "rCommAbility": "2.47", "rInstructorQuality": "2.47"}, "section": {"name": "REAL ESTATE LAW", "sectionnum": "401", "primary_alias": "REAL-204-401", "path": "/courses/16396/sections/401", "id": "16396-401", "aliases": ["REAL-204-401", "LGST-804-401", "REAL-804-401", "LGST-204-401"]}, "comments": "This course examines the fundamentals of real estate finance and development from a legal perspective. The course serves as a foundation course for real estate majors and provides an introduction to real estate for other students. The course will be of interest to students contemplating careers in accounting, real estate development, real estate finance, city planning, or banking. The main topics covered may include the following: land acquisition, finance; choice of entity; tax aspects; management (leasing, environmental); disposition of real property (sale of mortgaged property, foreclosures, wraparound mortgages, sale-leasebacks); and recent legal developments.\r\n\r\nStudents claimed that the content of the class “gives you an idea of very high level concepts” in real estate. However, they also mentioned that the lectures seemed to be somewhat disjointed and tended to follow “more of a stream-of-consciousness discussion pattern.” Students emphasized that more structure would have been helpful.\r\n\r\nMany students expressed that Professor Lane took an active interest in his students and was always enthusiastic about the material he was teaching. He was said to be a “great speaker” that “leads the class well with a depth of knowledge.” Some mentioned, though, that he struggled to retain interest and was “dry and uninteresting.”\r\n\r\nStudents said that the “material seems useless for real estate majors and non-majors.” Many believed that the mix of MBA and undergraduates made the class ineffective. Some mentioned that the “readings were good as was the project.” Others however said that the “final project was a waste.”", "num_students": 56, "path": "/courses/16396/sections/401/reviews/4549-ROBERT-D--LANE", "instructor": {"path": "/instructors/4549-ROBERT-D--LANE", "first_name": "ROBERT D.", "last_name": "LANE", "id": "4549-ROBERT-D--LANE", "name": "ROBERT D. LANE"}, "num_reviewers": 56, "id": "16396-401-4549-ROBERT-D--LANE"}]}, "credits": null, "primary_alias": "REAL-204", "path": "/courses/16396", "sections": {"path": "/courses/16396/sections", "values": [{"name": "REAL ESTATE LAW", "sectionnum": "401", "primary_alias": "REAL-204-401", "path": "/courses/16396/sections/401", "id": "16396-401", "aliases": ["REAL-204-401", "LGST-804-401", "REAL-804-401", "LGST-204-401"]}]}, "id": 16396, "aliases": ["REAL-204", "LGST-804", "REAL-804", "LGST-204"]}