{"coursehistories": {"path": "/coursehistories/5612"}, "description": "Venus was the God of Beauty and Love yet she was married to Hephaestus, the mangled, grumpy and for all intents and purposes, ugly god. Why juxtapose such distinct figures? Are they doing the same job? The course discusses the interplay between ugliness and politics with focus on a number of central concepts such as race, social conflict, nationalism, ideology, dictatorship, propaganda and autonomy. Emphasis is put on the double role of the deployment of ugliness, as reinforcement of ideological and political ideas and as a force of social criticism. How does the state justify its own existence by the use of aesthetic narratives? How does the State identify undesirables? This class highlights how groups who feel somatically alike behave, and how their boundaries form and change over time. The focus will be interdisciplinary and multi-national, with case studies from past and present. The class will have a digital media focus as we will delve into issues of representation particularly with respect to race. For example, we will delve into the aesthetic discussion of northern and southern Sudanese as well and Hitler's Germany. \n\nThe aim of the course is to locate ugliness within a larger framework of ethnic conflict and nation building practices. My hope is to extend discussions of ugliness beyond the confines of aesthetics and situate it at the intersection of nationalism, power and citizenship. Beauty and ugliness, so easily relegated to individual preference, are linked indissolubly to gender, power and race relations in nation building projects. As Pierre Bourdieu (1984) observes, nothing is more distinctive, more distinguished, than the capacity to confer aesthetic status on objects that are banal or even 'common'. And these aesthetic distinctions, consciously and deliberately or not, fulfill a social function of legitimating social differences. \n\n", "semester": "2013A", "name": "THE POLITICS OF UGLY", "reviews": {"path": "/courses/29854/reviews", "values": [{"ratings": {"rDifficulty": "3.00", "rStimulateInterest": "3.44", "rCourseQuality": "3.33", "rWorkRequired": "3.11", "rInstructorQuality": "3.38", "rCommAbility": "3.56", "rInstructorAccess": "3.33"}, "section": {"name": "THE POLITICS OF UGLY", "sectionnum": "401", "primary_alias": "ANTH-434-401", "path": "/courses/29854/sections/401", "id": "29854-401", "aliases": ["ANTH-434-401", "GSWS-434-401", "AFRC-434-401"]}, "comments": "", "num_students": 15, "path": "/courses/29854/sections/401/reviews/6447-NICHOLE-P-CARELOCK", "instructor": {"path": "/instructors/6447-NICHOLE-P-CARELOCK", "first_name": "NICHOLE P", "last_name": "CARELOCK", "id": "6447-NICHOLE-P-CARELOCK", "name": "NICHOLE P CARELOCK"}, "num_reviewers": 13, "id": "29854-401-6447-NICHOLE-P-CARELOCK"}]}, "credits": null, "primary_alias": "ANTH-434", "path": "/courses/29854", "sections": {"path": "/courses/29854/sections", "values": [{"name": "THE POLITICS OF UGLY", "sectionnum": "401", "primary_alias": "ANTH-434-401", "path": "/courses/29854/sections/401", "id": "29854-401", "aliases": ["ANTH-434-401", "GSWS-434-401", "AFRC-434-401"]}]}, "id": 29854, "aliases": ["ANTH-434", "GSWS-434", "AFRC-434"]}