{"coursehistories": {"path": "/coursehistories/2875"}, "description": "Few businesses experience as dramatic a paradigm shift as the one currently facing the media and entertainment industries. As entertainment and technology converge in interactive offerings, not only are media and entertainment being redefined, but also the underpinnings and business models on which those industries are based. \n\nThis rapidly changing marketplace is also impacting those businesses traditionally dependent upon media for advertising and brand building. As the locus of control shifts from providers to consumers, it is imperative to understand the marketing implications of this shift as well as its impact on other industries. Although media and entertainment are not traditional consumer products, they nonetheless face the same marketing mix issues of product, price, distribution, and promotion, and the need to understand the marketplace, their consumers, the decision making process, and behavioral drivers. In the midst of change, these questions become more vexing and of paramount importance for business survival. \n\nThis course will examine the marketing implications of the media and entertainment industries evolution from its original one-to-many model, to its present transition into a more customized, individualized approach. The course will begin by looking at the industries overall and the forces creating change. The second section considers emerging media, the future of the media and entertainment industries and consumer experience moving forward. This class is unique in that the instructor specializes in entertainment and marketing research; the class will draw upon practical experience and feature guest lectures from other industry experts. Because the industry changes are happening real time, the class will focus heavily on current events rather than theory or academic research. \n\n", "semester": "2010C", "name": "INTERACTIVE MEDIA MKTG", "reviews": {"path": "/courses/23445/reviews", "values": [{"ratings": {"rAmountLearned": "2.72", "rDifficulty": "1.90", "rStimulateInterest": "2.97", "rRecommendMajor": "3.19", "rCourseQuality": "2.82", "rWorkRequired": "1.65", "rInstructorAccess": "2.77", "rReadingsValue": "2.32", "rRecommendNonMajor": "2.66", "rCommAbility": "3.00", "rInstructorQuality": "2.97"}, "section": {"name": "INTERACTIVE MEDIA MKTG", "sectionnum": "301", "primary_alias": "MKTG-394-301", "path": "/courses/23445/sections/301", "id": "23445-301", "aliases": ["MKTG-394-301"]}, "comments": "This course is designed to provide students with an understanding of the strategic decisions in marketing media and entertainment products. It is a course about developing, financing, producing, marketing and distributing media and entertainment, and the role these functions play in shaping the creative and commercial decisions of media and entertainment companies. Using the case method, the course examines these companies from the perspective of entrepreneurial and multinational organizations in businesses as varied as film, television, music, video games, theme parks and sports entertainment. Marketing of Media and Entertainment is a course that evaluates the global, technological and social landscape of media and entertainment in the context of both the content and distribution side of these businesses.\r\n\r\nStudents found course material to be very interesting and “valuable to everyday life.” More specifically, the course provided a better understanding of different aspects of interactive media. The course was fast-paced but packed with plenty of real-life knowledge applicable to students’ lives.\r\n\r\nStudents were generally very pleased with Professor Diamond’s seminar-styled lecture. Some described Professor Diamond as “incredibly engaging” to listen to and able to convey course material in a “clear and exciting way.” One thing to note is that Professor Diamond was seldom available in forms apart from email due to her intense traveling schedule.\r\n\r\nSome students thought the grading on cases and especially exams was subjective and not representative of material taught in class. Even though the course was loosely structured by nature of its seminar style, students who found the course material interesting said the three hours always passed by quickly. This class is recommended to majors and non-majors alike.\r\n", "num_students": 40, "path": "/courses/23445/sections/301/reviews/3086-SUZANNE-E-DIAMOND", "instructor": {"path": "/instructors/3086-SUZANNE-E-DIAMOND", "first_name": "SUZANNE E", "last_name": "DIAMOND", "id": "3086-SUZANNE-E-DIAMOND", "name": "SUZANNE E DIAMOND"}, "num_reviewers": 40, "id": "23445-301-3086-SUZANNE-E-DIAMOND"}]}, "credits": null, "primary_alias": "MKTG-394", "path": "/courses/23445", "sections": {"path": "/courses/23445/sections", "values": [{"name": "INTERACTIVE MEDIA MKTG", "sectionnum": "301", "primary_alias": "MKTG-394-301", "path": "/courses/23445/sections/301", "id": "23445-301", "aliases": ["MKTG-394-301"]}]}, "id": 23445, "aliases": ["MKTG-394"]}