{"coursehistories": {"path": "/coursehistories/3397"}, "description": "This course presents an overview of the business of health and how a variety of health care organizations have gained, sustained, and lost competitive advantage amidst intense competition, widespread regulation, high interdependence, and massive technological, economic, social and political changes. Specifically, we evaluate the challenges facing health care organizations using competitive analysis, identify their past responses, and explore the current strategies they are using to manage these challenges (and emerging ones) more effectively. Students will develop generalized skills in competitive analysis and the ability to apply those skills in the specialized analysis of opportunities in producer (e.g. biopharmaceutical, medical product, information technology), purchaser (e.g. insurance), and provider (e.g. hospitals, nursing homes, physician) organizations and industry sectors. The course is organized around a number of readings, cases, presentations, and a required project. \n\n", "semester": "2011C", "name": "HC MGMT&STRAT", "reviews": {"path": "/courses/24515/reviews", "values": [{"ratings": {"rAmountLearned": "2.72", "rDifficulty": "2.27", "rStimulateInterest": "3.03", "rRecommendMajor": "3.18", "rCourseQuality": "2.69", "rWorkRequired": "2.85", "rInstructorAccess": "3.24", "rReadingsValue": "2.24", "rRecommendNonMajor": "2.52", "rCommAbility": "2.94", "rInstructorQuality": "3.00"}, "section": {"name": "HC MGMT&STRAT", "sectionnum": "001", "primary_alias": "HCMG-213-001", "path": "/courses/24515/sections/001", "id": "24515-001", "aliases": ["HCMG-213-001"]}, "comments": "Health Care Management 213 presents an overview of the business of health and how a variety of health care organizations have gained, sustained, and lost competitive advantage amidst intense competition, widespread regulation, high interdependence, and massive technological, economic, social and political changes. Specifically, challenges facing health care organizations are evaluated using competitive analysis, identify their past responses, and explore the current strategies they are using to manage these challenges (and emerging ones) more effectively. Students will develop generalized skills in competitive analysis and the ability to apply those skills in the specialized analysis of opportunities in producer (e.g. biopharmaceutical, medical product, information technology), purchaser (e.g. insurance), and provider (e.g. hospitals, nursing homes, physician) organizations and industry sectors. The course is organized around a number of readings, cases, presentations, and a required project.\r\n\r\nStudents commented that they “learned a lot about the industry, as well as business assessment, within the health care industry.” Students also enjoyed the guest lecturers, and many students remarked that “the group project was amazing.” Overall, there was a consensus among students that it was a “unique project-based course where you and a team do field-research on health-care organizations.”\r\n\r\nStudents found Professor Kimberly to be a “fantastic professor” who “genuinely understands and cares about how to teach each student.” One student called Professor Kimberly “an expert when it comes to strategic thinking in the healthcare industry.” Another remarked that Professor Kimberly was “willing to answer any questions.”\r\n\r\nMany students remarked that the grading in the class was very “subjective,” since it was based mostly off the group project. Some students said that for this reason they wished they could have picked their own groups for the project. Nevertheless, many students found the course “extremely valuable.”\r\n", "num_students": 37, "path": "/courses/24515/sections/001/reviews/3321-JOHN-R--KIMBERLY", "instructor": {"path": "/instructors/3321-JOHN-R--KIMBERLY", "first_name": "JOHN R.", "last_name": "KIMBERLY", "id": "3321-JOHN-R--KIMBERLY", "name": "JOHN R. KIMBERLY"}, "num_reviewers": 37, "id": "24515-001-3321-JOHN-R--KIMBERLY"}]}, "credits": null, "primary_alias": "HCMG-213", "path": "/courses/24515", "sections": {"path": "/courses/24515/sections", "values": [{"name": "HC MGMT&STRAT", "sectionnum": "001", "primary_alias": "HCMG-213-001", "path": "/courses/24515/sections/001", "id": "24515-001", "aliases": ["HCMG-213-001"]}]}, "id": 24515, "aliases": ["HCMG-213"]}