[{"ratings": {"rAmountLearned": "3.45", "rDifficulty": "2.62", "rStimulateInterest": "3.61", "rRecommendMajor": "3.77", "rCourseQuality": "3.67", "rWorkRequired": "2.63", "rInstructorAccess": "3.28", "rReadingsValue": "3.10", "rRecommendNonMajor": "3.09", "rCommAbility": "3.82", "rInstructorQuality": "3.79"}, "section": {"name": "CHINESE POLITICS", "sectionnum": "001", "primary_alias": "PSCI-219-001", "path": "/courses/23671/sections/001", "id": "23671-001", "aliases": ["PSCI-219-001"]}, "comments": "This lecture course introduces students to the politics of the Peoples Republic of China. Complementing offerings in other departments, this course emphasizes events in the period since the Chinese Communist Party established its regime in 1949. In addition to surveying the political history of contemporary China, we will assess the meaning of these events by drawing upon theories about the nature and significance of ideology and organization in communist regimes, factionalism and its relationship to policy formulation and implementation, and general issues of political and economic development. Although the principal focus is on the domestic politics of the PRC, the course includes several lectures examining Chinas international relations. \r\n\r\nMany students found this course “enjoyable and informative.” Certain students even claimed that the course had “completely changed” their views of the region and that the “knowledge… gained from this class” will be helpful in the future. The readings were “interesting,” “useful,” and “provide mostly context or supplemental information” to what is taught during lecture.\r\n\r\nProfessor Goldstein is called “brilliant” and “one of the best professors at Penn.” Professor Goldstein’s lectures were “well-planned, engaging and very interesting.” Additionally, Professor Goldstein frequently e-mailed students “news clips and provided other information related to China.”\r\n\r\nThe course is “a very enjoyable and informative class, even for a non-political science major.” However, some students commented that “too much emphasis is put on the final exam.”\r\n", "num_students": 100, "path": "/courses/23671/sections/001/reviews/996-AVERY-M--GOLDSTEIN", "instructor": {"path": "/instructors/996-AVERY-M--GOLDSTEIN", "first_name": "AVERY M.", "last_name": "GOLDSTEIN", "id": "996-AVERY-M--GOLDSTEIN", "name": "AVERY M. GOLDSTEIN"}, "num_reviewers": 95, "id": "23671-001-996-AVERY-M--GOLDSTEIN"}]