[{"ratings": {"rAmountLearned": "3.04", "rDifficulty": "2.30", "rStimulateInterest": "2.76", "rRecommendMajor": "3.30", "rCourseQuality": "2.99", "rWorkRequired": "2.53", "rInstructorAccess": "3.15", "rReadingsValue": "2.67", "rRecommendNonMajor": "2.52", "rCommAbility": "3.47", "rInstructorQuality": "3.28"}, "section": {"name": "STATISTICS FOR BIOLOGIST", "sectionnum": "001", "primary_alias": "BIOL-446-001", "path": "/courses/24078/sections/001", "id": "24078-001", "aliases": ["BIOL-446-001"]}, "comments": "This course is an introduction to probability theory, featuring principles of\r\nstatistical methods. Specifically, it focuses on problems of estimation and hypothesis,\r\ntesting in biology and related areas.\r\nMany students reported that this course was an “excellent course” and the\r\nmaterial was “interesting and very applicable to both research and daily life.” Students\r\nalso noted that the course was “really an introduction to statistics,” not necessarily a pure\r\nbiology class. Additionally, students appreciated that there was no textbook used in this\r\ncourse and that all the information could be articulated through lectures and problem sets.\r\nStudents agreed that Professor Plotkin “explains everything clearly and succinctly\r\nin class,” making up for the lack of textbook. They also explained that he is “extremely\r\neloquent and straightforward” in lecture. Despite being a great lecturer in class, a few\r\nstudents complained that he could be “unapproachable” one on one. Overall, though,\r\nstudents believed Professor Plotkin was an “amazing professor” who was “very\r\nknowledgeable in the subject.”\r\nStudents for the most part found the exams to be “very fair,” though students were\r\nforced to “memorize definitions” and were not necessarily tested enough on\r\ncomputational problems. Additionally, some students thought the “homework took too\r\nlong to complete,” while others wished there had been more practice problems and study\r\nmaterials. The workload, though, was not too great and this course was highly\r\nrecommended to anyone interested in scientific research.", "num_students": 176, "path": "/courses/24078/sections/001/reviews/4757-JOSHUA-B--PLOTKIN", "instructor": {"path": "/instructors/4757-JOSHUA-B--PLOTKIN", "first_name": "JOSHUA B.", "last_name": "PLOTKIN", "id": "4757-JOSHUA-B--PLOTKIN", "name": "JOSHUA B. PLOTKIN"}, "num_reviewers": 148, "id": "24078-001-4757-JOSHUA-B--PLOTKIN"}]