[{"ratings": {"rAmountLearned": "2.83", "rDifficulty": "2.20", "rStimulateInterest": "3.08", "rRecommendMajor": "3.06", "rCourseQuality": "2.84", "rWorkRequired": "2.36", "rInstructorAccess": "3.31", "rReadingsValue": "2.94", "rRecommendNonMajor": "2.67", "rCommAbility": "3.08", "rInstructorQuality": "3.16"}, "section": {"name": "MODERN JAPANESE HIST", "sectionnum": "401", "primary_alias": "HIST-091-401", "path": "/courses/26183/sections/401", "id": "26183-401", "aliases": ["HIST-091-401", "EALC-071-401"]}, "comments": "This course surveys the major political, economic, social and intellectual trends in the making of modern Japan. Special emphasis is given to the turbulent relationship between state and society from 1800 to the present. \r\n\r\nMany of the students in Modern Japanese History found the course to be engaging and “truly interesting,” but a few said that it was “painfully boring;” a remark that seemed to stem from disagreement with the professor's method of teaching. Students generally considered the readings “fine” and liked the fact that literature is incorporated into the class. However, many of the students did not appreciate that Professor Dickinson “would not really start the lecture until a half-an-hour into the course.” This was because “ 30 minutes of each lecture are used for silly anecdotes and music videos,” which many students did not think “connect[ed] to the material in a meaningful way usually.” \r\n\r\nStudents' reactions to Professor Dickinson's teaching methods were wildly different. Some taking the course said that Professor Dickinson is “the most interesting teacher I have had to date,” “hilarious,” and that Professor Dickinson made it “ one of the best courses” that one student ever took. However, almost all students reported that Professor Dickinson has certain unique opinions on Japanese history that color “almost all of his lectures” and that are “not open to debate.” Some found that these interpretations “actually made the class more interesting,” but others thought his take on Japan “borders on revisionist history” and was “very often not entirely corroborated by the readings assigned.” Many of those who did disagree with his teaching style still complimented Professor Dickinson for his “wealth of knowledge” and enthusiasm.\r\n\r\nThis course fulfills the History and Tradition Sector as well as Cross Cultural Analysis.", "num_students": 48, "path": "/courses/26183/sections/401/reviews/619-FREDERICK-R--DICKINSON", "instructor": {"path": "/instructors/619-FREDERICK-R--DICKINSON", "first_name": "FREDERICK R.", "last_name": "DICKINSON", "id": "619-FREDERICK-R--DICKINSON", "name": "FREDERICK R. DICKINSON"}, "num_reviewers": 45, "id": "26183-401-619-FREDERICK-R--DICKINSON"}]