[{"ratings": {"rAmountLearned": "3.31", "rDifficulty": "2.92", "rStimulateInterest": "3.38", "rRecommendMajor": "3.58", "rCourseQuality": "3.50", "rWorkRequired": "3.73", "rInstructorAccess": "2.58", "rReadingsValue": "3.46", "rRecommendNonMajor": "3.23", "rCommAbility": "3.46", "rInstructorQuality": "3.29"}, "section": {"name": "SCIENCE & LITERATURE", "sectionnum": "401", "primary_alias": "STSC-110-401", "path": "/courses/28200/sections/401", "id": "28200-401", "aliases": ["STSC-110-401", "HIST-117-401", "ENGL-075-401", "HSOC-110-401"]}, "comments": "This course will explore the emergence of modern science fiction as a genre, the ways it has reflected our evolving conceptions of ourselves and the universe, and its role as the mythology of modern technological civilization. Students will discuss such characteristic themes as utopias, the exploration of space and time, biological engineering, superman, robots, aliens, and other worlds--and the differences between European and American treatment of these themes.\r\n\tThe course was noted for the amount of reading, which made one student feel as though his course load was “6 instead of 5.” Another student described it simply as an “excellent course,” while many others noted the high level of reading required. Most students were united in praise of the course material, which was described as “well-chosen,” but some thought that there was too much covered in the class to truly get a firm handle on the material. \r\nProfessor Adams was described as “an excellent lecturer” for the course, as well as providing a “wealth of information” and “very valuable insights.” Students enjoyed his stories “about the Soviet Union” as well as his being an “avid science fiction reader.\r\n\tThis class was described as having a very high amount of reading. This review was based on eight students comments. ", "num_students": 34, "path": "/courses/28200/sections/401/reviews/663-MARK-B-ADAMS", "instructor": {"path": "/instructors/663-MARK-B-ADAMS", "first_name": "MARK B", "last_name": "ADAMS", "id": "663-MARK-B-ADAMS", "name": "MARK B ADAMS"}, "num_reviewers": 28, "id": "28200-401-663-MARK-B-ADAMS"}]