[{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "2.60", "rStimulateInterest": "2.80", "rRecommendMajor": "3.53", "rCourseQuality": "2.82", "rWorkRequired": "3.00", "rInstructorAccess": "3.32", "rReadingsValue": "3.10", "rRecommendNonMajor": "2.68", "rCommAbility": "3.50", "rInstructorQuality": "3.14"}, "section": {"name": "AMERICAN ART: 1865-1968", "sectionnum": "601", "primary_alias": "ARTH-296-601", "path": "/courses/22664/sections/601", "id": "22664-601", "aliases": ["ARTH-296-601"]}, "comments": "This course surveys the history of modern art in the U.S., from its international prominence during the 1950s to its alleged replacement by \"postmodernism.\" It explores the relation of art to historical processes of modernization (industrialization, urbanization, technological development, the rise of mass media and mass markets, etc.) and to the economic polarization, social fragmentation, political conflict, and myriad cultural changes these developments entailed. Students described this class as “enjoyable” and “compelling.” Overall, students were pleased with the course, as one wrote, “Lectures were organized and clear. Reading assignments, though numerous, complimented the material in lectures quite well.”&#8232;&#8232;Students were extremely happy with Professor Butterfield, one student calling her “the best Art History professor I have had.” She was good at clearly presenting material in lecture, though students were frustrated with the vague directions given for the final group presentation.&#8232;&#8232;This class includes group projects, an object paper, and a “heavy” amount of reading (with response papers). Students felt that, while response papers were “annoying,” they were a good way to get students to read material they would’ve otherwise ignored. Recommended to both majors and non-majors alike.", "num_students": 28, "path": "/courses/22664/sections/601/reviews/134-REBECCA-BUTTERFIELD", "instructor": {"path": "/instructors/134-REBECCA-BUTTERFIELD", "first_name": "REBECCA", "last_name": "BUTTERFIELD", "id": "134-REBECCA-BUTTERFIELD", "name": "REBECCA BUTTERFIELD"}, "num_reviewers": 24, "id": "22664-601-134-REBECCA-BUTTERFIELD"}]