[{"ratings": {"rAmountLearned": "3.82", "rDifficulty": "2.88", "rStimulateInterest": "3.91", "rRecommendMajor": "3.91", "rCourseQuality": "3.89", "rWorkRequired": "3.06", "rInstructorAccess": "3.61", "rReadingsValue": "3.30", "rRecommendNonMajor": "3.91", "rCommAbility": "3.85", "rInstructorQuality": "3.91"}, "section": {"name": "NEGOTIATION/CONFLICT RES", "sectionnum": "406", "primary_alias": "LGST-206-406", "path": "/courses/23309/sections/406", "id": "23309-406", "aliases": ["LGST-206-406", "OPIM-291-406", "MGMT-291-406"]}, "comments": "LGST206 examines the art and science of negotiation, with additional emphasis on conflict resolution. Students engage in a number of simulated negotiations ranging from simple one-issue transactions to multi-party joint ventures. Through these exercises and associated readings, students explore the basic theoretical models of bargaining and have an opportunity to test and improve their negotiation skills.\r\n\r\nStudents overwhelmingly enjoyed LGST 206 taught by Professor Shell, describing the course as practical, “invaluable throughout life,” and “easily the most valuable classroom experience during my time at Penn.”\r\n\r\nStudents showered Professor Shell with superlatives. They described him as “phenomenal,” “excellent,” and “truly riveting,” with students stating that he is “one of the best professors in Wharton” and that it was “an honor to learn from [Professor Shell].” While students noted that Professor Shell was one of the harder professors in the department, they seemed to agree that “getting a lower grade is definitely worth it to have Shell as a professor.”\r\n\r\nStudents felt that the course was moderately difficult. One student stated that, in his opinion, the Fall semester seemed more rushed than the Spring semester because there were two fewer weeks of classes in the Fall.\r\n\r\nNote: 6 reviews \r\n", "num_students": 36, "path": "/courses/23309/sections/406/reviews/2191-G-RICHARD-SHELL", "instructor": {"path": "/instructors/2191-G-RICHARD-SHELL", "first_name": "G RICHARD", "last_name": "SHELL", "id": "2191-G-RICHARD-SHELL", "name": "G RICHARD SHELL"}, "num_reviewers": 35, "id": "23309-406-2191-G-RICHARD-SHELL"}, {"ratings": {"rAmountLearned": "3.61", "rDifficulty": "1.66", "rStimulateInterest": "3.59", "rRecommendMajor": "3.81", "rCourseQuality": "3.77", "rWorkRequired": "1.63", "rInstructorAccess": "3.38", "rReadingsValue": "3.31", "rRecommendNonMajor": "3.81", "rCommAbility": "3.50", "rInstructorQuality": "3.57"}, "section": {"name": "NEGOTIATION/CONFLICT RES", "sectionnum": "407", "primary_alias": "LGST-206-407", "path": "/courses/23309/sections/407", "id": "23309-407", "aliases": ["LGST-206-407", "OPIM-291-407", "MGMT-291-407"]}, "comments": "This course examines the art and science of negotiation, with additional emphasis on conflict resolution. Students engage in a number of simulated negotiations ranging from simple one-issue transactions to multi-party joint ventures. Through these exercises and associated readings, students explore the basic theoretical models of bargaining and have an opportunity to test and improve their negotiation skills.\r\n\r\nStudents had rave reviews for this course. One student commented that they always “looked forward to going to class!” Students liked that the material covered was “very fun and practical.”\r\n\r\nStudents also heaped praise on Professor Shropshire, calling him “fantastic” and “brilliant.” They commended his emphasis on learning about negotiations, rather than the outcomes. One student commented that he “is good at encouraging students to participate in class.” \r\n\r\nStudents were graded on journal entries, a midterm exam, and an analytical paper. Overall, students recommended the class, and one student said that it was a “must take.” This review is based on the 8 student comments that were submitted.\r\n", "num_students": 36, "path": "/courses/23309/sections/407/reviews/718-KENNETH-L--SHROPSHIRE", "instructor": {"path": "/instructors/718-KENNETH-L--SHROPSHIRE", "first_name": "KENNETH L.", "last_name": "SHROPSHIRE", "id": "718-KENNETH-L--SHROPSHIRE", "name": "KENNETH L. SHROPSHIRE"}, "num_reviewers": 35, "id": "23309-407-718-KENNETH-L--SHROPSHIRE"}, {"ratings": {"rAmountLearned": "3.54", "rDifficulty": "2.26", "rStimulateInterest": "3.78", "rRecommendMajor": "3.88", "rCourseQuality": "3.66", "rWorkRequired": "3.26", "rInstructorAccess": "3.41", "rReadingsValue": "2.93", "rRecommendNonMajor": "3.85", "rCommAbility": "3.81", "rInstructorQuality": "3.72"}, "section": {"name": "NEGOTIATION/CONFLICT RES", "sectionnum": "408", "primary_alias": "LGST-206-408", "path": "/courses/23309/sections/408", "id": "23309-408", "aliases": ["LGST-206-408", "OPIM-291-408", "MGMT-291-408"]}, "comments": "This course examines the art and science of negotiation, with additional emphasis on conflict resolution. Students will engage in a number of simulated negotiations ranging from simple one-issue transactions to multi-party joint ventures. Through these exercises and associated readings, students explore the basic theoretical models of bargaining and have an opportunity to test and improve their negotiation skills. Students must keep a journal throughout the class exploring their thoughts on the negotiation process.\r\n\r\nOverall, students said they enjoyed this class and that it was, “absolutely amazing” and “one of the best at Penn.” While students expressed that this class “teaches life skills,” they also thought that the journal entries were time consuming and “perhaps not worth it.”\r\n\r\nProfessor Blum was highly praised by students who claimed that he was very unconventional for a Wharton professor. He has, “a great sense of humor” and is, “able to instill knowledge and genuinely care about his students.” Students ensured Professor Blum does a great job of connecting course concepts to the real world.\r\n\r\nStudents said that this class required a lot of reading and there were often pop quizzes, but overall that the class was well worth it. They also said it was difficult to stay on top of the journals entries.\r\n", "num_students": 34, "path": "/courses/23309/sections/408/reviews/710-STEVEN-BLUM", "instructor": {"path": "/instructors/710-STEVEN-BLUM", "first_name": "STEVEN", "last_name": "BLUM", "id": "710-STEVEN-BLUM", "name": "STEVEN BLUM"}, "num_reviewers": 32, "id": "23309-408-710-STEVEN-BLUM"}, {"ratings": {"rAmountLearned": "3.62", "rDifficulty": "2.07", "rStimulateInterest": "3.79", "rRecommendMajor": "3.97", "rCourseQuality": "3.88", "rWorkRequired": "2.31", "rInstructorAccess": "3.72", "rReadingsValue": "3.31", "rRecommendNonMajor": "3.93", "rCommAbility": "3.79", "rInstructorQuality": "3.88"}, "section": {"name": "NEGOTIATION/CONFLICT RES", "sectionnum": "409", "primary_alias": "LGST-206-409", "path": "/courses/23309/sections/409", "id": "23309-409", "aliases": ["LGST-206-409", "OPIM-291-409", "MGMT-291-409"]}, "comments": "", "num_students": 36, "path": "/courses/23309/sections/409/reviews/711-EDWARD-J-BERGMAN", "instructor": {"path": "/instructors/711-EDWARD-J-BERGMAN", "first_name": "EDWARD J", "last_name": "BERGMAN", "id": "711-EDWARD-J-BERGMAN", "name": "EDWARD J BERGMAN"}, "num_reviewers": 33, "id": "23309-409-711-EDWARD-J-BERGMAN"}]