[{"ratings": {"rAmountLearned": "2.39", "rDifficulty": "3.24", "rStimulateInterest": "2.17", "rRecommendMajor": "3.32", "rCourseQuality": "2.40", "rWorkRequired": "2.93", "rInstructorAccess": "3.46", "rReadingsValue": "2.63", "rRecommendNonMajor": "0.85", "rCommAbility": "3.10", "rInstructorQuality": "3.10"}, "section": {"name": "MECHANICS OF SOLIDS", "sectionnum": "001", "primary_alias": "MEAM-354-001", "path": "/courses/16061/sections/001", "id": "16061-001", "aliases": ["MEAM-354-001"]}, "comments": "This course extends knowledge of solid mechanics taught in MEAM 210 by addressing more advanced problems in the strength of materials. Applications discussed include those from traditional engineering disciplines as well as newer areas such as biotechnology and nanotechnology.\r\n\r\nSome students found this class to cover interesting ideas, though more described the content as “dull” or “boring.” Students also observed that significant overlap with material in MEAM 210 and a more theoretical treatment of content made the class seem less useful.\r\n\r\nStudents described Professor Purohit’s teaching ability as “excellent” and considered his lectures to be “clear” and “easy to understand.” Many students also commented favorably on his availability, communication skills, and attempts to raise interest in the course material.\r\n\r\nStudents found this class to be somewhat difficult, especially with the cumulative nature of the material. A few students thought the work was considerable and that tests were challenging and graded harshly. Many desired more example problems in preparation for tests.", "num_students": 42, "path": "/courses/16061/sections/001/reviews/3364-PRASHANT-KISHORE-PUROHIT", "instructor": {"path": "/instructors/3364-PRASHANT-KISHORE-PUROHIT", "first_name": "PRASHANT KISHORE", "last_name": "PUROHIT", "id": "3364-PRASHANT-KISHORE-PUROHIT", "name": "PRASHANT KISHORE PUROHIT"}, "num_reviewers": 42, "id": "16061-001-3364-PRASHANT-KISHORE-PUROHIT"}]