{"coursehistories": {"path": "/coursehistories/4393"}, "description": "What are \"race\" and \"ethnicity\"? How have American constitutional politics been shaped by issues of racial and ethnic statuses? How have American racial and ethnic identities and statuses been shaped by American constitutional politics? Have the nation's basic conflicts been at bottom economic, sometimes expressed via racial and ethnic antagonisms, or do racial and ethnic identities and conflicts have \"a life of their own\"? Has an \"American Creed\" of democratic liberalism dominated American culture, with racial hierarchies a frustrating exception? Or have ideologies of racial and ethnic identity and struggles over racial and ethnic statuses instead been central to American constitutional development? This seminar explores these questions by examining the role of race and ethnicity in many constitutional controversies, carried out in courts, legislatures, and popular debates. Secondary historical, legal, political and economic analyses will also be considered. \n\n", "semester": "2009A", "name": "RACE ETHN & AMER CON LAW", "reviews": {"path": "/courses/16368/reviews", "values": [{"ratings": {"rAmountLearned": "3.53", "rDifficulty": "2.65", "rStimulateInterest": "3.76", "rRecommendMajor": "3.94", "rCourseQuality": "3.59", "rWorkRequired": "3.00", "rInstructorAccess": "3.71", "rReadingsValue": "3.47", "rRecommendNonMajor": "3.53", "rCommAbility": "3.88", "rInstructorQuality": "3.82"}, "section": {"name": "RACE ETHN & AMER CON LAW", "sectionnum": "301", "primary_alias": "PSCI-380-301", "path": "/courses/16368/sections/301", "id": "16368-301", "aliases": ["PSCI-380-301"]}, "comments": "This class on American Constitutional politics examines constitutional controversies and the role that race and ethnicity play in them. It asks questions such as: What are “race” and “ethnicity”? How have American constitutional politics been shaped by issues of racial and ethnic statuses? How have American racial and ethnic identities and statuses been shaped by American constitutional politics? Has an “American Creed” of democratic liberalism dominated American culture, with racial hierarchies a frustrating exception? Or have ideologies of racial and ethnic identity and struggles over racial and ethnic statuses instead been central to American constitutional development? Secondary historical, legal, political and economic analyses will also be used to analyze these themes.&#8232;\r\n&#8232;Students liked this interesting course that they said “challenged common notions of race in America.” They also liked that the format of the class involved class discussion about the reading assignments, which were “relevant” and “helpful.” One student also commented that the “subject matter… is presented in such a way that there\\'s something for everyone.” Most students agreed that they learned a lot in this class, and a few students even described it as one of the best courses they had taken at Penn.\r\nThe majority of students commented that Professor Smith was an “excellent,” “amazing,” and “unbelievable” professor who was knowledgeable and “personable.” One student said that Professor Smith “did an admirable job of moderating the discussions so that everyone was able to contribute, and all of the material was covered in an interesting way.”&#8232;&#8232;\r\nOne student did mention that the class covered “an astonishing amount of material in a relatively short time” and another said that there was more reading in this course than they had ever had before. It was also suggested that “it would be convenient if footnotes were included with readings in the bulkpack.” The majority of students in this class were upperclassmen.", "num_students": 17, "path": "/courses/16368/sections/301/reviews/1002-ROGERS-M-SMITH", "instructor": {"path": "/instructors/1002-ROGERS-M-SMITH", "first_name": "ROGERS M", "last_name": "SMITH", "id": "1002-ROGERS-M-SMITH", "name": "ROGERS M SMITH"}, "num_reviewers": 17, "id": "16368-301-1002-ROGERS-M-SMITH"}]}, "credits": null, "primary_alias": "PSCI-380", "path": "/courses/16368", "sections": {"path": "/courses/16368/sections", "values": [{"name": "RACE ETHN & AMER CON LAW", "sectionnum": "301", "primary_alias": "PSCI-380-301", "path": "/courses/16368/sections/301", "id": "16368-301", "aliases": ["PSCI-380-301"]}]}, "id": 16368, "aliases": ["PSCI-380"]}