{"coursehistories": {"path": "/coursehistories/934"}, "description": "The existence and endurance of war provides one of the most important puzzles of politics: why is it that people keep making use of such a destructive and painful way of resolving their disputes? This course addresses this question and the related question of what factors contribute to peace, focusing on both academic and popular explanations for conflict, including among others anarchy, over-optimism, shifting power, diversionary war, the malevolent influence of war profiteers, and a variety of explanations grounded in culture, religion and other ideational variables. In this discussion, we will focus on both interstate and civil wars, and on both the onset and the eventual termination of war. At various points in the course we will discuss a wide range of historical and contemporary cases, including the World Wars, Vietnam, the Gulf War, the Iraq War, the various Arab-Israeli wars, the India-Pakistan rivalry, and a number of recent civil conflicts such as the wars in Yugoslavia, Congo, and Sudan. The course concludes with a discussion of strategies for managing ongoing conflicts and for securing peace in post war settings. \n\n", "semester": "2009A", "name": "THE CAUSES OF WAR&PEACE", "reviews": {"path": "/courses/16361/reviews", "values": [{"ratings": {"rAmountLearned": "2.95", "rDifficulty": "2.84", "rStimulateInterest": "2.67", "rRecommendMajor": "3.13", "rCourseQuality": "2.95", "rWorkRequired": "2.79", "rInstructorAccess": "3.13", "rReadingsValue": "2.92", "rRecommendNonMajor": "2.28", "rCommAbility": "2.97", "rInstructorQuality": "2.98"}, "section": {"name": "THE CAUSES OF WAR&PEACE", "sectionnum": "001", "primary_alias": "PSCI-255-001", "path": "/courses/16361/sections/001", "id": "16361-001", "aliases": ["PSCI-255-001"]}, "comments": "The existence and endurance of war provides one of the most important puzzles of politics: why is it that people keep making use of such a destructive and painful way of resolving their disputes? This course addresses this question and related questions of what factors contribute to peace, focusing on both academic and popular explanations for conflict, including among others anarchy, over optimism, shifting power, diversionary war, the malevolent influence of war profiteers, and a variety of explanations grounded in culture, religion, and other ideational variables. The course discusses a wide range of historical and contemporary cases, including the World Wars, Vietnam, the Gulf War, the Iraq War, the various Arab-Israeli wars, the India-Pakistan rivalry, and a number of recent civil conflicts such as the wars in Yugoslavia, Congo, and Sudan. The course concludes with a discussion of strategies for managing ongoing conflicts and for securing peace in post-war settings.&#8232;&#8232;\r\nStudents taking this course found it to be interesting and challenging and most agreed that it was very informative. “I learned a lot about the nature of the international political realm,” said one student. Students also mentioned that the outline of the lectures was helpful and made it easier to review notes. Most of the students felt that the readings were relevant and interesting. &#8232;&#8232;\r\nOverall students found Professor Weisiger to be very knowledgeable and a good instructor, although many felt that he rushed through the second half of the course and did not spend as much time as they felt was needed to explain some important concepts.&#8232;&#8232;\r\nMost of the students who took this course said that there was a lot of reading. The midterm was in the form of a paper and a few students said they felt that they did not have enough time to review for it and the final exam. One student also mentioned that the format of the midterm was “unclear about how to properly answer the question.” Another student said the final exam was “quite daunting” because of the amount of material that had been covered. A few students mentioned that the grading was also tough. Overall most students were happy with the course, and one student recommended that it was “vital to anyone interested in international politics.”", "num_students": 46, "path": "/courses/16361/sections/001/reviews/4540-ALEX-WEISIGER", "instructor": {"path": "/instructors/4540-ALEX-WEISIGER", "first_name": "ALEX", "last_name": "WEISIGER", "id": "4540-ALEX-WEISIGER", "name": "ALEX WEISIGER"}, "num_reviewers": 46, "id": "16361-001-4540-ALEX-WEISIGER"}]}, "credits": null, "primary_alias": "PSCI-255", "path": "/courses/16361", "sections": {"path": "/courses/16361/sections", "values": [{"name": "THE CAUSES OF WAR&PEACE", "sectionnum": "001", "primary_alias": "PSCI-255-001", "path": "/courses/16361/sections/001", "id": "16361-001", "aliases": ["PSCI-255-001"]}]}, "id": 16361, "aliases": ["PSCI-255"]}