{"coursehistories": {"path": "/coursehistories/1647"}, "description": "Is culture a commodity or a vanishing resource? Can cultural property be owned by one person or does it belong to the entire world? Can culture be copyrighted? In our increasingly global society, competing claims regarding the ownership of cultural objects, customs, and traditional knowledge, are becoming more frequent. In this course, we will address the current debates over the ownership and preservation of tangible and intangible cultural property, and we will review the competing interests and values that have been implicated in these debates. Particular attention will be paid to the development of U.S. law and policy (such as The Native American Graves Protection and Repatriation Act [NAGPRA]) and relevant international treaties, although examples from around the world will be considered. The first part of the course concerns preservation and the built environment, and the origins of U.S. heritage legislation. The second part will address tangible cultural property issues, such as the antiquities trade, stolen art, and the ethics of archaeological and collecting practices, and will examine the national and international laws aimed at regulating them. The third part will focus on disputes over intangible cultural heritage and indigenous property rights, such as those regarding the copyright and \n\npatenting of traditional medicine, folklore and music. Finally, we will consider the linkages between the tangible and intangible cultural heritage, and discuss the development of future policies addressing the range of issues from the built to the natural environment. \n\n", "semester": "2002C", "name": "CULT PROP, HERIT & LAW", "reviews": {"path": "/courses/2613/reviews", "values": [{"ratings": {"rAmountLearned": "3.29", "rDifficulty": "2.57", "rStimulateInterest": "3.43", "rRecommendMajor": "3.57", "rCourseQuality": "3.71", "rWorkRequired": "2.57", "rInstructorAccess": "3.43", "rReadingsValue": "3.71", "rRecommendNonMajor": "3.00", "rCommAbility": "3.71", "rInstructorQuality": "3.57"}, "section": {"name": "CULT PROP, HERIT & LAW", "sectionnum": "301", "primary_alias": "ANTH-331-301", "path": "/courses/2613/sections/301", "id": "2613-301", "aliases": ["ANTH-331-301"]}, "comments": "", "num_students": 9, "path": "/courses/2613/sections/301/reviews/257-ALEXANDER-A-BAUER", "instructor": {"path": "/instructors/257-ALEXANDER-A-BAUER", "first_name": "ALEXANDER A", "last_name": "BAUER", "id": "257-ALEXANDER-A-BAUER", "name": "ALEXANDER A BAUER"}, "num_reviewers": 7, "id": "2613-301-257-ALEXANDER-A-BAUER"}]}, "credits": null, "primary_alias": "ANTH-331", "path": "/courses/2613", "sections": {"path": "/courses/2613/sections", "values": [{"name": "CULT PROP, HERIT & LAW", "sectionnum": "301", "primary_alias": "ANTH-331-301", "path": "/courses/2613/sections/301", "id": "2613-301", "aliases": ["ANTH-331-301"]}]}, "id": 2613, "aliases": ["ANTH-331"]}