[{"ratings": {"rAmountLearned": "3.02", "rDifficulty": "2.69", "rStimulateInterest": "3.38", "rRecommendMajor": "3.29", "rCourseQuality": "3.02", "rWorkRequired": "2.98", "rInstructorAccess": "2.87", "rReadingsValue": "2.71", "rRecommendNonMajor": "2.02", "rCommAbility": "2.73", "rInstructorQuality": "3.08"}, "section": {"name": "INTRO TO ROBOTICS", "sectionnum": "001", "primary_alias": "MEAM-520-001", "path": "/courses/27739/sections/001", "id": "27739-001", "aliases": ["MEAM-520-001"]}, "comments": "The rapidly evolving field of robotics includes systems designed to replace, assist, or even entertain humans in a wide variety of tasks. Recent examples include planetary rovers, robotic pets, medical surgical-assistive devices, and semi-autonomous search- and-rescue vehicles. This introductory-level course presents the fundamental kinematic, dynamic, and computational principles underlying most modern robotic systems. The main topics of the course include: coordinate transformations, manipulator kinematics, mobile-robot kinematics, actuation and sensing, feedback control, vision, and motion planning. The material is reinforced with hands-on lab exercises including robot-arm control and the programming of vision-guided mobile robots.\r\n\r\nStudents overall felt that the course was “good hands on learning” and “exciting.” The “project style” of the course helped students with “reinforcing concepts,” but some students felt that “More emphasis on theoretical aspects would be nice.”\r\n\r\nProfessor Fiene’s teaching style was to “show some really simple outlines” without going “through details.” Most students felt “More guidance would’ve been appreciated.”\r\n\r\nStudents overall felt that “the requirement for programming is pretty high.”  Some commented that though the class was “fun,” the time requirement and necessary knowledge could “create conflicts” especially for undergraduates.\r\n", "num_students": 52, "path": "/courses/27739/sections/001/reviews/3916-JONATHAN-FIENE", "instructor": {"path": "/instructors/3916-JONATHAN-FIENE", "first_name": "JONATHAN", "last_name": "FIENE", "id": "3916-JONATHAN-FIENE", "name": "JONATHAN FIENE"}, "num_reviewers": 49, "id": "27739-001-3916-JONATHAN-FIENE"}]