{"coursehistories": {"path": "/coursehistories/2569"}, "description": "This course covers the fundamentals of discrete-time signals and systems and digital filters. Specific topics covered include: review of discrete-time signal and linear system representations in the time and frequence domain, and convolution; discrete-time Fourier transform (DTFT); Z-transforms; frequency response of linear discrete-time systems; sampling of continuous-time signals, analog to digital conversion, sampling-rate conversion; basic discrete-time filter structures and types; finite imples response (FIR) and infinite impulse response (IIR) filters; design of FIR and IIR filters; discrete Fourier transform (DFT), the fast Fourier transform (FFT) algorithm and its applications in filtering and spectrum estimation. Selected applications. \n\n", "semester": "2010C", "name": "DIGITAL SIGNAL PROC", "reviews": {"path": "/courses/23048/reviews", "values": [{"ratings": {"rAmountLearned": "3.06", "rDifficulty": "3.33", "rStimulateInterest": "2.78", "rRecommendMajor": "3.06", "rCourseQuality": "3.15", "rWorkRequired": "3.17", "rInstructorAccess": "3.11", "rReadingsValue": "3.11", "rRecommendNonMajor": "1.44", "rCommAbility": "3.12", "rInstructorQuality": "3.15"}, "section": {"name": "DIGITAL SIGNAL PROC", "sectionnum": "001", "primary_alias": "ESE-531-001", "path": "/courses/23048/sections/001", "id": "23048-001", "aliases": ["ESE-531-001"]}, "comments": "This course covers the fundamentals of discrete-time signals and systems and digital filters. Specific topics covered include: review of discrete-time signal and linear system representations in the time and frequence domain, and convolution; discrete-time Fourier transform (DTFT); Z-transforms; frequency response of linear discrete-time systems; sampling of continuous-time signals, analog to digital conversion, sampling-rate conversion; basic discrete-time filter structures and types; finite impulse response (FIR) and infinite impulse response (IIR) filters; design of FIR and IIR filters; discrete Fourier transform (DFT), the fast Fourier transform (FFT) algorithm and its applications in filtering and spectrum estimation. Projects requiring implementation of specific digital signal processing algorithms will also be assigned.\r\n\r\nStudents generally thought that the class was too math and theory-oriented and reporting hoping to see more application problems. Many also suggested introducing MATLAB earlier on in the course. One student felt that the textbook was “absolutely abysmal” and often glossed over core concepts. \r\n\r\nProfessor Kassam was described as “a very nice professor”, but some felt that his style was “strictly lecture.” Many students commented that they would like to see more problem-solving strategies and examples in class in order to better approach exam questions. \r\n\r\nThis is a graduate class. Most students found the material to be relatively difficult and reported needing a lot of time to do the project.\r\n", "num_students": 27, "path": "/courses/23048/sections/001/reviews/358-SALEEM-A-KASSAM", "instructor": {"path": "/instructors/358-SALEEM-A-KASSAM", "first_name": "SALEEM A", "last_name": "KASSAM", "id": "358-SALEEM-A-KASSAM", "name": "SALEEM A KASSAM"}, "num_reviewers": 21, "id": "23048-001-358-SALEEM-A-KASSAM"}]}, "credits": null, "primary_alias": "ESE-531", "path": "/courses/23048", "sections": {"path": "/courses/23048/sections", "values": [{"name": "DIGITAL SIGNAL PROC", "sectionnum": "001", "primary_alias": "ESE-531-001", "path": "/courses/23048/sections/001", "id": "23048-001", "aliases": ["ESE-531-001"]}]}, "id": 23048, "aliases": ["ESE-531"]}