[{"ratings": {"rAmountLearned": "2.97", "rDifficulty": "2.57", "rStimulateInterest": "3.34", "rRecommendMajor": "3.48", "rCourseQuality": "3.28", "rWorkRequired": "2.86", "rInstructorAccess": "3.03", "rReadingsValue": "2.38", "rRecommendNonMajor": "3.10", "rCommAbility": "3.48", "rInstructorQuality": "3.66"}, "section": {"name": "BERLIN: HIST POL CULTURE", "sectionnum": "401", "primary_alias": "GRMN-237-401", "path": "/courses/23164/sections/401", "id": "23164-401", "aliases": ["GRMN-237-401", "COML-237-401", "URBS-237-401", "ARTH-237-401", "HIST-237-401"]}, "comments": "What do you know about Berlin's history, architecture, culture, and political life? The present course will offer a survey of the history of Prussia, beginning with the seventeenth century, and the unification of the small towns of Berlin and koelln to establish a new capital for this country. It will tell the story of Berlin's rising political prominence in the eighteenth century, its transformation into an industrial city in the late nineteenth century, its rise to metropolis in the early twentieth century, its history during the Third Reich, and the post-war cold war period. The course will conclude its historical survey with a consideration of Berlin's position as a capital in reunified Germany. The historical survey will be supplemented by a study of Berlin's urban structure, its significant architecture from the eighteenth century (i.e. Schinkel) to the nineteenth (new worker's housing, garden suburbs) and twentieth centuries (Bauhaus, Speer designs, postwar rebuilding, GDR housing projects, post-unification building boom). In addition, students read literary texts about the city, and consider the visual art and music created in and about Berlin. Indeed, Berlin will be a specific example to explore German history and cultural life of the last 300 years. The course is interdisciplinary with the fields of German Studies, history, history of art, and urban studies. It is also designed as a preparation for undergraduate students who are considering spending a junior semester with the Penn Abroad Program in Berlin.&#8232;&#8232;\r\nStudents found this course to be “amazing” and “interesting.” One student commented that the class “overall was enriching and entertaining,” while another mentioned that this was an “outstanding course.”&#8232;&#8232;\r\nOverall, students found Professor Weissberg to be a great and interesting lecturer. One student mentioned that Professor Weissberg gave “extremely interesting lectures,” and another said that Professor Weisberg was one of the best lecturers they had had at Penn. Another student also described her as “approachable,” while anther said that Professor Weisberg quickly responded to emails. However, one student did mention that Professor Weisberg was a little confusing in lecture and that her office hours were not very helpful, as they felt as if Professor Weisberg was rushing them out of the office. Another commented that the course was unorganized.&#8232;&#8232;\r\nA couple of students commented that there was a lot of reading in the course, while another mentioned that finding a topic for the paper was frustrating. One student mentioned that the readings were not helpful. However, another student commented that they would recommend this course to anyone interested in art and culture. This course fulfills the Humanities and Social Science Sector.\r\n", "num_students": 42, "path": "/courses/23164/sections/401/reviews/1332-LILIANE-WEISSBERG", "instructor": {"path": "/instructors/1332-LILIANE-WEISSBERG", "first_name": "LILIANE", "last_name": "WEISSBERG", "id": "1332-LILIANE-WEISSBERG", "name": "LILIANE WEISSBERG"}, "num_reviewers": 35, "id": "23164-401-1332-LILIANE-WEISSBERG"}]