[{"ratings": {"rAmountLearned": "3.08", "rDifficulty": "1.77", "rStimulateInterest": "3.62", "rRecommendMajor": "3.62", "rCourseQuality": "3.64", "rWorkRequired": "2.31", "rInstructorAccess": "3.69", "rReadingsValue": "3.00", "rRecommendNonMajor": "3.42", "rCommAbility": "3.69", "rInstructorQuality": "3.64"}, "section": {"name": "TOPICS FILM HISTORY: Fright Night: The Ethics of Horror on Film", "sectionnum": "401", "primary_alias": "CINE-201-401", "path": "/courses/27138/sections/401", "id": "27138-401", "aliases": ["CINE-201-401", "ENGL-291-401", "COML-201-401", "ARTH-290-401"]}, "comments": "", "num_students": 16, "path": "/courses/27138/sections/401/reviews/5726-MIA-L--MASK", "instructor": {"path": "/instructors/5726-MIA-L--MASK", "first_name": "MIA L.", "last_name": "MASK", "id": "5726-MIA-L--MASK", "name": "MIA L. MASK"}, "num_reviewers": 14, "id": "27138-401-5726-MIA-L--MASK"}, {"ratings": {"rAmountLearned": "3.33", "rDifficulty": "2.42", "rStimulateInterest": "3.25", "rRecommendMajor": "3.67", "rCourseQuality": "3.00", "rWorkRequired": "2.42", "rInstructorAccess": "3.58", "rReadingsValue": "3.00", "rRecommendNonMajor": "3.25", "rCommAbility": "3.67", "rInstructorQuality": "3.43"}, "section": {"name": "TOPICS FILM HISTORY: REALISM IN FILM", "sectionnum": "402", "primary_alias": "CINE-201-402", "path": "/courses/27138/sections/402", "id": "27138-402", "aliases": ["CINE-201-402", "ENGL-291-402", "COML-201-402", "ARTH-290-402"]}, "comments": "This course examined the re-presentation of real life as an (the?) essential element of cinema, in both fiction and non-fiction films, from the earliest shorts of the Lumières in the 1890s through contemporary “mumblecore” and reality TV. Topics included German Expressionist and Kammerspiel films of the 1920s; French poetic realism of the 1930s; Italian neo-realism of the 1940s; Brazilian magical realism of the 1960s; American Direct Cinema documentaries of the 1960s; British social realism of the 1980s; Danish Dogme 95 films of the 1990s; American indies since 2002; and Romanian social realism since 2005. The course also explored such areas as the influential improvisational style of John Cassavetes films; the rise of the “mockumentary” and reality TV; the aesthetics of real time, long takes, and hyper-realism, especially in Warhol and Akerman; the role of realist style in themes of ethics and morality, especially in Kieslowski, Puiu, and the Dardennes; and alternative or experimental forms of realism. Students read such writers as Arnheim, Barthes, Baudrillard, Bazin, de Certeau, Derrida, Foucault, Jameson, Kael, Kracauer, and Metz, as well as examples of realist and magical realist fiction.\r\n\r\nStudents enjoyed the structure of the class and thought the course was \"great\" and \"well-planned.\" They especially liked the discussion of \"a genre or movement before the screening\" because it made \"the actual watching more meaningful.\" Some students wished for more discussion and less lecture, although students did acknowledge the professor's willingness to stop his lecture \"to have a discussion or ask a question.\" Those who liked the lecture aspect of the course found the lectures \"interesting and insightful,\" and students found the discussions \"congenial and thought-provoking.\" Those who described the class as \"challenging\" also found it \"satisfying.\"\r\n\r\nStudents found Professor Charney stimulating, \"knowledgeable,\" \"engaging and receptive to our ideas and thoughts.\" One student called Professor Charney, \"one of my favorite instructors for a non-major course.\" Class members found Professor Charney \"always ready and willing to answer questions.\"\r\n\r\nIn terms of workload, some students found the assigned two movies per week \"a bit much,\" but the films and readings assigned were \"valuable to understanding the material covered.\" Students thought the written assignments were \"fair and thought provoking.\" They enjoyed the final project because of \"the freedom to get creative\" that it offered students. This class involved \"theoretical analysis of film as a text\" and is not for students who dislike that sort of film analysis. Both majors and non-majors enrolled in this course because \"no background in film was necessary\" to take this class.", "num_students": 17, "path": "/courses/27138/sections/402/reviews/3241-LEOPOLD-CHARNEY", "instructor": {"path": "/instructors/3241-LEOPOLD-CHARNEY", "first_name": "LEOPOLD", "last_name": "CHARNEY", "id": "3241-LEOPOLD-CHARNEY", "name": "LEOPOLD CHARNEY"}, "num_reviewers": 14, "id": "27138-402-3241-LEOPOLD-CHARNEY"}]