[{"ratings": {"rAmountLearned": "2.87", "rDifficulty": "3.00", "rStimulateInterest": "1.84", "rRecommendMajor": "3.32", "rCourseQuality": "2.40", "rWorkRequired": "2.46", "rInstructorAccess": "2.71", "rReadingsValue": "2.84", "rRecommendNonMajor": "1.97", "rCommAbility": "2.24", "rInstructorQuality": "2.33"}, "section": {"name": "GAME THEORY", "sectionnum": "001", "primary_alias": "ECON-212-001", "path": "/courses/25890/sections/001", "id": "25890-001", "aliases": ["ECON-212-001"]}, "comments": "This course is an introduction to game theory and its applications to economic analysis. The course will provide a theoretical overview of modern game theory, emphasizing common themes in the analysis of strategic behavior in different social science contexts. The economic applications will be drawn from different areas including trade, corporate strategy and public policy. \r\n\r\nStudent opinion of the course material was mixed. While some students found the material intriguing, others thought it was too “abstract” at times. One student called the course content “fascinating,” noting that “some of the conclusions of some models were very interesting.” \r\n\r\nStudents found Professor Matthews “very knowledgeable,” but also indicated that he could have stimulated student interest more effectively. Students also felt that the professor did not have a good sense of what elements of the course were more difficult than others, and thus spent too little time explaining the more complex ideas. Many students also expressed that they required extensive use of other resources, such as the textbook, in order to comfortably grasp course concepts. \r\n\r\nStudents appreciated the variety of class formats, noting that simulations, movie clips, demonstrations, and games complemented lectures well. A few students were displeased with the grading structure, as one student stated, “Problem sets should be counted for a grade as well as the exams,” and another added, “The tests themselves were generally way harder than what was covered in class or the textbook.”", "num_students": 46, "path": "/courses/25890/sections/001/reviews/342-STEVEN-A-MATTHEWS", "instructor": {"path": "/instructors/342-STEVEN-A-MATTHEWS", "first_name": "STEVEN A", "last_name": "MATTHEWS", "id": "342-STEVEN-A-MATTHEWS", "name": "STEVEN A MATTHEWS"}, "num_reviewers": 42, "id": "25890-001-342-STEVEN-A-MATTHEWS"}]