[{"ratings": {"rAmountLearned": "3.16", "rDifficulty": "2.60", "rStimulateInterest": "2.94", "rRecommendMajor": "3.83", "rCourseQuality": "2.97", "rWorkRequired": "3.10", "rInstructorAccess": "3.13", "rReadingsValue": "2.33", "rRecommendNonMajor": "2.51", "rCommAbility": "3.18", "rInstructorQuality": "3.29"}, "section": {"name": "PROG LANG & TECH I", "sectionnum": "001", "primary_alias": "CIS-120-001", "path": "/courses/17123/sections/001", "id": "17123-001", "aliases": ["CIS-120-001"]}, "comments": "The course is a fast-paced introduction to the fundamental concepts of programming. Previous programming at the level of high school computer science class or CIS 110 is required. While this course uses Java and Python, any experience with programming language, such as C/C++, VB, PHP, or Perl, is sufficient. \r\n\r\nStudents with more computer science background found the course to be very easy while those with less experience thought it was challenging but learned a lot. Overall, however they enjoyed the course and homework. Some students even stated it was their “favorite class this semester.” There were mixed reactions to the Python portion of the course; some felt it needed to be dropped while others thought it was very beneficial. \r\n\r\nStudents described Professor Pierce as “excellent,” “charismatic,” “fantastic,” and “very easy to understand.” However, one student noted while Professor Pierce was helpful, he was not always approachable due to the many changes in his office hours.\r\n\r\nStudents took this course for their major or minor requirements. A diagnostic quiz is given to students in the beginning to test if the course is suitable for their level. This course goes into greater depth about the topics covered in CIS 110. \r\n", "num_students": 90, "path": "/courses/17123/sections/001/reviews/1321-BENJAMIN-C--PIERCE", "instructor": {"path": "/instructors/1321-BENJAMIN-C--PIERCE", "first_name": "BENJAMIN C.", "last_name": "PIERCE", "id": "1321-BENJAMIN-C--PIERCE", "name": "BENJAMIN C. PIERCE"}, "num_reviewers": 83, "id": "17123-001-1321-BENJAMIN-C--PIERCE"}]