{"coursehistories": {"path": "/coursehistories/3327"}, "description": "This course is designed to explore the unique issues that arise for communications researchers who work with children. We begin by considering the role of theory in designing research by providing examples of theoretical paradigms that shape research programs (e.g., developmental theory, critical theory, ecological theory). We next review the major methodological approaches communications researchers in this field use, including lab and field experiments, surveys and interviews, naturalistic and ethnographic research and secondary data analysis. We examine the variety of contexts in which such research is employed (e.g., audience research, market research, and social research) and consider the unique ethical issues and protective mechanisms in place. The course culminates in group-based, supervised research wherein students have an opportunity to design and implement a child-focused study. \n\n", "semester": "2009A", "name": "COMM RES W/CHILD & FAM", "reviews": {"path": "/courses/15541/reviews", "values": [{"ratings": {"rAmountLearned": "2.39", "rDifficulty": "2.91", "rStimulateInterest": "3.39", "rRecommendMajor": "2.74", "rCourseQuality": "2.58", "rWorkRequired": "3.17", "rInstructorAccess": "3.78", "rReadingsValue": "2.39", "rRecommendNonMajor": "1.35", "rCommAbility": "3.57", "rInstructorQuality": "3.63"}, "section": {"name": "COMM RES W/CHILD & FAM", "sectionnum": "301", "primary_alias": "COMM-308-301", "path": "/courses/15541/sections/301", "id": "15541-301", "aliases": ["COMM-308-301"]}, "comments": "This course is designed to explore the unique issues that arise for communications researchers who work with children. The class begins by considering the role of theory in designing research, then reviews the major methodological approaches, and finally examines the variety of contexts in which such research is employed.\r\nThe course considers the unique ethical issues and protective mechanisms in place. The course culminates in group-based, supervised research wherein students have an opportunity to design and implement a child-focused study. &#8232;&#8232;&#8232;Students reported that the course was one of “the most useful and well-taught” they had taken at Penn. Although it “was a good course overall”, some students reported difficulty having no prior research class experience.&#8232;&#8232;\r\nWhile students seemed to like each professor, individually one said the co-taught class “hindered my learning experience …[there were] too may conflicting style of teaching” and several others said the class was unorganized. However one student wrote, “I especially enjoyed the balance between [the two] personalities, [they] definitely complement each other as instructors” Another student reported “Amy Jordan is one of my favorite teachers…I think I could have done much better had it been only her teaching.”\r\nStudents said the exams were hard with one student mentioning that material they were tested on was “too trivial.” The course culminated in a final project which included a significant time of prep-work and execution time, reported by several students in the class.", "num_students": 24, "path": "/courses/15541/sections/301/reviews/281-AMY-B--JORDAN", "instructor": {"path": "/instructors/281-AMY-B--JORDAN", "first_name": "AMY B.", "last_name": "JORDAN", "id": "281-AMY-B--JORDAN", "name": "AMY B. JORDAN"}, "num_reviewers": 24, "id": "15541-301-281-AMY-B--JORDAN"}, {"ratings": {"rAmountLearned": "2.39", "rDifficulty": "2.91", "rStimulateInterest": "2.65", "rRecommendMajor": "2.74", "rCourseQuality": "2.58", "rWorkRequired": "3.17", "rInstructorAccess": "3.09", "rReadingsValue": "2.39", "rRecommendNonMajor": "1.35", "rCommAbility": "2.30", "rInstructorQuality": "2.46"}, "section": {"name": "COMM RES W/CHILD & FAM", "sectionnum": "301", "primary_alias": "COMM-308-301", "path": "/courses/15541/sections/301", "id": "15541-301", "aliases": ["COMM-308-301"]}, "comments": "This course is designed to explore the unique issues that arise for communications researchers who work with children. The class begins by considering the role of theory in designing research, then reviews the major methodological approaches, and finally examines the variety of contexts in which such research is employed. The course considers the unique ethical issues and protective mechanisms in place. The course culminates in group-based, supervised research wherein students have an opportunity to design and implement a child-focused study. &#8232;\r\n&#8232;Students reported that the course was one of “the most useful and well-taught” they had taken at Penn. Although it “was a good course overall”, some students reported difficulty having no prior research class experience.&#8232;&#8232;\r\nThe course was co-taught. Students wrote that Professor Linebarger was “a sweetheart” and a “great teacher,” but many found her “not very organized” overall.&#8232; One student wrote, “I especially enjoyed the balance between [the two] personalities, [they] both complement each other as instructors” while another wrote it “hindered my learning experience…too many conflicting styles of teaching.”\r\nStudents said the exams were hard with one student mentioning that material they were tested on was “too trivial.” The course culminated in a final project, which included a significant time of prep-work and execution time.", "num_students": 24, "path": "/courses/15541/sections/301/reviews/1814-DEBORAH-L--LINEBARGER", "instructor": {"path": "/instructors/1814-DEBORAH-L--LINEBARGER", "first_name": "DEBORAH L.", "last_name": "LINEBARGER", "id": "1814-DEBORAH-L--LINEBARGER", "name": "DEBORAH L. LINEBARGER"}, "num_reviewers": 24, "id": "15541-301-1814-DEBORAH-L--LINEBARGER"}]}, "credits": null, "primary_alias": "COMM-308", "path": "/courses/15541", "sections": {"path": "/courses/15541/sections", "values": [{"name": "COMM RES W/CHILD & FAM", "sectionnum": "301", "primary_alias": "COMM-308-301", "path": "/courses/15541/sections/301", "id": "15541-301", "aliases": ["COMM-308-301"]}]}, "id": 15541, "aliases": ["COMM-308"]}