{"coursehistories": {"path": "/coursehistories/5001"}, "description": "This course is a two part series. The first part concentrating on the Indian Consumer will be offered in December 2011. The second part, concentrating on the Chinese Consumer will be offered in March 2012. India and China add up to half of the world's population. Each presents its own challenges and opportunities. US and European MNCs have been in both countries for many years, but emerging market MNC's are becoming stronger and in many cases overtaking US and European companies despite their strong brands and know-how. \n\nMarketing to the Indian Consumer will provide a careful understanding of: The opportunity and challenges in the Indian consumer market 2) Various segments within the Indian consumer market. 3) Consumer psychology and decision making processes in each segment 4) Distribution channels in Indi Media in India: Mass, Local and non-traditional. 6) Bottom of the pyramid consumers and rural markets. 7) Product design and development decisions. The course will focus on the following industries: consumer packaged goods, mobile phones, financial services (insurance and banking), healthcare, sports and entertainment, and transportation. The course will involve case studies from local and international companies, guest lecturers, and visits to consumer homes to observe their tastes, habits, and preferences. \n\nMarketing to the Chinese Consumer will provide students with a critical understanding of the Chinese consumer, distribution channels, pricing environment, branding and competitive dynamics so as to enhance their ability to market to the Chinese consumer successfully. The course will consist of a combination of lectures, case studies, presentations by industry experts, and a short evening field trip. \n\nInactive \n\n", "semester": "2012A", "name": "MKTG TO INDIAN CONSUMER: Mktg in Emerging Economies: Understanding & Marketing to Indian Consumer", "reviews": {"path": "/courses/27808/reviews", "values": [{"ratings": {"rAmountLearned": "3.25", "rDifficulty": "2.32", "rStimulateInterest": "3.35", "rRecommendMajor": "3.47", "rCourseQuality": "3.34", "rWorkRequired": "2.74", "rInstructorAccess": "2.87", "rReadingsValue": "2.66", "rRecommendNonMajor": "2.97", "rCommAbility": "3.41", "rInstructorQuality": "3.36"}, "section": {"name": "MKTG TO INDIAN CONSUMER: Mktg in Emerging Economies: Understanding & Marketing to Indian Consumer", "sectionnum": "401", "primary_alias": "MKTG-893-401", "path": "/courses/27808/sections/401", "id": "27808-401", "aliases": ["MKTG-893-401"]}, "comments": "MKTG893 is a two part series. The first part concentrating on the Indian Consumer was offered in the fall, and is the basis of this review. The second part, concentrating on the Chinese Consumer will be was offered in the spring. Marketing to the Indian Consumer will provide a careful understanding of: The opportunity and challenges in the Indian consumer market 2) Various segments within the Indian consumer market. 3) Consumer psychology and decision making processes in each segment 4) Distribution channels in Indi Media in India: Mass, Local and non-traditional. 6) Bottom of the pyramid consumers and rural markets. 7) Product design and development decisions. The course will focus on the following industries: consumer packaged goods, mobile phones, financial services (insurance and banking), healthcare, sports and entertainment, and transportation. The course will involve case studies from local and international companies, guest lecturers, and visits to consumer homes to observe their tastes, habits, and preferences. The course will consist of a combination of lectures, case studies, presentations by industry experts, and a short evening field trip.\r\n\r\nOverall, students thought this course taught great marketing concepts that were “applicable to the universal consumer.” Some students thought they could “do away with visits to mall and market” while others “would have appreciated more site visits” and thought they “wouldn’t have gotten as much out of it if it was not locate in Mumbai.”  Many students thought the course design was “excellent” and that it provided “in depth knowledge about the Indian consumer.” \r\n\r\nAll students found the speakers to be “excellent” and of “high caliber”. \r\n\r\nMost students did not like the readings in this course. They found that there were “too many” that were “too long” and “overwhelming.” One student also wished the readings were “more organized.” Another student stressed “students were given the impression that they could change the course grading to pass/fail at another time” which was incorrect. This course is an advanced study that is not offered every year. There are no prerequisites.  \r\n", "num_students": 75, "path": "/courses/27808/sections/401/reviews/830-JAGMOHAN-SINGH-RAJU", "instructor": {"path": "/instructors/830-JAGMOHAN-SINGH-RAJU", "first_name": "JAGMOHAN SINGH", "last_name": "RAJU", "id": "830-JAGMOHAN-SINGH-RAJU", "name": "JAGMOHAN SINGH RAJU"}, "num_reviewers": 46, "id": "27808-401-830-JAGMOHAN-SINGH-RAJU"}, {"ratings": {"rAmountLearned": "2.89", "rDifficulty": "1.72", "rStimulateInterest": "3.37", "rRecommendMajor": "3.37", "rCourseQuality": "2.85", "rWorkRequired": "1.58", "rInstructorAccess": "3.16", "rReadingsValue": "2.79", "rRecommendNonMajor": "3.16", "rCommAbility": "3.16", "rInstructorQuality": "3.15"}, "section": {"name": "MKTG TO CHINESE CONSUMER: Mktg in Emerging Economies: Understanding & Marketing to Chinese Consumer", "sectionnum": "402", "primary_alias": "MKTG-893-402", "path": "/courses/27808/sections/402", "id": "27808-402", "aliases": ["MKTG-893-402"]}, "comments": "MKTG 893 is a two part series. The first part concentrating on the Indian Consumer is offered in the fall, and the second part, concentrating on the Chinese Consumer is offered in the spring, and is the focus of this review. Marketing to the Chinese Consumer provides students with a critical understanding of the Chinese consumer, distribution channels, pricing environment, branding and competitive dynamics so as to enhance their ability to market to the Chinese consumer successfully. The course consists of a combination of lectures, case studies, presentations by industry experts, and a short evening field trip. The course is taught in Beijing over spring break.\r\n\r\nMost students thought MKTG 893 was “fantastic” and allowed students to “learn a lot practically about the market.” One student commented the class contained a “well balanced amount of reading, work, assignments considering the most important aspect of this class is the cultural learning and interaction.” Other students’ comments echoed this sentiment. The main criticism for this course, which came from a significant minority of students, was that class participation was “disappointing.” One student thought that the retail field trip could have been managed better in order to “diversify” the learning experience.  \r\n\r\nMany students greatly enjoyed that Professor Zhang was from the country that the course was on and felt that this local perspective “immensely adds to the value of the course.” A few students commented that class facilitation could have been managed better.\r\n\r\nStudents did not agree on the rigor of this course, with about half of the students stating the course was very rigorous, and the other half of the students stating the course was not rigorous enough. MKTG 893 does not have any prerequisites. \r\n", "num_students": 46, "path": "/courses/27808/sections/402/reviews/1614-Z--JOHN-ZHANG", "instructor": {"path": "/instructors/1614-Z--JOHN-ZHANG", "first_name": "Z. JOHN", "last_name": "ZHANG", "id": "1614-Z--JOHN-ZHANG", "name": "Z. JOHN ZHANG"}, "num_reviewers": 23, "id": "27808-402-1614-Z--JOHN-ZHANG"}]}, "credits": null, "primary_alias": "MKTG-893", "path": "/courses/27808", "sections": {"path": "/courses/27808/sections", "values": [{"name": "MKTG TO INDIAN CONSUMER: Mktg in Emerging Economies: Understanding & Marketing to Indian Consumer", "sectionnum": "401", "primary_alias": "MKTG-893-401", "path": "/courses/27808/sections/401", "id": "27808-401", "aliases": ["MKTG-893-401"]}, {"name": "MKTG TO CHINESE CONSUMER: Mktg in Emerging Economies: Understanding & Marketing to Chinese Consumer", "sectionnum": "402", "primary_alias": "MKTG-893-402", "path": "/courses/27808/sections/402", "id": "27808-402", "aliases": ["MKTG-893-402"]}]}, "id": 27808, "aliases": ["MKTG-893"]}