{"coursehistories": {"path": "/coursehistories/3942"}, "description": "This course examines the history and practices of Indian popular cinema from the early 20th century to the present. Focusing on recent commercial Hindi cinema, we will learn how to intepret conventions such as song and dance sequences, melodrama and spectacle. Examining films as objects through which culture and society are made visible, students will watch films critically for their social, aesthetic and historical significance in Indian society. We will consider the particular commercial and industrial structures and practices surrounding Indian cinema, exploring the ways in which it is produced, circulated, and avidly consumed. We will examine the ways the Indian cinema accounts for nationality, religion, migration, and gender, and consider themes such as the use and creation of public space, spectatorship and visuality. This course will enable students to think critically about how cinema reflects, reforms and re-imagines the culture and society that creates it. \n\n", "semester": "2012A", "name": "INDIAN CINEMA & SOCIETY", "reviews": {"path": "/courses/28130/reviews", "values": [{"ratings": {"rAmountLearned": "1.92", "rDifficulty": "1.83", "rStimulateInterest": "2.00", "rRecommendMajor": "2.15", "rCourseQuality": "2.07", "rWorkRequired": "2.42", "rInstructorAccess": "2.62", "rReadingsValue": "2.31", "rRecommendNonMajor": "1.69", "rCommAbility": "1.85", "rInstructorQuality": "1.71"}, "section": {"name": "INDIAN CINEMA & SOCIETY", "sectionnum": "601", "primary_alias": "SAST-213-601", "path": "/courses/28130/sections/601", "id": "28130-601", "aliases": ["SAST-213-601", "CINE-215-601", "GSWS-213-601", "SAST-513-601", "GSWS-513-601"]}, "comments": "This course meets for three hours to view and discuss a variety of films/videos in Hindi, Tamil, Bengali, Urdu (with English subtitles), and English, which bring up issues of social, political, and cultural significance.  Readings for the course include articles in various fields ranging from film studies and communication to sociolinguistics and women's studies.  Discussions focus on cinema as a means of expression and as an instrument for social change, examining the various ways in which film both reflect and influence contemporary culture. Screenings will be held.\r\n\r\n\tOverall, students felt that while the course was “quite simple” and helped expose them to “interesting” films and ideas, the lack of structure prevented students from getting the most out of the class. Students said “lectures never had a solid lesson plan” and that the focus should have been more academic, “rather than talking about our feelings about movies.” Many students also noted widespread confusion over when projects and required journal entries were due.\r\n\r\n\tStudents felt Professor Raina “did not communicate assignments well” and “did not know much about the subject.” While some noted that he “wants his students to succeed,” many students were critical of his lack of clarity about the course’s outline and assignments. In addition, some students felt he was unresponsive to student emails and was unable to stick to the assigned themes of each week’s class.\r\n\r\n\tWhile the workload was relatively light, with only two major assignments during the semester, many students felt the stress about due dates and assignment instructions added to the course difficulty. Many students complained about lack of feedback in the class, with one student saying the professor “didn’t really grade anything and tell us where we stand.” Students also commented on the perceived bias in favor of students with previous knowledge of Indian films and culture.", "num_students": 19, "path": "/courses/28130/sections/601/reviews/6172-AJAY-RAINA", "instructor": {"path": "/instructors/6172-AJAY-RAINA", "first_name": "AJAY", "last_name": "RAINA", "id": "6172-AJAY-RAINA", "name": "AJAY RAINA"}, "num_reviewers": 14, "id": "28130-601-6172-AJAY-RAINA"}]}, "credits": null, "primary_alias": "SAST-213", "path": "/courses/28130", "sections": {"path": "/courses/28130/sections", "values": [{"name": "INDIAN CINEMA & SOCIETY", "sectionnum": "601", "primary_alias": "SAST-213-601", "path": "/courses/28130/sections/601", "id": "28130-601", "aliases": ["SAST-213-601", "CINE-215-601", "GSWS-213-601", "SAST-513-601", "GSWS-513-601"]}]}, "id": 28130, "aliases": ["SAST-213", "CINE-215", "GSWS-213", "SAST-513", "GSWS-513"]}