{"coursehistories": {"path": "/coursehistories/5236"}, "description": "Why can't work be fun? And just what is fun, anyway? Leading firms are answering that question through a new business practice called gamification, using the techniques of digital game designers to serve objectives as varied as marketing, human resources management, innovation, health and wellness, education, productivity enhancement, training, innovation, and customer engagement. This course, the first of its kind, examines gamification and provide an understanding of their effective. \n\nThe course uses a project-based approach to explore gamification as a design practice, which is rooted in research on human motivation and implemented through online systems and social media. No particular technical skills or gameknowledge is required. The course draws upon interdisciplinary source material as well as case studies to identify effective analytical models, strategies, techniques, and metrics for the application of game elements to real-world business context. \n\n", "semester": "2011C", "name": "DIGITAL GAME TECHNIQUES: Digital Game Design Techniques For Business:Rules, Incentives, Applications", "reviews": {"path": "/courses/24651/reviews", "values": [{"ratings": {"rAmountLearned": "2.59", "rDifficulty": "1.73", "rStimulateInterest": "3.19", "rRecommendMajor": "2.85", "rCourseQuality": "2.82", "rWorkRequired": "2.26", "rInstructorAccess": "3.59", "rReadingsValue": "2.70", "rRecommendNonMajor": "2.63", "rCommAbility": "3.26", "rInstructorQuality": "3.18"}, "section": {"name": "DIGITAL GAME TECHNIQUES: Digital Game Design Techniques For Business:Rules, Incentives, Applications", "sectionnum": "401", "primary_alias": "LGST-640-401", "path": "/courses/24651/sections/401", "id": "24651-401", "aliases": ["LGST-640-401", "OPIM-640-401"]}, "comments": "", "num_students": 40, "path": "/courses/24651/sections/401/reviews/721-DAN-HUNTER", "instructor": {"path": "/instructors/721-DAN-HUNTER", "first_name": "DAN", "last_name": "HUNTER", "id": "721-DAN-HUNTER", "name": "DAN HUNTER"}, "num_reviewers": 28, "id": "24651-401-721-DAN-HUNTER"}, {"ratings": {"rAmountLearned": "2.59", "rDifficulty": "1.73", "rStimulateInterest": "3.26", "rRecommendMajor": "2.85", "rCourseQuality": "2.82", "rWorkRequired": "2.26", "rInstructorAccess": "3.35", "rReadingsValue": "2.70", "rRecommendNonMajor": "2.63", "rCommAbility": "3.44", "rInstructorQuality": "3.25"}, "section": {"name": "DIGITAL GAME TECHNIQUES: Digital Game Design Techniques For Business:Rules, Incentives, Applications", "sectionnum": "401", "primary_alias": "LGST-640-401", "path": "/courses/24651/sections/401", "id": "24651-401", "aliases": ["LGST-640-401", "OPIM-640-401"]}, "comments": "Legal Studies 640 will examine the mechanism of gamification and provide an understanding of their effective use in the modern firm. The course will draw upon interdisciplinary source material as well as real-world case studies and production game environments to identify effective analytical models, strategies, techniques, and metrics for the application of games to business.  It will also identify a number of significant pitfalls to the successful implementation of gamification techniques, notably legal and ethical issues, the difficulty of making things fun, and the problems with implementing radical change in established firms.  The course will include both in-person meetings and web-based online sessions. This course is cross-listed with OPIM 640.\r\n\r\nThis course is based on a relatively new concept, gamification.  Most students felt it “turned out to be a lot of fun.”  There were many “interesting guest speakers” and one student said it was a good “exploration into new theories and concepts.”  Because it was a new course, students were involved with defining the course content with the professors, “as they themselves admittedly were changing the curriculum as they were going along.”\r\n\r\nStudents found the professors had “a passion for the topic that was infectious.” According to reviews, Professor Hunter and Werbach co-taught the course, and one student hoped the two would “teach this course again next year,” as the two professors “formed a dynamic and complementary team.”\r\n\r\nOne student mentioned that “it would have been nice to have some indicators that reflect your current grade in the course.”  Another student said that they enjoyed the group project, but found the weekly assignments tedious and too much like “busywork.” This class is not required of Wharton students and can be used to satisfy Concentration requirements.\r\n", "num_students": 40, "path": "/courses/24651/sections/401/reviews/2536-KEVIN-WERBACH", "instructor": {"path": "/instructors/2536-KEVIN-WERBACH", "first_name": "KEVIN", "last_name": "WERBACH", "id": "2536-KEVIN-WERBACH", "name": "KEVIN WERBACH"}, "num_reviewers": 28, "id": "24651-401-2536-KEVIN-WERBACH"}]}, "credits": null, "primary_alias": "LGST-640", "path": "/courses/24651", "sections": {"path": "/courses/24651/sections", "values": [{"name": "DIGITAL GAME TECHNIQUES: Digital Game Design Techniques For Business:Rules, Incentives, Applications", "sectionnum": "401", "primary_alias": "LGST-640-401", "path": "/courses/24651/sections/401", "id": "24651-401", "aliases": ["LGST-640-401", "OPIM-640-401"]}]}, "id": 24651, "aliases": ["LGST-640", "OPIM-640"]}