{"coursehistories": {"path": "/coursehistories/871"}, "description": "This course provides an introduction to some of the fundamental ideas of logic. Topics will include truth functional logic, quantificational logic, and logical decision problems. \n\n", "semester": "2010A", "name": "FORMAL LOGIC I", "reviews": {"path": "/courses/26596/reviews", "values": [{"ratings": {"rAmountLearned": "2.75", "rDifficulty": "3.64", "rStimulateInterest": "2.29", "rRecommendMajor": "3.07", "rCourseQuality": "2.44", "rWorkRequired": "2.93", "rInstructorAccess": "3.29", "rReadingsValue": "1.36", "rRecommendNonMajor": "1.39", "rCommAbility": "1.71", "rInstructorQuality": "2.44"}, "section": {"name": "FORMAL LOGIC I", "sectionnum": "401", "primary_alias": "PHIL-005-401", "path": "/courses/26596/sections/401", "id": "26596-401", "aliases": ["PHIL-005-401", "PHIL-505-401", "LGIC-010-401"]}, "comments": "This is an introductory course in the fundamentals of formal logic. It covers ideas about truth, functional logic, quantificational logic, and logical decision problems. The course covers sections 1-41 in Warren Goldfarb's book, Deductive Logic, with supplementary material provided through lecture notes. This course may be counted as a Formal Reasoning course.\r\n\r\nStudents described PHIL005 as “useful in [their] critical thinking abilities” and “worthwhile,” but a common mantra in their comments was that the course was “very challenging.” They felt the lectures were occasionally “disorganized and confusing” and that there was a lack of outside material like lecture slides or outlines.\r\n\r\nThere can be no doubt that Professor Weinstein is dedicated to his students. Almost very comment mentioned something about how he is “committed to the understanding of his students,” “extremely willing to help you understand the content,” or his rapport with the students. However, one student summed up the thoughts of others: “he's not for everyone.” Students say that sometimes Professor Weinstein often has difficulty communicating the subject matter, though he knows the material “frighteningly well.” The TAs were invaluable in explaining the material, and many students professed that might not have passed the class without them.\r\n\r\nThis course is definitely very challenging and moves quickly. Students mentioned the review sessions and office hours “are nearly obligatory” and that they are the only way to finish homework. Quite a few students were taking this class as a requisite for a philosophy major or minor, and many were upperclassmen.", "num_students": 40, "path": "/courses/26596/sections/401/reviews/946-SCOTT-WEINSTEIN", "instructor": {"path": "/instructors/946-SCOTT-WEINSTEIN", "first_name": "SCOTT", "last_name": "WEINSTEIN", "id": "946-SCOTT-WEINSTEIN", "name": "SCOTT WEINSTEIN"}, "num_reviewers": 33, "id": "26596-401-946-SCOTT-WEINSTEIN"}]}, "credits": null, "primary_alias": "PHIL-005", "path": "/courses/26596", "sections": {"path": "/courses/26596/sections", "values": [{"name": "FORMAL LOGIC I", "sectionnum": "401", "primary_alias": "PHIL-005-401", "path": "/courses/26596/sections/401", "id": "26596-401", "aliases": ["PHIL-005-401", "PHIL-505-401", "LGIC-010-401"]}]}, "id": 26596, "aliases": ["PHIL-005", "PHIL-505", "LGIC-010"]}