[{"ratings": {"rAmountLearned": "3.55", "rDifficulty": "3.06", "rStimulateInterest": "3.48", "rRecommendMajor": "3.82", "rCourseQuality": "3.45", "rWorkRequired": "3.13", "rInstructorAccess": "3.58", "rReadingsValue": "2.88", "rRecommendNonMajor": "2.58", "rCommAbility": "3.58", "rInstructorQuality": "3.55"}, "section": {"name": "FIN & ECON TIME SERIES", "sectionnum": "001", "primary_alias": "STAT-434-001", "path": "/courses/23837/sections/001", "id": "23837-001", "aliases": ["STAT-434-001"]}, "comments": "This course will introduce students to the time series methods and practices that are most relevant to the analysis of financial and economic data. After an introduction to the statistical programming language S-Plus the course develops autoregressive models, moving average models, and their generalizations. The course then develops models that are closely focused on particular features of financial series such as the challenges of time dependent volatility.\r\n\r\nStudents seemed to love this class in which, “every seat was filled every single day.” The class was valuable in teaching the basics of programming and financial markets and applying them to real-life scenarios. This class was described as “wonderful” and “undoubtedly the best class at Penn.” The lectures were described as laid-back and informative.\r\n\r\nStudents also seemed to find Professor Steele extremely “engaging and helpful.” They stated, “professors should strive to be more like Professor Steele who makes the material interesting.” He was described as “knowledgeable” and “motivational.”\r\n\r\nStudents recommended this class to all Wharton and Engineering students. The homework was straightforward, but students wished more time was spent reviewing and that there was less uncertainty about the final grades.\r\n", "num_students": 40, "path": "/courses/23837/sections/001/reviews/1750-J--MICHAEL-STEELE", "instructor": {"path": "/instructors/1750-J--MICHAEL-STEELE", "first_name": "J. MICHAEL", "last_name": "STEELE", "id": "1750-J--MICHAEL-STEELE", "name": "J. MICHAEL STEELE"}, "num_reviewers": 40, "id": "23837-001-1750-J--MICHAEL-STEELE"}]