{"coursehistories": {"path": "/coursehistories/2031"}, "description": "The conceptual and practice application of brain-behavior relationships for individuals with mental health and psychiatric conditions is developed in this course. Students learn interview and differential diagnostic skills toscreen for neuropsychological etiologies of mental disorders such as schizophrenia, bipolar disorders, mood disorders and anxiety disorders. The course reviews specific theories of etiology and diagnostic classifications found in the Diagnostic and Statistical Manual of Mental Disorders-Fourth Edition- Text Revision (DSM IV- TR). Students develop the ability to make critical decisions as they learn finer points of differentiial diagnosing of mental disorders using a case based method of learning, allowing students to focus on specific populations such as aged, adults, adolescents, anchildren. \n\n", "semester": "2010C", "name": "PATHOGENESIS OF MENTAL DISORDERS ACROSS THE LIFESPAN", "reviews": {"path": "/courses/23553/reviews", "values": [{"ratings": {"rAmountLearned": "3.93", "rDifficulty": "3.14", "rStimulateInterest": "3.14", "rRecommendMajor": "4.00", "rCourseQuality": "3.67", "rWorkRequired": "3.50", "rInstructorAccess": "3.43", "rReadingsValue": "2.77", "rRecommendNonMajor": "2.36", "rCommAbility": "3.43", "rInstructorQuality": "3.33"}, "section": {"name": "PATHOGENESIS OF MENTAL DISORDERS ACROSS THE LIFESPAN", "sectionnum": "001", "primary_alias": "NURS-622-001", "path": "/courses/23553/sections/001", "id": "23553-001", "aliases": ["NURS-622-001"]}, "comments": "The conceptual and practice application of brain-behavior relationships for individuals with mental health and psychiatric conditions is developed in this course. Students learn interview and differential diagnostic skills to screen for neuropsychological etiologies of mental disorders such as schizophrenia, bipolar disorders, mood disorders and anxiety disorders. The course reviews specific theories of etiology and diagnostic classifications found in the Diagnostic and Statistical Manual of Mental Disorders-Fourth Edition- Text Revision (DSM IV- TR). Students develop the ability to make critical decisions as they learn finer points of differential diagnosing of mental disorders using a case based method of learning, allowing students to focus on specific populations such as aged, adults, adolescents, and children.\r\n\r\nStudents generally felt that they gained a lot from the structure of the course and the material presented. The course was described as “very beneficial.” Some students agreed that “this was the best course I’ve taken at Penn.” However, some felt that discussions of the case studies were a bit drawn out and could have been summarized for easier understanding.\r\n\r\nSome students felt that the professor was “refreshing.” Most students appreciated the knowledge gained as a result of course. However, some noted that it would have been beneficial if the professor gave more lectures on “the biology and treatment for the disorders.” Another student commented that “quicker summaries of the case studies would have sufficed.”\r\n\r\nMost students felt that the tests for this course were difficult, and some students reported having trouble preparing for them. Many students indicated that the course required a substantial time commitment in order to complete the work and succeed. Comments included that regardless of the difficulty, it was a “great class.” One student commented that the course “definitely helped me feel more confident and knowledgeable at my clinical site.”\r\n", "num_students": 16, "path": "/courses/23553/sections/001/reviews/893-NANCY-C-TKACS", "instructor": {"path": "/instructors/893-NANCY-C-TKACS", "first_name": "NANCY C", "last_name": "TKACS", "id": "893-NANCY-C-TKACS", "name": "NANCY C TKACS"}, "num_reviewers": 15, "id": "23553-001-893-NANCY-C-TKACS"}, {"ratings": {"rAmountLearned": "3.93", "rDifficulty": "3.14", "rStimulateInterest": "3.71", "rRecommendMajor": "4.00", "rCourseQuality": "3.67", "rWorkRequired": "3.50", "rInstructorAccess": "3.93", "rReadingsValue": "2.77", "rRecommendNonMajor": "2.36", "rCommAbility": "3.50", "rInstructorQuality": "3.67"}, "section": {"name": "PATHOGENESIS OF MENTAL DISORDERS ACROSS THE LIFESPAN", "sectionnum": "001", "primary_alias": "NURS-622-001", "path": "/courses/23553/sections/001", "id": "23553-001", "aliases": ["NURS-622-001"]}, "comments": "", "num_students": 16, "path": "/courses/23553/sections/001/reviews/3131-NANCY-P-HANRAHAN", "instructor": {"path": "/instructors/3131-NANCY-P-HANRAHAN", "first_name": "NANCY P", "last_name": "HANRAHAN", "id": "3131-NANCY-P-HANRAHAN", "name": "NANCY P HANRAHAN"}, "num_reviewers": 15, "id": "23553-001-3131-NANCY-P-HANRAHAN"}]}, "credits": null, "primary_alias": "NURS-622", "path": "/courses/23553", "sections": {"path": "/courses/23553/sections", "values": [{"name": "PATHOGENESIS OF MENTAL DISORDERS ACROSS THE LIFESPAN", "sectionnum": "001", "primary_alias": "NURS-622-001", "path": "/courses/23553/sections/001", "id": "23553-001", "aliases": ["NURS-622-001"]}]}, "id": 23553, "aliases": ["NURS-622"]}