[{"ratings": {"rAmountLearned": "2.90", "rDifficulty": "2.73", "rStimulateInterest": "3.01", "rRecommendMajor": "3.58", "rCourseQuality": "2.90", "rWorkRequired": "2.24", "rInstructorAccess": "3.05", "rReadingsValue": "2.48", "rRecommendNonMajor": "2.79", "rCommAbility": "3.09", "rInstructorQuality": "3.14"}, "section": {"name": "INTRO TO MICRO", "sectionnum": "001", "primary_alias": "ECON-001-001", "path": "/courses/24261/sections/001", "id": "24261-001", "aliases": ["ECON-001-001"]}, "comments": "Economics 001 is an introduction to economic analysis and its application. Theory of supply and demand, costs and revenues of the firm under perfect competition, monopoly and oligopoly, pricing of factors of production, income distribution, and theory of international trade are studied. \r\n\r\nOverall, a majority of students seemed to enjoy this “challenging, but very informative and stimulating” class. Many commented that “everyone should take an intro Economics course” because the knowledge is so useful and applicable. While students felt that a lot of effort needed to be put in to do well in this class, they felt that the grades reflected effort and that the knowledge gained was definitely practical. Some students felt the exams were tricky and “contained subtleties” that were not presented in lecture. Overall, most students stated that this was one of their favorite classes at Penn.\r\n\r\nProfessor Stein was described as “extremely engaging” and a “ball of energy.” She made the material, which could be somewhat dry, applicable to the real world and exciting to learn. It was noted that Professor Stein enjoys “challenging her students,” and thus expects a lot from them. Regardless, students were overwhelming positive in their reviews of her. Viewed as “phenomenal, helpful, and interesting,” many students recommend this course simply because of her. Some students did say that sometimes she was “vague and ambiguous” in what she specifically wanted you to know.\r\n\r\nStudents recommend this course to everyone, because it is a good introduction to microeconomics and has many real world applications that students found to be “useful in daily life.” The tests were seen as more difficult than the material presented, but overall, students really enjoyed this class.\r\n", "num_students": 225, "path": "/courses/24261/sections/001/reviews/319-REBECCA-STEIN", "instructor": {"path": "/instructors/319-REBECCA-STEIN", "first_name": "REBECCA", "last_name": "STEIN", "id": "319-REBECCA-STEIN", "name": "REBECCA STEIN"}, "num_reviewers": 207, "id": "24261-001-319-REBECCA-STEIN"}, {"ratings": {"rAmountLearned": "2.98", "rDifficulty": "2.81", "rStimulateInterest": "3.12", "rRecommendMajor": "3.69", "rCourseQuality": "2.96", "rWorkRequired": "2.29", "rInstructorAccess": "3.11", "rReadingsValue": "2.34", "rRecommendNonMajor": "2.76", "rCommAbility": "3.19", "rInstructorQuality": "3.21"}, "section": {"name": "INTRO TO MICRO", "sectionnum": "002", "primary_alias": "ECON-001-002", "path": "/courses/24261/sections/002", "id": "24261-002", "aliases": ["ECON-001-002"]}, "comments": "Economics 001 offers an introduction to economic analysis and its application. This course deals primarily with microeconomics. Theory of supply and demand, costs and revenues of the firm under perfect competition, monopoly and oligopoly, pricing of factors of production, income distribution, and theory of international trade will be discussed.\r\n\r\nOverall, students really enjoyed Professor Stein's lectures, which were described as \"informative,\" \"entertaining,\" and \"engaging.\" Students appreciated the interactive nature of the lectures and Professor Stein's clear presentation of the material.       \r\n\r\nStudents heaped praise on Professor Stein. Students admired her \"ability to stimulate student interest\" and her enthusiasm for the material. One student reported that \"her energy and enthusiasm for economics was infectious.\" Professor Stein was also accessible and willing to meet with students out of class. \r\n\r\nMany students reported that this course was \"a great introduction to economics.\" They agreed that this is a worthwhile course to take even if you are not a major.  However, some students reported that the course was very difficult.  Numerous students warned that the exam questions were much more difficult than those discussed in lecture. This course fulfills the Society Sector.\r\n", "num_students": 236, "path": "/courses/24261/sections/002/reviews/319-REBECCA-STEIN", "instructor": {"path": "/instructors/319-REBECCA-STEIN", "first_name": "REBECCA", "last_name": "STEIN", "id": "319-REBECCA-STEIN", "name": "REBECCA STEIN"}, "num_reviewers": 226, "id": "24261-002-319-REBECCA-STEIN"}, {"ratings": {"rAmountLearned": "3.14", "rDifficulty": "2.74", "rStimulateInterest": "3.11", "rRecommendMajor": "3.70", "rCourseQuality": "3.02", "rWorkRequired": "2.14", "rInstructorAccess": "3.17", "rReadingsValue": "2.47", "rRecommendNonMajor": "2.91", "rCommAbility": "3.19", "rInstructorQuality": "3.27"}, "section": {"name": "INTRO TO MICRO", "sectionnum": "003", "primary_alias": "ECON-001-003", "path": "/courses/24261/sections/003", "id": "24261-003", "aliases": ["ECON-001-003"]}, "comments": "Economics 001 introduces students to microeconomics, with respect to the techniques and application of economic analysis. Students will learn about the theory of supply and demand, costs and revenues of firms in particular markets, pricing factors of production, income distribution, theory of international trade, and market types such as perfect competition, monopoly, and oligopoly. \r\n\r\nThe majority of students applauded the interesting and varied content of the course. Many students noted the “large array of material covered,” but considered the material well presented and manageable. Several students, however, cautioned that practice problems and tangential concepts were difficult to master. Overall, most students appreciated the perspective that the class offered. \r\n\r\nProfessor Stein was highly praised by most students. Many students appreciated Professor Stein’s ability to “stimulate student interest” and “present material in a clear, logical manner.” Several students appreciated that Professor Stein “is always available,” but “is not the type to coddle you.” One student found it particularly impressive that Professor Stein attempted to learn many of the students’ names in a large lecture course. A majority of students found Professor Stein to be both engaging and fair.\r\n\r\nFor many students, this was their first course in Economics. Nevertheless, several students cited previous introductions to Economics, such as AP classes, as advantageous. In general, the assessments proved “difficult,” but fairly graded. Many students would recommend both the course and Professor Stein to others.\r\n", "num_students": 223, "path": "/courses/24261/sections/003/reviews/319-REBECCA-STEIN", "instructor": {"path": "/instructors/319-REBECCA-STEIN", "first_name": "REBECCA", "last_name": "STEIN", "id": "319-REBECCA-STEIN", "name": "REBECCA STEIN"}, "num_reviewers": 208, "id": "24261-003-319-REBECCA-STEIN"}, {"ratings": {"rAmountLearned": "2.65", "rDifficulty": "2.65", "rStimulateInterest": "1.22", "rRecommendMajor": "2.91", "rCourseQuality": "1.86", "rWorkRequired": "2.52", "rInstructorAccess": "2.17", "rReadingsValue": "2.48", "rRecommendNonMajor": "2.83", "rCommAbility": "2.22", "rInstructorQuality": "1.89"}, "section": {"name": "Introductory Economics: Micro", "sectionnum": "601", "primary_alias": "ECON-001-601", "path": "/courses/24261/sections/601", "id": "24261-601", "aliases": ["ECON-001-601"]}, "comments": "", "num_students": 37, "path": "/courses/24261/sections/601/reviews/4648-AARON-D--HEDLUND", "instructor": {"path": "/instructors/4648-AARON-D--HEDLUND", "first_name": "AARON D.", "last_name": "HEDLUND", "id": "4648-AARON-D--HEDLUND", "name": "AARON D. HEDLUND"}, "num_reviewers": 29, "id": "24261-601-4648-AARON-D--HEDLUND"}]