{"coursehistories": {"path": "/coursehistories/4478"}, "description": "Engineers and scientists create and lead great companies, hiring managers when and where needed to help execute their vision. Designed expressly for students having a keen interest in technological innovation, this course investigates the roles of inventors and founders in successful technology ventures. Through case studies and guest speakers, we introduce the knowledge and skills needed to recognize and seize a high-tech entrepreneurial opportunity - be it a product or service - and then successfully launch a startup or spin-off company. The course studies key areas of intellectual property, its protection and strategic value; opportunity analysis and concept testing; shaping technology driven inventions into customer-driven products; constructing defensible competitive strategies; acquiring resources in the form of capital, people and strategic partners; and the founder's leadership role in an emerging high-tech company. Throughout the course emphasis is placed on decisions faced by founders, and on the sequential risks and determinants of success in the early growth phase of a technology venture. The course is designed for, but not restricted to, students of engineering and applied science and assumes no prior business education. \n\n", "semester": "2009C", "name": "ENG ENTREPRENEURSHIP I", "reviews": {"path": "/courses/17203/reviews", "values": [{"ratings": {"rAmountLearned": "3.36", "rDifficulty": "2.62", "rStimulateInterest": "3.47", "rRecommendMajor": "3.56", "rCourseQuality": "3.45", "rWorkRequired": "3.49", "rInstructorAccess": "3.15", "rReadingsValue": "3.38", "rRecommendNonMajor": "3.41", "rCommAbility": "3.72", "rInstructorQuality": "3.57"}, "section": {"name": "ENG ENTREPRENEURSHIP I", "sectionnum": "001", "primary_alias": "EAS-545-001", "path": "/courses/17203/sections/001", "id": "17203-001", "aliases": ["EAS-545-001"]}, "comments": "Part 1 of Engineering Entrepreneurship introduces the knowledge and skills needed to recognize and seize a high-tech entrepreneurial opportunity and then successfully launch a startup or spin-off company. The course investigates the roles of inventors and founders in successful technology ventures while also studying key areas such as intellectual property, opportunity analysis and concept testing, construction of defensible competitive strategies, acquisition of resources, and founder’s leadership role in an emerging high-tech company. Emphasis is placed on decisions faced by founders and on the sequential risks and determinants of success in the early growth phase of technology venture. \r\n\r\nThe course provides an excellent introduction to both entrepreneurship and business and is designed for engineering students with prior business education. Students were “taught a huge quantity and breadth of knowledge” that “would be really useful to any engineer with ambition.” Although an EAS course, the material bridges science and technology to the practical realities of the business world. \r\n\r\nGenerally, students praised Professor Babin, describing his lectures as “stimulating,” “interesting” and “interactive.” One student even stated “Professor Babin was one of the best lecturers I’ve had.” Students commented Professor Babin cared about his students and was always willing to help, but one student pointed out he was impossible to reach via email. \r\n\r\nOverall, students found the course stimulating though work intensive. While the readings were “amazing,” some reported the weekly quizzes and papers became burdens and unnecessary ways to force students to do the readings. Class participation was a large portion of the grade, resulting in many students asking irrelevant questions and delaying class time. This course is open to those of junior or higher standing. \r\n", "num_students": 47, "path": "/courses/17203/sections/001/reviews/1595-JEFFREY-A--BABIN", "instructor": {"path": "/instructors/1595-JEFFREY-A--BABIN", "first_name": "JEFFREY A.", "last_name": "BABIN", "id": "1595-JEFFREY-A--BABIN", "name": "JEFFREY A. BABIN"}, "num_reviewers": 43, "id": "17203-001-1595-JEFFREY-A--BABIN"}, {"ratings": {"rAmountLearned": "3.54", "rDifficulty": "2.78", "rStimulateInterest": "3.59", "rRecommendMajor": "3.80", "rCourseQuality": "3.70", "rWorkRequired": "3.74", "rInstructorAccess": "3.46", "rReadingsValue": "3.67", "rRecommendNonMajor": "3.41", "rCommAbility": "3.74", "rInstructorQuality": "3.72"}, "section": {"name": "ENG ENTREPRENEURSHIP I", "sectionnum": "002", "primary_alias": "EAS-545-002", "path": "/courses/17203/sections/002", "id": "17203-002", "aliases": ["EAS-545-002"]}, "comments": "", "num_students": 51, "path": "/courses/17203/sections/002/reviews/317-THOMAS-A--CASSEL", "instructor": {"path": "/instructors/317-THOMAS-A--CASSEL", "first_name": "THOMAS A.", "last_name": "CASSEL", "id": "317-THOMAS-A--CASSEL", "name": "THOMAS A. CASSEL"}, "num_reviewers": 47, "id": "17203-002-317-THOMAS-A--CASSEL"}]}, "credits": null, "primary_alias": "EAS-545", "path": "/courses/17203", "sections": {"path": "/courses/17203/sections", "values": [{"name": "ENG ENTREPRENEURSHIP I", "sectionnum": "001", "primary_alias": "EAS-545-001", "path": "/courses/17203/sections/001", "id": "17203-001", "aliases": ["EAS-545-001"]}, {"name": "ENG ENTREPRENEURSHIP I", "sectionnum": "002", "primary_alias": "EAS-545-002", "path": "/courses/17203/sections/002", "id": "17203-002", "aliases": ["EAS-545-002"]}]}, "id": 17203, "aliases": ["EAS-545"]}