{"coursehistories": {"path": "/coursehistories/4896"}, "description": "Understanding how diseases disrupt the life of human individuals requires an appreciation of the genetic, biochemical, and cellular mechanisms that underlie normal human biology. After providing some of this basic information, in a form accessible to students in the humanities, social sciences and physical sciences, this course will focus on a selective group of human diseases, including inherited metabolic and neurological disorders, cancer, and viral infections. Presentations by experts in these areas will be followed by sessions discussing various aspects of each disease, including the biological basis of therapies and preventive methods including gene therapy, stem cells, and vaccines. This course is designed for non-majors and is open to both freshmen and upperclassmen. \n\n", "semester": "2011A", "name": "BIOLOGY OF HUMAN DISEASE", "reviews": {"path": "/courses/21343/reviews", "values": [{"ratings": {"rAmountLearned": "2.78", "rDifficulty": "2.48", "rStimulateInterest": "1.81", "rRecommendMajor": "1.59", "rCourseQuality": "2.76", "rWorkRequired": "2.15", "rInstructorAccess": "3.19", "rReadingsValue": "2.48", "rRecommendNonMajor": "2.85", "rCommAbility": "2.04", "rInstructorQuality": "2.24"}, "section": {"name": "BIOLOGY OF HUMAN DISEASE", "sectionnum": "001", "primary_alias": "BIOL-015-001", "path": "/courses/21343/sections/001", "id": "21343-001", "aliases": ["BIOL-015-001"]}, "comments": "Entitled “The Biology of Human Diseases,” this course seeks to provide an understanding as to how diseases disrupt the life of human individuals through an appreciation of the genetic, biochemical, and cellular mechanisms that underlie normal human biology. This course focuses on a selective group of human diseases, including inherited metabolic and neurological disorders, cancer, and viral infections. Presentations by experts in these areas will be followed by sessions discussing various aspects of each disease, including the biological basis of therapies and preventive methods including gene therapy, stem cells, and vaccines. This course cannot be counted towards a biology major or minor.\r\n\r\nBIOL-015 was described by multiple students as very interesting and as one of the few classes that directly relate to the outside world. It also touched on topics that students were interested in. Students especially liked the format of the class, in which guest lecturers routinely came to speak. Hearing from “world-class scientists” kept the students stimulated by the subject matter. One student did comment that bouncing from guest lecturer to guest lecturer sometimes threw off the “fluidity” of the course.\r\n\r\nStudents agreed that Professor Weinberg was very nice and always willing to meet with students to discuss subject matter; he would even take students out to lunch. Professor Weinberg “rewards hard work,” but in terms of his lectures, students felt that sometimes they were “hard to follow.”\r\n\r\nAlthough the class is geared towards non-biology majors, one student commented that the exams were too difficult and too advanced for someone with minimal background in biology. The exams also involve a lot of “memorization” and are very lecture based, thus attending class and taking good notes are necessary.\r\n", "num_students": 36, "path": "/courses/21343/sections/001/reviews/1297-ERIC-S--WEINBERG", "instructor": {"path": "/instructors/1297-ERIC-S--WEINBERG", "first_name": "ERIC S.", "last_name": "WEINBERG", "id": "1297-ERIC-S--WEINBERG", "name": "ERIC S. WEINBERG"}, "num_reviewers": 30, "id": "21343-001-1297-ERIC-S--WEINBERG"}]}, "credits": null, "primary_alias": "BIOL-015", "path": "/courses/21343", "sections": {"path": "/courses/21343/sections", "values": [{"name": "BIOLOGY OF HUMAN DISEASE", "sectionnum": "001", "primary_alias": "BIOL-015-001", "path": "/courses/21343/sections/001", "id": "21343-001", "aliases": ["BIOL-015-001"]}]}, "id": 21343, "aliases": ["BIOL-015"]}