[{"ratings": {"rAmountLearned": "2.72", "rDifficulty": "3.26", "rStimulateInterest": "1.57", "rRecommendMajor": "3.31", "rCourseQuality": "2.13", "rWorkRequired": "3.53", "rInstructorAccess": "2.47", "rReadingsValue": "1.86", "rRecommendNonMajor": "1.72", "rCommAbility": "1.95", "rInstructorQuality": "1.97"}, "section": {"name": "PROG LANG & TECH I", "sectionnum": "001", "primary_alias": "CIS-120-001", "path": "/courses/21444/sections/001", "id": "21444-001", "aliases": ["CIS-120-001"]}, "comments": "A fast-paced introduction to the fundamental concepts of programming and software design. &#8232;&#8232;While many students appreciated Professor Weirich for putting in the effort to make the class better, the majority of the students were frustrated with her choice of teaching OCaml instead of Python as in previous years. Several students were uninterested in learning OCaml or found it difficult to learn “without being taught explicitly about the syntax.” Some more experienced students, however, thought it was a good choice to “level out the playing field” in the intro class and give them new material to expand their programming knowledge. &#8232;&#8232;Students generally considered Professor Weirich a “nice lady” but a “boring” lecturer. A student noted that she was willing to meet but often directed him to the TAs who “really run her class.”  Many students complained about the excessively time-consuming homework assignments, especially considering how little they were worth towards the grade compared to the exams. Students stated that this course assumes some previous programming experience, at the level of a high school computer science class or CIS110. Some commented that those who received at least 4 in the AP Computer Science A or AB exam would be adequately prepared to take the class. No specific programming language background is assumed: basic experience with any language (for instance Java, C, C++, VB, Python, Perl, or Scheme) is fine. It is recommended that those who have never programmed before take CIS 110 before taking this course.", "num_students": 141, "path": "/courses/21444/sections/001/reviews/1820-STEPHANIE-WEIRICH", "instructor": {"path": "/instructors/1820-STEPHANIE-WEIRICH", "first_name": "STEPHANIE", "last_name": "WEIRICH", "id": "1820-STEPHANIE-WEIRICH", "name": "STEPHANIE WEIRICH"}, "num_reviewers": 130, "id": "21444-001-1820-STEPHANIE-WEIRICH"}]