{"coursehistories": {"path": "/coursehistories/5424"}, "description": "The author of a New York Times article entitled \"On Being Male, Female, Neither or Both\" concluded her comments with the following statement: \"The definition of sex was (and is) still up for grabs.\" In our post-modern world, we have become accustomed to the malleability of gender identity and sexuality. We are also aware that individuals undergo sex reassignment surgeries but by and large we assume that transgender people are transitioning from one discrete category to another. Queer activists certainly challenge this assumption, preferring to envision sex, gender, and sexuality on a continuum, but these days even scientists don't concur about a definitive definition of sex. Should sex be defined chiefly by anatomy? Chromosomes? The body's ability to produce and respond to hormones? If the boundaries of biological categories can be contested, what are the implications for culturally constructed ideas about gender identity and sexulatity. \n\nIn this course, we will examine the scientific study of sex and sexuality, and ask how these ostensibly objective inquiries have both influenced and been effected by changing cultural definitions of gender and sexuality. How, for example, can we account for our culture's compulsion for identifying the genetic bases of behavior while at the same time recognize society's increased acceptance of individuals' insistence on self-definition? What are the political and social implications of some gay right advocates' claim to \"being born that way\"? Though our course will mainly focus on state of these debates in 21st century America, we will trace the historical antecedents that brought us to this juncture. Our readings, therefore, will range from Aristotle's musings on the nature of sex to Victorians' anxious fascination with alleged hermaphrodites to current biomedical research on the gay gene. \n\n", "semester": "2012A", "name": "SCI OF SEX & SEXUALITY", "reviews": {"path": "/courses/27521/reviews", "values": [{"ratings": {"rAmountLearned": "3.53", "rDifficulty": "2.63", "rStimulateInterest": "3.71", "rRecommendMajor": "3.82", "rCourseQuality": "3.47", "rWorkRequired": "2.88", "rInstructorAccess": "3.71", "rReadingsValue": "3.13", "rRecommendNonMajor": "3.29", "rCommAbility": "3.82", "rInstructorQuality": "3.82"}, "section": {"name": "SCI OF SEX & SEXUALITY", "sectionnum": "401", "primary_alias": "GSWS-242-401", "path": "/courses/27521/sections/401", "id": "27521-401", "aliases": ["GSWS-242-401", "HSOC-242-401", "STSC-242-401"]}, "comments": "", "num_students": 20, "path": "/courses/27521/sections/401/reviews/3206-SHANNON-B--LUNDEEN", "instructor": {"path": "/instructors/3206-SHANNON-B--LUNDEEN", "first_name": "SHANNON B.", "last_name": "LUNDEEN", "id": "3206-SHANNON-B--LUNDEEN", "name": "SHANNON B. LUNDEEN"}, "num_reviewers": 17, "id": "27521-401-3206-SHANNON-B--LUNDEEN"}]}, "credits": null, "primary_alias": "GSWS-242", "path": "/courses/27521", "sections": {"path": "/courses/27521/sections", "values": [{"name": "SCI OF SEX & SEXUALITY", "sectionnum": "401", "primary_alias": "GSWS-242-401", "path": "/courses/27521/sections/401", "id": "27521-401", "aliases": ["GSWS-242-401", "HSOC-242-401", "STSC-242-401"]}]}, "id": 27521, "aliases": ["GSWS-242", "HSOC-242", "STSC-242"]}