[{"ratings": {"rAmountLearned": "2.31", "rDifficulty": "2.48", "rStimulateInterest": "2.53", "rRecommendMajor": "3.56", "rCourseQuality": "2.31", "rWorkRequired": "3.05", "rInstructorAccess": "2.77", "rReadingsValue": "1.96", "rRecommendNonMajor": "0.76", "rCommAbility": "2.69", "rInstructorQuality": "2.63"}, "section": {"name": "SENIOR DESIGN PROJECT", "sectionnum": "001", "primary_alias": "BE-495-001", "path": "/courses/24036/sections/001", "id": "24036-001", "aliases": ["BE-495-001"]}, "comments": "This course focuses on the development of design projects in various areas of\r\nbioengineering; projects are chosen by the students with approval of the instructor in the\r\nSpring semester of the Junior year; a project brief, interim reports, a final report, and a\r\npresentation are required. Also emphasized are report writing, scheduling, project risk\r\nassessment, multidisciplinary environments and ethics.\r\nStudents praised the “design process associated with the course,” as it\r\n“[encouraged] all students to think creatively and practically in achieving project goals.”\r\nThe assignments were useful, while also “adequately [preparing students] for writing\r\n[the] final paper.” Conversely, the class lectures received strong criticism, and were said\r\nto be “boring and unhelpful.” One student suggested replacing the lecture material with\r\ninstruction on “design software, machine shop, [and] mechanical design concepts.”\r\nOne student wrote that the instructors had “finally arrived at a format which\r\nmaximizes the usefulness of the course,” a sentiment echoed by many others in the class.\r\nHowever, another student found that he did not “gain much from the instructors’\r\ncommunication.” One respondent complained that the instructors went “out of their way”\r\nto make lecture attendance mandatory.\r\nThis class is taken by senior year students in Bioengineering as the first semester\r\nof the senior design requirement for engineering degrees. Students appreciated the\r\n“reduced workload” in the course as compared to assignments in previous years,\r\nespecially the decrease in “busywork.” One person felt that the course could be difficult\r\nif the group’s chosen project did not perfectly fit into a “certain set of criteria,” leading to\r\ncriticism from TAs simply because “it doesn’t fit into the BE senior design mold.”", "num_students": 92, "path": "/courses/24036/sections/001/reviews/1795-BETH-A--WINKELSTEIN", "instructor": {"path": "/instructors/1795-BETH-A--WINKELSTEIN", "first_name": "BETH A.", "last_name": "WINKELSTEIN", "id": "1795-BETH-A--WINKELSTEIN", "name": "BETH A. WINKELSTEIN"}, "num_reviewers": 86, "id": "24036-001-1795-BETH-A--WINKELSTEIN"}, {"ratings": {"rAmountLearned": "2.31", "rDifficulty": "2.48", "rStimulateInterest": "2.65", "rRecommendMajor": "3.56", "rCourseQuality": "2.31", "rWorkRequired": "3.05", "rInstructorAccess": "3.28", "rReadingsValue": "1.96", "rRecommendNonMajor": "0.76", "rCommAbility": "2.89", "rInstructorQuality": "3.04"}, "section": {"name": "SENIOR DESIGN PROJECT", "sectionnum": "001", "primary_alias": "BE-495-001", "path": "/courses/24036/sections/001", "id": "24036-001", "aliases": ["BE-495-001"]}, "comments": "In this course, students design projects in various areas of bioengineering. The\r\nprojects are chosen by the students with approval of the instructor in the Spring semester\r\nof the junior year. Project briefings, interim reports, a final report, and a presentation are\r\nrequired to complete this course. Report writing, scheduling, project risk assessment,\r\nmultidisciplinary environments and ethics are emphasized throughout this course.\r\nStudents for the most part enjoyed the design process and freedom associated with\r\nthis course. Most felt that these features “did a really good job at encouraging all students\r\nto think creatively.” Students, however, expressed that the lecture format of the course\r\nneeded restructuring.\r\nMost of the students that took this course felt that Professor Rizk needed to better\r\ncommunicate concepts and course material during lecture. Some expressed that lectures\r\nwere not as interactive as they would have hoped. However, several students did note that\r\nProfessor Rizk’s assignments “adequately” prepared them for writing the final paper.\r\nThis course is required for senior-level Bioengineering majors.", "num_students": 92, "path": "/courses/24036/sections/001/reviews/4750-MICHAEL-RIZK", "instructor": {"path": "/instructors/4750-MICHAEL-RIZK", "first_name": "MICHAEL", "last_name": "RIZK", "id": "4750-MICHAEL-RIZK", "name": "MICHAEL RIZK"}, "num_reviewers": 86, "id": "24036-001-4750-MICHAEL-RIZK"}, {"ratings": {"rAmountLearned": "2.31", "rDifficulty": "2.48", "rStimulateInterest": "2.50", "rRecommendMajor": "3.56", "rCourseQuality": "2.31", "rWorkRequired": "3.05", "rInstructorAccess": "3.10", "rReadingsValue": "1.96", "rRecommendNonMajor": "0.76", "rCommAbility": "2.63", "rInstructorQuality": "2.83"}, "section": {"name": "SENIOR DESIGN PROJECT", "sectionnum": "001", "primary_alias": "BE-495-001", "path": "/courses/24036/sections/001", "id": "24036-001", "aliases": ["BE-495-001"]}, "comments": "Design projects in various areas of bioengineering; projects are chosen by the\r\nstudents with approval of the instructor in the Spring semester of the Junior year; a\r\nproposal, three interim reports, a final report, and a presentation are required. Also\r\nemphasized are proposal and report writing, scheduling, project risk assessment,\r\nmultidisciplinary environments and ethics.\r\nStudents felt that the new structure of the course made it much more useful. They\r\nwere “happy with the reduced workload” and amounts of busywork. However, the\r\nmajority of students felt that the lectures were “not helpful” and “unnecessary.” Many\r\nrecommended holding lectures less often and focusing more on using design software\r\ninstead.\r\nGenerally, students appreciated Professor Salinas’ willingness to communicate\r\nabout their projects. Some students commented that she should relax the “strict and\r\nseemingly arbitrary guidelines” for their projects.\r\nAs a senior project class, this course is required for Bioengineering majors.", "num_students": 92, "path": "/courses/24036/sections/001/reviews/5290-CHELSEA-N-SALINAS", "instructor": {"path": "/instructors/5290-CHELSEA-N-SALINAS", "first_name": "CHELSEA N", "last_name": "SALINAS", "id": "5290-CHELSEA-N-SALINAS", "name": "CHELSEA N SALINAS"}, "num_reviewers": 86, "id": "24036-001-5290-CHELSEA-N-SALINAS"}]