{"coursehistories": {"path": "/coursehistories/4929"}, "description": "Statistical techniques and quantitative reasoning are essential tools for properly examining crime and justice policy. Using case studies of highly controversial issues, appropriate statistical techniques and sound quantitative reasoning are addressed. Case studies can include the death penalty, racial profiling, human trafficking, DNA identification, sentencing guidelines, drug testing, war crimes, ballistic analyses from the JFK assassination, and others. The statistical procedures discussed overlap significantly with those covered in an introductory statistics course. Criminology 150 has been approved for the quantitative data analysis requirement (QDA). \n\n", "semester": "2011A", "name": "EVIDENCED BASED CRIME AND JUSTICE POLICY", "reviews": {"path": "/courses/21512/reviews", "values": [{"ratings": {"rAmountLearned": "2.70", "rDifficulty": "2.89", "rStimulateInterest": "2.10", "rRecommendMajor": "3.25", "rCourseQuality": "2.48", "rWorkRequired": "2.00", "rInstructorAccess": "2.84", "rReadingsValue": "2.65", "rRecommendNonMajor": "1.80", "rCommAbility": "2.85", "rInstructorQuality": "2.75"}, "section": {"name": "EVIDENCED BASED CRIME AND JUSTICE POLICY", "sectionnum": "001", "primary_alias": "CRIM-150-001", "path": "/courses/21512/sections/001", "id": "21512-001", "aliases": ["CRIM-150-001"]}, "comments": "This course focuses on Statistical techniques and quantitative reasoning, which are essential tools for properly examining crime and justice policy. Using case studies of highly controversial issues, appropriate statistical techniques and sound quantitative reasoning are addressed. Case studies can include the death penalty, racial profiling, human trafficking, DNA identification, sentencing guidelines, drug testing, war crimes, ballistic analyses from the JFK assassination, and others. The statistical procedures discussed overlap significantly with those covered in an introductory statistics course. &#8232;&#8232;Students with previous experience in statistics, such as STAT111, felt that this course was mainly a review of statistical analysis but in a different light. However, other students found the material difficult to understand especially since there was no textbook for the course.&#8232;&#8232;Students reported that Professor Berk was very knowledgeable about his subject. However, some students commented that he was unclear in explaining his expectations for assignments. Additionally, some students wrote that the professor seemed unwilling to answer students’ questions outside of class.&#8232;&#8232;Students with previous experience in statistics found this course easy. This course may be used to satisfy the Quantitative Data Analysis requirement.", "num_students": 26, "path": "/courses/21512/sections/001/reviews/3928-RICHARD-A--BERK", "instructor": {"path": "/instructors/3928-RICHARD-A--BERK", "first_name": "RICHARD A.", "last_name": "BERK", "id": "3928-RICHARD-A--BERK", "name": "RICHARD A. BERK"}, "num_reviewers": 25, "id": "21512-001-3928-RICHARD-A--BERK"}]}, "credits": null, "primary_alias": "CRIM-150", "path": "/courses/21512", "sections": {"path": "/courses/21512/sections", "values": [{"name": "EVIDENCED BASED CRIME AND JUSTICE POLICY", "sectionnum": "001", "primary_alias": "CRIM-150-001", "path": "/courses/21512/sections/001", "id": "21512-001", "aliases": ["CRIM-150-001"]}]}, "id": 21512, "aliases": ["CRIM-150"]}