[{"ratings": {"rAmountLearned": "2.06", "rDifficulty": "1.50", "rStimulateInterest": "1.69", "rRecommendMajor": "2.02", "rCourseQuality": "1.94", "rWorkRequired": "1.56", "rInstructorAccess": "2.60", "rReadingsValue": "1.52", "rRecommendNonMajor": "2.15", "rCommAbility": "2.33", "rInstructorQuality": "2.29"}, "section": {"name": "ENERGY,OIL&GLOBAL WARMIN", "sectionnum": "001", "primary_alias": "PHYS-016-001", "path": "/courses/20687/sections/001", "id": "20687-001", "aliases": ["PHYS-016-001"]}, "comments": "Physics 016 looks at energy production in the 21st century, considering the environmental consequences of global dependence on fossil fuels. Students are exposed to the physical principles of energy production and consumption, as well as the physics and technology behind alternative energy sources, including biomass, solar, hydro and nuclear power. The course may involve field trips to power plants.\r\n\r\nMany students said they enjoyed the class but felt it was highly disorganized. A few students thought the class was excellent and that the professor was an awesome lecturer. Many complained about the lack of syllabus in the class and thought that the two 10-page papers assigned in the last two weeks of school were “not fair.” Some students also felt that grades were “arbitrarily assigned,” and that there was “very little feedback” on student performance even in the last weeks of the course. Assignments and grades were not returned until very late in the course.\r\n\r\nThis course is designed for students hailing from non-science backgrounds. No previous experience with physics or science is assumed. The class fulfills the Natural Science and Mathematics requirement in the College curriculum.", "num_students": 84, "path": "/courses/20687/sections/001/reviews/1672-KENNETH-LANDE", "instructor": {"path": "/instructors/1672-KENNETH-LANDE", "first_name": "KENNETH", "last_name": "LANDE", "id": "1672-KENNETH-LANDE", "name": "KENNETH LANDE"}, "num_reviewers": 52, "id": "20687-001-1672-KENNETH-LANDE"}]