{"coursehistories": {"path": "/coursehistories/929"}, "description": "This course examines the interplay between politics and economics in East Asia. A major course objective is to reconcile the region's past success with the difficulties experienced in many of these countries more recently. Another primary objective is to consider in what ways and to what degree the growth experiences of the high-performing economies in East Asia shed light on the prospects for long-term success of reforms currently underway in China and Vietnam. The first half of the course begins by exploring the causes and consequences of the rise of industrial Asia. The second half of the course examines the challenges to sustained growth faced by many countries in this region in recent years. The course concludes by examining the challenges faced by China and Vietnam today in their attempt to embrace more market-oriented economic systems. \n\n", "semester": "2009A", "name": "POL ECON OF E. ASIA", "reviews": {"path": "/courses/16356/reviews", "values": [{"ratings": {"rAmountLearned": "2.55", "rDifficulty": "2.59", "rStimulateInterest": "2.38", "rRecommendMajor": "2.72", "rCourseQuality": "2.28", "rWorkRequired": "2.63", "rInstructorAccess": "2.16", "rReadingsValue": "2.34", "rRecommendNonMajor": "1.91", "rCommAbility": "2.59", "rInstructorQuality": "2.59"}, "section": {"name": "POL ECON OF E. ASIA", "sectionnum": "401", "primary_alias": "PSCI-214-401", "path": "/courses/16356/sections/401", "id": "16356-401", "aliases": ["PSCI-214-401", "PSCI-514-401", "EALC-104-401", "EALC-504-401"]}, "comments": "This course begins by exploring the causes and consequences of the rise of industrial Asia, paying particular attention to the role played by political institutions. It then examines the political economic challenges faced in recent years by many countries in this region. What explanations may be given for the rapid growth experienced in the region? And, how can we reconcile the success of the past with the difficulties experienced in more recent years? The role of national financial systems in supporting or undermining growth and the politics of financial crisis management and financial system reform will be explored in depth.\r\n\r\nStudents stated that the course was a “tough class to have in an hour” as there was a lot of material to cover in such a short period. Many students complained about the lack of variety as one student stated: “The class was too focused on Japan. Not enough about China” and one student went as far as to say, “if this is truly a course on ‘East Asia’, then it should address all of the countries in East Asia, including the smaller countries.” &#8232;&#8232;\r\n\r\nStudents stated that although Professor Amyx was an interesting teacher, she “often came to class with about 50 lecture slides she wanted to cover” and “in the. our of class we had, we usually only covered 10 slides”. However, Professor Amyx had to leave midway through the semester for a medical leave. The teaching assistants were “inexperienced” and unprepared, according to students. &#8232;\r\nAlthough every review featured a negative aspect because the class was left to the T.A.s after Professor Amyx had to take a medical leave, students complained about the workload. One student stated that “most of the learning was pretty much done on our own, by having to catch up on slides and reading ahead for the next week.”", "num_students": 45, "path": "/courses/16356/sections/401/reviews/1001-JENNIFER-A--AMYX", "instructor": {"path": "/instructors/1001-JENNIFER-A--AMYX", "first_name": "JENNIFER A.", "last_name": "AMYX", "id": "1001-JENNIFER-A--AMYX", "name": "JENNIFER A. AMYX"}, "num_reviewers": 43, "id": "16356-401-1001-JENNIFER-A--AMYX"}]}, "credits": null, "primary_alias": "PSCI-214", "path": "/courses/16356", "sections": {"path": "/courses/16356/sections", "values": [{"name": "POL ECON OF E. ASIA", "sectionnum": "401", "primary_alias": "PSCI-214-401", "path": "/courses/16356/sections/401", "id": "16356-401", "aliases": ["PSCI-214-401", "PSCI-514-401", "EALC-104-401", "EALC-504-401"]}]}, "id": 16356, "aliases": ["PSCI-214", "PSCI-514", "EALC-104", "EALC-504"]}