{"coursehistories": {"path": "/coursehistories/4592"}, "description": "This course will examine the nature and history of the doctor-patient relationship from the era of Hippocrates to the present. The doctor-patient relationship has evolved along side the practice of medicine and its institutions. Historical, cultural, scientific, social and economic forces have impacted it and shaped it into what it is today. As the concepts of health and disease are socially and culturally determined, so has the doctor-patient relationship undergone significant social and cultural change. The place the doctor has held in society, as well as the expectations of both the doctor and the patient have changed dramatically in the last century. In addition, striking advances in science and technology and changes in the delivery of healthcare, particularly in the last half of the 20th century, have shaped the pactice of medicine and by necessity have influenced the relationship between doctor and patient. The course will focus primarily on the evolution of the doctor-patient relationshp over the last century from boththe doctor's and patient's perspective. \n\n", "semester": "2010C", "name": "DOCTOR-PATIENT RELSHIP", "reviews": {"path": "/courses/23253/reviews", "values": [{"ratings": {"rAmountLearned": "2.42", "rDifficulty": "1.58", "rStimulateInterest": "2.47", "rRecommendMajor": "3.37", "rCourseQuality": "2.56", "rWorkRequired": "1.84", "rInstructorAccess": "2.89", "rReadingsValue": "2.32", "rRecommendNonMajor": "2.58", "rCommAbility": "2.84", "rInstructorQuality": "2.80"}, "section": {"name": "DOCTOR-PATIENT RELSHIP", "sectionnum": "301", "primary_alias": "HSOC-351-301", "path": "/courses/23253/sections/301", "id": "23253-301", "aliases": ["HSOC-351-301"]}, "comments": "Almost every student enjoyed this seminar course on doctor-patient relationships calling it “excellent” and “extraordinary.” Another said that, “all of the readings are really insightful and there are enough materials written from different perspectives to really get students thinking.” However a few comments complained that they watched too many movies and “did not spend enough time on discussion of readings and comments.” The same student also said that, “the discussions were too anecdotal.” However, another student said that “the extensive discussion of what it means to be on both sides of the relationship has been a truly eye-opening experience.” &#8232;&#8232;Students raved about Professor Walls calling her a “superb professor” and “down to earth.” Another mentioned that, “Dr. Walls does a phenomenal job at exposing her students to the realities of being a physician as well as a patient.”&#8232;&#8232;Students would recommend this class, especially for anyone considering medical school. As one comment said, “If a student is considering a career in healthcare, this course is a must-take.” &#8232;*Review based on 7 comments", "num_students": 28, "path": "/courses/23253/sections/301/reviews/3014-THERESA-A--WALLS", "instructor": {"path": "/instructors/3014-THERESA-A--WALLS", "first_name": "THERESA A.", "last_name": "WALLS", "id": "3014-THERESA-A--WALLS", "name": "THERESA A. WALLS"}, "num_reviewers": 26, "id": "23253-301-3014-THERESA-A--WALLS"}]}, "credits": null, "primary_alias": "HSOC-351", "path": "/courses/23253", "sections": {"path": "/courses/23253/sections", "values": [{"name": "DOCTOR-PATIENT RELSHIP", "sectionnum": "301", "primary_alias": "HSOC-351-301", "path": "/courses/23253/sections/301", "id": "23253-301", "aliases": ["HSOC-351-301"]}]}, "id": 23253, "aliases": ["HSOC-351"]}