[{"ratings": {"rAmountLearned": "2.42", "rDifficulty": "1.58", "rStimulateInterest": "2.47", "rRecommendMajor": "3.37", "rCourseQuality": "2.56", "rWorkRequired": "1.84", "rInstructorAccess": "2.89", "rReadingsValue": "2.32", "rRecommendNonMajor": "2.58", "rCommAbility": "2.84", "rInstructorQuality": "2.80"}, "section": {"name": "DOCTOR-PATIENT RELSHIP", "sectionnum": "301", "primary_alias": "HSOC-351-301", "path": "/courses/23253/sections/301", "id": "23253-301", "aliases": ["HSOC-351-301"]}, "comments": "Almost every student enjoyed this seminar course on doctor-patient relationships calling it “excellent” and “extraordinary.” Another said that, “all of the readings are really insightful and there are enough materials written from different perspectives to really get students thinking.” However a few comments complained that they watched too many movies and “did not spend enough time on discussion of readings and comments.” The same student also said that, “the discussions were too anecdotal.” However, another student said that “the extensive discussion of what it means to be on both sides of the relationship has been a truly eye-opening experience.” &#8232;&#8232;Students raved about Professor Walls calling her a “superb professor” and “down to earth.” Another mentioned that, “Dr. Walls does a phenomenal job at exposing her students to the realities of being a physician as well as a patient.”&#8232;&#8232;Students would recommend this class, especially for anyone considering medical school. As one comment said, “If a student is considering a career in healthcare, this course is a must-take.” &#8232;*Review based on 7 comments", "num_students": 28, "path": "/courses/23253/sections/301/reviews/3014-THERESA-A--WALLS", "instructor": {"path": "/instructors/3014-THERESA-A--WALLS", "first_name": "THERESA A.", "last_name": "WALLS", "id": "3014-THERESA-A--WALLS", "name": "THERESA A. WALLS"}, "num_reviewers": 26, "id": "23253-301-3014-THERESA-A--WALLS"}]