{"coursehistories": {"path": "/coursehistories/3396"}, "description": "The course provides an application of economic models to demand, supply, and their interaction in the medical economy. Influences on demand, especially health status, insurance coverage, and income will be analyzed. Physician decisions on the pricing and form of their own services, and on the advice they offer about other services, will be considered. Competition in medical care markets, especially for hospital services, will be studied. Special emphasis will be placed on government as demander of medical care services. Changes in Medicare and regulation of managed care are among the public policy issues to be addressed. Students who take HCMG 202 may not also take HCMG 302, ECON 039, or ECON 236 for further credit. \n\n", "semester": "2010C", "name": "ECON & FINCING-HLTHCR DL", "reviews": {"path": "/courses/23177/reviews", "values": [{"ratings": {"rAmountLearned": "2.67", "rDifficulty": "2.84", "rStimulateInterest": "2.27", "rRecommendMajor": "3.31", "rCourseQuality": "2.57", "rWorkRequired": "2.36", "rInstructorAccess": "2.69", "rReadingsValue": "2.16", "rRecommendNonMajor": "2.20", "rCommAbility": "2.41", "rInstructorQuality": "2.63"}, "section": {"name": "ECON & FINCING-HLTHCR DL", "sectionnum": "401", "primary_alias": "HCMG-202-401", "path": "/courses/23177/sections/401", "id": "23177-401", "aliases": ["HCMG-202-401", "ECON-039-401"]}, "comments": "This course is a study of the economic facts and analysis of the medical care sector. This class is primarily an economics course and therefore an understanding and interest in economics is key. Topics discussed during the semester will include both description and discussion of problems in medical services pertaining to financing, delivery, and analysis of how medical markets work. \r\n\r\nMany students enjoyed this course but a select few found it to be somewhat repetitive in comparison to other health care management courses. Even so, one student described the course as fostering an “interesting viewpoint in which to approach concepts in healthcare.” \r\n\r\nSome students raved about Professor Kolstad, describing him as “outstanding” and “a good instructor.” However, others students commented that he was “not the most apt communicator.” \r\n\r\nThe grade for the course is broken up into a midterm and final exam, short papers, and class participation. Students must complete ECON001 and ECON002 before taking this course unless exempt by the instructor. The course is open to both Wharton freshmen and upperclassmen. Overall, students recommended that those interested in health care take the course generally as the first class on the subject.\r\n", "num_students": 54, "path": "/courses/23177/sections/401/reviews/4834-JONATHAN-T--KOLSTAD", "instructor": {"path": "/instructors/4834-JONATHAN-T--KOLSTAD", "first_name": "JONATHAN T.", "last_name": "KOLSTAD", "id": "4834-JONATHAN-T--KOLSTAD", "name": "JONATHAN T. KOLSTAD"}, "num_reviewers": 51, "id": "23177-401-4834-JONATHAN-T--KOLSTAD"}]}, "credits": null, "primary_alias": "HCMG-202", "path": "/courses/23177", "sections": {"path": "/courses/23177/sections", "values": [{"name": "ECON & FINCING-HLTHCR DL", "sectionnum": "401", "primary_alias": "HCMG-202-401", "path": "/courses/23177/sections/401", "id": "23177-401", "aliases": ["HCMG-202-401", "ECON-039-401"]}]}, "id": 23177, "aliases": ["HCMG-202", "ECON-039"]}