{"coursehistories": {"path": "/coursehistories/4698"}, "description": "In late antiquity, both in Israel and in Babylonia, the custom developed of accompanying the Bible reading in synagogues with simultaneous oral translation (targum) into the Aramaic spoken language of the day. The translators negotiated their way between literal translation and various degrees of interpretive translation based on the different styles and idioms of Hebrew and Aramaic and considerations of theology, law, and other matters. Those targums popular in the land of Israel expanded the text considerably by introducing aggadic lore in the translation. They were studied by the laity, exerted a strong influence on the medieval Bible commentators and are still regularly studied in some Jewish circles today. They constitute a valuable resource for the study of the Hebrew Bible and for understanding Jewish belief, practice, and folklore. Since the Renaissance they have also been studied by Christian scholars as an aid to understanding Scripture and as a window on Jewish belief contemporary with the early development of Christianity. The translators' methods, especially as explained by S.D. Luzzatto (Shadal) in the 19th century, are a virtual encyclopedia of the philosophy and techniques of translation. \n\nThe course will begin with a brief orientation in the grammar of the targums to enable students to recognize the main differences between Hebrew and Aramaic. The main focus will be on studying and comparing selected narrative, poetic and legal passages and analyzing thei interpretive emphases, their religious ideas, and their methods of translation. \n\n", "semester": "2008C", "name": "RDGS IN ARAMAIC TARGUMS", "reviews": {"path": "/courses/18248/reviews", "values": [{"ratings": {"rAmountLearned": "3.40", "rDifficulty": "2.60", "rStimulateInterest": "3.60", "rRecommendMajor": "3.20", "rCourseQuality": "3.20", "rWorkRequired": "2.20", "rInstructorAccess": "3.80", "rReadingsValue": "3.00", "rRecommendNonMajor": "2.80", "rCommAbility": "3.80", "rInstructorQuality": "4.00"}, "section": {"name": "RDGS IN ARAMAIC TARGUMS", "sectionnum": "401", "primary_alias": "ANEL-242-401", "path": "/courses/18248/sections/401", "id": "18248-401", "aliases": ["ANEL-242-401", "ANEL-642-401", "JWST-242-401"]}, "comments": "", "num_students": 13, "path": "/courses/18248/sections/401/reviews/67-JEFFREY-HOWARD-TIGAY", "instructor": {"path": "/instructors/67-JEFFREY-HOWARD-TIGAY", "first_name": "JEFFREY HOWARD", "last_name": "TIGAY", "id": "67-JEFFREY-HOWARD-TIGAY", "name": "JEFFREY HOWARD TIGAY"}, "num_reviewers": 5, "id": "18248-401-67-JEFFREY-HOWARD-TIGAY"}]}, "credits": null, "primary_alias": "ANEL-242", "path": "/courses/18248", "sections": {"path": "/courses/18248/sections", "values": [{"name": "RDGS IN ARAMAIC TARGUMS", "sectionnum": "401", "primary_alias": "ANEL-242-401", "path": "/courses/18248/sections/401", "id": "18248-401", "aliases": ["ANEL-242-401", "ANEL-642-401", "JWST-242-401"]}]}, "id": 18248, "aliases": ["ANEL-242", "ANEL-642", "JWST-242"]}