[{"ratings": {"rAmountLearned": "3.40", "rDifficulty": "3.59", "rStimulateInterest": "2.82", "rRecommendMajor": "3.58", "rCourseQuality": "3.25", "rWorkRequired": "3.72", "rInstructorAccess": "3.21", "rReadingsValue": "2.92", "rRecommendNonMajor": "1.92", "rCommAbility": "2.79", "rInstructorQuality": "3.03"}, "section": {"name": "MACHINE LEARNING", "sectionnum": "001", "primary_alias": "CIS-520-001", "path": "/courses/24180/sections/001", "id": "24180-001", "aliases": ["CIS-520-001"]}, "comments": "This course introduces the mathematics, algorithms, and practice of machine\r\nlearning. Covering the foundations of statistical machine learning, the course focuses on\r\nprobabilistic and statistical methods for prediction and clustering in high dimensions.\r\nOther topics covered include graphical models, dimensionality reduction, neural\r\nnetworks, and reinforcement learning. This course is aimed broadly at advanced\r\nundergraduates and beginning graduate students. The software used in the course in\r\nMATLAB.\r\nMost students enjoyed the course very much even though it was quite tough.\r\nStudents generally indicated that “the subjects covered by the assignments and the\r\nprojects were very interesting” and the wiki layout for course lectures was wonderful.\r\nWhile some students pointed out that the problems in the homework are sometimes\r\n“slightly tangential to the focus” of the course and not closely related to exam questions,\r\nthe majority of the students thought this course stimulated their interest in machine\r\nlearning. One student even noted that this is “one of the most enjoyable core courses at\r\nPenn.”\r\nProfessor Taskar and his TAs were highly praised by the students. Some students\r\nreported that the professor and the TAs’ emphasis on “developing intuitions” despite “the\r\nstatistics-heavy nature” was “the best part about this course.” Many students greatly\r\ncomplimented the TAs’ help, yet some wished that Professor Taskar could have “shown\r\nup to office hours more often to answer questions and help students with their\r\nhomework.”\r\nStudents felt that the course was heavily math-oriented and thus was only\r\nrecommended for students who meet the prerequisites - Elementary Probability, Calculus,\r\nLinear Algebra, and basic programming experience. The workload was high but the\r\nassigned projects were mostly interesting.", "num_students": 123, "path": "/courses/24180/sections/001/reviews/3917-BENJAMIN-TASKAR", "instructor": {"path": "/instructors/3917-BENJAMIN-TASKAR", "first_name": "BENJAMIN", "last_name": "TASKAR", "id": "3917-BENJAMIN-TASKAR", "name": "BENJAMIN TASKAR"}, "num_reviewers": 120, "id": "24180-001-3917-BENJAMIN-TASKAR"}]