[{"ratings": {"rAmountLearned": "3.14", "rDifficulty": "3.29", "rStimulateInterest": "1.95", "rRecommendMajor": "3.44", "rCourseQuality": "2.58", "rWorkRequired": "3.71", "rInstructorAccess": "2.95", "rReadingsValue": "1.65", "rRecommendNonMajor": "0.79", "rCommAbility": "2.13", "rInstructorQuality": "2.48"}, "section": {"name": "MECH ENG DESIGN PROJECTS", "sectionnum": "001", "primary_alias": "MEAM-446-001", "path": "/courses/22024/sections/001", "id": "22024-001", "aliases": ["MEAM-446-001"]}, "comments": "MEAM 446 is the second semester of the capstone design project sequence for MEAM majors. As an extension of MEAM 445, this course requires students to work individually or in groups to select projects in which they will learn design, development, and experimentation strategies under the supervision of a MEAM faculty advisor. The course also focuses on project planning, patent and library searches, and technical presentation.&#8232;&#8232;Teams of five students work throughout their senior year on a design project of their choice. Students wished there was “more emphasis on obtaining good advisement and council at the outset of the project.” Students commented that loose proposals made for a shaky foundation and resulted in a reduction in project scope. However, many felt this could have been fixed with more guidance and thought from the advisors about the feasibility of projects. &#8232;&#8232;Students referred to Dr. Jeffcoat as “very friendly” and “always willing to discuss team issues.” The professor received glowing reviews from every student as a Senior Design course instructor. Students described him as organized and diligent, agreeing that he is someone who “knows a lot about a lot.” Designed to be more objective, the grading process was considered by several students as “unnecessarily complicated.” The end result was a “vicious grading policy that creates emotional turmoil within groups and hinders cooperation.” Peer evaluations were frowned upon by the majority, and students concluded that the grading sheets needed to be reviewed.", "num_students": 54, "path": "/courses/22024/sections/001/reviews/2438-ROBERT-L--JEFFCOAT", "instructor": {"path": "/instructors/2438-ROBERT-L--JEFFCOAT", "first_name": "ROBERT L.", "last_name": "JEFFCOAT", "id": "2438-ROBERT-L--JEFFCOAT", "name": "ROBERT L. JEFFCOAT"}, "num_reviewers": 51, "id": "22024-001-2438-ROBERT-L--JEFFCOAT"}]