{"coursehistories": {"path": "/coursehistories/564"}, "description": "An examination of European social, economic, political and cultural development from 1500 to the present, with attention to Europe's impact on the rest of the world. \n\n", "semester": "2010A", "name": "EUROPE IN A WIDER WORLD", "reviews": {"path": "/courses/26177/reviews", "values": [{"ratings": {"rAmountLearned": "3.36", "rDifficulty": "2.49", "rStimulateInterest": "3.85", "rRecommendMajor": "3.63", "rCourseQuality": "3.52", "rWorkRequired": "2.55", "rInstructorAccess": "3.69", "rReadingsValue": "3.11", "rRecommendNonMajor": "3.53", "rCommAbility": "3.84", "rInstructorQuality": "3.80"}, "section": {"name": "EUROPE IN A WIDER WORLD", "sectionnum": "001", "primary_alias": "HIST-002-001", "path": "/courses/26177/sections/001", "id": "26177-001", "aliases": ["HIST-002-001"]}, "comments": "This course examined European social, economic, political and cultural development from 1500 to the present, with attention to Europe's impact on the rest of the world.\r\n\r\nStudents found the class to be very stimulating, interesting, and engaging. A couple of students also mentioned that they learned a lot in the course, and many others commented that this was one of the best courses they had taken at Penn. One student went on to mention that “all of the material covered was relevant and the composition of the class was straightforward and clear.” \r\n\r\nStudents described Professor Granieri as knowledgeable, engaging, passionate, and a great lecturer. Several students also commented that Professor Granieri was one of the best professors they had had at Penn. Many students also commented that Professor Granieri was accessible and willing to meet with students. One went on to say that Professor Granieri “always welcomes people to come to office hours if they want to discuss a certain topic more in depth.”\r\n\r\nOne student commented that the overall workload for the course was manageable, but the reading got to be a little much at times. Students generally felt that the tests accurately reflected what was taught in the course. Another student was disappointed by the midterm, feeling there was not enough time to complete it. There were also a few essay assignments. This course fulfills the History and Tradition Sector.", "num_students": 92, "path": "/courses/26177/sections/001/reviews/2180-RONALD-J--GRANIERI", "instructor": {"path": "/instructors/2180-RONALD-J--GRANIERI", "first_name": "RONALD J.", "last_name": "GRANIERI", "id": "2180-RONALD-J--GRANIERI", "name": "RONALD J. GRANIERI"}, "num_reviewers": 87, "id": "26177-001-2180-RONALD-J--GRANIERI"}]}, "credits": null, "primary_alias": "HIST-002", "path": "/courses/26177", "sections": {"path": "/courses/26177/sections", "values": [{"name": "EUROPE IN A WIDER WORLD", "sectionnum": "001", "primary_alias": "HIST-002-001", "path": "/courses/26177/sections/001", "id": "26177-001", "aliases": ["HIST-002-001"]}]}, "id": 26177, "aliases": ["HIST-002"]}