[{"ratings": {"rAmountLearned": "1.86", "rDifficulty": "2.07", "rStimulateInterest": "1.54", "rRecommendMajor": "2.29", "rCourseQuality": "1.65", "rWorkRequired": "1.86", "rInstructorAccess": "2.57", "rReadingsValue": "2.15", "rRecommendNonMajor": "1.64", "rCommAbility": "1.21", "rInstructorQuality": "1.71"}, "section": {"name": "SOCIAL STATISTICS", "sectionnum": "401", "primary_alias": "SOCI-120-401", "path": "/courses/23789/sections/401", "id": "23789-401", "aliases": ["SOCI-120-401"]}, "comments": "This course introduces students to the application of statistical analysis in sociology, with attention given to interpretation of data. The course familiarizes students with how to describe groups and generalize relationships between groups using statistics. Students learn how to calculate statistical relationships by hand and with the help of computer programs.\r\n\r\nMost students felt that the course material did not meet their expectations. Some students were concerned that the class relied too heavily on the “system for running statistical data (SPSS) instead of [teaching] how to do everything.” Other students were disappointed that “there is no concrete application of the material, so it's really hard to learn it.” Several students noted that their TA provided the most valuable resource for course materials, rather than using assigned readings or lecture notes.\r\n\r\nMany students criticized Professor Koppel’s lectures. Regarding Professor Koppel’s description of course content, one student noted how “his form of explaining things often ended up confusing me more than helping me.” Other students noted that Professor Koppel seemed “all over the place in lectures” and had difficulty communicating the concepts in “a non-math, non-statistics oriented class.”\r\n\r\nThis course caters mainly to students with some background in sociology. Students commented that lectures, readings, and assignments seemed disjointed, but the course could prove “very easy” with help from the TAs.\r\n", "num_students": 37, "path": "/courses/23789/sections/401/reviews/659-ROSS-KOPPEL", "instructor": {"path": "/instructors/659-ROSS-KOPPEL", "first_name": "ROSS", "last_name": "KOPPEL", "id": "659-ROSS-KOPPEL", "name": "ROSS KOPPEL"}, "num_reviewers": 32, "id": "23789-401-659-ROSS-KOPPEL"}]