{"coursehistories": {"path": "/coursehistories/610"}, "description": "This course will examine the international politics of Europe in the 20th Century, the period during which Europe, beset by two devasting wars and the horrific experience of genocide, lost its dominant international position and was forced to adjust to a world dominated by extra-European forces. We wil examine the decline and (partial) recovery of Europe's international position with special attention to the contrast between international competition and transnational cooperation within Europe, the impact of the two World Wars, the ambivalent legacy of the Cold War, and Europe's developing role in the post-Cold War world. \n\n", "semester": "2012A", "name": "EURO INT'L REL SINCE WWI", "reviews": {"path": "/courses/27594/reviews", "values": [{"ratings": {"rAmountLearned": "2.61", "rDifficulty": "2.31", "rStimulateInterest": "2.06", "rRecommendMajor": "3.18", "rCourseQuality": "2.67", "rWorkRequired": "2.58", "rInstructorAccess": "3.04", "rReadingsValue": "2.86", "rRecommendNonMajor": "2.06", "rCommAbility": "2.86", "rInstructorQuality": "2.63"}, "section": {"name": "EURO INT'L REL SINCE WWI", "sectionnum": "001", "primary_alias": "HIST-421-001", "path": "/courses/27594/sections/001", "id": "27594-001", "aliases": ["HIST-421-001"]}, "comments": "This course examines the international politics of Europe in the 20th Century, the period during which Europe, beset by two devastating wars and the horrific experience of genocide, lost its dominant international position and was forced to adjust to a world dominated by extra-European forces.  This course examines the decline and (partial) recovery of Europe's international position with special attention to the contrast between international competition and transnational cooperation within Europe, the impact of the two World Wars, the ambivalent legacy of the Cold War, and Europe's developing role in the post-Cold War world.\r\n\r\n\tStudents generally enjoyed this course, which “did a good job of combining both history and international relations theory into its material.” Students felt it was a “valuable introduction to world affairs in the 20th century,” but many noted that there was “way too much material for too little time.” Lectures were described as “very dry,” with many students wishing for a more “dynamic lecture” experience instead of the professor just “reading off the slides.” The slides themselves were difficult to follow, and students complained about overwhelming reading that did not always relate to what was covered in lecture.\r\n\r\n\tProfessor Ogle received mixed reviews from students. Many liked that she was “very approachable” and was always willing to meet with students, even attending certain recitations to better get to know students. Students all noted that she was very knowledgeable about the subject matter but had trouble organizing her lecture slides and “could work towards presenting the subject in a slightly more engaging way.” Many had problems with her teaching style, criticizing her “monotonous and boring” lectures and wishing she would do more than “essentially read off her notes.” \r\n\r\n\tThis course was described as having a good amount of work, with “excessively lengthy” readings and a midterm and final. Some students felt Professor Ogle was “vague on what she wanted on her tests, which made it confusing and frustrating to write to,” and others felt “the assignments had not quite been ironed out.” Students said the tests required too much information to be conveyed in too little time frame, and noted recitations “required an unnecessary amount of work and participation.” Overall, students recommended this course as an informative way to learn about European international relations but stressed the need for the course structure to become more engaging.", "num_students": 78, "path": "/courses/27594/sections/001/reviews/5761-VANESSA-OGLE", "instructor": {"path": "/instructors/5761-VANESSA-OGLE", "first_name": "VANESSA", "last_name": "OGLE", "id": "5761-VANESSA-OGLE", "name": "VANESSA OGLE"}, "num_reviewers": 69, "id": "27594-001-5761-VANESSA-OGLE"}]}, "credits": null, "primary_alias": "HIST-421", "path": "/courses/27594", "sections": {"path": "/courses/27594/sections", "values": [{"name": "EURO INT'L REL SINCE WWI", "sectionnum": "001", "primary_alias": "HIST-421-001", "path": "/courses/27594/sections/001", "id": "27594-001", "aliases": ["HIST-421-001"]}]}, "id": 27594, "aliases": ["HIST-421"]}