{"coursehistories": {"path": "/coursehistories/4652"}, "description": "This course integrates economic, ethical and political perspectives. It examines competing theories, models, and analytical frameworks for understanding policymaking. The course will focus on: 1. How public problems are framed and described; 2. What crieteria are useful in developing and assessing policy choices; and 3. How policy choices and outcomes are mediated and influenced by individuals, organizations and political institutions. \n\n", "semester": "2011C", "name": "THE PUBLIC POL PROCESS: The Public Policy Process", "reviews": {"path": "/courses/24992/reviews", "values": [{"ratings": {"rAmountLearned": "2.60", "rDifficulty": "2.68", "rStimulateInterest": "1.89", "rRecommendMajor": "3.02", "rCourseQuality": "2.21", "rWorkRequired": "2.82", "rInstructorAccess": "2.75", "rReadingsValue": "2.53", "rRecommendNonMajor": "1.69", "rCommAbility": "2.08", "rInstructorQuality": "2.27"}, "section": {"name": "THE PUBLIC POL PROCESS: The Public Policy Process", "sectionnum": "401", "primary_alias": "PPE-202-401", "path": "/courses/24992/sections/401", "id": "24992-401", "aliases": ["PPE-202-401", "PSCI-236-401"]}, "comments": "Philosophy Politics and Economics 202 centers on understanding policymaking. The aims of the course are threefold. Firstly, the framing and description of public problems is discussed. Secondly, the criteria useful in developing and assessing policy choices are examined. Lastly, how policy choices and outcomes are mediated and influenced by individuals, organizations and political institutions is studied. \r\n\r\nA vast majority of students felt that the course was disorganized. Many also noted its resemblance to Introduction to American Political Thought. Multiple other students, however, described the class as “great.” Opinions on the course were mixed.   \r\n\r\nStudents agreed for the most part that Professor Lapinski was very knowledgeable. A majority of students commented on how quickly he delivered his lectures. A few students labeled his lectures as “dry” and felt that his PowerPoint presentations were a little sparse. One student commented on his insertion of his personal politics into lectures.\r\n\r\nPPE considers this class an intermediate course. Some students felt that the readings were either too long or too dense.  There is no final, which led one student to remark that the class felt over two thirds of the way through the semester.  \r\n", "num_students": 115, "path": "/courses/24992/sections/401/reviews/4082-JOHN-S--LAPINSKI", "instructor": {"path": "/instructors/4082-JOHN-S--LAPINSKI", "first_name": "JOHN S.", "last_name": "LAPINSKI", "id": "4082-JOHN-S--LAPINSKI", "name": "JOHN S. LAPINSKI"}, "num_reviewers": 109, "id": "24992-401-4082-JOHN-S--LAPINSKI"}]}, "credits": null, "primary_alias": "PPE-202", "path": "/courses/24992", "sections": {"path": "/courses/24992/sections", "values": [{"name": "THE PUBLIC POL PROCESS: The Public Policy Process", "sectionnum": "401", "primary_alias": "PPE-202-401", "path": "/courses/24992/sections/401", "id": "24992-401", "aliases": ["PPE-202-401", "PSCI-236-401"]}]}, "id": 24992, "aliases": ["PPE-202", "PSCI-236"]}