{"coursehistories": {"path": "/coursehistories/1403"}, "description": "Multinational management is the study of the international corporation and the global political and economic environment. This course provides an introduction to the more advanced offerings. It covers the historical origins of the multinational corporation, the economics of trade, money and investment in the world economy, and the policies and behavior of governments and international organizations. We place considerable emphasis in understanding the national and historic origins of the international firm, as well as on current issues regarding emerging economies and shifts in the political economy of global markets. \n\n", "semester": "2010A", "name": "MULTINATIONAL MANAGEMENT", "reviews": {"path": "/courses/26371/reviews", "values": [{"ratings": {"rAmountLearned": "3.19", "rDifficulty": "2.50", "rStimulateInterest": "3.56", "rRecommendMajor": "3.57", "rCourseQuality": "3.21", "rWorkRequired": "3.12", "rInstructorAccess": "3.92", "rReadingsValue": "3.03", "rRecommendNonMajor": "2.60", "rCommAbility": "3.53", "rInstructorQuality": "3.67"}, "section": {"name": "MULTINATIONAL MANAGEMENT", "sectionnum": "001", "primary_alias": "MGMT-111-001", "path": "/courses/26371/sections/001", "id": "26371-001", "aliases": ["MGMT-111-001"]}, "comments": "MGMT111 intends to demonstrate that decisions affecting the international expansion of the firm are neither obvious nor totally determined by the technological or economic forces generally associated with globalization. Detailed case studies are used to illustrate that the internationalization of the firm is a sequential decision-making process operating at the country, industry, corporate, business, and subsidiary levels of analysis. Firms manage knowledge accumulation and transfer as they grow international through a mixture of planning and trial-and-error. Students will experience in the classroom the most important decisions that multinational firms face in the course of conducting business across borders.\r\n\r\nOverall, students agreed that the material was well-presented. One student commented that “initially it seemed like it would just be a typical management course, with frameworks that, while interesting, were not always easy to map on to real life situations. However, Professor Monteiro was very candid about this reality, and drew a clear distinction between academic management findings and what one can see in practice. His ability to bring in managers in hugely successful companies from around the world was remarkable as well, and really helped to stimulate student interest in a subject matter which can be dry at times.” \r\n\r\nStudents praised Professor Monteiro for his “exceptionally high level of commitment to the course”. They agreed that he was an “excellent professor, very smart, and very enthusiastic about the multinational management. Went out of his way to be available to students.”\r\n\r\nCourse requirements include homework assignments and class participation, a midterm exam, and a group project. While there is a considerable amount of work required, students found it to be worthwhile. One student commented, “Although the course was extremely challenging and work-intensive, I found every reading and assignment, especially the group project, to be completely worthwhile.”", "num_students": 45, "path": "/courses/26371/sections/001/reviews/5642-LUIZ-FELIPE-MONTEIRO", "instructor": {"path": "/instructors/5642-LUIZ-FELIPE-MONTEIRO", "first_name": "LUIZ FELIPE", "last_name": "MONTEIRO", "id": "5642-LUIZ-FELIPE-MONTEIRO", "name": "LUIZ FELIPE MONTEIRO"}, "num_reviewers": 43, "id": "26371-001-5642-LUIZ-FELIPE-MONTEIRO"}]}, "credits": null, "primary_alias": "MGMT-111", "path": "/courses/26371", "sections": {"path": "/courses/26371/sections", "values": [{"name": "MULTINATIONAL MANAGEMENT", "sectionnum": "001", "primary_alias": "MGMT-111-001", "path": "/courses/26371/sections/001", "id": "26371-001", "aliases": ["MGMT-111-001"]}]}, "id": 26371, "aliases": ["MGMT-111"]}