{"coursehistories": {"path": "/coursehistories/566"}, "description": "This course examines American history from the first contacts of the indigenous peoples of North America with European settlers to our own times by focusing on a few telling moments in this history. The course treats twelve of these moments. Each unit begins with a specific primary document, historical figure, image, location, year, or cultural artifact to commence the delving into the American past. Some of these icons are familiar, but the ensuing deciphering will render them as more complicated; some are unfamiliar, but they will emerge as absolutely telling. The course meets each week for two 50-minute team-taught lectures and once recitation session. Course requirements include: in-class midterm and final exams; three short paper assignments; and punctual attendance and participation in recitations. \n\n", "semester": "2009A", "name": "THE WORLD:HIST & MODRNTY", "reviews": {"path": "/courses/15885/reviews", "values": [{"ratings": {"rAmountLearned": "2.76", "rDifficulty": "1.95", "rStimulateInterest": "2.75", "rRecommendMajor": "3.11", "rCourseQuality": "2.66", "rWorkRequired": "2.10", "rInstructorAccess": "3.10", "rReadingsValue": "2.68", "rRecommendNonMajor": "2.86", "rCommAbility": "2.79", "rInstructorQuality": "3.01"}, "section": {"name": "THE WORLD:HIST & MODRNTY", "sectionnum": "001", "primary_alias": "HIST-011-001", "path": "/courses/15885/sections/001", "id": "15885-001", "aliases": ["HIST-011-001"]}, "comments": "An explanation of major themes, milestones, and debates in the history of the global community since 1300. Using examples from around the world, the course will explore such issues as the causes of war and revolution; the impact of religion, science and technology on human communities; the development of global systems of slavery, colonialism, and labor migration; the rise of nationalisms; and perceived differences between \\\"East\\\" and \\\"West,\\\" and \\\"tradition\\\" and \\\"modernity.\\\" The course will also introduce students to the art and science of historical inquiry using primary sources, maps, pictures, and material culture.\r\n\r\nStudents stated that they “thoroughly enjoyed” this course and felt they came away learning a great deal from it. Many said the class was “engaging” and agreed that taking it was a “worthwhile experience.” Some thought the lecture was “badly organized” but many felt that, overall, the course “covered a lot of material in a way that is manageable and interesting.” While a few students expressed that “the amount of reading was a bit too much at times,” they acknowledged, “the content was well appreciated” and referred to this course as “an exciting journey in history!”\r\n\r\nMost students praised Professor Cassanelli’s enthusiasm, and described his lectures as “passionate” and “engaging,” but felt they were, at times, unorganized. The general opinion was overwhelmingly positive and one student summed up Professor Cassanelli by saying he is an “amazing teacher and one of the few professors that has ever voluntarily come to recitation.”\r\n\r\nThis class fulfills the History and Tradition Sector requirement and students recommended it to anyone with an interest in world history, regardless of major.", "num_students": 96, "path": "/courses/15885/sections/001/reviews/658-LEE-V-CASSANELLI", "instructor": {"path": "/instructors/658-LEE-V-CASSANELLI", "first_name": "LEE V", "last_name": "CASSANELLI", "id": "658-LEE-V-CASSANELLI", "name": "LEE V CASSANELLI"}, "num_reviewers": 94, "id": "15885-001-658-LEE-V-CASSANELLI"}]}, "credits": null, "primary_alias": "HIST-011", "path": "/courses/15885", "sections": {"path": "/courses/15885/sections", "values": [{"name": "THE WORLD:HIST & MODRNTY", "sectionnum": "001", "primary_alias": "HIST-011-001", "path": "/courses/15885/sections/001", "id": "15885-001", "aliases": ["HIST-011-001"]}]}, "id": 15885, "aliases": ["HIST-011"]}