{"coursehistories": {"path": "/coursehistories/950"}, "description": "This courseprovides an introduction to the psychology of personality and individual differences. Many psychology courses focus on the mind or brain; in contrast to those approaches of studying people in general, the focus in this course is on the question \"How are people different from each other?\" It will highlight research that take a multidimensional approach to individual differences and attempts to integrate across the biological, cognitive-experimental, and social-cultural influences on personality. A recitation will be required, you willhave a choice of times, announced on first day of class. \n\n", "semester": "2011A", "name": "PERSONALITY", "reviews": {"path": "/courses/22346/reviews", "values": [{"ratings": {"rAmountLearned": "2.22", "rDifficulty": "2.28", "rStimulateInterest": "2.11", "rRecommendMajor": "2.39", "rCourseQuality": "2.10", "rWorkRequired": "1.59", "rInstructorAccess": "2.50", "rReadingsValue": "1.89", "rRecommendNonMajor": "2.00", "rCommAbility": "2.28", "rInstructorQuality": "2.43"}, "section": {"name": "PERSONALITY", "sectionnum": "601", "primary_alias": "PSYC-160-601", "path": "/courses/22346/sections/601", "id": "22346-601", "aliases": ["PSYC-160-601"]}, "comments": "This course introduces students to the psychology of personality and individual differences in humans. This course attempts to answer the question: “How are people different from one another?” Taking a multi-dimensional approach to individual differences, this course seeks to integrate biological, cognitive-experimental, and socio-cultural influences on personality.&#8232;&#8232;Students found the course material to be unclear. Some students thought that, “the subject matter was often too complex.” Due to the ambiguity of the material, “students were unsure of what to study” before exams.&#8232;&#8232;Students expressed serious concern about the professor’s beliefs in outdated theories and seeming disregard for the goals of the course. &#8232;This course is not listed as fulfilling any major college requirements. In addition, there are no prerequisites listed. The course is open to both college freshmen and upperclassmen.", "num_students": 24, "path": "/courses/22346/sections/601/reviews/5518-RICHARD-JOHN-DI-ROCCO", "instructor": {"path": "/instructors/5518-RICHARD-JOHN-DI-ROCCO", "first_name": "RICHARD JOHN", "last_name": "DI ROCCO", "id": "5518-RICHARD-JOHN-DI-ROCCO", "name": "RICHARD JOHN DI ROCCO"}, "num_reviewers": 21, "id": "22346-601-5518-RICHARD-JOHN-DI-ROCCO"}]}, "credits": null, "primary_alias": "PSYC-160", "path": "/courses/22346", "sections": {"path": "/courses/22346/sections", "values": [{"name": "PERSONALITY", "sectionnum": "601", "primary_alias": "PSYC-160-601", "path": "/courses/22346/sections/601", "id": "22346-601", "aliases": ["PSYC-160-601"]}]}, "id": 22346, "aliases": ["PSYC-160"]}