[{"ratings": {"rAmountLearned": "2.12", "rDifficulty": "3.71", "rStimulateInterest": "1.82", "rRecommendMajor": "2.62", "rCourseQuality": "1.83", "rWorkRequired": "3.47", "rInstructorAccess": "2.09", "rReadingsValue": "1.61", "rRecommendNonMajor": "0.65", "rCommAbility": "2.32", "rInstructorQuality": "2.14"}, "section": {"name": "PRINC BIOLOGICAL CHEM", "sectionnum": "001", "primary_alias": "CHEM-251-001", "path": "/courses/24118/sections/001", "id": "24118-001", "aliases": ["CHEM-251-001"]}, "comments": "This class teaches the fundamentals of biological chemistry, including the\r\nstructure of biological macromolecules and their mechanism of action, intermediary\r\nmetabolism, and the chemical basis of information transfer.\r\nStudents found that this class covered a lot of material and involved a lot of\r\nmemorization. Some complained that the tests focus on “minutiae that are barely\r\naddressed in lectures.” Some felt that they tested your ability to “cram and copy form a\r\ncheat sheet” rather than testing students’ understanding of concepts.\r\nStudents generally found Professor Cooperman accessible. Students liked that he\r\npresented his lectures slowly, as there was a lot material to absorb.\r\nStudents found the course very difficult, but “manageable if you have time.”\r\nSome noted that having some background in organic chemistry would be very helpful.", "num_students": 41, "path": "/courses/24118/sections/001/reviews/229-BARRY-S--COOPERMAN", "instructor": {"path": "/instructors/229-BARRY-S--COOPERMAN", "first_name": "BARRY S.", "last_name": "COOPERMAN", "id": "229-BARRY-S--COOPERMAN", "name": "BARRY S. COOPERMAN"}, "num_reviewers": 38, "id": "24118-001-229-BARRY-S--COOPERMAN"}, {"ratings": {"rAmountLearned": "2.12", "rDifficulty": "3.71", "rStimulateInterest": "1.53", "rRecommendMajor": "2.62", "rCourseQuality": "1.83", "rWorkRequired": "3.47", "rInstructorAccess": "1.71", "rReadingsValue": "1.61", "rRecommendNonMajor": "0.65", "rCommAbility": "1.82", "rInstructorQuality": "1.72"}, "section": {"name": "PRINC BIOLOGICAL CHEM", "sectionnum": "001", "primary_alias": "CHEM-251-001", "path": "/courses/24118/sections/001", "id": "24118-001", "aliases": ["CHEM-251-001"]}, "comments": "This course covers the fundamentals of biological chemistry, including the\r\nstructure of biological macromolecules and their mechanism of action, intermediary\r\nmetabolism, and the chemical basis of information transfer.\r\nMost of the material was well-received, though some students wished the focus\r\nhad been better delegated to important topics rather than ones that did not appear heavily\r\non exams. For instance, one student noted that there was too much time spent on the\r\n“specifics of proteins,” which did not help in conceptual and theoretical understanding of\r\nthe material.\r\nStudents complained that because of his accent and his tendency to be “softspoken,”\r\nProfessor Baumgart was sometimes difficult to understand, which made\r\nlearning new key words and concepts difficult. One student wished that Professor\r\nBaumgart showed a little more “enthusiasm” for the material, while others found him\r\ninteresting and willing to answer all questions.\r\nThe prerequisite for this course is CHEM 102 while the co-requisite is CHEM\r\n241. Some students felt that this course covered “a ridiculous amount of material.”\r\nStudents recommend a background in organic chemistry as this course is “mechanismbased.”\r\nThe exams were also considered difficult and some students complained that they\r\nfocused too much on minute details in the face of the vast quantity of material that was\r\ncovered in class.", "num_students": 41, "path": "/courses/24118/sections/001/reviews/3235-TOBIAS-BAUMGART", "instructor": {"path": "/instructors/3235-TOBIAS-BAUMGART", "first_name": "TOBIAS", "last_name": "BAUMGART", "id": "3235-TOBIAS-BAUMGART", "name": "TOBIAS BAUMGART"}, "num_reviewers": 38, "id": "24118-001-3235-TOBIAS-BAUMGART"}]