[{"ratings": {"rAmountLearned": "3.15", "rDifficulty": "2.86", "rStimulateInterest": "3.58", "rRecommendMajor": "3.31", "rCourseQuality": "3.41", "rWorkRequired": "2.69", "rInstructorAccess": "3.71", "rReadingsValue": "2.91", "rRecommendNonMajor": "2.53", "rCommAbility": "3.80", "rInstructorQuality": "3.64"}, "section": {"name": "MATHEMATICAL STATISTICS", "sectionnum": "401", "primary_alias": "STAT-512-401", "path": "/courses/28193/sections/401", "id": "28193-401", "aliases": ["STAT-512-401", "STAT-432-401"]}, "comments": "The purpose of STAT 512 is to discuss theoretical aspects of estimation theory and hypothesis testing procedures, together with some of their more important applications. The broad nature of the material to be covered is indicated below. It is assumed that each student in the class has taken probability theory to the level discussed in STAT 430, as well as a good introductory course in Statistics, a year of calculus and a good introduction to matrix theory.\r\nStudents had overall positive reviews for the course. Many students called the class “the best course” they have taken so far and went on to elaborate on how the course helps you “understand the fundamentals of statistics” beyond the knowledge imparted in introductory statistics classes. One student mentioned the class was “a little less mathematical than expected” but when on to qualify by stating that the course “[provided] an accessible introduction to the fundamental concepts of statistics.” Concepts that may have been mentioned in earlier statistics classes were explained in further detail.\r\nProfessor Ewens was met with great reviews. “An awesome professor who is always willing to help you outside of class,” Professor Ewens “makes the subject matter easy to understand.” One student elaborated, explaining that Professor Ewens’s enthusiasm for the subject is contagious. Another student echoed this feeling, stating that Professor Ewens “has the unique gift of explaining concepts patiently and thoroughly, instead of leaving students on their own to figure out the details for themselves.”\r\nSTAT 512 is recommended for students looking for a deeper knowledge of topics that were covered in their introductory Statistics courses. This course was “less mathematical” than students expected, but this did not deter students from enjoying the course.", "num_students": 44, "path": "/courses/28193/sections/401/reviews/206-WARREN-J--EWENS", "instructor": {"path": "/instructors/206-WARREN-J--EWENS", "first_name": "WARREN J.", "last_name": "EWENS", "id": "206-WARREN-J--EWENS", "name": "WARREN J. EWENS"}, "num_reviewers": 40, "id": "28193-401-206-WARREN-J--EWENS"}]