[{"ratings": {"rAmountLearned": "2.52", "rDifficulty": "2.15", "rStimulateInterest": "2.24", "rRecommendMajor": "2.86", "rCourseQuality": "2.65", "rWorkRequired": "1.95", "rInstructorAccess": "3.33", "rReadingsValue": "2.48", "rRecommendNonMajor": "2.71", "rCommAbility": "3.05", "rInstructorQuality": "3.09"}, "section": {"name": "BECOMING HUMAN", "sectionnum": "601", "primary_alias": "ANTH-122-601", "path": "/courses/22615/sections/601", "id": "22615-601", "aliases": ["ANTH-122-601"]}, "comments": "Human evolutionary studies is a composite product of the fieldwork of both Paleolithic archaeology and human paleontology (or what we refer to as \"stones and bones\"). This marriage of two sub disciplines of anthropology produces a unique set of data that is intellectually managed and driven by theories within anthropology as a whole and even beyond -- to fields such as biology, psychology, and primate ethology, as we try to understand the origins of language, culture, and our unique physical characteristics. In this course, two archaeologists and one physical anthropologist will jointly discuss and debate the actual evidence of human evolution, describing what the actual evidence is and exploring how far can we take these interpretations. \r\n\r\nOverall students considered the course to be “information packed and enriching.” Students reported that they learned “new and interesting things,” and a few were “inspired.”\r\n\r\nStudents praised Dr. Olszewski as “committed to her students” and “never short on support.” Although students considered Professor Olszeweski a “wealth of knowledge,” some students would have preferred more opportunities to discuss the reading.\r\n\r\nStudents reported that the “workload was fair as were the tests and quizzes” and the “grading was easy” with a manageable number of assignments.\r\n\r\n", "num_students": 28, "path": "/courses/22615/sections/601/reviews/86-DEBORAH-IRENE-OLSZEWSKI", "instructor": {"path": "/instructors/86-DEBORAH-IRENE-OLSZEWSKI", "first_name": "DEBORAH IRENE", "last_name": "OLSZEWSKI", "id": "86-DEBORAH-IRENE-OLSZEWSKI", "name": "DEBORAH IRENE OLSZEWSKI"}, "num_reviewers": 24, "id": "22615-601-86-DEBORAH-IRENE-OLSZEWSKI"}]