{"coursehistories": {"path": "/coursehistories/700"}, "description": "This course allows Penn students to teach a series of hands-on activities to students in math classes at University City High School. The semester starts with an introduction to successful approaches for teaching math in urban high schools. The rest of the semester will be devoted to a series of weekly hands-on activities designed to teach fundamental aspects of geometry. The first class meeting of each week, Penn faculty teach Penn students the relevant mathematical background and techniques for a hands-on activity. During the second session of each week, Penn students will teach the hands-on activity to a small group of UCHS students. The Penn students will also have an opportunity to develop their own activity and to implement it with the UCHS students. \n\n", "semester": "2011A", "name": "COMMUNITY MATH TEACH PRO", "reviews": {"path": "/courses/21991/reviews", "values": [{"ratings": {"rAmountLearned": "1.48", "rDifficulty": "1.54", "rStimulateInterest": "2.07", "rRecommendMajor": "2.29", "rCourseQuality": "1.78", "rWorkRequired": "2.11", "rInstructorAccess": "2.00", "rReadingsValue": "1.85", "rRecommendNonMajor": "2.41", "rCommAbility": "2.00", "rInstructorQuality": "1.88"}, "section": {"name": "COMMUNITY MATH TEACH PRO", "sectionnum": "001", "primary_alias": "MATH-123-001", "path": "/courses/21991/sections/001", "id": "21991-001", "aliases": ["MATH-123-001"]}, "comments": "This course allows Penn students to teach a series of hands-on activities to students in math classes at University City High School. The semester starts with an introduction to successful approaches for teaching math in urban high schools. The rest of the semester will be devoted to a series of weekly hands-on activities designed to teach fundamental aspects of geometry. During the first class meeting of each week, Penn faculty teach Penn students the relevant mathematical background and techniques for a hands-on activity. During the second session of each week, Penn students will teach the hands-on activity to a small group of UCHS students. The Penn students will also have an opportunity to develop their own activity and to implement it with the UCHS students.\r\n\r\nStudents said the class was a let down; some even said it was by far one of the worst classes ever at Penn. They said they enjoyed working the students at UCHS but would have preferred more organization and structure to the class.\r\n\r\nStudents complained heavily about the TAs, stating that one of them in particular was extremely rude.\r\nStudents did not comment at all on the actual professor because the TAs were doing the majority of the work.\r\n\r\nStudents complained that the work had very little correlation to the labs and was a waste of time. The assignments were not graded. Students disliked the Penn portion of the course but loved the UCHS element.\r\n", "num_students": 33, "path": "/courses/21991/sections/001/reviews/1556-IDRIS-STOVALL", "instructor": {"path": "/instructors/1556-IDRIS-STOVALL", "first_name": "IDRIS", "last_name": "STOVALL", "id": "1556-IDRIS-STOVALL", "name": "IDRIS STOVALL"}, "num_reviewers": 32, "id": "21991-001-1556-IDRIS-STOVALL"}]}, "credits": null, "primary_alias": "MATH-123", "path": "/courses/21991", "sections": {"path": "/courses/21991/sections", "values": [{"name": "COMMUNITY MATH TEACH PRO", "sectionnum": "001", "primary_alias": "MATH-123-001", "path": "/courses/21991/sections/001", "id": "21991-001", "aliases": ["MATH-123-001"]}]}, "id": 21991, "aliases": ["MATH-123"]}