{"coursehistories": {"path": "/coursehistories/5462"}, "description": "This course is about understanding emerging technology enablers with a goal of stimulating thinking on new applications for commerce. No prerequisite or technical background is assumed. The class is self-contained (mainly lecture-based) and will culminate in a class-driven identification of novel businesses that exploit these enablers. \n\nNo prerequisite or technical background is assumed. Students with little prior technical background can use the course to become more technologically informed. Those with moderate to advanced technical background may find the course a useful survey of emerging technologies. The course is recommended for students interested in careers in consulting, investement banking and venture capital in the tech sector. \n\n", "semester": "2012A", "name": "ENABLING TECHNOLOGIES", "reviews": {"path": "/courses/27971/reviews", "values": [{"ratings": {"rAmountLearned": "1.48", "rDifficulty": "1.41", "rStimulateInterest": "1.15", "rRecommendMajor": "1.68", "rCourseQuality": "1.45", "rWorkRequired": "1.68", "rInstructorAccess": "3.07", "rReadingsValue": "1.84", "rRecommendNonMajor": "1.41", "rCommAbility": "1.30", "rInstructorQuality": "1.36"}, "section": {"name": "ENABLING TECHNOLOGIES", "sectionnum": "001", "primary_alias": "OPIM-662-001", "path": "/courses/27971/sections/001", "id": "27971-001", "aliases": ["OPIM-662-001"]}, "comments": "OPIM 662 is about understanding emerging technology enablers with a goal of stimulating thinking on new applications for commerce. The class is self-contained (mainly lecture-based) and culminates in a class-driven identification of novel businesses that exploit these enablers.\r\n\r\nMost students commented that their “expectations for this course were high and the course simply did not live up to them.” The class was presented as a “primer of the current technology landscape,” but several students commented that there “was not a clear unifying theme of the course.” Several other students commented that the information taught in this course was “out-of-date.” Even more students commented that the class lacked “depth,” and they would have liked to learn more about the topics presented in class. Nevertheless, many students agreed that the basic “important topics in technology” was covered adequately. \r\n\r\nStudents described Professor Wu as “accomplished in her research,” but her “facilitation skills were lacking.” Specifically, students said that Professor Wu sometimes became too “defensive” during class discussions. One student commented that the disappointment in Professor’s Wu teaching lie in that she was “knowledgeable in her specialty,” but this “did not translate into course leadership.”\r\n\r\nNo prerequisite or technical background is assumed for OPIM 662.  Students with little prior technical background can use the course to become more technologically informed. Those with moderate to advanced technical background may find the course a useful survey of emerging technologies. The course is recommended for students interested in careers in consulting, investment banking and venture capital in the tech sector.\r\n", "num_students": 59, "path": "/courses/27971/sections/001/reviews/6161-LYNN-L--WU", "instructor": {"path": "/instructors/6161-LYNN-L--WU", "first_name": "LYNN L.", "last_name": "WU", "id": "6161-LYNN-L--WU", "name": "LYNN L. WU"}, "num_reviewers": 44, "id": "27971-001-6161-LYNN-L--WU"}]}, "credits": null, "primary_alias": "OPIM-662", "path": "/courses/27971", "sections": {"path": "/courses/27971/sections", "values": [{"name": "ENABLING TECHNOLOGIES", "sectionnum": "001", "primary_alias": "OPIM-662-001", "path": "/courses/27971/sections/001", "id": "27971-001", "aliases": ["OPIM-662-001"]}]}, "id": 27971, "aliases": ["OPIM-662"]}