[{"ratings": {"rAmountLearned": "3.38", "rDifficulty": "2.06", "rStimulateInterest": "3.28", "rRecommendMajor": "3.32", "rCourseQuality": "3.43", "rWorkRequired": "2.22", "rInstructorAccess": "3.59", "rReadingsValue": "3.13", "rRecommendNonMajor": "2.84", "rCommAbility": "3.66", "rInstructorQuality": "3.49"}, "section": {"name": "STRAT & PRAC OF FAMILY", "sectionnum": "001", "primary_alias": "MGMT-833-001", "path": "/courses/27780/sections/001", "id": "27780-001", "aliases": ["MGMT-833-001"]}, "comments": "Management 833 is designed for those persons who desire to understand the distinct strategies and practices of family-controlled companies and family wealth management. It will focus on shareholder decision making; financial and market driven options for long-run competitiveness, organizational structures and management team issues; strategic planning from a resource-based perspective; transition planning for the corporate entity, wealth, leadership and relationships; family dynamics and communication issues; and leadership empowerment. The course is intended for those who plan to consult or provide professional services to family-controlled companies and for those planning a career in their family firm. \r\n\tThis course received overwhelmingly positive reviews. Students applauded the “fantastic material covered in this class.” One student mentioned that the course “was one of the few that focused on becoming executive leaders.” Another student had similar thoughts, stating “there was fantastic material covered, a must for all with family businesses!” \r\n\tReviews for Professor Alexander were completely positive. One commented that he was “excellent and credible,” and another commented that he “was clearly passionate about the subject matter.” Students said that he brought in some “great guest speakers- in addition to encouraging students to present.” All agreed that he did an amazing job stimulating class interest. \r\n\tThis class consists of case studies and a final project. One student commented that, “the cases were generally interesting and final project could be worthwhile if students actually put time into it.” This is an MBA course, and is recommended to “anyone that wants to go into a family business or intends to work with family businesses in the future. “\r\n", "num_students": 56, "path": "/courses/27780/sections/001/reviews/2791-WILLIAM-H-ALEXANDER", "instructor": {"path": "/instructors/2791-WILLIAM-H-ALEXANDER", "first_name": "WILLIAM H", "last_name": "ALEXANDER", "id": "2791-WILLIAM-H-ALEXANDER", "name": "WILLIAM H ALEXANDER"}, "num_reviewers": 44, "id": "27780-001-2791-WILLIAM-H-ALEXANDER"}]