[{"ratings": {"rAmountLearned": "2.81", "rDifficulty": "3.38", "rStimulateInterest": "2.84", "rRecommendMajor": "3.37", "rCourseQuality": "2.48", "rWorkRequired": "2.79", "rInstructorAccess": "2.79", "rReadingsValue": "1.91", "rRecommendNonMajor": "1.32", "rCommAbility": "2.95", "rInstructorQuality": "2.97"}, "section": {"name": "INTRO BIO-MOLEC BIO LIFE", "sectionnum": "001", "primary_alias": "BIOL-121-001", "path": "/courses/24059/sections/001", "id": "24059-001", "aliases": ["BIOL-121-001"]}, "comments": "Introduction to Biology: The Molecular Biology of Life is an intensive\r\nintroductory lecture course covering the cell, molecular biology, biochemistry, and the\r\ngenetics of animals, bacteria, and viruses. This course is comparable to Biology 101 but\r\nplaces greater emphasis on molecular mechanisms and experimental approaches,\r\nespecially with regards to the mechanistic basis of human disease.\r\nNearly every student agreed that this class was “interesting” with a good range\r\nand depth of topics. Students overall reported learning a lot from this “informative” class,\r\nsaying that it was a “very good introduction to biology.” Some students like having four\r\ndifferent professors because they liked each professor’s perspective, while others thought\r\nthat the course suffered from a lack of consistency and structure, making it hard to get to\r\nknow and get used to a professor. Recitation was held with the entire class, but several\r\nstudents found this to be “ineffective.” Students were also not very complimentary of the\r\ntextbook/readings and found lectures to be more useful for exams.\r\nStudents generally liked Professor Goulian, describing him as “very good,”\r\n“clear,” and noting that his lectures “followed nicely with the textbook.”\r\nThis course fulfills the Living World Sector. Prerequisites include solid high\r\nschool biology and strong high school chemistry or CHEM 101 taken concurrently. It is\r\nalso required that BIOL 123 is taken concurrently. Many students reported that this was\r\namong the most—if not the most—challenging courses they had taken at Penn. They\r\ndescribed the course as fast-paced, “intense” and “competitive,” describing exams as\r\n“rough” and “very challenging.” While a few thought the course was “fairly evaluated,”\r\nmore students criticized the difficulty of the scale, saying it was “not very generous.”\r\nStudents appreciated being allowed to drop a midterm. Exams emphasized applying\r\nconcepts rather than memory and “regurgitation” of information. In summary: “this\r\ncourse is interesting and challenging, but the grading is so difficult that I would not\r\nrecommend this course unless you have to take it.” This course was not recommended to\r\nfirst semester freshmen.", "num_students": 221, "path": "/courses/24059/sections/001/reviews/983-MARK-D-GOULIAN", "instructor": {"path": "/instructors/983-MARK-D-GOULIAN", "first_name": "MARK D", "last_name": "GOULIAN", "id": "983-MARK-D-GOULIAN", "name": "MARK D GOULIAN"}, "num_reviewers": 200, "id": "24059-001-983-MARK-D-GOULIAN"}, {"ratings": {"rAmountLearned": "2.81", "rDifficulty": "3.38", "rStimulateInterest": "2.97", "rRecommendMajor": "3.37", "rCourseQuality": "2.48", "rWorkRequired": "2.79", "rInstructorAccess": "2.99", "rReadingsValue": "1.91", "rRecommendNonMajor": "1.32", "rCommAbility": "2.81", "rInstructorQuality": "3.05"}, "section": {"name": "INTRO BIO-MOLEC BIO LIFE", "sectionnum": "001", "primary_alias": "BIOL-121-001", "path": "/courses/24059/sections/001", "id": "24059-001", "aliases": ["BIOL-121-001"]}, "comments": "This introductory lecture and laboratory course emphasizes mechanistic\r\napproaches to the understanding of modern biology. The course considers how molecular\r\nmethods and principles contribute to the understanding of biochemistry, cell biology and\r\ngenetics, in the context of evolutionary, developmental and physiological processes. In\r\naddition to studying the current status of biomedical knowledge, every effort is made to\r\nprovide an understanding of how biological systems work, and the methods of biological\r\nresearch. This course addresses not just the WHAT, but also the HOW and (where\r\npossible) the WHY. Contemporary methods encompassing such areas as applied\r\nbiotechnology, genomics, molecular medicine, and the biology of disease are integral\r\ncomponents of the course. Topics to be covered include: protein structure; enzymes;\r\nlipids and membranes; polysaccharides and cell walls; membrane proteins; primary and\r\nsecondary transporters; cellular respiration; ion channels; receptors and signal\r\ntransduction; protein and vesicular traffic; the cytoskeleton, cell cycle and cell division;\r\nDNA replication and repair; transcription, translation and mutations; model organisms\r\nand genomics; gene regulation; Mendelian and population genetics.\r\nStudents said the course material was “interesting.” However, many found the\r\ncourse to be too technical. The course pushes students to think about biological\r\nprocesses rather than simply regurgitate information. One student said “This course\r\nprovided an in depth introduction to essential concepts of molecular biology. It ties topics\r\ntogether in a new way that is less textbook intensive, focusing on the research aspect and\r\nreal world applications of the concepts learned. The guest lectures were great in applying\r\nconcepts learned to real world situations.” Many students found the course to be very\r\ninformational, however, said that the class lacked a focused direction. Students describe\r\nthe course as “fast paced.” Overall students found that the course required much\r\ndedication to understand the material, but the knowledge gained from the course was\r\npriceless for those interested in the sciences.\r\nProfessor Rea was said to be the standout lecturer among the four professors in\r\nthis course. He was said to be passionate about teaching students. In addition, he always\r\nmade himself readily available to students.\r\nThis course fulfills the Living World Sector requirement. The prerequisites\r\ninclude solid high school biology and strong high school chemistry or CHEM 101 taken\r\nconcurrently. BIOL 121 and 123 must be taken concurrently. Biology Majors and Pre-\r\nMedical students should take either BIOL 101 or 121. BIOL 121 is the companion course\r\nto BIOL 124 and may be taken before or after BIOL 124. Many students said this course\r\nwas “extremely difficult.” They found that the material covered in the class did not\r\nprepare students adequately for the exam questions. They said that the curve was\r\n“terrible.” Many of the students who take this course are fulfilling their pre-med\r\nrequirements; the composition of this course breeds a competitive atmosphere.", "num_students": 221, "path": "/courses/24059/sections/001/reviews/1802-PHILIP-ARTHUR-REA", "instructor": {"path": "/instructors/1802-PHILIP-ARTHUR-REA", "first_name": "PHILIP ARTHUR", "last_name": "REA", "id": "1802-PHILIP-ARTHUR-REA", "name": "PHILIP ARTHUR REA"}, "num_reviewers": 200, "id": "24059-001-1802-PHILIP-ARTHUR-REA"}, {"ratings": {"rAmountLearned": "2.81", "rDifficulty": "3.38", "rStimulateInterest": "2.10", "rRecommendMajor": "3.37", "rCourseQuality": "2.48", "rWorkRequired": "2.79", "rInstructorAccess": "2.41", "rReadingsValue": "1.91", "rRecommendNonMajor": "1.32", "rCommAbility": "1.90", "rInstructorQuality": "2.01"}, "section": {"name": "INTRO BIO-MOLEC BIO LIFE", "sectionnum": "001", "primary_alias": "BIOL-121-001", "path": "/courses/24059/sections/001", "id": "24059-001", "aliases": ["BIOL-121-001"]}, "comments": "This introductory lecture course emphasizes mechanistic approaches to the\r\nunderstanding of modern biology. Molecular methods and principles contribute to our\r\nunderstanding of biochemistry, cell biology and genetics, in the context of evolutionary,\r\ndevelopmental and physiological processes. In addition to studying the current status of\r\nbiomedical knowledge, every effort is made to provide an understanding of how\r\nbiological systems work, and the methods of biological research. Not just the WHAT,\r\nbut also the HOW and (where possible) the WHY are addressed. Contemporary methods\r\nencompassing such areas as applied biotechnology, genomics, molecular medicine, and\r\nthe biology of disease are integral components of the course. Topics to be covered\r\ninclude: protein structure; enzymes; lipids and membranes; polysaccharides and cell\r\nwalls; membrane proteins; membrane transport; cellular respiration; ion channels;\r\nreceptors and signal transduction; protein and vesicular traffic; the cytoskeleton, cell\r\ncycle and cell division; DNA replication and repair; transcription, translation and\r\nmutations; model organisms and genomics; gene regulation; Mendelian and population\r\ngenetics.\r\nMany students felt that the course was “interesting,” but was taught at too fast of a\r\npace. Overall, they felt that having four different professors made learning more difficult\r\nbecause they needed to adjust to different teaching styles and paces. This course was\r\ncategorized as “demanding and intensive,” and students felt that the questions that\r\nappeared on the exam didn’t always correlate to what was learned in class.\r\nThe majority of students felt that Professor Brisson’s lectures were not very\r\ncomprehensive. Some said that he had “good intentions,” but is a “poor communicator”\r\nof the material.\r\nMost of the students felt that this course was extremely difficult, and some\r\nrecommended that it was not a good course for first semester freshmen. The grades they\r\nreceived in the course were lower than what they expected. Mainly, they recommended\r\nthis course to premedical students. Overall, the students felt that the readings in the book\r\nwere “worthless.” This class fulfills the living world sector.", "num_students": 221, "path": "/courses/24059/sections/001/reviews/3902-DUSTIN-BRISSON", "instructor": {"path": "/instructors/3902-DUSTIN-BRISSON", "first_name": "DUSTIN", "last_name": "BRISSON", "id": "3902-DUSTIN-BRISSON", "name": "DUSTIN BRISSON"}, "num_reviewers": 200, "id": "24059-001-3902-DUSTIN-BRISSON"}, {"ratings": {"rAmountLearned": "2.81", "rDifficulty": "3.38", "rStimulateInterest": "2.16", "rRecommendMajor": "3.37", "rCourseQuality": "2.48", "rWorkRequired": "2.79", "rInstructorAccess": "2.41", "rReadingsValue": "1.91", "rRecommendNonMajor": "1.32", "rCommAbility": "2.45", "rInstructorQuality": "2.45"}, "section": {"name": "INTRO BIO-MOLEC BIO LIFE", "sectionnum": "001", "primary_alias": "BIOL-121-001", "path": "/courses/24059/sections/001", "id": "24059-001", "aliases": ["BIOL-121-001"]}, "comments": "This is an intensive introductory lecture course covering the cell, molecular\r\nbiology, biochemistry, and the genetics of animals, bacteria, and viruses. This course is\r\ncomparable to Biology 101, but places greater emphasis on molecular mechanisms and\r\nexperimental approaches. Particular attention is given to the ways in which modern cell\r\nbiological and molecular genetic methods contribute to our understanding of evolutionary\r\nprocesses, the mechanistic basis of human disease, and recent biotechnological\r\ninnovations.\r\nStudents found this class to be very “interesting” but also at times “intense.”\r\nStudents reported that the amount of information was at times “overwhelming,”\r\nespecially when compared to AP Biology. Many students mentioned that the course goes\r\nbeyond wrote memorization and into the domain of real world application.\r\nStudents found it difficult to follow the professors in lecture, especially since\r\nthere were four of them. It was often difficult to get in contact with professors outside of\r\nthe classroom and one student mentioned having to go to “four review sessions” in order\r\nto get all the material for the final. Students often mentioned that the book was not\r\nhelpful and that most of the material comes from the lecture slides that are posted online.\r\nMost students found this class to be extremely difficult. Many expressed\r\ndifficulty in answering questions on the exams and that they seemed to be drawn out of\r\nno-where. Students mentioned that this class is intended for majors. Students expressed\r\nthat many of the questions on the test involved application of material and not simply\r\nmemorization.", "num_students": 221, "path": "/courses/24059/sections/001/reviews/3905-MICHAEL-A--LAMPSON", "instructor": {"path": "/instructors/3905-MICHAEL-A--LAMPSON", "first_name": "MICHAEL A.", "last_name": "LAMPSON", "id": "3905-MICHAEL-A--LAMPSON", "name": "MICHAEL A. LAMPSON"}, "num_reviewers": 200, "id": "24059-001-3905-MICHAEL-A--LAMPSON"}]