[{"ratings": {"rAmountLearned": "2.59", "rDifficulty": "3.15", "rStimulateInterest": "1.86", "rRecommendMajor": "3.25", "rCourseQuality": "2.25", "rWorkRequired": "2.92", "rInstructorAccess": "2.82", "rReadingsValue": "2.38", "rRecommendNonMajor": "1.53", "rCommAbility": "2.43", "rInstructorQuality": "2.57"}, "section": {"name": "ECONOMETRICS", "sectionnum": "001", "primary_alias": "ECON-104-001", "path": "/courses/24269/sections/001", "id": "24269-001", "aliases": ["ECON-104-001"]}, "comments": "Economics introduces students to econometric techniques and their applications in economic analysis and decision-making. This course teaches students how to analyze economic data, how to approach economic models with probabilistic tools, how to use econometric techniques, and how to apply these techniques through computer software. Students will become familiar with linear regression models, simultaneous-equations models, discrete choice models and univariate time series models. Students will perform several economic analyses on their own throughout the semester. \r\n\r\nMany students found the material for this course “tedious” and “dull.” Several students considered the problem sets difficult, but generally found the material to be well presented.\r\n\r\nMost student spoke highly of Professor Cheng, citing an ability to “engage the class” and “review concepts at every chance.” Many students also praised Professor Cheng for being “quick to respond to e-mails” and “very willing to answer students’ questions during class.” Overall, Professor Cheng comes very highly regarded. \r\n\r\nMost students in this course were Economics majors. Many students were concerned that the problem sets and exams were challenging, but found Professor Cheng’s presentation of the material to be adequate preparation. The course was not recommended to non-majors. The prerequisites are ECON 101, ECON 103, and MATH 114. ", "num_students": 73, "path": "/courses/24269/sections/001/reviews/4783-XU-CHENG", "instructor": {"path": "/instructors/4783-XU-CHENG", "first_name": "XU", "last_name": "CHENG", "id": "4783-XU-CHENG", "name": "XU CHENG"}, "num_reviewers": 66, "id": "24269-001-4783-XU-CHENG"}]