{"coursehistories": {"path": "/coursehistories/2129"}, "description": "What is American Society? The literary critic, Leslie Fielder once wrote,\"...to be and American...precisely to imagine a destiny rather than to inherit one; since we have always been, insofar as we are Americans at all, inhabitants of myth rather than history...\" The myths that we inherit form the basis of American civil religion. In this course we will explore the elements of the myth that form the basis of the civil religion as well as the facts on the ground that contradict our conceptions of American Society: Examples of mythic elements and their contradiction that we will explore are: A nation founded to pursue liberty and freedom yet allowed slavery, equality of opportunity and persistent structural inequality, and a welcoming of the Immigrant coupled with a suspicion of the outsider. \n\n", "semester": "2011A", "name": "AMERICAN SOCIETY", "reviews": {"path": "/courses/22425/reviews", "values": [{"ratings": {"rAmountLearned": "1.92", "rDifficulty": "1.73", "rStimulateInterest": "1.52", "rRecommendMajor": "2.36", "rCourseQuality": "1.90", "rWorkRequired": "2.05", "rInstructorAccess": "2.52", "rReadingsValue": "2.41", "rRecommendNonMajor": "2.05", "rCommAbility": "1.98", "rInstructorQuality": "2.05"}, "section": {"name": "AMERICAN SOCIETY", "sectionnum": "001", "primary_alias": "SOCI-005-001", "path": "/courses/22425/sections/001", "id": "22425-001", "aliases": ["SOCI-005-001"]}, "comments": "What is American Society? The literary critic, Leslie Fielder once wrote,\"...to be and American...precisely to imagine a destiny rather than to inherit one; since we have always been, insofar as we are Americans at all, inhabitants of myth rather than history...\" The myths that we inherit form the basis of American civil religion. In this course students explore the elements of the myth that form the basis of the civil religion as well as the facts on the ground that contradict our conceptions of American Society. Examples of mythic elements and their contradiction that are explored are: a nation founded to pursue liberty and freedom yet allowed slavery, equality of opportunity and persistent structural inequality, and a welcoming of the Immigrant coupled with a suspicion of the outsider.&#8232;&#8232;Students in this course overall found the material interesting and the class a great addition to their schedules. Some students complained about the lack of structure in the class. The class seems to focus a lot on history in the first half of the semester and really only turns to the present in the last weeks of class&#8232;&#8232;The students gave great reports for Professor Bosk. Despite the occasional boring lecture, students praised him for trying his best to inspire interest among students. He was described as a “great guy,” “insightful,” and “a pleasure to be in class with.” Professor Bosk was very approachable and accessible.&#8232;&#8232;Students really enjoyed the reading list that was assigned in class. Students of all grades and majors took the class. The course does not satisfy any requirements within the sector or foundational approaches within the college. This review is based on 10 student comments.", "num_students": 96, "path": "/courses/22425/sections/001/reviews/1712-CHARLES-L--BOSK", "instructor": {"path": "/instructors/1712-CHARLES-L--BOSK", "first_name": "CHARLES L.", "last_name": "BOSK", "id": "1712-CHARLES-L--BOSK", "name": "CHARLES L. BOSK"}, "num_reviewers": 87, "id": "22425-001-1712-CHARLES-L--BOSK"}]}, "credits": null, "primary_alias": "SOCI-005", "path": "/courses/22425", "sections": {"path": "/courses/22425/sections", "values": [{"name": "AMERICAN SOCIETY", "sectionnum": "001", "primary_alias": "SOCI-005-001", "path": "/courses/22425/sections/001", "id": "22425-001", "aliases": ["SOCI-005-001"]}]}, "id": 22425, "aliases": ["SOCI-005"]}