[{"ratings": {"rAmountLearned": "3.10", "rDifficulty": "3.00", "rStimulateInterest": "2.80", "rRecommendMajor": "3.45", "rCourseQuality": "2.53", "rWorkRequired": "3.63", "rInstructorAccess": "3.14", "rReadingsValue": "1.86", "rRecommendNonMajor": "0.88", "rCommAbility": "2.98", "rInstructorQuality": "3.10"}, "section": {"name": "LECTURE", "sectionnum": "001", "primary_alias": "MEAM-348-001", "path": "/courses/22022/sections/001", "id": "22022-001", "aliases": ["MEAM-348-001"]}, "comments": "The Spring semester lab for juniors in Mechanical Engineering, MEAM 348 follows its Fall predecessor, MEAM 347. This course also follows MEAM 333 Heat Transfer and MEAM 354 Mechanics of Materials with design projects based on those topics. This course also introduces open ended topics, wider design options, and introduces project planning and management.&#8232;&#8232;Students generally found the course to be a “good class” and in some cases “excellent... the best of the MEAM labs [they’ve] taken.” The content of the course was reported as “extremely interesting and relevant” and seen as “really allowing [the students] to use and apply what [they had] learned in the theoretical classes to real life.” Most students felt that they “learned many useful skills and felt very accomplished at the end of every lab.”&#8232;&#8232;Professor Yim was said to have “run the lab well” with Professor Kothman and was reported as “extremely open about student input,” which students found to be “refreshing.” Students felt that Professor Yim taught “very well.” One of the only complaints students had was that they felt “it'd be nice to know more how much was expected” from them for each lab and lab report. &#8232;&#8232;Students generally found there to be a lot of work, one possible reason being that the course “seems to pack in more labs than are comfortable.” Other students reported that the “amount of work was substantial but manageable given the typical MEAM student’s workload.” Overall, students found that even though the course required “more work than [they] were expecting... [they] thought that [they] learned many useful skills and felt very accomplished at the end of every lab.”", "num_students": 66, "path": "/courses/22022/sections/001/reviews/3053-MARK-YIM", "instructor": {"path": "/instructors/3053-MARK-YIM", "first_name": "MARK", "last_name": "YIM", "id": "3053-MARK-YIM", "name": "MARK YIM"}, "num_reviewers": 61, "id": "22022-001-3053-MARK-YIM"}, {"ratings": {"rAmountLearned": "3.10", "rDifficulty": "3.00", "rStimulateInterest": "3.31", "rRecommendMajor": "3.45", "rCourseQuality": "2.53", "rWorkRequired": "3.63", "rInstructorAccess": "3.20", "rReadingsValue": "1.86", "rRecommendNonMajor": "0.88", "rCommAbility": "2.92", "rInstructorQuality": "3.22"}, "section": {"name": "LECTURE", "sectionnum": "001", "primary_alias": "MEAM-348-001", "path": "/courses/22022/sections/001", "id": "22022-001", "aliases": ["MEAM-348-001"]}, "comments": "The Spring semester lab for juniors in Mechanical Engineering, MEAM 348 follows its Fall predecessor, MEAM 347. This course also follows MEAM 333 Heat Transfer and MEAM 354 Mechanics of Materials with design projects based on those topics. This course also introduces open ended topics, wider design options, and introduces project planning and management.&#8232;&#8232;Students generally found the course to be a “good class,” and in some cases “excellent... the best of the MEAM labs [they’ve] taken.” The content of the course was reported as “extremely interesting and relevant” and seen as “really allowing [the students] to use and apply what [they had] learned in theory classes to real life.” Most students thought that they “learned many useful skills and felt very accomplished at the end of every lab.”&#8232;&#8232;Professor Kothman was said to have “run the lab well” with Professor Yim, and was reported as “extremely open about student input,” which students found to be “refreshing.” Students generally felt that Professor Kothman taught “very well.” One of the only complaints some students had was that they felt “it'd be nice to know more how much was expected” from them for each lab and lab report. &#8232;&#8232;Students generally found there to be a lot of work, since the course “seems to pack in more labs than are comfortable.” Other students reported that the “amount of work was substantial but manageable given the typical MEAM student’s workload.” Overall, students found that even though the course required “more work than [they] were expecting... [they] thought that [they] learned many useful skills and felt very accomplished at the end of every lab.”", "num_students": 66, "path": "/courses/22022/sections/001/reviews/3294-BRUCE-D--KOTHMANN", "instructor": {"path": "/instructors/3294-BRUCE-D--KOTHMANN", "first_name": "BRUCE D.", "last_name": "KOTHMANN", "id": "3294-BRUCE-D--KOTHMANN", "name": "BRUCE D. KOTHMANN"}, "num_reviewers": 61, "id": "22022-001-3294-BRUCE-D--KOTHMANN"}]