[{"ratings": {"rAmountLearned": "3.18", "rDifficulty": "2.35", "rStimulateInterest": "3.35", "rRecommendMajor": "3.33", "rCourseQuality": "3.05", "rWorkRequired": "2.88", "rInstructorAccess": "3.62", "rReadingsValue": "2.97", "rRecommendNonMajor": "2.85", "rCommAbility": "3.35", "rInstructorQuality": "3.43"}, "section": {"name": "LAW OF MKTG & ANTITRUST", "sectionnum": "401", "primary_alias": "LGST-205-401", "path": "/courses/15985/sections/401", "id": "15985-401", "aliases": ["LGST-205-401", "MKTG-760-401", "MKTG-236-401", "LGST-805-401"]}, "comments": "LGST205 explores the legal aspects of marketing strategy. The first half considers relevant antitrust doctrine & policy: mergers, acquisitions, and joint ventures; pricing strategy; marketing channel strategy; and limits on market dominance. The second half considers the intellectual property dimension as well as federal and state laws pertaining to trade secrets, unfair competition, and consumer protection. The focus is primarily on U.S. law, but the challenges posed by diverse domestic, foreign, and international regimes will also be emphasized. The course is useful to students contemplating employment in the field of marketing, and to students interested in anticipating legal constraints on competitive strategies. Most broadly, the course should be of interest to anyone desiring to understand the legal and public policy issues relating to the government regulation of business.\r\n\r\nStudents generally found the course “enjoyable” and “interesting” and valued the assigned readings as useful. Professor Constan was described as being “funny, comic relief” and many students felt he led class discussions in a way that was “enjoyable and easy to learn.”\r\n\r\nStudents found Professor Constan to be very accessible and eager to help them understand. One student said Professor Constan was “the most engaged and friendly professor I’ve ever had.”\r\n\r\nThis course comes highly recommended to both majors and non-majors, but students warned that there was a fair amount of reading.", "num_students": 46, "path": "/courses/15985/sections/401/reviews/706-NICHOLAS-D-CONSTAN", "instructor": {"path": "/instructors/706-NICHOLAS-D-CONSTAN", "first_name": "NICHOLAS D", "last_name": "CONSTAN", "id": "706-NICHOLAS-D-CONSTAN", "name": "NICHOLAS D CONSTAN"}, "num_reviewers": 43, "id": "15985-401-706-NICHOLAS-D-CONSTAN"}]