{"coursehistories": {"path": "/coursehistories/867"}, "description": "Philosophers ask difficult questions about the most basic issues in human life. Does God exist? What does it mean to live a good life? How should I treat non-human animals? Do I have free will? How do I know that the world I see is really there? This course is an introduction to some of these questions and to the methods philosophers have developed for thinking clearly about them. \n\n", "semester": "2009A", "name": "INTRO TO PHILOSOPHY", "reviews": {"path": "/courses/16287/reviews", "values": [{"ratings": {"rAmountLearned": "2.74", "rDifficulty": "1.84", "rStimulateInterest": "2.45", "rRecommendMajor": "3.05", "rCourseQuality": "2.59", "rWorkRequired": "1.91", "rInstructorAccess": "2.86", "rReadingsValue": "2.91", "rRecommendNonMajor": "2.65", "rCommAbility": "2.71", "rInstructorQuality": "2.57"}, "section": {"name": "INTRO TO PHILOSOPHY", "sectionnum": "001", "primary_alias": "PHIL-001-001", "path": "/courses/16287/sections/001", "id": "16287-001", "aliases": ["PHIL-001-001"]}, "comments": "This class will reflect on the following fundamental questions: What is the nature of underlying reality? What are the scope and limits of human knowledge? Does God exist? What is the ultimate nature of persons? Do we have free will? These are questions which have been asked since ancient times. As we shall see, they do not have obvious or uncontroversial answers. Perhaps this is why they are still with us. The class shall examine a range of answers to these questions, and students shall develop analytic thinking skills to defend and develop their own answers to these questions.&#8232;&#8232;\r\n\r\nStudents found this course to be an “accessible and interesting introduction to problems of philosophical thought” covering many topics. Some students complained the readings could have been “a bit better,” as some were “never even referenced” in class. One student complained there was a focus more on “modern philosophy over classical philosophy.” &#8232;&#8232;\r\n\r\nSome students were a “bit turned off by the instructor” and found Professor Schneider’s mixed interest in science fiction and philosophy to be a “double-edged sword.” Other students enjoyed Professor Schneider’s lectures and found her to be easily accessible. They described Professor Schneider as an “incredibly competent” instructor who enjoys teaching the subject. &#8232;&#8232;\r\n\r\nThis course fulfills the Humanities & Social Sciences Sector. To note, Freshman Seminar sections are also offered. ", "num_students": 46, "path": "/courses/16287/sections/001/reviews/3457-SUSAN-SCHNEIDER", "instructor": {"path": "/instructors/3457-SUSAN-SCHNEIDER", "first_name": "SUSAN", "last_name": "SCHNEIDER", "id": "3457-SUSAN-SCHNEIDER", "name": "SUSAN SCHNEIDER"}, "num_reviewers": 45, "id": "16287-001-3457-SUSAN-SCHNEIDER"}]}, "credits": null, "primary_alias": "PHIL-001", "path": "/courses/16287", "sections": {"path": "/courses/16287/sections", "values": [{"name": "INTRO TO PHILOSOPHY", "sectionnum": "001", "primary_alias": "PHIL-001-001", "path": "/courses/16287/sections/001", "id": "16287-001", "aliases": ["PHIL-001-001"]}]}, "id": 16287, "aliases": ["PHIL-001"]}