[{"ratings": {"rAmountLearned": "2.32", "rDifficulty": "2.82", "rStimulateInterest": "2.08", "rRecommendMajor": "2.71", "rCourseQuality": "2.17", "rWorkRequired": "2.79", "rInstructorAccess": "2.81", "rReadingsValue": "1.70", "rRecommendNonMajor": "1.34", "rCommAbility": "2.03", "rInstructorQuality": "2.32"}, "section": {"name": "EVOLUTIONARY BIOLOGY", "sectionnum": "001", "primary_alias": "BIOL-230-001", "path": "/courses/27050/sections/001", "id": "27050-001", "aliases": ["BIOL-230-001"]}, "comments": "\tThis course studies theories and mechanisms of evolution, with emphasis on the genetic basis of evolutionary change.\r\n\r\n\tStudents mainly agreed that this was a “very interesting course.”  Students felt they “learned far… more” in this course than any other class.  Additionally, they felt the course touched on the more “nuanced concepts” and forced student to “think about the context” of the material, beyond strict memorization.  At the same time, however, students complained that the course was “all over the place” and lacked organization.  Overall, students felt that the material was very interesting, but the course was structured in a confusing manner.\r\n\r\n\tProfessor Schmidt was described mainly as lacking a “strong and organized style of instruction.”  While many felt that he explained difficult topics well, more students felt Professor Schmidt could have communicated the material more clearly, often since he had many tangents and an erratic lecturing style.  One student also described him as “boring.”  Professor Schmidt was noted for being “accessible” and easy to communicate with outside of the classroom, however.\r\n\r\n\tStudents said this course was difficult, mainly due to the professor’s teaching style.  Students appreciated having only two midterms and enjoyed having a final paper, which “made the science more real.”  Students highly recommend this course for majors, but do not recommend it for non-majors.  BIOL 101 and 102 or BIOL121 are prerequisites for this class", "num_students": 89, "path": "/courses/27050/sections/001/reviews/191-PAUL-STUTZ-SCHMIDT", "instructor": {"path": "/instructors/191-PAUL-STUTZ-SCHMIDT", "first_name": "PAUL STUTZ", "last_name": "SCHMIDT", "id": "191-PAUL-STUTZ-SCHMIDT", "name": "PAUL STUTZ SCHMIDT"}, "num_reviewers": 79, "id": "27050-001-191-PAUL-STUTZ-SCHMIDT"}]