[{"ratings": {"rAmountLearned": "2.58", "rDifficulty": "3.82", "rStimulateInterest": "1.75", "rRecommendMajor": "2.00", "rCourseQuality": "2.33", "rWorkRequired": "3.83", "rInstructorAccess": "3.17", "rReadingsValue": "2.42", "rRecommendNonMajor": "1.25", "rCommAbility": "1.67", "rInstructorQuality": "2.83"}, "section": {"name": "INTR TO SPATIAL ANALYSIS", "sectionnum": "001", "primary_alias": "ESE-502-001", "path": "/courses/21665/sections/001", "id": "21665-001", "aliases": ["ESE-502-001"]}, "comments": "This course is designed to introduce students to modern statistical methods for analyzing spatial data. These methods include nearest-neighbor analyses of spatial point patterns, variogram and kriging analyses of continuous spatial data, and autoregression analyses of area data. The underlying statistical theory of each method is developed and illustrated in terms of selected GIS applications. Students are also given some experience with ARCMAP, JMPIN, and MATLAB software.&#8232;&#8232;While some students found that the course introduced “a variety of interesting subjects,” most felt that the course went “too fast.” There was “a lot of material”, but “not enough covered to the extent where most of the class [understood] it.” &#8232;&#8232;Students tended to agree that Professor Smith’s notes were “sometimes helpful,” but that he tended to “go off topic.” He was described as “an expert in the subject.” &#8232;&#8232;The majority of students felt that the course was “too difficult.” Many felt that the course “requires too much work.” This course was recommended for majors only. &#8232;&#8232;This review is based on the 6 student comments which were submitted.", "num_students": 14, "path": "/courses/21665/sections/001/reviews/1170-TONY-EDWARD-SMITH", "instructor": {"path": "/instructors/1170-TONY-EDWARD-SMITH", "first_name": "TONY EDWARD", "last_name": "SMITH", "id": "1170-TONY-EDWARD-SMITH", "name": "TONY EDWARD SMITH"}, "num_reviewers": 12, "id": "21665-001-1170-TONY-EDWARD-SMITH"}]