{"coursehistories": {"path": "/coursehistories/2625"}, "description": "Discusses the forces that shape a company's marketing structure and the methods of marketing goods and services. Topics studied include the role of marketing in the economic system, the industrial and consumer marketplaces, market segmentation, consumer demand, and buing motivation. Students will discuss retail and wholesale marketing structures, product management, pricing, promotiom, and distribution strategies. Using case studies, the unit will also look at the relation of government to marketing, market research, and methods for measuring the efficieincy of a marketing operation. \n\n", "semester": "2011C", "name": "INTRO TO MARKETING", "reviews": {"path": "/courses/24776/reviews", "values": [{"ratings": {"rAmountLearned": "3.20", "rDifficulty": "2.85", "rStimulateInterest": "3.60", "rRecommendMajor": "3.40", "rCourseQuality": "3.50", "rWorkRequired": "2.80", "rInstructorAccess": "3.15", "rReadingsValue": "2.95", "rRecommendNonMajor": "3.35", "rCommAbility": "3.65", "rInstructorQuality": "3.55"}, "section": {"name": "INTRO TO MARKETING", "sectionnum": "001", "primary_alias": "MKTG-411-001", "path": "/courses/24776/sections/001", "id": "24776-001", "aliases": ["MKTG-411-001"]}, "comments": "*Marketing 411 focuses on three essential areas. Firstly, managers as people — who are they, what are their motivations, and how do they lead? What are the special skills needed to be one? Secondly, what managers do — building the organization, planning, controlling, and coordinating. Lastly, what are the issues facing managers — the impact of computers, business ethics and responsibility, and cultural problems between government and business. Instruction includes an introduction to current quantitative management tools. The course is taught using a combination of lectures and class discussion.\r\n\r\nThe course received relatively positive reviews.  Some said it was great “in terms of structure and teaching.”  It “balanced student presentations, discussion and lecture time well.”\r\n\r\nStudents said Professor Niedermeier had “an excellent ability to discuss subject matter and stay on track.”  One student praised Professor Niedermeier’s ability to balance “ student presentations, class discussion, and lecture time.” Professor Niedermeier was “able to engage students in a dialogue that was both open and analytical.” \r\n\r\nStudents were not impressed with the textbook, in which much reading was assigned, and found the texts “only moderately useful.”  One felt the quizzes were frustrating without “enough questions to get any incorrect.” \r\n\r\n*This review is based on 5 student comments\r\n", "num_students": 23, "path": "/courses/24776/sections/001/reviews/2576-KEITH-E--NIEDERMEIER", "instructor": {"path": "/instructors/2576-KEITH-E--NIEDERMEIER", "first_name": "KEITH E.", "last_name": "NIEDERMEIER", "id": "2576-KEITH-E--NIEDERMEIER", "name": "KEITH E. NIEDERMEIER"}, "num_reviewers": 20, "id": "24776-001-2576-KEITH-E--NIEDERMEIER"}]}, "credits": null, "primary_alias": "MKTG-411", "path": "/courses/24776", "sections": {"path": "/courses/24776/sections", "values": [{"name": "INTRO TO MARKETING", "sectionnum": "001", "primary_alias": "MKTG-411-001", "path": "/courses/24776/sections/001", "id": "24776-001", "aliases": ["MKTG-411-001"]}]}, "id": 24776, "aliases": ["MKTG-411"]}