[{"ratings": {"rAmountLearned": "2.60", "rDifficulty": "2.93", "rStimulateInterest": "2.28", "rRecommendMajor": "3.03", "rCourseQuality": "2.67", "rWorkRequired": "2.38", "rInstructorAccess": "2.25", "rReadingsValue": "2.23", "rRecommendNonMajor": "1.60", "rCommAbility": "2.53", "rInstructorQuality": "2.80"}, "section": {"name": "ENGINEERING BIOTEC", "sectionnum": "401", "primary_alias": "CBE-554-401", "path": "/courses/25734/sections/401", "id": "25734-401", "aliases": ["CBE-554-401", "BE-554-401"]}, "comments": "\r\nThis course provides an advanced study of DNA techniques, bioreactor design for bacteria, mammalian and insect culture, separation methods, chromatography, drug and cell delivery systems, gene therapy, and diagnosis. This course is cross-listed with BE 554.\r\n\r\nStudents reported that the course covered “interested topics … in enough detail”. Some topics were, however, unclear. Students felt that the lectures often “took for granted knowledge of cellular/genetic processes” and “items of important detail were glazed over”. The lectures were “math-centered”, and “difficult to get through or even understand”. The assignments were not met with enthusiasm. The homework sets were not reflective of the difficulty of the exams, group papers were “inefficient”, and the final group project “ended up being superficial” because at students felt they didn’t have the skills to “complete it in the [sufficient] detail”. The exams were also “long and hard”, and students wished there was “more focus on concepts rather than equations”, and that they had more time to “think about the problems rather than rush through them”.\r\n\r\nDr Diamond was hailed to be a good lecturer, and students reported that he communicated the subject matter fairly well, and was fairly accessible.\r\n\r\nThis course was highly recommended for majors, but not so much for non-engineers. This course “would not be helpful to someone who doesn’t want to go into the Biotech or Pharma area”.\r\n\r\nThis review was based on 8 comments. ", "num_students": 58, "path": "/courses/25734/sections/401/reviews/221-SCOTT-L--DIAMOND", "instructor": {"path": "/instructors/221-SCOTT-L--DIAMOND", "first_name": "SCOTT L.", "last_name": "DIAMOND", "id": "221-SCOTT-L--DIAMOND", "name": "SCOTT L. DIAMOND"}, "num_reviewers": 47, "id": "25734-401-221-SCOTT-L--DIAMOND"}]