{"coursehistories": {"path": "/coursehistories/107"}, "description": "The Roman Empire was one of the few great world states-one that unified a large area around the Mediterranean Sea-an area never subsequently united as part of a single state. Whereas the great achievements of the Greeks were in the realm of ideas and concepts (democracy, philosophy, art, literature, drama) those of the Romans tended to be in the pragmatic spheres of ruling and controlling subject peoples and integrating them under the aegis of an imperial state. Conquest, warfare, administration, and law making were the great successes of the Roman state. We will look at this process from its inception and trace the formation of Rome's Mediterranean empire over the last three centuries BC; we shall then consider the social, economic and political consequences of this great achievement, especially the great political transition from the Republic (rule by the Senate) to the Principate (rule by emperors). We shall also consider limitations to Roman power and various types of challenges, military, cultural, and religious, to the hegemony of the Roman state. Finally, we shall try to understand the process of the development of a distinctive Roman culture from the emergence new forms of literature, like satire, to the gladiatorial arena as typical elements that contributed to a Roman social order. \n\n", "semester": "2009A", "name": "ANCIENT ROME", "reviews": {"path": "/courses/15302/reviews", "values": [{"ratings": {"rAmountLearned": "2.93", "rDifficulty": "2.76", "rStimulateInterest": "3.70", "rRecommendMajor": "3.54", "rCourseQuality": "3.24", "rWorkRequired": "2.89", "rInstructorAccess": "3.13", "rReadingsValue": "2.81", "rRecommendNonMajor": "2.94", "rCommAbility": "3.61", "rInstructorQuality": "3.69"}, "section": {"name": "ANCIENT ROME", "sectionnum": "401", "primary_alias": "ANCH-027-401", "path": "/courses/15302/sections/401", "id": "15302-401", "aliases": ["ANCH-027-401", "HIST-027-401"]}, "comments": "While many students felt strongly about how great this class was, others had some complaints. Some felt that the class wasn’t very coherent as it, “wandered aimlessly through Roman history.” Some others mentioned that the readings were “excessively dry” and that there was simply too much reading to keep up on. Still, many of the students loved the class, saying that Professor McInerney’s lectures “blend the witty and provocative, the ancient and modern, to spur the interest of both classics majors and engineers. “\r\n\r\nWhile some students had mixed feelings about the class, everyone agreed that Professor McInerney was an amazing teacher. Many said he was a “damn good professor” and is “one of the best at Penn”. Many students remarked that he constantly seemed to be in a good mood and that he was always ready to spice up the lectures with a joke or two. However, some did complain that he spoke quickly and moved through the content very fast and it was difficult to take notes in lecture.\r\n\r\nWhile most students loved Professor McInerney and his class, some did complain that there was simply “too much work for an 027 history class.” Another student complained that the quizzes were too nitpicky, and would focus on one line from a reading of 150 pages. Still, another student said that “as long as you stay on top of the readings and do the few papers that there are (one response paper, a term paper and a midterm in class essay) and do well on the final, it’s a really enjoyable class.”", "num_students": 236, "path": "/courses/15302/sections/401/reviews/84-JEREMY-MCINERNEY", "instructor": {"path": "/instructors/84-JEREMY-MCINERNEY", "first_name": "JEREMY", "last_name": "MCINERNEY", "id": "84-JEREMY-MCINERNEY", "name": "JEREMY MCINERNEY"}, "num_reviewers": 221, "id": "15302-401-84-JEREMY-MCINERNEY"}]}, "credits": null, "primary_alias": "ANCH-027", "path": "/courses/15302", "sections": {"path": "/courses/15302/sections", "values": [{"name": "ANCIENT ROME", "sectionnum": "401", "primary_alias": "ANCH-027-401", "path": "/courses/15302/sections/401", "id": "15302-401", "aliases": ["ANCH-027-401", "HIST-027-401"]}]}, "id": 15302, "aliases": ["ANCH-027", "HIST-027"]}