[{"ratings": {"rAmountLearned": "2.85", "rDifficulty": "2.65", "rStimulateInterest": "3.18", "rRecommendMajor": "3.47", "rCourseQuality": "2.85", "rWorkRequired": "1.97", "rInstructorAccess": "3.24", "rReadingsValue": "2.53", "rRecommendNonMajor": "2.68", "rCommAbility": "3.27", "rInstructorQuality": "3.18"}, "section": {"name": "HUMAN SEXUALITY", "sectionnum": "001", "primary_alias": "PSYC-168-001", "path": "/courses/20755/sections/001", "id": "20755-001", "aliases": ["PSYC-168-001"]}, "comments": "Human Sexuality covers topics ranging from the anatomy and physiology of the human reproductive system to the cognitive systems that underpin human sexual behavior. Throughout, there is an emphasis on the relationship between the features of these physical and cognitive mechanisms and the evolutionary functions these systems were designed to serve.\r\n\r\nStudents loved this course, with many calling it “one of my favorites at Penn.” They found the content interesting and appreciated that Professor Kurzban related the course material to current events.  Students reported learning a lot and one commented that she will “actually remember a good amount of the material unlike other classes.” Students also noted that the class was well organized and the slides were a great study tool.\t\r\n\r\nProfessor Kurzban was very popular among students, who called him “amazing” and “engaging.” Students enjoyed Professor Kurzban’s sense of humor, saying that he was “always animated and made lots of jokes.” Another student noted that despite the 9am start time,  “I always wanted to come to class because he made it so fun to learn the material.”\r\n\r\nStudents found the exams fairly difficult. The multiple choice questions were very specific and “material not explicitly covered in class was on exam.” PSYC001 is a prerequisite for this course and the course fulfills the Society sector requirement.", "num_students": 51, "path": "/courses/20755/sections/001/reviews/1946-ROBERT-O--KURZBAN", "instructor": {"path": "/instructors/1946-ROBERT-O--KURZBAN", "first_name": "ROBERT O.", "last_name": "KURZBAN", "id": "1946-ROBERT-O--KURZBAN", "name": "ROBERT O. KURZBAN"}, "num_reviewers": 37, "id": "20755-001-1946-ROBERT-O--KURZBAN"}]