[{"ratings": {"rAmountLearned": "2.07", "rDifficulty": "2.93", "rStimulateInterest": "2.00", "rRecommendMajor": "2.27", "rCourseQuality": "1.87", "rWorkRequired": "3.40", "rInstructorAccess": "2.07", "rReadingsValue": "1.80", "rRecommendNonMajor": "1.13", "rCommAbility": "2.20", "rInstructorQuality": "2.00"}, "section": {"name": "CLINICAL MODALITIES ACROSS THE LIFE CYCLE IN ADV PRACT PSYCH/MENT HLTH NURS", "sectionnum": "001", "primary_alias": "NURS-625-001", "path": "/courses/23554/sections/001", "id": "23554-001", "aliases": ["NURS-625-001"]}, "comments": "In Nursing 625, crisis intervention, brief psychotherapy, group processes and practices, milieu therapy, and intervention with families are examined as they relate to nursing practice in mental health.\r\n\r\nStudents generally found this to be an “excellent course in the beginning” but eventually a “disappointment.” The paper took an “exceptional amount of time to research and complete.” Many felt that it was weighed too much in the grade—“50% is too much for one paper”—and that it was “incongruent with the material…learned in class.” Most students also did not like that they could not figure out where they were in the class “grade-wise until the semester [was] over.”\r\n\r\nMany students felt that Dr. Coleman tried to “encourage out-of-class engagement” with them, but that the professor did not seem to care if students “liked the course.” Some felt that the grading was not objective.\r\n\r\nOne student remarked that the course would “absolutely direct future practice as well as self-development.” Many found that they would have liked more videos or demonstrations. There were a “heavy amount of readings and quizzes.”\r\n", "num_students": 15, "path": "/courses/23554/sections/001/reviews/2630-CHRISTOPHER-LANCE-COLEMAN", "instructor": {"path": "/instructors/2630-CHRISTOPHER-LANCE-COLEMAN", "first_name": "CHRISTOPHER LANCE", "last_name": "COLEMAN", "id": "2630-CHRISTOPHER-LANCE-COLEMAN", "name": "CHRISTOPHER LANCE COLEMAN"}, "num_reviewers": 15, "id": "23554-001-2630-CHRISTOPHER-LANCE-COLEMAN"}]