{"coursehistories": {"path": "/coursehistories/2555"}, "description": "This course investigates methods of economic analysis for decision making among alternative courses of action in engineering applications. Topics include: cost-driven design economics, break-even anlaysis, money-time relationships, rates of return, cost estimation, depreciation and taxes, foreign exchange rates, life cycle analysis, benefit-cost ratios, risk analysis, capital financing and allocation, and financial statement analysis. Case studies apply these topics to actual engineering problems. \n\n", "semester": "2011A", "name": "ENGINEERING ECONOMICS", "reviews": {"path": "/courses/21661/reviews", "values": [{"ratings": {"rAmountLearned": "3.38", "rDifficulty": "2.97", "rStimulateInterest": "2.99", "rRecommendMajor": "3.41", "rCourseQuality": "3.20", "rWorkRequired": "3.87", "rInstructorAccess": "3.16", "rReadingsValue": "2.89", "rRecommendNonMajor": "2.99", "rCommAbility": "3.28", "rInstructorQuality": "3.40"}, "section": {"name": "ENGINEERING ECONOMICS", "sectionnum": "401", "primary_alias": "ESE-400-401", "path": "/courses/21661/sections/401", "id": "21661-401", "aliases": ["ESE-400-401", "ESE-540-401"]}, "comments": "This course investigates methods of economic analysis for decision-making among alternative courses of action in engineering applications. The topics covered throughout the semester include cost-driven design economics, break-even analysis, money-time relationships, rates of return, cost estimation, depreciation and taxes, foreign exchange rates, life cycle analysis, benefit-cost ratios, risk analysis, capital financing and allocation, and financial statement analysis. Case studies apply these topics to actual engineering problems.&#8232;&#8232;Overall, students were very pleased with this course. They felt that this class was very rewarding, as they learned concepts that were “useful” and “practical.” Students also felt that concepts in class were consolidated in the assigned case studies. One student even claimed, “[ESE 400] is a fantastic class that will benefit me throughout my life and career.” &#8232;&#8232;Almost all students thought that Dr. Cassel was a “great professor” and felt he did an excellent job teaching the quantitative analysis behind everyday business decisions. Dr. Cassel was “prompt” with grading and returning homework, and he ran the class in a “very organized” way. Many students felt that Dr. Cassel gave them their “money’s worth.” &#8232;&#8232;Students considered this a difficult class that moved very fast and required a lot of work, especially for the weekly case studies. Since class only met once a week, there was a quiz given every lecture. The course was recommended for anyone who “wants some practical knowledge.” Some even said that this was the “best course for engineers who are interested in finance and accounting.” Knowledge of calculus and probability is required for this class.", "num_students": 98, "path": "/courses/21661/sections/401/reviews/317-THOMAS-A--CASSEL", "instructor": {"path": "/instructors/317-THOMAS-A--CASSEL", "first_name": "THOMAS A.", "last_name": "CASSEL", "id": "317-THOMAS-A--CASSEL", "name": "THOMAS A. CASSEL"}, "num_reviewers": 96, "id": "21661-401-317-THOMAS-A--CASSEL"}]}, "credits": null, "primary_alias": "ESE-400", "path": "/courses/21661", "sections": {"path": "/courses/21661/sections", "values": [{"name": "ENGINEERING ECONOMICS", "sectionnum": "401", "primary_alias": "ESE-400-401", "path": "/courses/21661/sections/401", "id": "21661-401", "aliases": ["ESE-400-401", "ESE-540-401"]}]}, "id": 21661, "aliases": ["ESE-400", "ESE-540"]}