{"coursehistories": {"path": "/coursehistories/1381"}, "description": "The course explores the legal aspects of marketing strategy. The course considers the technology and intelectual property dimension (including federal patent, copyright, and trademark law), as well as federal and state laws pertaining to trade secrets, unfair competition, and consumer protection. The focus is primarily on U.S. law, but the challenges posed by diverse domestic, foreign, and international regimes will also be emphasized. The course is useful to students contemplating employment in the field of marketing, and to students interested in anticipating legal constraints on competitive strategies. Most broadly, the course should be of interest to anyone desiring to understand the legal and public policy issues relating to the government regulation of business. \n\n", "semester": "2010A", "name": "LAW OF MKTG & ANTITRUST", "reviews": {"path": "/courses/26281/reviews", "values": [{"ratings": {"rAmountLearned": "3.25", "rDifficulty": "2.50", "rStimulateInterest": "3.25", "rRecommendMajor": "3.29", "rCourseQuality": "3.10", "rWorkRequired": "3.00", "rInstructorAccess": "3.54", "rReadingsValue": "3.04", "rRecommendNonMajor": "2.71", "rCommAbility": "3.04", "rInstructorQuality": "3.43"}, "section": {"name": "LAW OF MKTG & ANTITRUST", "sectionnum": "401", "primary_alias": "LGST-205-401", "path": "/courses/26281/sections/401", "id": "26281-401", "aliases": ["LGST-205-401", "MKTG-760-401", "LGST-805-401", "MKTG-236-401"]}, "comments": "LGST205 explores the legal aspects of marketing strategy. The first half considers relevant antitrust doctrine and policy: mergers, acquisitions, and joint ventures; pricing strategy (e.g., price fixing, exchanging price information, predatory pricing, and discriminatory pricing); marketing channel strategy (e.g., resale price maintenance, territorial and customer restrictions, exclusive dealing, refusals to deal, etc.); and limits on market dominance. The second half considers issues the intellectual property dimension (including federal patent, copyright, and trademark law). The focus is primarily on U.S. law, but the challenges posed by diverse domestic, foreign, and international regimes will also be emphasized. The course is useful to students contemplating employment in the field of marketing, and to students interested in anticipating legal constraints on competitive strategies. Most broadly, the course should be of interest to anyone desiring to understand the legal and public policy issues relating to the government regulation of business.\r\n\r\nStudents said that they “loved this course.” This course is a “good way to get perspectives from across disciplines.” One student believed it would help them “in law school.” Students “learnt a lot.”\r\n\r\nStudents loved Professor Constan. Professor Constan is an “absolutely phenomenal teacher.” One student felt that “Prof. Constan is not just a great teacher but also a great person.” Professor Constan was considered “very funny” and made students “enjoy coming to class.” As one student wrote, Professor Constan is the “best professor I’ve had at Penn.”\r\n\r\nExams were considered “fair” and one student felt that the “readings, while valuable, are a little too long.”", "num_students": 32, "path": "/courses/26281/sections/401/reviews/706-NICHOLAS-D-CONSTAN", "instructor": {"path": "/instructors/706-NICHOLAS-D-CONSTAN", "first_name": "NICHOLAS D", "last_name": "CONSTAN", "id": "706-NICHOLAS-D-CONSTAN", "name": "NICHOLAS D CONSTAN"}, "num_reviewers": 31, "id": "26281-401-706-NICHOLAS-D-CONSTAN"}]}, "credits": null, "primary_alias": "LGST-205", "path": "/courses/26281", "sections": {"path": "/courses/26281/sections", "values": [{"name": "LAW OF MKTG & ANTITRUST", "sectionnum": "401", "primary_alias": "LGST-205-401", "path": "/courses/26281/sections/401", "id": "26281-401", "aliases": ["LGST-205-401", "MKTG-760-401", "LGST-805-401", "MKTG-236-401"]}]}, "id": 26281, "aliases": ["LGST-205", "MKTG-760", "LGST-805", "MKTG-236"]}