[{"ratings": {"rAmountLearned": "3.35", "rDifficulty": "2.05", "rStimulateInterest": "3.05", "rRecommendMajor": "3.75", "rCourseQuality": "2.90", "rWorkRequired": "2.32", "rInstructorAccess": "3.35", "rReadingsValue": "3.30", "rRecommendNonMajor": "3.20", "rCommAbility": "3.35", "rInstructorQuality": "3.27"}, "section": {"name": "SOCIAL STRATIFICATION", "sectionnum": "001", "primary_alias": "SOCI-010-001", "path": "/courses/26764/sections/001", "id": "26764-001", "aliases": ["SOCI-010-001"]}, "comments": "This course explores social stratification. The American Dream highlights opportunity for individuals to achieve success based on their own ability and initiative. An interesting set of questions raised is the following: how well does our society live up to this ideal? Who gets ahead, and who falls behind? Topics include factors that affect life chances in contemporary society: education, social class, race, ethnicity and gender.\r\n\r\nThe course was generally described as enjoyable and featured “fun and interesting” discussions. The material was “thought-provoking” and was praised for addressing present-day issues. However, one student did register a complaint about “a bit of a slant” to the readings and essay prompts, saying that he felt he was forced to answer questions in a certain way.\r\n\r\nStudents had nothing but praise for Professor Viscelli, lauding his knowledge and his ability to stimulate discussion. He was described as “easy to talk to” and “understanding.” He reportedly had a great ability to teach the material, as he “ensures that you learn what he wants you to.”\r\n\r\nExams were delivered as essay questions, which “tend to consume the better part of a weekend each time” but were reportedly reasonably graded. The workload for the course seemed to be relatively light. Students recommended the class highly to both Sociology majors and non-majors alike. The course is open to all class levels and has no prerequisites, and it satisfies the Society sector requirement. *This review is based on the 6 student comments that were submitted. ", "num_students": 25, "path": "/courses/26764/sections/001/reviews/4106-STEPHEN-R--VISCELLI", "instructor": {"path": "/instructors/4106-STEPHEN-R--VISCELLI", "first_name": "STEPHEN R.", "last_name": "VISCELLI", "id": "4106-STEPHEN-R--VISCELLI", "name": "STEPHEN R. VISCELLI"}, "num_reviewers": 23, "id": "26764-001-4106-STEPHEN-R--VISCELLI"}]