{"coursehistories": {"path": "/coursehistories/3848"}, "description": "This course covers core subject matter common to the fields of robotics, character animation and embodied intelligent agents. The intent of the course is to provide the student with a solid technical foundation for developing, animating and controlling articulated systems used in interactive computer game virtual reality simulations and high-end animation applications. The course balances theory with practice by \"looking under the hood\" of current animation systems and authoring tools and exams the technologies and techniques used from both a computer science and engineering perspective. Topics covered include: geometric coordinate systems and transformations; quaternions; parametric curves and surfaces; forward and inverse kinematics; dynamic systems and control; computer simulation; keyframe, motion capture and procedural animation; behavior-based animation and control; facial animation; smart characters and intelligent agents. \n\n", "semester": "2010C", "name": "COMPUTER ANIMATION", "reviews": {"path": "/courses/22835/reviews", "values": [{"ratings": {"rAmountLearned": "2.91", "rDifficulty": "3.14", "rStimulateInterest": "2.37", "rRecommendMajor": "3.29", "rCourseQuality": "2.72", "rWorkRequired": "3.09", "rInstructorAccess": "3.16", "rReadingsValue": "2.85", "rRecommendNonMajor": "1.34", "rCommAbility": "2.66", "rInstructorQuality": "2.81"}, "section": {"name": "COMPUTER ANIMATION", "sectionnum": "401", "primary_alias": "CIS-462-401", "path": "/courses/22835/sections/401", "id": "22835-401", "aliases": ["CIS-462-401", "CIS-562-401"]}, "comments": "This course covers core subject matter common to the fields of robotics, character animation and embodied intelligent agents. The intent of the course is to provide the student with a solid technical foundation for developing, animating and controlling articulated systems used in interactive computer game virtual reality simulations and high-end animation applications. The course balances theory with practice by \"looking under the hood\" of current animationsystems and authoring tools and exams the technologies and techniques used from both a computer science and engineering perspective. Topics covered include: geometric coordinate systems and transformations; quaternions; parametric curves and surfaces; forward and inverse kinematics; dynamic systems and control; computer simulation; keyframe, motion capture and procedural animation; behavior-based animation and control; facial animation; smart characters and intelligent agents.\r\n\r\nStudents generally found the course to be valuable for their major, and most felt that the content was useful and interesting. However, many students found the readings to be excessive and unnecessary.\r\n\r\nMost students did not seem to enjoy Professor Lane’s teaching style, as many commented he covered content in a dry manner and manipulated equations in a way that became detached from the “big picture.”\r\n\r\nPrerequisites for this course include linear algebra, curves and surfaces, dynamical systems, and 3D computer graphics. One student recommended significant background in C++.\r\n", "num_students": 41, "path": "/courses/22835/sections/401/reviews/310-STEPHEN-LANE", "instructor": {"path": "/instructors/310-STEPHEN-LANE", "first_name": "STEPHEN", "last_name": "LANE", "id": "310-STEPHEN-LANE", "name": "STEPHEN LANE"}, "num_reviewers": 36, "id": "22835-401-310-STEPHEN-LANE"}]}, "credits": null, "primary_alias": "CIS-462", "path": "/courses/22835", "sections": {"path": "/courses/22835/sections", "values": [{"name": "COMPUTER ANIMATION", "sectionnum": "401", "primary_alias": "CIS-462-401", "path": "/courses/22835/sections/401", "id": "22835-401", "aliases": ["CIS-462-401", "CIS-562-401"]}]}, "id": 22835, "aliases": ["CIS-462", "CIS-562"]}