[{"ratings": {"rAmountLearned": "3.28", "rDifficulty": "1.93", "rStimulateInterest": "3.10", "rRecommendMajor": "3.59", "rCourseQuality": "3.18", "rWorkRequired": "1.79", "rInstructorAccess": "3.14", "rReadingsValue": "2.76", "rRecommendNonMajor": "3.45", "rCommAbility": "3.24", "rInstructorQuality": "3.18"}, "section": {"name": "NEGOTIATIONS", "sectionnum": "401", "primary_alias": "OPIM-291-401", "path": "/courses/22239/sections/401", "id": "22239-401", "aliases": ["OPIM-291-401", "MGMT-291-401", "LGST-206-401"]}, "comments": "Negotiation is the art and the science of creating good agreements. This course develops managerial negotiation skills by mixing lectures and practice, using cases and exercises in which students negotiate with each other. The cases cover a wide range of problems and settings: one-shot deals between individuals, repeated negotiations, negotiations over several issues, negotiations among several parties (both within and between organizations), and cross-cultural issues. Performance in the cases accounts for nearly half the course grade. Students must also describe their experience and thoughts in a journal, and write a term paper. This course will complement the technical and diagnostic skills you have learned in other courses at Wharton. A basic premise of the course is that, while you will need analytical skills to discover optimal solutions to problems, you will also need a broad array of negotiation skills to implement these solutions and make sure that they are truly effective. The following is a partial list of the course's objectives: &#8232;• Gain a deep understanding of the strategic structure of negotiations. It is critical to learn to think rigorously about the strategic aspects of negotiations such as interests, goals, positions, rights, and power. These issues are often ambiguous and do not have singularly correct answers.&#8232;Students praised this course overall and felt that they “learned a lot” in terms of both “how to negotiate” and how to “work with other people.” Some student commented that they were “excited to come to class each day”, as each lecture was “extremely enjoyable.” Students agreed that “this course is one of the most interesting courses at Penn,” and that the course material was “extremely useful for real life and business.” Multiple students commented that they learned the most from this course out of all their classes at Penn. &#8232;&#8232;Students called Professor Kimbrough a “great instructor” who was a “great part of the learning process of this course.” An engaging lecturer, Professor Kimbrough “established an atmosphere of collaboration focused on the skills and concepts involved in the course.” Students further commented that Professor Kimbrough “was a great influence on every student in the course.” &#8232;&#8232;Students overall enjoyed the work for this course and appreciated the group projects. Some, however, wished there had been a “peer-review process” rather than simple group-grading. Others expressed uncertainty regarding their grades and were “worried about how we will be evaluated” as they were “unsure of what it really required to get a good grade” due to the “vague” grading scheme. &#8232;&#8232;*Six students submitted comments for this course.", "num_students": 35, "path": "/courses/22239/sections/401/reviews/931-STEVEN-O-KIMBROUGH", "instructor": {"path": "/instructors/931-STEVEN-O-KIMBROUGH", "first_name": "STEVEN O", "last_name": "KIMBROUGH", "id": "931-STEVEN-O-KIMBROUGH", "name": "STEVEN O KIMBROUGH"}, "num_reviewers": 34, "id": "22239-401-931-STEVEN-O-KIMBROUGH"}, {"ratings": {"rAmountLearned": "3.38", "rDifficulty": "2.25", "rStimulateInterest": "3.53", "rRecommendMajor": "4.00", "rCourseQuality": "3.37", "rWorkRequired": "2.00", "rInstructorAccess": "3.69", "rReadingsValue": "2.94", "rRecommendNonMajor": "3.94", "rCommAbility": "3.50", "rInstructorQuality": "3.33"}, "section": {"name": "NEGOTIATIONS", "sectionnum": "402", "primary_alias": "OPIM-291-402", "path": "/courses/22239/sections/402", "id": "22239-402", "aliases": ["OPIM-291-402", "MGMT-291-402", "LGST-206-402"]}, "comments": "", "num_students": 25, "path": "/courses/22239/sections/402/reviews/5505-JULIA-MINSON", "instructor": {"path": "/instructors/5505-JULIA-MINSON", "first_name": "JULIA", "last_name": "MINSON", "id": "5505-JULIA-MINSON", "name": "JULIA MINSON"}, "num_reviewers": 21, "id": "22239-402-5505-JULIA-MINSON"}, {"ratings": {"rAmountLearned": "3.19", "rDifficulty": "2.26", "rStimulateInterest": "3.04", "rRecommendMajor": "3.63", "rCourseQuality": "3.21", "rWorkRequired": "2.30", "rInstructorAccess": "3.44", "rReadingsValue": "2.67", "rRecommendNonMajor": "3.44", "rCommAbility": "3.26", "rInstructorQuality": "3.21"}, "section": {"name": "NEGOTIATIONS", "sectionnum": "403", "primary_alias": "OPIM-291-403", "path": "/courses/22239/sections/403", "id": "22239-403", "aliases": ["OPIM-291-403", "MGMT-291-403", "LGST-206-403"]}, "comments": "", "num_students": 33, "path": "/courses/22239/sections/403/reviews/5505-JULIA-MINSON", "instructor": {"path": "/instructors/5505-JULIA-MINSON", "first_name": "JULIA", "last_name": "MINSON", "id": "5505-JULIA-MINSON", "name": "JULIA MINSON"}, "num_reviewers": 32, "id": "22239-403-5505-JULIA-MINSON"}]