[{"ratings": {"rAmountLearned": "2.61", "rDifficulty": "2.89", "rStimulateInterest": "1.70", "rRecommendMajor": "3.59", "rCourseQuality": "2.31", "rWorkRequired": "3.25", "rInstructorAccess": "2.70", "rReadingsValue": "1.71", "rRecommendNonMajor": "0.59", "rCommAbility": "1.91", "rInstructorQuality": "2.12"}, "section": {"name": "MECH ENG DESIGN PROJECTS", "sectionnum": "001", "primary_alias": "MEAM-445-001", "path": "/courses/23392/sections/001", "id": "23392-001", "aliases": ["MEAM-445-001"]}, "comments": "This is a capstone design project course in mechanical engineering and is required of all mechanical engineering students. Students will be involved in selected group or individual projects emphasizing design, development, and experimentation, under the supervision of a MEAM faculty advisor. Projects are sponsored either by industry or by Penn professors. Alternatively, students may propose their own projects. Each project is approved by the instructor and the faculty advisor. The work is spread over MEAM 445 and MEAM 446. In addition to being involved in the design project, MEAM 445 covers project planning, patent and library searches, professional education, ethics, writing skills, communication, and technical presentation.\r\n\r\nOverall, students enjoyed the course. Many noted, though, that the groups of five were too big and caused communication problems. A few students found it troubling that they could not choose their own members and suggested going back to the previous system. One student lamented that “no one listens to my ideas” and felt that the grade depended too much on one-sided peer reviews. \r\n\r\nStudents generally described Professor Jeffcoat as approachable and accessible. One student felt that he was “the ideal professor to teach this course” and had many interesting ideas. However, several students found that some lectures lacked content and were repetitive, such as the one on library research. \r\n\r\nThis class is open to students with junior standing and above, and it contained mostly seniors. It is a project-oriented course recommended to MEAM majors only.\r\n\r\n", "num_students": 54, "path": "/courses/23392/sections/001/reviews/2438-ROBERT-L--JEFFCOAT", "instructor": {"path": "/instructors/2438-ROBERT-L--JEFFCOAT", "first_name": "ROBERT L.", "last_name": "JEFFCOAT", "id": "2438-ROBERT-L--JEFFCOAT", "name": "ROBERT L. JEFFCOAT"}, "num_reviewers": 50, "id": "23392-001-2438-ROBERT-L--JEFFCOAT"}]