[{"ratings": {"rAmountLearned": "3.17", "rDifficulty": "1.94", "rStimulateInterest": "3.35", "rRecommendMajor": "3.53", "rCourseQuality": "3.00", "rWorkRequired": "1.93", "rInstructorAccess": "2.27", "rReadingsValue": "2.36", "rRecommendNonMajor": "3.00", "rCommAbility": "3.16", "rInstructorQuality": "3.31"}, "section": {"name": "PRICING STRATEGIES", "sectionnum": "001", "primary_alias": "MKTG-288-001", "path": "/courses/27795/sections/001", "id": "27795-001", "aliases": ["MKTG-288-001"]}, "comments": "MKTG 288 is designed to equip students with the concepts, techniques, and latest thinking on pricing issues, with an emphasis on ways in which to help a firm improve its pricing. The orientation of the course is about practice of pricing, not theory. The course focuses on how firms can improve profitability through pricing and looks at how firms set their prices and how to improve current practices to increase profitability. The first part of the course focuses on how to analyze costs, customers, and competitors in order to formulate proactive pricing strategies. The second part focuses on price promotions, price bundling, price discrimination, versioning, nonlinear pricing, pricing through a distribution channel, dynamic pricing, etc. The course contains a group project.\r\n\r\nStudents commented that the course material was “very interesting” and offered insight into many different marketing strategies. Students said concepts were often taught through “relevant stories and real-life examples.”\r\n\r\nMost students found Professor Zhang to be “phenomenal” because he was “engaging” and “genuinely cared about his students.” Students also commented that Professor Zhang was able to “communicate his experience” to the class. Nevertheless, a significant minority of students described Professor Zhang as “unapproachable” and “condescending” towards students.\r\n\r\nOverall, students thought MKTG 288 was “fantastic.” The prerequisite for this course is MKTG 101.\r\n", "num_students": 57, "path": "/courses/27795/sections/001/reviews/1614-Z--JOHN-ZHANG", "instructor": {"path": "/instructors/1614-Z--JOHN-ZHANG", "first_name": "Z. JOHN", "last_name": "ZHANG", "id": "1614-Z--JOHN-ZHANG", "name": "Z. JOHN ZHANG"}, "num_reviewers": 57, "id": "27795-001-1614-Z--JOHN-ZHANG"}]