{"coursehistories": {"path": "/coursehistories/5001"}, "description": "This course is a two part series. The first part concentrating on the Indian Consumer will be offered in December 2011. The second part, concentrating on the Chinese Consumer will be offered in March 2012. India and China add up to half of the world's population. Each presents its own challenges and opportunities. US and European MNCs have been in both countries for many years, but emerging market MNC's are becoming stronger and in many cases overtaking US and European companies despite their strong brands and know-how. \n\nMarketing to the Indian Consumer will provide a careful understanding of: The opportunity and challenges in the Indian consumer market 2) Various segments within the Indian consumer market. 3) Consumer psychology and decision making processes in each segment 4) Distribution channels in Indi Media in India: Mass, Local and non-traditional. 6) Bottom of the pyramid consumers and rural markets. 7) Product design and development decisions. The course will focus on the following industries: consumer packaged goods, mobile phones, financial services (insurance and banking), healthcare, sports and entertainment, and transportation. The course will involve case studies from local and international companies, guest lecturers, and visits to consumer homes to observe their tastes, habits, and preferences. \n\nMarketing to the Chinese Consumer will provide students with a critical understanding of the Chinese consumer, distribution channels, pricing environment, branding and competitive dynamics so as to enhance their ability to market to the Chinese consumer successfully. The course will consist of a combination of lectures, case studies, presentations by industry experts, and a short evening field trip. \n\nInactive \n\n", "semester": "2013A", "name": "MKTG TO INDIAN CONSUMER: Mktg in Emerging Economies: Understanding & Marketing to Indian Consumer", "reviews": {"path": "/courses/30671/reviews", "values": [{"ratings": {"rAmountLearned": "3.41", "rDifficulty": "2.36", "rStimulateInterest": "3.64", "rRecommendMajor": "3.55", "rCourseQuality": "3.68", "rWorkRequired": "2.62", "rInstructorAccess": "3.55", "rReadingsValue": "2.91", "rRecommendNonMajor": "3.32", "rCommAbility": "3.73", "rInstructorQuality": "3.73"}, "section": {"name": "MKTG TO INDIAN CONSUMER: Mktg in Emerging Economies: Understanding & Marketing to Indian Consumer", "sectionnum": "401", "primary_alias": "MKTG-893-401", "path": "/courses/30671/sections/401", "id": "30671-401", "aliases": ["MKTG-893-401"]}, "comments": "", "num_students": 37, "path": "/courses/30671/sections/401/reviews/830-JAGMOHAN-SINGH-RAJU", "instructor": {"path": "/instructors/830-JAGMOHAN-SINGH-RAJU", "first_name": "JAGMOHAN SINGH", "last_name": "RAJU", "id": "830-JAGMOHAN-SINGH-RAJU", "name": "JAGMOHAN SINGH RAJU"}, "num_reviewers": 23, "id": "30671-401-830-JAGMOHAN-SINGH-RAJU"}]}, "credits": null, "primary_alias": "MKTG-893", "path": "/courses/30671", "sections": {"path": "/courses/30671/sections", "values": [{"name": "MKTG TO INDIAN CONSUMER: Mktg in Emerging Economies: Understanding & Marketing to Indian Consumer", "sectionnum": "401", "primary_alias": "MKTG-893-401", "path": "/courses/30671/sections/401", "id": "30671-401", "aliases": ["MKTG-893-401"]}]}, "id": 30671, "aliases": ["MKTG-893"]}