[{"ratings": {"rAmountLearned": "3.05", "rDifficulty": "2.25", "rStimulateInterest": "3.42", "rRecommendMajor": "3.60", "rCourseQuality": "3.36", "rWorkRequired": "2.45", "rInstructorAccess": "3.85", "rReadingsValue": "3.60", "rRecommendNonMajor": "2.95", "rCommAbility": "3.42", "rInstructorQuality": "3.59"}, "section": {"name": "TOPICS AMERICAN LIT: AMERICAN RENAISSANCE", "sectionnum": "301", "primary_alias": "ENGL-286-301", "path": "/courses/21622/sections/301", "id": "21622-301", "aliases": ["ENGL-286-301"]}, "comments": "The term “American Renaissance” is often used to describe a period of American literature written between the 1820s and the Civil War. Critics have described the writers of this period as outsiders who both developed a uniquely American literary style and questioned stifling convention at every turn. In this class, students bring these forms of independence under close examination, focus on major movements within the “American Renaissance,” and investigate changing notions of democracy, gender, and racial identity. Among other works, students read Nathaniel Hawthorne’s The Scarlet Letter, Edgar Allan Poe’s short stories, Harriet Beecher Stowe’s Uncle Tom’s Cabin. Frederick Douglass’s Narrative of the Life of Frederick Douglass, Victor Sejour’s “The Mulatto,” poems by Emily Dickinson, and Herman Melville’s Moby Dick. &#8232;&#8232;Students generally thought that the course provided room for great class discussion. There was some disagreement about the course content, with some students calling the literature interesting and others calling it dry. &#8232;&#8232;Despite the disagreement about the course content, students agreed that Professor Edwards had the ability to make “the driest of literature very interesting.” Students described Professor Edwards as “fantastic” and “engaging.” According to some, Professor Edwards really knew how to communicate with his students and provided great feedback on writing assignments. &#8232;&#8232;Students reported that Professor Edwards was not an easy grader. Many felt that although Professor Edwards was challenging, he was very approachable.", "num_students": 23, "path": "/courses/21622/sections/301/reviews/2448-JEFFREY-A-EDWARDS", "instructor": {"path": "/instructors/2448-JEFFREY-A-EDWARDS", "first_name": "JEFFREY A", "last_name": "EDWARDS", "id": "2448-JEFFREY-A-EDWARDS", "name": "JEFFREY A EDWARDS"}, "num_reviewers": 22, "id": "21622-301-2448-JEFFREY-A-EDWARDS"}]