[{"ratings": {"rAmountLearned": "2.27", "rDifficulty": "1.23", "rStimulateInterest": "2.95", "rRecommendMajor": "2.86", "rCourseQuality": "3.17", "rWorkRequired": "1.50", "rInstructorAccess": "3.05", "rReadingsValue": "2.65", "rRecommendNonMajor": "3.55", "rCommAbility": "2.82", "rInstructorQuality": "3.13"}, "section": {"name": "DESIRE AND DEMAND", "sectionnum": "301", "primary_alias": "ANTH-086-301", "path": "/courses/22610/sections/301", "id": "22610-301", "aliases": ["ANTH-086-301"]}, "comments": "Does consumption shape culture or does culture shape consumption? As even the most mundane purchase becomes socially symbolic and culturally meaningful we can persuasively argue that the concept of \"need\" has been transformed. Analyzing a variety of physical and virtual consumer venues, the goal of this seminar is to understand and to analyze historical and contemporary issues related to a culture of consumption. We investigate social and political-economic factors that impact when and how people purchase goods and argue that behavior attached to consumption includes a nexus of influences that may change periodically in response to external factors. Readings and research assignments are interdisciplinary and require a critical analysis of global/local linkages. The city of Philadelphia becomes the seminar's laboratory as we ask how have issues of culture, consumption, and global capitalism become intertwined around the world. \r\n\r\nOn the whole, students found the course to be “extremely fun and interactive.” Through field trips, students were able to apply what was learned in class “to our surroundings in Philly.” The course involved a lot of group work, although at times the different readings assigned to different groups prevented discussions with the entire class. The readings were “helpful and insightful.”\r\n\r\nStudents praised Professor Digg-Thompson. One student “loved her teaching style, her dedication to her students, her creativity, and her fun and sassy personality.”\r\n\r\nThis course is a freshman seminar and was said to be a great course to take when adjusting to college life. The workload is manageable and the course was said to be a great way to connect to and learn about the Philadelphia community.\r\n", "num_students": 23, "path": "/courses/22610/sections/301/reviews/2850-MARILYNNE-DIGGS-THOMPSON", "instructor": {"path": "/instructors/2850-MARILYNNE-DIGGS-THOMPSON", "first_name": "MARILYNNE", "last_name": "DIGGS-THOMPSON", "id": "2850-MARILYNNE-DIGGS-THOMPSON", "name": "MARILYNNE DIGGS-THOMPSON"}, "num_reviewers": 23, "id": "22610-301-2850-MARILYNNE-DIGGS-THOMPSON"}]