{"coursehistories": {"path": "/coursehistories/680"}, "description": "Human language viewed from a social and historical perspective. Students will acquire the tools of linguistic analysis through interactive computer programs, covering phonetics, phonology and morphology, in English and other languages. These techniques will then be used to trace social differences in the use of language, and changing patterns of social stratification. The course will focus on linguistic changes in progress in American society, in both mainstream and minority communities, and the social problems associated with them. Students will engage in field projects to search for the social correlates of linguistic behavior, and use quantitative methods to analyze the results. \n\n", "semester": "2011A", "name": "INTRO TO SOCIOLING", "reviews": {"path": "/courses/21972/reviews", "values": [{"ratings": {"rAmountLearned": "2.48", "rDifficulty": "1.62", "rStimulateInterest": "2.57", "rRecommendMajor": "3.41", "rCourseQuality": "2.62", "rWorkRequired": "1.86", "rInstructorAccess": "3.40", "rReadingsValue": "2.23", "rRecommendNonMajor": "2.45", "rCommAbility": "2.80", "rInstructorQuality": "2.85"}, "section": {"name": "INTRO TO SOCIOLING", "sectionnum": "001", "primary_alias": "LING-102-001", "path": "/courses/21972/sections/001", "id": "21972-001", "aliases": ["LING-102-001"]}, "comments": "This introductory course explores human language viewed from a social and historical perspective. Students acquire the tools of linguistic analysis through interactive computer programs and through covering phonetics, phonology and morphology, in English and other languages. These techniques are then used to trace social differences in the use of language and changing patterns of social stratification. The course focuses on linguistic changes and progress in American society, in both mainstream and minority communities, and the social problems associated with them. Students engage in field projects to search for the social correlates of linguistic behavior and use quantitative methods to analyze the results.&#8232;&#8232;&#8232;&#8232;Students generally found the material covered in this course “interesting,” and many students described the course as “great.” The course material covered daily language use, and students found the material relatable and applicable to their everyday lives. This course was comprised of both quantitative and qualitative components, combining study of lecture and textbook material and analysis of numerical data. The two components were combined in three field assignments, which students heavily praised, with many describing them as “fun” and as their “favorite part of the course.” The quantitative aspect was simplified and taken slowly, but most students did not feel that the easiness of the class detracted from its interestingness. One student regretted that there wasn’t more time for “in-depth looks at the material” or for “branching out and looking at other questions in sociolinguistics” because so much time was spent on teaching quantitative analysis skills. However, students appreciated that the course included an exploration of linguistic issues in languages other than English, uncommon for the typical Penn linguistics course. &#8232;&#8232;&#8232;&#8232;Students’ impressions of Professor Sankoff were predominantly positive. She was described as an “engaging” and “effective” lecturer; however, students’ chief complaint was that her PowerPoints were often “frustratingly disorganized” and therefore “confusing.” Several students complained that Professor Sankoff was constantly correcting errors in her slides, which consumed a lot of class time. Her classes are very lecture-driven, but students commented that a lot of self-study is also necessary for success in the course. Students overwhelmingly agreed that Professor Sankoff is extremely “approachable,” open to helping students, and “genuinely cares about her students” and their success. Students also agreed that she was “knowledgeable,” “passionate,” and an “expert in the field” of sociolinguistics. Students appreciated that Professor Sankoff incorporated personal or funny anecdotes in her lectures.&#8232;&#8232;&#8232;&#8232;This course was taken by both majors and non-majors and was received positively by both type of student. It fulfills the Quantitative Data Analysis requirement. One Linguistics major noted that the material covered was “important” for majors to learn before proceeding further into Linguistics. Students commented that the course was an “easy way” for students who are “bad with numbers” to fulfill their quantitative data analysis requirement; students who were mathematically minded or were familiar with statistical methods found this class extremely easy but still interesting. Students were assigned three field assignments, which they found to be both “fun and interesting.” Both the midterm and final were described as “unchallenging,” and the work required for the course is “minimal.”", "num_students": 75, "path": "/courses/21972/sections/001/reviews/736-GILLIAN-E-SANKOFF", "instructor": {"path": "/instructors/736-GILLIAN-E-SANKOFF", "first_name": "GILLIAN E", "last_name": "SANKOFF", "id": "736-GILLIAN-E-SANKOFF", "name": "GILLIAN E SANKOFF"}, "num_reviewers": 72, "id": "21972-001-736-GILLIAN-E-SANKOFF"}]}, "credits": null, "primary_alias": "LING-102", "path": "/courses/21972", "sections": {"path": "/courses/21972/sections", "values": [{"name": "INTRO TO SOCIOLING", "sectionnum": "001", "primary_alias": "LING-102-001", "path": "/courses/21972/sections/001", "id": "21972-001", "aliases": ["LING-102-001"]}]}, "id": 21972, "aliases": ["LING-102"]}