
{
  "result_data" : [ {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course meets on the following Saturdays: September 6 and 20; October 4 and 18; November 1 and 15,& will possibly also meet November 22. Process improvement as taught in this course often provides high-leverage, high visibility opportunities for showcasing coaching and leadership skills as a member, coach or leader of cross-functional process improvement teams. Cross-functional process improvement teams (running lean and six sigma projects) have evolved into a major pathway for developing leadership and coaching talent in such organizations as Baptist Healthcare, Federal Express, Ritz Carlton, Toyota Motor Co, General Electric and Motorola. Categories: DE, A Concentrations: LMC, MSN Process improvement project leaders and team members use specific tools and capabilities to analyze as-is processes and to define and deploy new or improved processes that deliver better outcomes and customer satisfaction with less non-value added effort. Leading or serving on cross-functional process improvement teams creates opportunities to work and network with people from other parts of your organization and creates opportunities for visibility to executives and managers sponsoring strategic improvements. Participating in or leading process improvement is also a great leadership, coaching and professional development activity.",
    "course_id" : "DYNM634",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "634",
    "course_title" : "Process Improvement Tools and Strategies",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Stankard",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Through presentations by expert speakers, case discussions, and participation in team projects, students will review and evaluate critical issues from across the frames of business, including general; human resource; marketing; information and stakeholder management; leadership; corporate culture; communications; organizational behavior; sales, marketing and public relations; finance and financial reporting; ethics and social responsibility; unions and government relations; and business law. Each of these elements will be studied in light of changing environmental conditions, including the economy; society; consumer behavior; market trends; regulation; politics, unpredictable events such as 9/11; organizational change; history; and internationalism. This course fills the following Organizational Dynamics requirements: Categories: F Concentrations: LMC",
    "course_id" : "DYNM635",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "635",
    "course_title" : "Organizational Essentials for Leadership",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Choukroun",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "L",
    "terms_offered_description" : "Course usually offered summer term only"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "DYNM683",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "683",
    "course_title" : "Organizational Experienc",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "MST",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "DYNM990",
    "course_level" : "4",
    "course_level_description" : "Graduate",
    "course_notes" : "",
    "course_number" : "990",
    "course_title" : "Master's Continuation",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Starr",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Students will have the opportunity for a brief \"professional match\" while abroad. Prior to departure, the domain of professional practice of each student will be identified in order to determine a match with a person or organization in Prague. A person working in the financial sector or in human resources, for example, will have an opportunity to spend time with a colleague working in a similar area in the Czech Republic. Course objectives are: 1) Understand the high points of the previous history, culture and economics within the region; 2) Understand the routes of the transformation process from an organizational perspective; 3) Understand how the current changes in the economy, culture, and structure influence society and the transition to democracy; 4) Appreciate the environments of a major Central European city and regional towns; 5) Study with representatives of the region's academic, political, cultural, and business environment in order to compare these processes to those in the U.S.; 6) Demonstrate understanding of the issues presented in this course by writing a final paper.",
    "course_id" : "DYNM766",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "766",
    "course_title" : "Perspectives on Change in the Czech Republic",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Steiner",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "L",
    "terms_offered_description" : "Course usually offered summer term only"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The \"Global Leader\" is a co-listed INTS/DYNM course, developed as part of the Lauder Institute's new Global Program that will prepare students for leadership roles in international and culturally diverse envrionments. The course will focus on deveoping skills through a hands-on approach that includes using case students, in-class exercises, movie clips, and class discussion, with readings that emphasize theory and application. The ocurse is comprised of two modules. The first module - Globally Capable Leadership - will ingtroduce students to the core qualities of leadership that transcend culgtures, as well as examine how cultural context influences leadership efficacy. The second module - Managing Across Borders - will teach students how to negotiate effectively in a variety of contexts, including conflict resultion,k transactional settings, conflict resultion, and across borders, such as those of gender, ethnic identity, national culture, and differences in values and beliefs.",
    "course_id" : "DYNM693",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "693",
    "course_title" : "The Global Leader",
    "crosslistings" : [ {
      "course_id" : "693",
      "section_id" : "",
      "subject" : "INTS"
    } ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Taheripour",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Organizations which seek to create value for their stakeholders must do so using available capital resources: financial capital, human capital, and intellectual capital. They should manage resources to gain leverage and maximize value realized. They then seek to defend and control the value created. Why, then, do most organizations treat innovation (and innovators) in ways similar to the human body's immune system (i.e., by identifying the innovators, isolating them, killing them, and ejecting them from the organization)? This course will explore innovation, invention, and value creation as a driving force in the \"New Economy\" and the ways in which managers should plan to take full advantage of innovation as the only true competitive weapon for long-term success.",
    "course_id" : "DYNM678",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics@upenn.edu/od.cgi",
    "course_number" : "678",
    "course_title" : "Systems Thinking in Practice",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Barstow",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This online course offers insight on how innovative firms are organizing strategically to gain advantage from engaging online with the value distributed resources held by a global pool of individuals. Through cases derived from original research, including Amazon, Facebook, Netflix, oDesk, Kiva, Wikipedia, among others, this course unveils the business models that these organizations use to create new value by working with \"crowds\" online. Open, distributed, online approaches to work and innovation have been widely studied over the past decade in the context of the computer and software industry (e.g. Benkler 2002; Chesbrough 2003; von Hippel and von Krogh 2003). Many of those concepts have since then permeated other industries, eventually giving birth to a distributed organizational paradigm referred to as \"crowdsourcing\" (e.g. Howe 2008; Villarroel 2008). The crowdsourcing model has proven valuable for innovation, work, entrepreneurship, among other applications. For example, in 2011, a crowd innovation initiative involving 57,000 individuals solved a decade-old scientific problem in molecular biology in only 3 weeks. In 2012, the top 3 crowd labor platforms brou ght skilled work to 6 million people in over 200 counties. In 2013, US $5 billion are expected to be invested in crowd-funded projects around the world. The aims of this course are (1) to gain a solid understanding of the business models in crowdsourcing; (2) to benefit from first-hand experience with the \"power of the crowd\", (3) to critically analyze the potential and limitations of this new organizational paradigm.",
    "course_id" : "DYNM552",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics@upenn.edu/od.cgi",
    "course_number" : "552",
    "course_title" : "Strategic Crowdsourcing & Business Models",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Villarroel",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course examines the social construction of race and ethnicity, including relations within and across groups, with a particular focus on their implications for organizational culture and management. In a very real sense, the workplace is a microcosm of the larger society; a place where our individual experiences, beliefs, and biases related to race and ethnicity intersect, creating both opportunities and challenges. Our capacity to understand the different backgrounds and experiences that individuals and groups bring to the organization, as well as recognizing our own biases and the biases of others are directly implicated in our ability to both manage and be managed in the organizations that we are a part of. A primary objective in this course is to increase our capacity to first understand the contours of racial and ethnic diversity in twenty-first century America by investigating (1) the historical context that influences present-day understandings of racial/ethnic diveristy (2) how and why individuals from different racial/ethnic backgrounds can \"see\" the same thing but interpret it very differently, depending on experience, culture, and social position relative to race/ethnicity (3) the meaning and importance of dominant and minority groups, the degree to which a racial hierarchy exists, and the implications of that hierarchy for important outcomes (4) the degree to which the workplace is, indeed, a microcosm of the larger society (5) the pitfalls of \"colorblindness\" (6) the nature of stigma and its workplace implications and (7) the benefits and drawbacks of affirmative action policy in the workplace.",
    "course_id" : "DYNM656",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "656",
    "course_title" : "The New Normal: Racial and Ethnic Diversity in the 21st Century Workplace",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Charles",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "L",
    "terms_offered_description" : "Course usually offered summer term only"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "It's not enough to be competent, educated, smart and professional. Globalization, technology, and vastly improved communications have increasingly led to \"Winner Take All\" markets. Consider the local opera house: 100 years ago, Iowa alone had more than 1,500 of them. Thousands of sopranos earned adequate, if modest, livings from the live performances, but now, thanks to i-pods, the world's best soprano can be literally everywhere at once. And since it costs no more to transmit MP3s of Renee Fleming's Mozart arias than her understudy's, most opera fans listen to Fleming. Thus, Fleming earns several million dollars a year while most other sopranos, many of whom are almost as talented, struggle to get by. The same is increasingly true of other professions: Those who are recognized for being the best at what they do can sell their services anywhere and everywhere at top dollar, whereas those who lack such recognition find their services valued less and less--if they are valued at all. As graduate students at the University of Pennsylvania, you have an extraordinary opportunity to become the leading expert in a given domain in a few short years, maybe less.",
    "course_id" : "DYNM559",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "559",
    "course_title" : "Research Methods to Develop Dynamic Expertise",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Freeman",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "2"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This 2CU course includes travel and study in Bangalore, Mangalore and Mumbai, India, a country acknowledged as the world's larget democracy with a population of over 1 billion. India has a thriving microfinance industry that has come under scrutiny in the past year. While micro finance has been touted by many as the panacea in helping raise people out of poverty, empower women and aid in development from the grassroots level, it has come with some serious attendant costs. This course will discuss a variety of different models of micro finance and review the new trends of financial inclusion for the poor. We will start in Bangalore and continue to Mangalore, where we will visit local development projects, microfinance women's groups, and meet organizational leaders. We will see firsthand how and if micro finance and financial inclusion \"work effectively\" to achieve the goals of alleviating poverty. While in Mangalore, students will attend and participate in a conference: Micro Finance in India: The Past, Present and Future, being held at Nitte University. We will hear experts speak on current issues and how new legislation in India may change the face of micro finance. We will end the program in Mumbai, one of the most populous urban regions in the world and the richest city in India with the highest GDP of any city in South, West or Central Asia.",
    "course_id" : "DYNM771",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "771",
    "course_title" : "Micro-Finance in India: The Past, Present and Future",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Handy",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Participants integrate everything they have learned by contracting with a client to provide consulting/coaching services. Individual supervision is provided on a weekly basis by a core faculty member and peer supervision is provided in two clinics, where cohort members share their experiences and learning with one another and, at the conclusion of the second clinic, bid the cohort farewell as members are now ready for their internship experiences. This course is open to OCEC students only. This course fills the following Organizational Dynamics requirements: Categories: A Concentrations: OCEC",
    "course_id" : "DYNM727",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "727",
    "course_title" : "Practicum Experience in Consulting and Coaching",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Russo/Napier/Orenstein",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Environmentalist Paul Hawken challenged a class of 2009 college graduates that they would have to \"figure out what it means to be a human being on earth at a time when every living system is declining, and the rate of decline is accelerating.\" That theme is at the heart of this course. While we have seen the notion of sustainability gaining some traction in recent years, our quality of life in the near future very likely hinges on the development and implementation of sustainable solutions to enormously complex environmental and social problems. This course is designed to foster the thinking that is needed to address those enormous problems. It involves focusing on a critical global problem with sustainability and social dimensions - in this case, the rapid shift of an increasing global population to cities--and addressing it it in detail as a project team over the course of a semester. PENNovation is a course about innovation, idea generation, collaboration, leadership, communication, research, decision-making, sustainability, sustainable solutions, creative thinking, leading change, and complex problem-solving. Class members take a deep dive into a major sustainability challenge while alsogaining experience in how to effectively lead global teams. The World Health Organization (WHO) estimates that in 1990, less than 40% of the global population lived in cities and that figure is expected to grow to 60% by 2030 and 70% by 2050. Such growth brings tremendous sustainability and design challenges in both developed and developing countries in terms of resource consumption, food security, water security, energy security, air quality, transportation, infrastructure, waste processing, recycling, and public health.It also brings opportunity. In 2015, the class will focus on the challenges and opportunities created by increasing urbanization with a focus on advancing development of sustainable cities. The group will take a systems approach to the problem, aided by contributions from several thought leaders from business,NGOs, and non-profits in a unique class format. Our expectation is that the world will benefit from their work. Activities and Outcomes: The end goal of this course will be to produce a world-class product including highly meaningful recommendations to solve the problem. Deliverables can include: final group paper, a website, an awareness-raising event, a social media campaign, or presentiation. This course fills the following Organizational Dynamics requirements: Categories: A. Concentrations: LMC, GL, SD",
    "course_id" : "DYNM615",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "615",
    "course_title" : "Pennovation",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Finn",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "DYNM 720",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The cohort will reconvene to collectively \"unwrap\" the five-day intensive. Using their journals and observations, participants learn how to apply relevant theory and concepts to make meaning of their experiences and to analyze and interpret behavior at multiple levels. Then, using their knowledge of applying theory to practical experience, participants will develop a theory-guided consulting and coaching framework. Here they research, present and apply a framework of their own choosing. Entry into this course is restricted to OCEC students only. This course fills the following Organizational Dynamics requirements: Categories: A Concentrations: OCEC",
    "course_id" : "DYNM722",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "722",
    "course_title" : "Making Meaning from Organizational Experience and Establishing Frameworks for Consulting and Coaching",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "JACOBS",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Participants learn to be coaches by being coaches to one another. Over a two-month period,cohort members expand their repertoire of skills and tools, share their experiences, and together scrutinze the client/coach relationship.",
    "course_id" : "DYNM723",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "723",
    "course_title" : "Consulting and Coaching Process: Knowing Yourself-Coach as an Instrument of Change",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "NAPIER",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course requires the student to study a topic of their own choice, to discuss their progress with the class (in regulare meetings) and to deliver a final paper that meets the following criteria: 1) Makes an argument, describes, or summarizes a position that is unique, original or which directly applies to the student; 2) Uses primary sources or applies to a primary organization as much as possible; 3) Conforms to the style and format of good academic writing and the MPhil Capstone Project presentation standards; 4) Allows a student to demonstrate competencies gained from the courses completed in the Organizational Dynamics program. The role of the MPhil Capstone course professor is to coordinate the development of each student's capstone committee, to offer facilitation during peer-review discussion of student work as the capstone is written, and to post the final grade. The course professor may also be a student's primary advisor or a reader. For details about the MPhil capstone course, including delivery dates, see the MPhil capstone course page.",
    "course_id" : "DYNM899",
    "course_level" : "4",
    "course_level_description" : "Graduate",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "899",
    "course_title" : "MPhil Capstone Course",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Starr",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Short-term or long-term? Us or them? Build or buy? Margin or volume? My way or the highway! Ad infinitum, apparent forced choices--or no choice--and limited perspectives can create costly tugs of war or constricted judgment without our minds (and hearts) and in organization dynamics, persuasive, and often hidden, divergence in thinking offers great opportunity for learning, creativity, and sound decision-making. This course offers several robust, practical techniques for bringing the value of diverse perspectives in politically productive ways to leadership thinking, communications, and organization dynamics. This course will meet between May 26th and June 19th. This course fills the following Organizational Dynamics requirements: Categories: A Concentrations: LMC",
    "course_id" : "DYNM551",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "551",
    "course_title" : "Devil's Advocate: Power of Divergent Thinking",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Greco",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will examine both personal and professional behaviors that constitute effective followership. While the leadership literature is saturated with books on becoming better leaders, there is a dearth of awareness on finding and supporting those who follow those leaders effectively. Students will use surveys from the limited literature on effective followership to profile their own organization's dynamics on styles of followership, and stories of success and failure in confronting organization mistakes and leadership errors will be researched. The outcome of the class will be a personal profile on followership style and an organizational profile on its followership culture.",
    "course_id" : "DYNM553",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "553",
    "course_title" : "Becoming a Courageous Follower",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Eldred",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "DYNM 731",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "DYNM732",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "732",
    "course_title" : "Field Experience",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The purpose of this seminar is to understand appropriate leadership behaviors for professional services. Students will gain first hand exposure to prominent leaders of diverse service organizations, and will research how those leaders both develop and deploy their leadership agenda. This course fills the following Organizational Dynamics requirements: Categories: A Concentrations: LMC",
    "course_id" : "DYNM626",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "626",
    "course_title" : "Leading the Professional Service Organization",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Eldred",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will examine how theory guides the effective practice of coaching. Students will be introduced to a theory and model that encompasses a multi-disciplinary approach to coaching in an organizational setting. With this framework as a basis, students will select, research, and present a theoretical model of their own choosing and design a coaching application that demonstrates theory in action. Students will leave the course with an array of theoretical frameworks and practical techniques that will enhance their own coaching capabilities as managers and consultants. Undergraduates may enroll in 500-level courses only with permission of the instructor. This course fills the following Organizational Dynamics requirements: Categories: A Concentrations: LMC, OC This course will meet on the following Saturdays: March 7, 21, and 28; April 4,11, and 18.",
    "course_id" : "DYNM542",
    "course_level" : "4",
    "course_level_description" : "Graduate",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "542",
    "course_title" : "Theories & Models That Inform Coaching",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Orenstein",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "What is organizational culture? What is organizational learning? How do organizations learn effectively and change their culture? A learning organization is skilled at creating, acquiring, and transferring knowledge, and at modifying its behavior to reflect new knowledge (Garvin, 1993). According to Ray Stata, Chairman of Analog Devices, \"The rate at which individuals and organizations learn may become the only sustainable competitive advantage.\" However we define and prioritize organizational learning, we must still struggle with how to do it. This is a tougher question. The thesis of this seminar is that an enriched understanding of culture can enhance organizational learning. Participants will explore the concept of culture, study the work of Chris Argyris, and discover practices and behaviors that promote organizational learning and culture change. The objective of this seminar is to help participants get beyond highly abstract philosophy and develop a deeper understanding and useful skills based on these concepts.",
    "course_id" : "DYNM664",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "664",
    "course_title" : "Organizational Culture and Learning",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Barstow",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "What are the systemic changes that an organization must undergo in order to become sustainable? (Sustainability is defined here to mean that no aspect of business operations is harmful to the planet or future generations.) We will examine the issues of sustainability using Peter Senge's work on learning organizations, the Swedish sustainability model, The Natural Step, and Russell Ackoff's idealized design as our frameworks for building a business case for sustainability within an organization or department. Class participants will be asked to build a business case for sustainability within an organization or department and to prepare an interim progress report (5-7 pages) plus a final paper (15-20 pages) using the concepts and principles covered in this course and then will present their case to the class in the last sessions of the course.",
    "course_id" : "DYNM667",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "667",
    "course_title" : "Building a Business Case for Sustainability",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Barstow",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Can operations undertake effective risk management in our globalized, inextricably networked economy? What risk management role do we play in our organizations? We will apply readings and engage in case students to discuss whether our organizations do or should manage risks as strategically as opportunities : we'll also examine our involvement with risk management in our organizations. By the conclusion of the course, you should have a strong understanding of organizational risk and a framework for addressing risk in your organization. This course includes webinar calls on several weeks during the semester in addition to the weekly Wednesday evening classroom meetings. This course fills the following Organizational Dynamics requirements: Categories: DE, A Concentrations: LMC",
    "course_id" : "DYNM604",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "604",
    "course_title" : "MANAGING ENTERPRISE RISK",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Combrinck-Graham",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "L",
    "terms_offered_description" : "Course usually offered summer term only"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "In this course, you will have the opportunity to: 1) examine ethical, religious, legal, technological, and economic bases for different ownership systems from early human history through the 20th century; 2) develop a theoretical framework for understanding ownership issues in the contemporary workplace; 3) review social science concerning ownership and the related organizational issues of motivation, performance, productivity, profitability, culture, diversity, and equity; 4) analyze a variety of cases to measure ownership's effects across many industries and business situations; 5) learn about various forms of ownership and compensation in use today in small and large organizations, both public and private; 6) utilize a diagnostic tool for assessing the ways in which your own organization's culture and business outcomes are impacted by the firm's ownership system; 7) describe your own experiences of the different ownership systems with which you may have engaged, including: family, schools, little leagues and professional sports, volunteer service organizations, charities, religious institutions, professional service providers (e.g., doctors, lawyers, veterinarians), the places where you shop (e.g., think about Genuardi's before and after it was sold to Safeway), and the different places you have worked...as a way of systems; 8) assess and refine your views regarding ownership in light of your own social, political, religious, andethical commitments. Who is going to own what we all have a part in creating? The history of American business is an evolving answer to the question of ownership. Of all the issues relevant to organizational dynamics, ownership is arguably the most important and least understood. Matters of ownership have also been and remain of intimate concern to ordinary Americans-the slave yearning to be free, the young couple with a dream of home ownership, the entrepreneru who wants to be his own boss, the consultant who wants to form a partnership with her best friends, and the indebted, mid-level manager reviewing last year's 401(k) statement. This course fills the following Organizational Dynamics requirements: Categories: F Concentrations: LMC",
    "course_id" : "DYNM671",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "671",
    "course_title" : "Organizational Ethics and Ownership",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Lamas",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The goal of this course is to assess/advance the participant's competence in applying the \"eigth habit\" - that of organizational politics and power, in a variety pf organizational settings, system levevels and contexts. Course requirements are: 1) a detailed learning log (to be supplied and reviewed weekly; 2) A political autobiography (guide to be supplied); 3) Active participation in all sessions; 4) Three interviews of senior managers on the topic of politics (interview guide to be supplied;Note: Additional interviews may be done for extra credit; 5) An assessment of the political map of a complex organization (map to be developed in class; 6) A peer completed assessment using the \"political skills inventory\" (see Ferris).",
    "course_id" : "DYNM675",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "675",
    "course_title" : "Advanced Seminar in Organizational Politics",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Eldred",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Coaching insinuates change, and most meaningful change is, at some level, therapeutic. This course will explore the dynamics of change as a therapeutic process. Whenever individuals have the nerve to \"help\" others, self-understanding must come front and center. As a master coach once said, \"Who in the hell do we think we are helping others unless we are willing to take a very hard look at ourselves-our behavior, our impact, our projections and biases?\" Not only must we ask hard questions of ourselves and resolve our own issues that could corrupt our effectiveness, but we also need to model the most productive behaviors possible. The questions for students of this course include: 1) Are you willing to look? 2) Are you willing to be fiercely honest with yourself and with your fellow students? 3) Are you prepared for the responsibility that goes with mucking around in someone else's life? What makes this particular coaching course unique is that it affords students the opportunity to experience a full range of coaching practices in a relatively short amount of time. The expectation is that the students will have identified a potential client that will be discussed during the first class (although no firm agreement would have to be reached prior to that time). The student/coach will be guided each step of the way through the coaching process which will include a) contracting with the client; b) engaging in a thorough diagnostic exercise for the client including interviews, observations and a complete 360 feedback cycle, c) analyzing the data, d) feeding the results back to the client, e) engaging the client in problem solving and an action plan designed to help increase the client's effectiveness.",
    "course_id" : "DYNM620",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "620",
    "course_title" : "The Coach: Applying Tools and Skills in the Field",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Napier",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "New work technologies, increased competition and employees' desire for more involvement in their work are changing the traditional role of the manager. Rather than directing, planning and controlling the work, managers and leaders are facilitating processes and coaching and developing their employees. Team based organizations are built on coaching as a core requirement of the team leader role. This course explores the theory and practices of individual coaching as leadership behavior. The focus is on helping managers develop their skills and improve their performances as coaches. We will examine the need to provide others with successful performance strategies, timely feedback on strengths and on development needs and growth opportunities in order to challenge others to reach their potential. We will explore workplace environments that foster the growth and achievement of those we lead. This course fills the following Organizational Dynamics requirements: Categories: A Concentrations: LMC,OC,MSN. This course meets on the following dates: September 20, October 4 & 25; November 8 & 29.",
    "course_id" : "DYNM602",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "602",
    "course_title" : "Leader-Manager as Coach",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Russo",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course requires the student to study a topic of their own choice, discuss their progress with the class in regular meetings and to deliver a final paper that meets the following criteria: (1) Makes an argument, describes or summarizes a position that is unique, original, or which directly applies to the student; (2) Uses primary sources or applies to a primary organization as much as possible; (3) Conforms to the style and format of good academic writing and the MSOD Capstone Presentation Guidelines; (4) Allows a student to demonstrate competencies gained from the courses completed in the Organizational Dynamics program. The role of the capstone professor is to coordinate the development of each student's capstone committee, to offer facilitation during peer-review discussion discussion of student work as the capstone is written, and to post the final grade. The course professor may also be the student's primary advisor,or a reader. For details about the capstone course, including delivery dates, please see: http://www.organizationaldynamics.upenn.edu/capstone",
    "course_id" : "DYNM705",
    "course_level" : "4",
    "course_level_description" : "Graduate",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "705",
    "course_title" : "Capstone Course",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Barstow",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Coaching has been used to support high-level leadership, to develop high potential talent, to overcome or remediate deficiencies or unproductive behaviors, and to support or manage performance during periods of change. As the use of organizational coaching has grown over the last decade, globalization of the economy has transformed organizational markets, operations, and workforces so that \"culture\" routinely influences interpersonal, group, and organizational interfaces. In this context leadership requires an ability to recognize and leverage the \"cultural diversity\" inherent in teamwork, communication, collaboration, conflict, and change. Coaching, as a leadership development practice, must help leaders grow in their ability to recognize and leverage the national, professional, functional, and organizational cultures that influence workforce engagement, productivity, satisfaction, and innovation. This course is intended for students with an interest in culturally complex leadership and organizational development. This course has a dual purpose. First, through reading, class discussion, and written reflection, the course will enhance student understanding of coaching models, methods, and cases informed by cross-cultural psychology, intercultural communication, anthropology, and international business disciplines. Secondly, through guided practice, students will develop their skills in coaching across cultural differences. Students will coach one another through a self-assessment, development planning process, and initial movement toward their objectives using Rosinski's global coaching process as one illustrative example of this kind of coaching. This course fills the following Organizational Dynamics requirements: Categories: A, Concentrations: LMC, GL, OC",
    "course_id" : "DYNM636",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu This course meets on the following schedule: 6/4 6:00 to 9:00 pm; 6/21 & 22 and 7/19 & 20 9:00 am to 5:00 pm",
    "course_number" : "636",
    "course_title" : "21st Century Leadership Development: Integrating Cultural Influences into Coaching Practice",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Reyes",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "DYNM782",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "782",
    "course_title" : "Strategic and Socio-Cultural Issues in Innovation and Creativity",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Choukroun",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "DYNM783",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "783",
    "course_title" : "European Approaches to the Organizational Management of Projects and Programs",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Choukroun",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This seminar will explore the intersection of gender and organizational behavior as it has evolved and in the current social and economic context in this country. We will examine the social, cultural and structural dynamics within organizations that differentially affect women and men, as well as the gender-linked resources each brings to organizations. Topics that will be addressed include the debate over the currect situation of women in the workforce; the social construction of gender; the relationship of gender and power in understanding gender dynamics in the workplace; the intersection of gender and class; gender issues in organizational leadership; policy and practice as reinforcers of gendered dynamics; the interaction of culture and organizational structure; and restructuring organizations to better meet the needs of women and men in today's culture. The course will 1) address the development of a theoretical framework for understanidng gender issues in the workplace; 2) explore more specific ways in which policies and practices have different effects on employees and managers by virtue of gender and; 3) focus on alternative conceptualizations, structures, policies and practices that could make it possible for both men and women to be successful in the workplace and to avoid gender-based discrimination. In this last section, we will specifically discuss various organizational change processes that address gender issues within organizations.",
    "course_id" : "DYNM601",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "601",
    "course_title" : "Gender Issues in Organizational Leadership",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Vanderslice",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Neutral during WWII, and claiming a \"Middle Way\" between east and west in the post-war twentieth century, Sweden - its people, institutions, and culture - has left its mark on our global society. In today's world, the influence of Swedish ideas and innovations can be seen in government structures, health and social policies, business organizations, working life, education, science, art, literature, and, of course, the design and style of many products and services which enjoy high demand. These are impressive impacts from a nation-state of only eight million people. What lessons are there for Americans and our institutions as we enter the twenty-first century where our leadership position, ability to determine the rules and control the agenda of world economic and political affairs are diminished? In this course, we focus on \"the people philosophy\" of Sweden, its government, businesses and organizations. We cover healthcare issues and policy, sustainable development, the European Community and the human relations issues in organizations. This course will include meetings with academics and leaders from industry, government, health care, science, media, arts and culture. Students will meet with and learn from these representatives in order to explore Swedish organizational dynamics, both in terms of its economic prosperity and the problems Swedish society faces today.",
    "course_id" : "DYNM758",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "758",
    "course_title" : "Sweden: Strategies for Thriving in the 21st Century",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Barstow",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "L",
    "terms_offered_description" : "Course usually offered summer term only"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This seminar is designed to help participants learn multiple approaches to diagnosing the complex ways in which issues and/or problems manifest themselves in organizations. Frequently, when organizations find themselves in trouble, i.e., there are rumblings in the system about such things as lack of leadership, poor communication, diminished productivity, low morale, etc., there is a tendency to frame the problem(s) simplistically and/or locate blame in a few difficult individuals or groups. However, upon closer examination, problematic issues are often found to be symptomatic and/or symbolic of multiple issues within the organization. This course will help students understand how problems which appear at one level of the system (for example, at the personal or interpersonal level) often represent problems at other levels of the system (e.g., at the group and/or institutional level) or signify a range of inter-related issues. It will provide students with the theoretical constructs and application skills necessary for identifying and framing problem areas, collecting data, and organizing feedback to client systems. Real-time examples will inform our discussions as we consider the relationships between diagnosis, organizational reflection and appropriate action. Categories: DE, A Concentrations: LMC, MSN",
    "course_id" : "DYNM628",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "628",
    "course_title" : "Organizational Diagnosis: Diagnostic Strategies for Enhancing Organizational Effectiveness",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Kaminstein",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Note: This class is predicated on the assumption that prior to offering coaching assistance, a coach should have a deep understanding of his or her own behavior and its impact on a client. Utilizing validated tools and strategies available for coaches, the students practice sets of coaching skills on each other. This includes practice in interviewing and observational skills. In addition, students will have the opportunity to give and analyze 360 degree feedback data, as well as use a variety of other instruments that can be foundational for a useful coaching experience. Premise: Coaching others is very serious business. Intrepid individuals willing to take on this responsibility should be willing to answer the following questions: Who am I as a leader and helper? What are the assets I bring to the coaching relationship? What are my deficits, overused strengths, or underutilized skills and behaviors? What historical influences from my family of origin influence my capacity to build a positive relationship with my coaching client? Are there discrepancies in relation to my self-perceptions and those who know me well--family members, peers, colleagues, friends, boss, and direct reports? As a result, are these specific areas of personal development that I need to address as I move Similar to most traditional programs where the focus is on the management of change, the course is organized to: 1) A diagnostic phase in which the values, history, assumptions, and behaviors of the client will be assessed. In this case the client will be the student/coach. 2) The applied phase in which analysis, interpretation, and formal learning will be the central focus. The end result will be individuals with a deep and abiding understanding of their own psychodynamics and their personal impact. Finally, by modeling many of the tools and strategies useful in any effective coaching effort and practicing them on themselves and their student peers, it is hoped that the experiential nature of the course will allow maximum transference to the real work of coaching. This class will meet on the following Saturdays and Sundays: January 17 and 18; February 21 and 22; March 22. This course fills the following Organizational Dynamics requirements: Categories: A Concentrations: LMC, OC, MSN",
    "course_id" : "DYNM610",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "610",
    "course_title" : "Knowing Yourself: The Coach as an Instrument of Change",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Napier",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Educational Objectives: 1. Awareness of crisis as a part of life and social systems; macro-level crises that could affect you; organizational/individual crisis vulnerability; types of organizational crises; group, family and individual crises. 2. Understanding of: nature and phases of crisis; what to do before, during and after a crisis; crisis psychology/decision-making; security strategies-anticipation vs. resilience; Skills, models and practices of resilience; systemic vulnerability/systemic resilience. 3. Enhance ability to: think critically; develop expertise; adopt a systems perspective; articulate and communicate your thoughts cogently, concisely and compellingly. 4. Apply course-related knowledge to be able to successfully foresee and weather crises. General Education Philosophy. This course fills the following Organizational Dynamics requirements: Categories: A Concentrations: LMC, SD The course includes travel to New York and the World Trade Center site, and lectures at Columbia University to understand what can happen during and after a crisis.",
    "course_id" : "DYNM672",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "672",
    "course_title" : "A Systems Approach to Crisis Preparation and Organizational Resilience",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Freeman",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will focus on China's rapid growth and its transformation in less than a generation from a largely rural traditional society to a modern, industrial power. Specific topics that will receive particular attention include: 1) transition to a market economy; 2) emergence of modern global corporations; 3) private entrepreneurship and start-ups; 4) technological innovation; 5) rise of the middle class and its impact on the sonsumer market; 6) intellectual property; 7) challenges of operating in China, including organizational practices and ethical issues. Students will stay in Shanghai and Beijing where the program will include site visits, academic lectures, meetings with government officials, Chinese and expatriate business leaders and others, and briefings by US Embassy officials. Visits to significant cultural sites and institutions are also planned. Class meetings will be held prior to and following the trip to China and may include some guest speakers. Deliverables will include a paper and a class presentation.",
    "course_id" : "DYNM760",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "760",
    "course_title" : "Window On 21st China II",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "L",
    "terms_offered_description" : "Course usually offered summer term only"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "DYNM761",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "761",
    "course_title" : "Window On 21st China II",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "L",
    "terms_offered_description" : "Course usually offered summer term only"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This international seminar will take place six months after the adoption of the Reform Treaty of the European Union and one year before the 70th anniversary of the outbreak of the Second World War. We compare attitudes and concerns of two major players in recent European history: Comparisons of Poland and Germany in this changing Europe will help students to assess the challenges that the United States faces now in Europe. For over a century, the United States has been both friend and enemy of many European countries. How will present relations develop under increased competition and diversified interests? Is a reformed and integrated Europe a real competitor to the global power of the United States facing a restoration of the influence of Russia and an ascendant China? Is Europe really inegrated despite its continuing inequalities and pervasively present past? Poland and Germany provide the basis for different answers to these questions. The short distance between these two capitals, Warsaw and Berlin without borders, contains an area of persistent cleavages between two nations, different pressures pulling from the east and west, and the remnants of two German political systems, east and west.",
    "course_id" : "DYNM784",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "784",
    "course_title" : "A Berlin-Warsaw Axis?",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Teune",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The First Annual Global conference on Caoching will be held in Dublin Ireland on July 7 through July 11. At thie conference, work sessions will be held ont eh following areas of interest: 1. Knowledge Base for Coaching-Core and Specialist Areas. 2. Code of Ethics. 3. Core Competencies-General and Specialist. 4. Training Guidelines for Graduate Program. 5. Research Agenda for the Development of the Field. 6. Professional Status for Coaching-Should this be pursued, in what form? 7. Mapping the Field-What constitutes the field and its related areas? 8. Selection of Coaches and Management of the Coaching Engagement. 9. Evaluation of Coaching Engagements. Using these conference topics as an anchor and through participation in daily learning modules, participants will increase their knowledlge of the profession of coaching and where that profession is headed. Participation in this course will be greatly enhanced by a basic knowledge of coaching practices, coaching models and the theories and grameworks that inform these models and practices. Additionally, the following activities, under consideration, may be part of the learning modules: 1. Site visit to a pharma located in Ireland with home base in the States. This visit would focus on the vitalization of Ireland's economic activities over the past 10-12 years and a discussion of the organization's coaching practices. 2. Students may have the option of participating in a coaching engagement as part of this class.",
    "course_id" : "DYNM785",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "785",
    "course_title" : "Global Trends, Issues and Opportunities for Coaching",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Wilkinsky",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course is designed for you if you are preparing to take responsibility without authority for actions that will make you the leader you have been looking for. The aim of this course is to prepare participants to drive results in an uncertain organizational environment, under high pressure. The learning objectives of this course are: a) to involve you in designing your personal cycle of leadership and development to benefit your organization and yourself and b) to experience applying the idealized design process to designing your personal LftM approach. The course requires reading, a class project, and independent work on your personal LftM opportunity or challenge. Students who take this course should already be concerned about one or more important opportunities or upsetting challenges in their present or previous organizational surroundings. The ionstructor will coach the class in functioning as an idealized design team. The design process has two phases, a base case projection and an idealized design. Phase 1, the base case projection, formulates the current reality without change, and projects the likely undesired effects and outcomes of maintaining status quo. Phase 2, idealized design, creates a leadership approach that all stakeholders would wish for, if all their feasible, sustainable and adaptable wishes could come true today. By participating in a design process, the class itself models many group dynamics of an actual LftM situation. Scholarly COmmons describes the work done in this class with examples. (Please see Stankard, Martin (2011). Guest speakers from earlier years are invited to share experiences with course content and answer questions. This course fills the following Organizational Dynamics requirements: Categories: DE, A Concentrations LMC, OC",
    "course_id" : "DYNM633",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "633",
    "course_title" : "Leadership from the Middle of the Organization",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Stankard",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course examines some of the sources of confusion, conflict, misperception and error that arise when representatives of U.S. organizations interact and work in the global marketplace.The aim is to heighten awareness, help avoid personal or professional pitfalls, and to more effectively manage some of the organizational and business challenges that arise when operating across dissimilar environments. We will focus on areas including: ethics, culture, language, ethnicity, religion, gender, the political and legal systems, labor, corruption, and corporate organization. Each class session will begin with a short, interactive introductory lecture, followed by discussion around assigned readings and mini-cases.",
    "course_id" : "DYNM608",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "608",
    "course_title" : "Organizational Dynamics of Working in a Global Marketplace",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Tschoegl",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The economy is global and every successful business in every nation must operate with awareness of its place in the interconnected dynamics of local, national, and global issues. This course uses many lenses, such as history, culture and economy to understand the global issues, their interconnections, and the impact they may have in different places, on different organizations, and in our personal decisions. Each of us needs to be able to engage systems thinking as we aim to understand others from the inside and ourselves from the outside. The ecentral relationship in the global new normal is the United States and China. The weekly readings begin with recognition of the centrality of a liberal for the United States and the effect that has on China and the cultures of East Asia. This sets up three frames of reference: Human Rights, Democracy, and Capitalism. Current and potential Organizational Dynamics students with interest in Global Studies, particularly those focusing on Systems Thinking, (Sustainable) Development Policy, and International Courses Abroad (ICA) will find this course helpful. MPhil students with MSOD background can use this course as a foundation for advanced research in Global Studies. This course fills the following Organizational Dynamics requirements: Categories: F Concentrations: LMC, GL, SD",
    "course_id" : "DYNM689",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics@upenn.edu",
    "course_number" : "689",
    "course_title" : "Balance of Power",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Bauer",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "DYNM 753",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The course will focus on the reforms and international openness that have transformed China during the last quarter century, and their political, social and legal contexts and consequences. Several specific topics will receive detailed attention, including reforms to China's economy (including the creation of a market economy, and changes in enterprise ownership and management and financial institutions), the role of foreign trade and investments and other channels of external influence, rising affluence and inequality, political reform and liberalization, and the development of the legal system. Students will experience contemporary urban China firsthand and see important cultural and historical sites and artifacts, providing a basis for assessing the influence of Chinese traditions and legacies in the People's Republic today. In China, we will meet with foreign and Chinese business people, government officials, academics, and others.",
    "course_id" : "DYNM754",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "754",
    "course_title" : "China in Transition: The Context and Consequences of Economic Reform and Opening to the Outside World",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "deLisle",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "L",
    "terms_offered_description" : "Course usually offered summer term only"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "As a society, we choose many different ways to organize different aspects of our lives. The institutions and organization we choose to provide us with the necessities and comforts of life range from the fundamental institutions of family and religious organizations, to firms in the capitalistic market and democratically elected governments. We respond to this environment in unique ways: we marry, we worship, we buy and sell goods and services, and we vote. The primary goal of this course is an examination of the various aspects of human behavior in the context of organizational and institutional life from an economic perspective perspective. We recognize that the choices we make are sensitive to the costs and benefits of different actions and use this economic perspective to gain insights into social, economic and political behavior in our daily lives. We start the course with an examination of how micro economists view the world and examine their favorite toolkit. We discuss concepts such as: efficiency, opportunity cost, marginal analysis, externalities, incentives, free-riding, rent-seeking, and transaction costs. These concepts are fundamental if an economic perspective and they will be presented using every day examples. This course fills the following Organizational Dynamics requirements: Categories: F Concentrations: LMC, SD Before concluding the course, we will look at several topics such as: Human capital and investment in education (Should you invest in an Ivy League school education?); Law and enforcement (When is it profitable to break the law?); Bribes and gifts (Quid pro quo?); Economics of information (Used cars and the market for \"lemons\"); Why we discriminate against minorities?; Property rights and externalities (The tragedy of the commons: Should we have smoke-free environments?); and Free-riding (Should I vote in the next election? Should I volunteer to clean up?)",
    "course_id" : "DYNM617",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "617",
    "course_title" : "Economics of Human Behavior and Organizational Life",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Handy",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "L",
    "terms_offered_description" : "Course usually offered summer term only"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The most valuable resource of any organization is the people who work there; the human capital, if you will. This seminar will explore the issues of the leadership of this human capital to meet the goals of the organization and the personal and professional goals of the people in the organization. We will read about and discuss issues such as: Crisis Periods of Leadership, Enhancing One's Leadership Capability, Conflicts Between the Organization's Leadership and One's Personal Leadership, and Strategies for Success in Leadership Positions. Additional themes of power, authority and control will be examined in terms of the organization and the individual. The seminar requires a considerable degree of participation from the students. Our explorations of leadership both begin and end with each of us individually. Therefore, the seminar will reflect both our common readings and our mutually uncommon (individual) lives as we all negotiate this interesting and challenging personal and professional journey.",
    "course_id" : "DYNM669",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "669",
    "course_title" : "Leadership in Organizations: Private and Public, Personal and Professional",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Larkin",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "I",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Goal: To mine the resources within yourself, cultivate and engage others, and build with them. Every one of us is potentially wired for creativity, however, each of us is unique. How can we understand the research and use it to understand ourselves, our colleagues, and our world? How do we know what is real?",
    "course_id" : "DYNM677",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "677",
    "course_title" : "Human Capital and Human Nature: Sources of Creativity and Innovation",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Bauer",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The seminar focuses on the implications for our own work and personal lives as we reinvent ourselves, our organizations, and our society in what is often called \"the new normal.\" We begin with a realistic exploration of the relationship of the global economy to the widely different political systems which provide individuals with safety nets. We compare the United States to China and Europe and the ways in which our different systems both compete and support each other. Each participant will research a portion of the regional job market, analyzing the source of investments, patents, required skill level and experience of employees, and competitive outlook. The final presentation and paper will fit their regional analysis into the global picture. Where does it fit? What are its risks? This course fills the following Organizational Dynamics requirements: Categories: A Concentrations: LMC, GL",
    "course_id" : "DYNM679",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics@upenn.edu",
    "course_number" : "679",
    "course_title" : "To Thrive Or To Survive?  Our Question in the Evolving New Normal",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Bauer",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The primary objective of this course is to enable participants to gain a thorough understanding of and appreciation for the discipline of Project Portfolio Management. Ill-defined and poorly utilized in many organizations, Portfolio Management has struggled to become inculcated within the fabric of these cultures without direct intervention and sponsorship from the highest levels of Senior Management. Beginning with a decidedly strategic focus, the course brings together the very essence of Portfolio Management--technically robust analytics--with the softer elements of communication and decision- making to enable portfolio value maximization. The course is structured in sucha way that it follows a unique Portfolio Management framework--CREOPMTM-- created by the authors Bayney & Chakravarti in their book titled Enterprise Project Portfolio Management: Building Competencies For R&D and IT Investment Success. In each of the first 6 classes, the framework is followed sequentiallyand is then applied holistically to a case study in the final 2 classes. The impact of risk and uncertainty to the quantification of project, program, and portfolio value is addressed through classic program and portfolio optimizationStudents will be expected to apply many of the principles taught in this courseto their own organizations and to deliver class presentations that address portfolio strategy, linkages between organizational plans, decomposing complex decisions, project prioritization, portfolio optimization, and Stage Gate Review (SGR) processes. In their final paper, students will be presented with a choice of analyzing their organizations portfolio health or a selected Kellogg School of Management case study in Portfolio Management using the CREOPMTM framework. This course meets on the following Saturdays: January 17, 31; February 14, 28; March 14, 27; April 11, 25. This course fills the following Organizational Dynamics requirements: Categories: A Concentrations: LMC",
    "course_id" : "DYNM621",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "621",
    "course_title" : "Managing Project Portfolios",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Bayney",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The objective of Program Leadership Skills is to provide students with an understanding of current principles and best practices in the maturing field of Program Management. Students will investigate the relationships between Program Management, Project Management and Portfolio Management as separate but co-dependent disciplines, and examine the importance of each to the successful achievement of organizational goals. Focusing on Program Management, the course will examine the unique challenges that are faced when managing organizational activities that principally pursue strategic goals, and that must be responsive to outcomes of activities being pursued and changes in strategic direction. The course will provide a forum for discussing the various types of Programs that organizations pursue, and for understanding how Program Managment best practices can be applied to each type of Program. The course will explore the need to adapt Program Management principles in a context-specific way to ensure that Programs deliver their expected organizational value. Moreover, it will examine how-despite qualitative differences between Programs-common approaches can be used to assess Program Management maturity and performance, and to define the skills required of a successful Program Leader. At the conclusion of the course, students will be expected to understand current best practices in Program Management, and to determine how to initiate or improve upon Program Management practices in their own organizations. This course fills the following Organizational Dynamics requirements: Categories: A Concentrations: LMC, OC",
    "course_id" : "DYNM624",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "624",
    "course_title" : "Program Leadership",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Heaslip",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "IND",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "DYNM699",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "699",
    "course_title" : "Independent Study",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Russo",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This is a practical course designed to help participants engage in reflective practice regarding their own leadership and their relationship to leadership by others. Students will present for discussion case material from their workplaces or other settings and we will also explore leadership through in-class experiential exercises. Foundational readings will provide a common langage and conceptual framework. Along the way, we will revisitthe fundamental questions : What is leadership? What is good leadership? What do I intend to do difvferently going forward?",
    "course_id" : "DYNM638",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "638",
    "course_title" : "THE PRACTICE OF ORGANIZATIONAL LEADERSHIP",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "WING",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Green initiatives are creating competitive advantage for businesses. Smart companies are integrating environmental stewardship into their strategies, operations, marketing, and product innovation. Companies that successfully embed sustinability in their their core business strategy and culture--rather than \"bolting it on\" as a peripheral activity - are gaining the most value added. Embedding sustainability requires the active engagement of all organizational stakeholders, many of whom may be green skeptics, dubious of the need to change. \"Many people who feel passionately about sustainability cannot relate to those who have a harder time understanding the need for a change...\" - Corporate associate & MBA candidate. The business case for sustainability has been made many times, yet skepticism about the need for change remains widespread. While adopting sustainable business practices must make sense financially, an economic argument alone may not be enough to convince people to purchase green business products and services or to implement sustainability practices. The course is based on the assumption that \"task significance\" is an important factor for implementing sustainable business practices. This means helping people see the connection between small tasks they are being asked to do and the big picture of global sustainable business.The first part of the course focuses on understanding sustainability driven changes in the global business landscape through a coherent framework. The second part of the course focuses on what those changes mean for business fundamentals: consumption, production systems, innovation, and emerging economies. The third part of the course focuses on communicating and implementing sustaianable business strategies and initiatives. Students will have the opportunity, with a team, to design a communication and implementation program for an organization. Throughout the course, strategies and tactics that work to engage skeptics who do not understand the need for change, as well as tactics that don't work, will be studied. The course is based on the instructor's experience leading hundreds of business and environmental professionals from skepticism to enthusiasm for sustainable business over the past decade. This course is designed for everyone tasked with engaging others in implementing sustainable business practices and for entrepreneurs selling green business products and services. It will provide strategies for enhancing a technical and economic sales pitch. The course is also for those who may be skeptical themselves, and want to reconsider their skepticism. Categories: A Concentrations LMC, SD",
    "course_id" : "DYNM663",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "663",
    "course_title" : "Green Skepticism: Communicating and Implementing Sustainable Business",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Heller",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "IND",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "DYNM645",
    "course_level" : "4",
    "course_level_description" : "Graduate",
    "course_notes" : "",
    "course_number" : "645",
    "course_title" : "Project Based Laboratory",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Although groups and teams are often lauded as the mechanisms that provide the competitive edge for organizations in today's challenging economic environment, there is often little attention paid to the deeper social and psychological currents influencing group and team dynamics. Organizational leaders and facilitators frequently lack an in-depth understanding of how work groups, multifunctional teams, and cross-national executive groups develop, operate, accomplish their goals-or not-and end. Team members often struggle to make meaning of the myriad spoken, as well as unexpressed, factors influencing the process and outcomes of the groups of which they are a part. This course, by emphasizing both theory and practice, provides students with a thorough grounding in the ways groups and teams develop and learn. The class will also examine approaches to building group and team competencies related to effective communication, conflict-resolution, and solving complex strategic problems as well as ways to manage the range of intentional and more hidden dynamics that both support and challenge high performance. The course is designed to include seven 3-hour classroom meetings across the semester and two Saturday sessions that will afford students the opportunity to explore various theoretical frameworks. In addition to drawing on the extensive literature and research in group dynamics and team building, the class will rely on experiential methods to help students develop keener understanding and insight into the ways in which their own leadership and followership dynamics, as well as the dynamics of the group-as-a-whole, influence their team's ability to accomplish its tasks. This course fills the following Organizational Dynamics requirements: Categories: DE, A Concentrations LMC, MSN",
    "course_id" : "DYNM651",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "651",
    "course_title" : "Group and Team Dynamics",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Kaminstein",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "As we all know, living in-and out of- organizations is getting exponentially harder. Things seem to be multiplying, splintering, and coalescing kaleidosopically, and each of us is increasingly taxed to make sense of it all let alone create meaning for ourselves and those we manage and care about. Remarkably, a powerful tool for helping us is one we have already mastered: stories. As humans we think, feel, speak, listen, explain, and believe in narrative form. Yet this capability is dramataically under-exploited at work. This course examines a variety of ways to bring the power of stories to organizational life. We will look at how stories enhance communication, support change, and intensify learning and development in individuals and organizations, thus informing your leadership style and effectivness. We will have many opportunities in class to apply \"story-based technologies\" to issues you face in personal or professional life. Readings come from the literatures of human deelopment, narrative psychology, organizational change, executive learning, and, of course, from literature itself. This course fills the following Organizational Dynamics requirements: Categories: A",
    "course_id" : "DYNM673",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "673",
    "course_title" : "Stories in Organizations: Tools for Executive Development",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Greco",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "In the interconnected world of global corporations, studying Project Management from the standpoint of U.S. firms is not enough. Broadening perspectives is the goal of the seminar in Paris, France. Dr. Jean-Marc Choukroun will lead Organizational Dynamics students in a study of European approaches to the challenges of large project management, particularly those involved in public-private and other multi-group projects. Dr. Choukroun notes that \"In today's global economy, managing multi-national, multi-cultural teams, devising innovative financing arrangements and securing public-private cooperation are increasingly becoming standard requirements for complex projects. European integration has made dealing with these issues a priority with many European organizations. Students will be exposed to new ideas, and new ways of applying time-tested methods and techniques that European organizations in general, and more specifically French organizations, have developed to address these issues. Properly adapted, some of these ideas should prove to be readily applicable in the US context. In addition, students will discover how French managers in the public and private sectors frame issues, approach problems and implement solutions.\" The first stop for the group will be the Hautes Etudes Commerciales (HEC) School of Management in Jouy en Josas, France, where a cross-cultural approach to management education is the rule. Then on to Paris and the Ecole Nationale d'Administration (ENA) France's pre-eminent institution of government, for study about the dynamics of collaboration in government-private projects.",
    "course_id" : "DYNM786",
    "course_level" : "4",
    "course_level_description" : "Graduate",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "786",
    "course_title" : "Multi-Organizational Project Management",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Choukroun",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The course provides an overview of the concepts, procedures and fundamental processes of project management for working professionals. Participants are introduced to the principles, tools and techniques of project management within an integrative framework. The course emphasizes that, for most organizations, projects are the primary means for implementing strategic initiatives. Course Objectives: 1) Understand and critically evaluate expectations, procedures and processes of program management as currently practiced in large for-profit enterprises; 2) Understand the content and processes and standards of prac tice as defined by the Program Management Institute (PMI); 3) Understand how to build and manage effective project teams; 4) Become familiar with the critical components of effective project plans. This course fills the following Organizational Dynamics requirements: Categories: F, A Concentrations: LMC, MSN",
    "course_id" : "DYNM619",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "619",
    "course_title" : "Organizational Project Management",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Choukroun",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The purpose of this seminar is to critique the thought and practice of several \"big names\" in organizational behavior, while establishing the continuing relevance of their work to today's organizations. Federick Taylor (Scientific Management), The Hawthorne Studies (Human Relations), Kurt Lewin (Group Dynamics), Eric Trist (Socio-Technical Systems) and others will be read in their primary sources, giving participants the opportunity to form their own opinion of these classic field studies. Participants will read primary sources in the field as well as more recent critical scholarship. They will then present short papers to the class in the model of an academic conference, followed by discussion. Participants will debate their own views in this conference atmosphere as if both the founders and their critics were present. In addition to the readings and discussion, participants will view a taped oral-history interview with Eric Trist and a film of Kurt Lewin's famous experiment on leadership styles. Each participant will present two brief papers to the class and will submit a longer final paper.",
    "course_id" : "DYNM627",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "627",
    "course_title" : "Classics of Organizational Behavior",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Barstow",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "As an area of study, the psychodynamics of organizations draws out attention to the tacit, implicit, and unconscious dimensions of organizational life. It presumes that a person takes up his or her role at work by drawing on both individual history and the organizational context that helps define a role, its boundary, and the resources available to take it up. In both these aspects, the organizational context, and one's individual biography, people are often unaware of the thoughts and feelings that animate their behavior. This course meets Thursdays from September 4th through November 11th. In addition there will be two 8-hour Saturday sessions during the course, currently proposed to be October 11th and November 1st. The course will introduce students to some basic concepts of psychoanalysis, which focus on individual motivation, and systems psychodynamics, which focuses on group dynamics and group psychology. System psychodynamics also emphasizes how an organizational's primary task, or its \"reason for being,\" influences individual experience. Readings include case studies as well as expositions of theory. The instructor will also draw on his own consulting cases. This course fills the following Organizational Dynamics requirements: Category: A Concentrations: LMC",
    "course_id" : "DYNM607",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "607",
    "course_title" : "Psychodynamics of Organizations",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Hirschhorn",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Most serious study of innovation has focused on its dynamics and how these dynamics can be managed. A broader range of studies also consider the nature of creativity and techniques to facilitate innovation. We survey these areas, emphasizing the relationship between innovation and organization, which are central to innovation both as facilitators and impediments. More generally, we consider the process of Organizing Innovation, the role of individuals, teams and organizations in effecting change and realizing its benefits. I cover one additional theme--improvisation--because it provides insight into dealing with novel situations, and also as antidote to the relentless organizational and institutional pressues that crush the \"impulsivity\" and \"deviance\" that we need for creativity and innovation. In the end, though, the core of the course are the real issues of your life and work. Creativity begins with questions, innovation begins with problems, and education begins with you. Reflect on the central issues o fyour life and work and ocme prepared to share them with the class. The succe ss of your experience rests on a willingness to explore your core interests and take a leadership role in molding the course to meet them. This course fills the following OrganizationalDynamics requirements: Categories: A Concentrations: LMC, SD",
    "course_id" : "DYNM692",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "692",
    "course_title" : "Innovation in Organizations",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Freeman",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Not a day goes by when you or I, or a person we are coaching, is not faced withsome tantalizing, challenging conflict. It may be with someone we love, a conflict in a team, a struggle between two direct reports, a difference with our boss or the challenge of a difficult, perhaps aggresive person in a meeting we facilitate. The problem is not that there is a conflict. The problem is that most of us have a very thin, often inadequate repertoire of responses to the conflicts that engage us on a daily basis. The result is that all too often we are predictable in our responses. Thus, if we take these same limited skills and attempt to provide them to a client in our role as a coach, the consequences will more than likely be similar. This course fills the following Organizational Dynamics requirements: Categories: A Concentrations: OC This course meets on the following dates: 8/30-31; 10/11-12; 11/9 This course is about expanding your repertoire of responses to a wide array of conflict situations. In the process, you will increase your understanding of the theoretical constructs that underlie successful conflict management. Not only will your strategies for managing a variety of conflicts expand, but you will be better able to design unique responses that relate to the particular situation with which your client is faced. How you translate these ideas to your clients and, in the process, provide them the confidence to use them, will be a central theme throughout the course. There is an attempt to provide a balance between intellectual theory, skills, and applied strategies along with the time to practice them.",
    "course_id" : "DYNM653",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "653",
    "course_title" : "Coaching Others to Manage Conflict",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Napier",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Peter Drucker once famously said that \"entrepreneurs innovate.\" The course looks at how innovation drives the entrepreneurial process in both large organizations and in startup ventures. It stresses the importance of bringing entrepreneurial vision and energy to all organizations: profit and non-profit, as well as government and institutional. The course examines the characteristics of successful entrepreneurs. Participants will learn how to develop their own entreprenuerial instincts and how to encourage an entrepreneurial culture in their organizations. The course examines the challenges of startup ventures and provides practical information to participants who are considering an entrepreneurial venture. It explores strategies for identifying opportunities, creating successful business models, valuing a business, raising capital and managing the business. This course fills the following Organizational Dynamics requirements: Categories: A Concentrations: LMC, SD The course builds understanding of how a culture of entrepreneurhip and innovation are critical to any organization that wants to survive and prosper in the future. The course discusses how sustainability is becoming a global force for change, creating exceptional entrepreneurial opportunities. The course looks closely at the leadership roles of both the CEO in a large organization and the entrepreneur in a venture. The course examines how leaders in all kinds of organizations set priorities, identify game-changing opportunities, shape the organizational culture and motivate their teams to achieve outstanding performance or, sometimes, fail. The course stresses the leadership responsibilities of the board of directors in providing governance and oversight in both for-profit and non-profit organizations.",
    "course_id" : "DYNM662",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "662",
    "course_title" : "Entrepreneurship and Leadership: Creating Winners",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Keech",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Says an Indian businessman to his American counterpart: \"In your country you give money to politicians before they pass legislation and you call it lobbying. In my country we do so afterwards, and you call it corruption.\" This anecdote illustrates well the cultrual relativity of all concepts: what one society considers a legitimate \"profit\" is elsewhere \"usury\" or exploitation. This is the problem faced by American companies considering expansion into any new foreign market. National identities expressed through subtle customs, laws, institutions and behaviors are not always obvious, even when there are no apparent language problems. Understanding the complex regional influences of geography, history, religion, and culture is key to anticipating how local norms are reflects in market preferences, social, political and economic institutions, and work attitudes. This seminar will explore various topics of cultural studies and how they affect values and behavior. Participants will be encouraged to focus on a specific foreign culture and, through assigned readings, film, and literature, analyze its various aspects. Alternatively they may develop, either in teams or individually, a questionnaire about cultural attitudes and carry out a pilot survey in their own organizations. A significant portion of the course will take place in Montreal, one of North America's oldest cities, a veritable turnstile of peoples from around the world, whose cultural relations are to some degree regulated by Canadian multicultural policies.",
    "course_id" : "DYNM770",
    "course_level" : "4",
    "course_level_description" : "Graduate",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "770",
    "course_title" : "Global Communications",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "STEINER",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Business strategies and operations are driven by scores of ever-shifting factors: from demographic changes and capital availability to technological innovations and increasing regulation. Static business models are rarely able to keep pace with such dynamic change; and this is why companies need a management approach that fits to this environment. In effect, they need to know how and when to modify or enhance their business processes, which processes are optimal candidates for intervention, and how to move rapidly from business strategy to execution. Business Process Management (BPM) helps organizations master change successfully and create immediate as well as durable competitive advantage. BPM has become a management discipline that delivers significant business value. It is implemented through the \"process of process management\" that addresses all aspects of the lifecycle of a business process: design, implementation, executive and controlling of processes. This course fills the following Organizational Dynamics requirementsCatergories: A Concentrations: LMC This seminar discusses how organizations master the \"process of processes management\" to achieve the right BPM maturity level to move efficiently and effectively from business strategy to execution, achieving goals like transparency, agility and compliance, quality and efficiency, internal integration and external networks. It addresses topics like creating a BPM roadmap, innovation, process governance and centers of excellence, integration of business and IT, the value-driven use of process repositories, as well as selected aspects of process automation including the concept of Service Oriented Architectures (SOA) and the \"Enterprise 2.0.\" In this course framework, approaches, methods and software for achieving and maintaining a high performance business will be discussed using real live examples and case studies. Business Process Management (BPM) is introduced as a holistic management discipline.",
    "course_id" : "DYNM630",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "630",
    "course_title" : "Value-Driven Business Process Management - From Strategy to People and IT-Based Execution",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Kirchmer",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The purpose of this course is to explore, enhance, and expand the participants' competence in organizational politics. Students will observe political dynamics as they occur in their own organizations and will interview senior managers in other organizations to learn how political realities vary from one organization to another. Theoretical ideas about a dimension of organizational politics of particular interest to each individual participant will be analyzed in a term paper. In addition, each participant will keep a personal diary of political dynamics in his or her own workplace. The course will also explore ways to master the political skills of networking, negotiating, influencing, leading, and following, as well as developing a political strategy. This course fills the following Organizational Dynamics requirements: Categories: A Concentrations: LMC, MSN",
    "course_id" : "DYNM612",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "612",
    "course_title" : "Mastering Organizational Politics and Power",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Eldred",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "We live and compete in a global economy increasingly dominated not only by the United States, but also by China. With a different philosophy or set of philosophies, a different concept of \"society\" and different assumptions about human nature and the future, China can help us to understand how \"American\" we are. In this course, we look at the ideals and realities of the U.S. and Chinese systems and look at how these systems have developed over time. We raise questions about how we affect each other, as well as potential areas of risk, competition, and cooperation in the Sino-U.S. relationship. Each participant will develop a comparative case study based upon one of three topics for which neither country, one might argue, has a working policy: health environment, or trade.",
    "course_id" : "DYNM632",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics@upenn.edu",
    "course_number" : "632",
    "course_title" : "China and the U.S.: Competition and Collaboration",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Bauer",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course discusses the essential structures and issues of leading and operating in the modern workplace. Often these structures-including management, marketing and finance-are treated as silos in which roles and responsbilities take exclusive ownership. The strategic leader and planner,as well as participant, of any organization, whether for profit or not for profit, must develop an overall familiarity and synthesis of meaning of the areas in order to be effective. The issues of leadership will be woven into the discussion using cases. The focus is on the understanding of fundamental characteristics and operation of each area and on the integration of these areas into the strategic planning process that all organizations must go through in order to survive, grow, develop, and prosper.",
    "course_id" : "DYNM202",
    "course_level" : "3",
    "course_level_description" : "Advanced",
    "course_notes" : "",
    "course_number" : "202",
    "course_title" : "Organizational Dynamics for the Modern Workplace",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Pourdehnad",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "DYNM560",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "560",
    "course_title" : "Family Systems",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course explores the implications of past and future changes in land use and population changes over time in one of the least densely populated areas of the country, but which serves as both a winter and summer playground for millions of urban residents each year. Set in the White Mountains of New Hampshire, only a day's drive for over 10 million Americans, the area boasts some of the most pristine and exotic microenvironments in the world, left from the last Ice Age. Over 250,000 people visit the summit of Mt. Washington, the region's highest peak, every year, driving, hiking or riding the cog railway to the top. The focus of this course is the growing interest in promoting \"sustainable development,\" which most people envision as protecting the environment and wild species from human encroachment and pollution. The course will examine the human sphere and the natural sphere as common ground in the analysis of competing issues; areas of compatibility; and future plans to promote a sustainable environment in this region. The course will focus on three themes: 1) how the people and institutions tasked with being the environment's guardians go about their jobs; 2) how the area is used by visitors; and 3) how industry and its stakeholders have worked with local regulators and politicians to create jobs and promote growth. The course will ask students to overlay the principles of sustainability and issues management, in managing the increasing concern that the trajectory of land use and industrial growth will compromise the region's native ecology and wilderness and backcountry attractiveness. Left to its own momentum, how will the future of the area fare versus promoting and implementing more sustainable goals? Changes in behavior will be needed to bring the two into line, and that leads to organizational dynamics. How will stakeholders resolve the natural tensions of the institutions' (primarily those that operate in the region) mission and development goals with outsiders' desires? What leverage do they and others have in the debate over the future of the region? In addition to an active outdoor week in the White Mountains, participants will meet with key players and leaders from the area and come away with a deeper understanding of the major issues in the tentions between \"the place no one knew and the place that got loved to death.\" This course fills the following Organizational Dynamics requirements: Categories: A Concentrations: LM, SD This is a travel course that will have on-campus meetings on June 30th and July14th from 5:30-8:00 pm at 3440 Market Street, Suite 100. The travel dates to New Hampshire are August 2-9, 2014.",
    "course_id" : "DYNM650",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics@upenn.edu",
    "course_number" : "650",
    "course_title" : "OUTDOOR DYNAMICS",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Barstow/Havely",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "DYNM726",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Participants explore sources of problems and conflicts, identify the range of choices for resolution, and spend time in the field identifying and resolving conflicts at the personal and team levels.",
    "course_id" : "DYNM725",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "725",
    "course_title" : "Interpretation & Problem-Solving & Managing Conflict",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Napier",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "In the new \"flat world\" of social media, interconnected technology, and smart algorithms, analyzing and reflecting upon different approaches to creativity and innovation--in design, applied research, product development, pharmaceuticals, advancements in medicine, graphic arts and political and economic problem-solving, Western Europe and the Upper Rhine region has long been a leader in product advancement, product quality, and integrated design. Studied separately or in combination with European Project Management, DYNM 756 will be offered the week after in Strasbourg. DYNM 756 looks at multi-cultural European management styles and approaches that present students a wide array of perspectives and techniques for their own organizations and firms in how to encourage, manage, and implement creative solutions and organizational innovation. Broadening perspectives and approaches is the goal goal of the 2014 course based in Strasbourg, France and Switzerland for unique glimpses into European companies and technology centers at the forefront of innovation and creativity.",
    "course_id" : "DYNM756",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "756",
    "course_title" : "DYNM 756: Managing Innovation and Creativity--Some Insights from the Upper Rhine: France, Germany and Switzerland",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "R.  Syd Havely",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "L",
    "terms_offered_description" : "Course usually offered summer term only"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "DYNM781",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "781",
    "course_title" : "European Approach Coach",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "DYNM 722",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This intensive course not only provides experientially the intellectual and practical core of every subsequent course, but also facilitates the creation of the cohesive community that is so fundamental to this program. Here, the cohort itself is the source of the learning that occurs, as participants learn to assess needs in the moment, provide critical insight and practical strategies in a wide range of situations, and personally reflect on the professional and personal work they have done. Entry into this course is restricted to OCEC students only. This course fills the following Organizational Dynamics requirements: Categories: A Concentrations: OCEC",
    "course_id" : "DYNM720",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "720",
    "course_title" : "Foundations of Organizational Consulting and Executive Coaching",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Russo/Napier/Orenstein",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "IND",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "DYNM721",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "721",
    "course_title" : "Field Study & Assessment",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "DYNM727",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "In this course, each participant is exposed to a variety of organizational consulting opportunities designed to enable them to utilize their skills in multiple situations and contexts. Access to an advisor/coach during this period ensures that each participant's avanced learning will be provided in a timely and individualized manner. Entry into this course is restricted to OCEC students only. This course fills the following Organizational Dynamics requirements: Categories: A Concentrations: OCEC",
    "course_id" : "DYNM728",
    "course_level" : "4",
    "course_level_description" : "Graduate",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "728",
    "course_title" : "Organiztional Consulting Internship",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Russo/Napier/Orenstein",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will offer a conceptual comprehension of the tools and techniques used in effective internal and external organizational consulting engagements. By contrasting the theory and practice of alternative coaching models, we will build tools and techniques for effective coaching as a leadership competency. Through an analysis of the coaching relationships in your organization, you will learn to develop a personalized approach to coaching and expand upon within organizational settings. Participants learn the \"how and why\" as well consulting frameworks. Additionally, the relevant and often symbiotic connection between consulting and coaching will be studied. What process toolsare most useful to today's executive coach in a consultative environment? How do approaches to consulting and coaching differ? How are they similar? How can a confluence of coaching and consulting lead to more effective decision making and wide-scale organizational performance? DYNM 724 will be presented over five class meetings. The class sessions will be taught utilizing lectureslectures, case studies, structured small group discussions, individual, and team presentations, faculty and participant experiences, and guest speakers. Course meeting dates are January 24 and 31; February 7 and 28; March 14.",
    "course_id" : "DYNM724",
    "course_level" : "4",
    "course_level_description" : "Graduate",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "724",
    "course_title" : "Consulting/Coaching Tools and Techniques",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Russo",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This class explores the formation and development processes of effective organization and work teams. We will engage in a blend of discussion, theory, and practical experiences. Topics include leadership, communications, norms, decision making, problem solving, interpersonal dynamics, phases of team development, and controlling barriers to effective teams. Students will be assigned to a core team and will work with that team throughout the semester. Each group will have as its goal developing itself into a high-performing team. Advanced graduate students from the Organizational Coaching concentration of the Organizational Dynamics Master's program will facilitate and support each team. Course material will be covered through lecture, small and large group discussions, learning activities, readings and assignments. Topics that will be covered include: 1) Team formation; 2) Leadership; 3) Communications; 4) Dealing with difficult team members/leaders; 5) Knowing yourself; 6) Roles; 7) Norms; 8) Problem solving and decision making; 9) Closure.",
    "course_id" : "DYNM201",
    "course_level" : "3",
    "course_level_description" : "Advanced",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics@upenn.edu/od.cgi",
    "course_number" : "201",
    "course_title" : "Team Dynamics in Organizational Settings",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Wilkinsky, William",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "In today's global economy, brands connote meaning and status for consumers around the world. In this course, we will develop a set of research tools necessary for understanding and evaluating how consumers interact with brands and consumer products, and integrate them into their everyday lives. We will also explore how companies build identities around brands by prioritizing consumer engagement and experiential value. In doing so, we will emphasize the rising importance of aesthetics, novelty, style, and authenticity in the world of creative branding and consumer culture.",
    "course_id" : "DYNM682",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics@upenn.edu",
    "course_number" : "682",
    "course_title" : "Branding and Consumer Culture",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Grazian",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This class is designed to challenge the traditional thinking of basic management strategy and practice. Through a series of lectures, interactive cases, and group discussions, faculty will challenge participants to rethink their assumptions and move beyond the traditional practice of management strategy formulation and execution. The prevailing pattern of thought employed by management is analytical. Analysis has come to dominate thought in the western world. But no amount of analysis can explain systemic interaction and organizational behavior. A new pattern of thought is required: synthetic. Systems Thinking involves both analysis - to produce knowledge of organizations (systems) - and synthesis to provide understanding. Without both, effective solutions to problems cannot be obtained. To go beyond understanding to wisdom requires awareness of the difference between doing things right (efficiency) and doing the right thing (effectiveness). The better we do the wrong thing, the more wrong we become. Today a great deal of energy is expended by organizations in an effort to increase the efficiency with which wrong things are done. This course fills the following Organizational Dynamics requirements: Categories: F, A Concentrations: LMC, SD",
    "course_id" : "DYNM666",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics@upenn.edu",
    "course_number" : "666",
    "course_title" : "Systems and Design Thinking",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Pourdehnad",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "DYNM725",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Competencies are expanded into more complex aspects of team and organizational change. Having experienced the art of design at a micro level, they now examine it as a means of enhancing larger system change. The cohort explores the nature of system change and how it relates to changing teams and individuals.",
    "course_id" : "DYNM726",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "726",
    "course_title" : "Expanding Coaching/Consulting Tools and Skills",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Russo/Napier/Orenstein",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Is the modern large corporation alienating, inflexible, unproductive? Is the small organization or work team engaging, innovative or creative, productive? Has it always been this way in the U.S.? Is change possible? In this unique, informal, \"turbo\" seminar, we will examine the large corporation in terms of history, governance and control, and delivery of (office) work. We will consider whether \"bigness\" and bureaucracy are inevitable, and how organizations of the present, and probably the future, are affected by those of the past. This seminar has been structured to cover a good deal of ground in a short time. The seminar will meet on six Saturdays. The subject matter of the seminar is the large-scale organization. Questions to be raised include: 1) Is the modern large corporation alienating, inflexible, unproductive? 2) Are bigness and bureaucracy inevitable? 3) Is the small organization or work team engaging, innovative, creative, productive? 4) What does the historical record for the United States reveal? 5) Are organizational alternatives and change possible?",
    "course_id" : "DYNM613",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "613",
    "course_title" : "Is Bigger - Inevitable, Better or Worse in Organizations?",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Licht",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "DYNM 754",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The course will focus on the reforms and international openness that have transformed China during the last quarter century, and their political, social and legal contexts and consequences. Several specific topics will receive detailed attention, including reforms to China's economy (including the creation of a market economy, and changes in enterprise ownership and management and financial institutions), the role of foreign trade and investment and other channels of external influence, rising affluence and inequality, political reform and liveralization, and the development of the legal system. Students will experience contemporary urban China firsthand and see important cultural and historical sites and artifacts, providing a basis for assessing the influence of Chinese traditions and legacies in the People's Republic today. In China, we will meet with foreign and Chinese business people, government officials, academics and others.",
    "course_id" : "DYNM753",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "753",
    "course_title" : "China in Transition: The Context and Consequences of Economic Reform and Opening to the Outside World",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "deLisle",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "L",
    "terms_offered_description" : "Course usually offered summer term only"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "\"Perspectives\" is both a fundamental and integrating course intended for MSOD students at any point in the program who wish to understand and deploy a multiplicty of dynamics operative in organizations and in the minds that create and inhabit them. It is particularly useful for those in their first year and for non-MSOD students. One key focus is on understanding the implicit mental and emotional frameworks or metaphors that \"inform\" organizing so that we can virtually see more robust and complex approaches to effectiveness and to leadership within them. Several faculty members highlight their specialties. One special theme examines new management models and thinking frameworks designed to prevail in a 21st century context. Lectures, discussion, and experiential learning are used to build an informed grounding in the history, philosophy, theory and practice of Organizational Dynamics. The course requirements are active class participation, potential application projects/weekly journal, a midterm paper and a final paper. This course fills the following Organizational Dynamics requirements: Categories: F Concentrations: LMC,GL, OC, MSN, SD",
    "course_id" : "DYNM501",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "501",
    "course_title" : "Perspectives on Organizational Dynamics",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Greco",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "DYNM561",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "561",
    "course_title" : "Cios/Ctos As Leaders",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will involve travel and study in Seoul, the capital of South Korea. A fully functioning modern democracy, Seoul is one of the world's largest cities (population of over 10 million) and the 2010 World Design Capital with one of the world's most technologically advanced infrastructures. Yet there are many outstanding social issues and welfare needs among the population. We will study, therefore, the degree to which orporate and nonprofit foundations play a major role in meeting their own interests for growth and profitability as well as these social welfare development needs. We will also visit corporate and nonprofit foundations, and other organizations, meeting leaders. We will study with faculty, practitioners, and others within industry and associated with the Seoul National University to examine and learn about the work they undertake and how the entrepreneurship model can promot the \"social good.\"",
    "course_id" : "DYNM768",
    "course_level" : "4",
    "course_level_description" : "Graduate",
    "course_notes" : "",
    "course_number" : "768",
    "course_title" : "Corporate & No-Profit LD.",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "At one time or another, each of us has said something like, \"I know what to do to make some really effective--and possibly even profitable--changes in this organization,but the politics make it almost impossible to get anything done.\" The sense is that, althaough there are changes that should be made to improve organizational performance, politics (internal, external, governmental) simply obstructs our ability to make a difference. Frustrations notwithstanding, depending on how it is employed, politics can be either an impediment or, more importantly, a source of opportunities for improving organizations. Politics is the art and science of coordinating individuals, departments, management, markets--the entire organizational environment-to effect a balance between the organization's objectives and the methods used to achieve them. As with the other factors that are employed to affect organizational performance-the methods used to improve manufacturing, marketing, sales, finance, and so on-politics is a means that organizations can use to initiate and maintain critical personal and institutional relationships One of the seminar readings--Latimer's \"Why Do They Call It Business If It's Mostly Politics?\" is used to provide illustrations of the ambiguous nature of much of what is regarded as organizational politics. What is critical to understand and appreciate from the outset, however, is that politics is not an external factor that is imposed on organizations. Politics is not only a means for achieving personal or institutional power; it is also a method for developing and maintaining personal and institutional relationships within and among individuals and organizations of all types. This seminar will discuss organizational politics and the ways that it is used to identify, characterize, and effect change--both within and among organizations. After reviewing several perspectives on organizations and the roles that political processes play in decision-making, a series of cases is presented that illustrate the contexts and conditions for effective political communication and coordination. This course fills the following Organizational Dynamics requirements: Categories: A Concentration: LMC",
    "course_id" : "DYNM655",
    "course_level" : "4",
    "course_level_description" : "Graduate",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "655",
    "course_title" : "Using the Political Process to Effect Organizational Change",
    "crosslistings" : [ {
      "course_id" : "655",
      "section_id" : "",
      "subject" : "GAFL"
    } ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Gale",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "DYNM730",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "In this course, each participant is exposed to a variety of executive coaching opportunities designed to enable them to utilize their skills in multiple situations and contexts. Access to an advisor/coach during this period ensures that each participant's advanced learning will be provided in a timely and individualized manner. Entry into this course is restricted to OCEC students only.",
    "course_id" : "DYNM729",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "729",
    "course_title" : "Executive Coaching Internship",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Russo/Napier/Orenstein",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "We survive in the work world not by our own devices alone, but through the interaction of individuals working as a group toward common goals. Using a group process format, we will look at how individuals work together, addressing questions such as: What invididual behaviors contribute to the success of groups in accomplishing tasks? What group behaviors are productive and which interfere with the task? Who belongs to the group and who does not? We will examine how people in small groups influence one another through direct, generally face-to-face contacts. Participants will develop and report on projects relevant to their own work or home environment. Readings will include a retrospective on the field of human relations and group dynamics, the social psychology of group process and group dynamics, with specific application to the world or work and complex organizations.",
    "course_id" : "DYNM691",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "691",
    "course_title" : "Small Group Processes",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Ramsden",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "DYNM622",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "622",
    "course_title" : "Building Effective Struc",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "If you don't yet believe in the social media revolution, then watch this: http://www.youtube.com/watch?v=ZQzsQkMFgHE Facebook. Twitter. Pinterest. Tumblr. Path. Delicious. Digg. Youtube.Linkedin. It's been less than a decade since many of these social media services have launched, yet they've transformed society in many significant ways. Social Media and the Organization will deepen your understanding of and offer real time practical experience with social media. The course will examine the current trends and use of social media in marketing, product development, customer service, networking and other facets of organizational policy and practice. Students will have hands-on participation online with the class blog, http://upennsocialbook.wordpress.com sharing relevant case studies, analyzing social media campaigns and critiquing their own organization's culture and values surrounding social media including social media policy, staff challenges, and evaluation of challenges and opportunities in its use.",
    "course_id" : "DYNM558",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "558",
    "course_title" : "Social Media and the Organization",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Havely/Warren",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "ONL",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "NOTE: Logitech ClearChat Headphones and Logitech QuickCam Pro9000 are required for this course. Please see the syllabus for other requirements. Across the globe, companies, both large and small, are increasingly conducting culturally complex work thorugh tecnnology channels and virtual personnel transfers, making multi-cultural organization and virtual work inextricably intertwined. In this context, electronically mediated collaboration and communication capabilities across time, distance, organization, culture and other knowledge boundaries have become necessary for the everyday work of telecommuters, virtual teams, remote managers, professional knowledge communities, and electronic marketplaces. This course is primarily intended for students with an interest in globally distributed work and collaborative virtual organizations. The purpose of this elective is to enhance student understandings of virtual forms of human collaboration and to develop student abilities to work jointly with others via electronic tools. This course design makes typical social patterns encountered in virtual organizations visible so that students can learn from participating and collectively reflecting on their course experiences. This course has an online course fee of $150 This course fills the following Organizational Dynamics requirements: Categories: A Concentrations LMC, GL",
    "course_id" : "DYNM640",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "640",
    "course_title" : "Virtual Collaboration",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Reyes",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "DYNM729",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "In this course, students demonstrate their consulting and coaching mastery and scholarship by creating their capstone/thesis summary proposal. Throughout the program, participants will have systematically codified their learning experiences through the delivery and accumulation of various papers, project results, and other measures of performance. These will be contained in a Personal Portfolio which includes a record of understanding the assigned literature and classroom-based theory and experiences. In addition, each individual's personal coaching philosophy is framed in a theoretical and model developed over the course of the program. Personal reflections and insights are an essential aspect of the ongoing record of learning. Using all of these as source material, the participant writes and assembles a full case history drawn from the Practicum (DYNM 727) and the Internships (DYNM 728 and DYNM 729).",
    "course_id" : "DYNM730",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "730",
    "course_title" : "Capstone Portfolio Preparation and Proposal",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Russo/Napier/Orenstein",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will examine the difficulties of operating a sustainable business in a society that has an unquestioned commitment to economic growth at any cost. Generating momentum for sustainability-creating a world where nature thrives, business prospers, and societies work without mortgaging the future of unborn generations-is the great challenge of the 21st century. Using systems thinking and Ackoff's idealized design, we will examine questions such as: 1) Is environmental deterioration real and a result of a systemic failure of modern capitalism? 2) How can the operating instructions for the modern economy be changed to both protect and restore the natural world while maintaining quality of life for as many as possible? 3) Can market driven prices be environmentally honest? 4) How can the economic system foster \"regenerative growth\" that is not destructive to the planet? 5) What are the dimensions of a \"post-growth\" economy and society and what is the new role of the \"post-growth\" consumer? 6) What role will the various levels of government play in moving society toward this \"post-growth\" economy and how will business, NGOs and citizens contribute? 7) Are there social and structural innovations on the horizon that will help with this important transition? Course participants will take away a grounded understanding of the current state of modern capitalism vs the desired state for a sustainable business environment as we explore together what actions will move us toward a more communited based, more sustainable world.",
    "course_id" : "DYNM674",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "674",
    "course_title" : "Leadership, Sustainability & Social Innovation",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Nuessle",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "AS",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "We live in a unique time of worldwide crisis with recognition that the economy that will emerge will be different from the one that we have known. It will be: export-oriented, less consumption-oriented, more environmentally-oriented, more bio and software oriented, more civil-engineer oriented, more middle class oriented, less oriented to income growth that is disporportionate towards a very small share of the population. For many who hold onto their current work, it will be a jobless recovery, because so many of the jobs and markets were based in unreal values. For those who can expand their mindset and adapt, it can provide opportunity. Each participant in this seminar will analyze how the local, national and global system really work and evolve, and learn how to differentiate yourself in the emergeing economic marketplace. The seminar will focus on four levels of analysis that will determine who will have job security in the new economy: Your current skills and the culture and organization of your current business/industry; The role of our government, politics and political will in shaping your future; The global picture--especially China, trade, the dollar; Your understanding of yourself: physically, intellectually, emotionally, socially and spiritually. Each person will come away with their own analysis and a plan to gain advantage in the emerging economic picture. The plan is developed each week in writing and shared by email the day before class meets, at midterm in an outline and presentation to the group, and in a final paper/presentation at the end of the semester.",
    "course_id" : "DYNM686",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics@upenn.edu/od.cgi",
    "course_number" : "686",
    "course_title" : "Integration and Innovation: The Only Job Security",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Bauer",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "DYNM 605 is a uniquely blended content of thought leadership vetted by subject matter experts worldwide. This participant-centered seminar is an opportunity to increase both awareness and knowledge of risk and uncertainty by examining causes of unexpected events in predictive (classic) and adaptive (agile) project frameworks. Successful applications of non-deterministic approaches areexplored as antidotes to constrained command and control project environments. Course content is valuable in roles, organizations, and sectors of all types. Prominent project/operational risk management methodologies are included in this seminar. Processes advanced by the Project Management Institute, U.K. Association for Project Management, International Council on Systems Engineering, and by the International Organization for Standardization are contrasted with industry specific practices, including the U.S. Food and Drug Administration, NASA, and the Departments of Defense and Energy. Case examples are based on relevant experience. Participants perform hands-on implementation of processes in realistic team working sessions and facilitated dialogue. Optional quantitative tools workshops and tutorials will be available beyond scheduled course work for those who are interested. Categories: DE, A Concentrations: LMC, MSN",
    "course_id" : "DYNM605",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "605",
    "course_title" : "Project/Operational Risk, Uncertainty, and the Unexpected",
    "crosslistings" : [ {
      "course_id" : "605",
      "section_id" : "",
      "subject" : "GAFL"
    } ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Hornbacher",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "A main objective of this foundation course is to improve the academic papers and presentations in all Organizational Dynamics work, including the capstone. Because the discipline of writing for academic purposes is based on skills thatare not common to business writing and because the writing process is central to learning in this program, Organizational Dynamics offers this course designed to assist participants in developing efficient, reliable, and fruitfulacademic writing, and presentation techniques. This course fills the following Organizational Dynamics requirements: Categories: F",
    "course_id" : "DYNM500",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "500",
    "course_title" : "Fdns of Res & Schlrship",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will concentrate its attention on the process, the tools and evaluations that characterize the various planning approaches in the 21st century. The emphasis will be divided between the private sector and the public sector planning scenarios as well as the various approaches to planning within the western democracies. The course will also include some specific reviews of business planning so that the participant may acquire more realistic understanding of the field of planning. The central idea is, of course, to carry out a comparative analysis of the plannign paradigms as they are practiced in the field, or as they have been articulated in theory. In order to achieve this objective, the seminar will spend considerable time reviewing the subject matter of planning as it has evolved, the institutionalization of planning as it has been articulated, and the products of planning as they have been delivered to the pertinent client groups.",
    "course_id" : "DYNM614",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "614",
    "course_title" : "Comparative Analysis of Alternative Planning Scenarios",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Tomazinis",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The importance of organizational culture as a factor that can influence organizational performance either positively or negatively gained renewed attention beginning in the mid-1990's. The success of high-profile firms with \"quirky cultures\" like Ben & Jerry's. tje entrepreneurial cultures of high tech firms that countered the cultures of traditional corporations, a recognition that organizational culture can be a major factor in organizational performance and the related emergency of \"high performance organizations\", acknowledgment that organiza tional culture can trump the implementation of organizational strategy, differences in values of workers from different generations, competition among companies to attract the best employees, and the failure of many once-promising mergers and acquisitions all pointed to the importance of understanding and intentionally managing organizational culture. This course will address many of the major debates about organizational culture as well as provide students with tools for better assessing and understanding organizational culture and managing culture change. Course material and discussions will consistently address issues related to both theory and practice.",
    "course_id" : "DYNM661",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "For additional information, please see our website at: http://www.organizationaldynamics.upenn.edu",
    "course_number" : "661",
    "course_title" : "Organizational Culture Change: Theory and Practice",
    "crosslistings" : [ ],
    "department" : "DYNM",
    "department_of_record" : "DYNM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "2F",
    "instructors" : "Vanderslice",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "AS",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  } ],
  "service_meta" : {
    "current_page_number" : 1,
    "error_text" : "",
    "next_page_number" : 1,
    "number_of_pages" : 1,
    "previous_page_number" : 1,
    "results_per_page" : 999
  }
}
