
{
  "result_data" : [ {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Agents are a new technique for trying to model, simulate, and understand systems that are ill-structured and whose mathematics is initially unknown and possibly unknowable. This approach allows the analyst to assemble models of agents and components where micro-decision rules may be understood; to bring the agents and components together as a system where macro-behavior then emerges; and to use that to empirically probe and improve understanding of the whole, the interrelations of the components, and synergies. This approach helps one explore parametrics, causality, and what-ifs about socio-technical systems (technologies that must support people, groups, crowds, organizations, and societies). It is applicable when trying to model and understand human behavior -- consumers, investors , passengers, plant operators, patients, voters, political leaders, terrorists, and so on. This course will allow students to investigate and compare increasingly complex agent based paradigms along three lines - math foundations, heuristic algorithms/knowledge representations, and empirical science. The student will gain a toolbox and methodology for attempting to represent and study complex socio-technical systems.",
    "course_id" : "ESE 308",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "308",
    "course_title" : "Agent Based Modeling and Simulation",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Probability, Java or C programming, or equivalent",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Participation of graduate students in the teaching mission of the department will help to develop teaching, presentation, leadership, and interpersonal skills while assisting the department in discharging its teaching responsibilities. All doctoral students are required to participate under faculty guidance in the teaching mission of the department. This requirement will be satisfied by completing two 0.5 course units of teaching practicum (ESE 895). Each 0.5 course unit of teaching practicum will consist of the equivalent of 10 hours of effort per week for one semester. As a part of the preparation for and fulfillment of the teaching practicum requirement, the student will attend seminars emphasizing teaching and communication skills, lead recitations, lead tutorials, supervise laborato experiments, develop instructional laboratories, develop instructional materiaand grade homeworks, laboratory reports, and exams. A teacher training seminar will be conducted the day before the first day of classes of the Fall semester. Attendance is mandatory for all second-year students. As much as possible, the grading aspect of the teaching practicum course will be such as not to exceed 50% of the usual teaching assistant commitment time. Some of the recitations will b supervised and feedback and comments will be provided to the student by the faresponsible for the course. At the completion of every 0.5 course unit of teach, the student will receive a Satisfactory/Unsatisfactory grade and a written evsigned by the faculty member responsible for the course. The evaluation will beon comments of the students taking the course and the impressions of the facult",
    "course_id" : "ESE 895",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "895",
    "course_title" : "Teaching Practicum",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The use of distributed wireless sensor networks has surged in popularity in recent years with applications ranging from environmental monitoring, to people- and object-tracking in both cooperative and hostile environments. This course is targeted at understanding and obtaining hands-on experience with the state-of-the-art in such wireless sensor networks which are often composed using relatively inexpensive sensor nodes that have low power consumption, low processing power and bandwidth. The course will span a variety of topics ranging from radio communications, network stack, systems infrastructure including QoS support and energy management, programming paradigms, distributed algorithms and example applications. Some guest lectures may be given.",
    "course_id" : "ESE 519",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "519",
    "course_title" : "Real-Time Embedded Systems",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Programming in C/C++.  ESE 350 or equivalent, one course in computer networks and Senior or Graduate standing",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "IND",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "V",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "ESE 599",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "599",
    "course_title" : "Independent Study for Master's credit",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "IND",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "V",
    "course_credit_type" : "CU",
    "course_description" : "For students who are studying a specific advanced subject area in electrical engineering. Students must submit a proposal outlining and detailing the study area, along with the faculty supervisor's consent, to the graduate group chair for approval. A maximum of 1 c.u. of ESE 899 may be applied toward the MSE degree requirements. A maximum of 2 c.u.'s of ESE 899 may be applied toward the Ph.D. degree requirements.",
    "course_id" : "ESE 899",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "899",
    "course_title" : "Independent Study for PhD credit",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This rapidly moving course provides a rigorous development of fundamental ideas in probability theory and random processes. This course is a prerequisitefor subsequent courses in communication theory and telecommunications such as ESE 576 and TCOM 501. The course is also suitable for students seeking a rigorous graduate level exposure to probabilistic ideas and principles with applications in diverse settings. We will focus on discrete and continuous probability spaces. The topics covered are drawn from: abstract probability spaces; combinatorial probabilities; conditional probability; Bayes's rule and the theorem of total probability; independence; connections with the theory of numbers, Borel's normal law; rare events, Poisson laws, and the Lovasz local lemma; arithmetic and lattice distributions arising from the Bernoulli scheme; limit laws and characterizations of the binomial and Poisson distributions; continuous distributions in one and more dimensions; the uniform, exponential, normal, and related distributions and their characterizations and applications; random variables, distribution functions; random number generation and statistical tests of randomness; measures of central tendency -- mean, median, mode; mathematical expectation and the Lebesgue theory; expectations of functions, key properties, moments, convolutions; operator methods and distributional convergence, the central limit theorem, selection principles; conditional expectation; tail inequalities, concentration; convergence in probability and almost surely, the law of large numbers, the law of the iterated logarithm; Poisson approximation, Janson's inequality, the Stein-Chen method; moment generating functions, renewal theory; characteristic functions.",
    "course_id" : "ESE 530",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "530",
    "course_title" : "Elements of Probability Theory",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "A solid foundation in undergraduate probability at the level of STAT 430 or ESE301 at Penn.  Students are expected to have a sound calculus background as covered in the first two years of a typical undergraduate engineering curriculum.  Undergraduates are warned that the course is very mathematical in nature with an emphasis on rigor; upperclassmen who wish to take the course will need to see the instructor for permission to register.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Hybrid systems combine discrete state-machines and continuous differential equations, and have been used as models of a large number of applications in areas such as real-time software, embedded systems, robotics, mechatronics, aeronautics, process control, and biological systems. The course will cover state-of-the-art modeling, design, and analysis of hybrid systems. The course is interdisciplinary, and is aimed at bringing together concepts in control theory and computer science. Specific topics include modeling, simulation, stability, reachability, and controller design for hybrid systems. Computational tools for the simulation and verification of hybrid systems will be emphasized with applications to robotics, avionics, air traffic management systems, and biological systems. The course consists of lectures, homeworks, and a final project.",
    "course_id" : "ESE 601",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "601",
    "course_title" : "Hybrid Systems",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course covers exact, approximate and numerical methods of wave propagation, radiation, diffraction and scattering with an emphasis on bringing students to a point of contributing to the current research literature. Topics are chosen from a list including analytical and numerical techniques, waves in complex media and metamaterials, photonic bandgap structures, imaging, miniaturized antennas, high-impedance ground plans, and fractal electrodynamics.",
    "course_id" : "ESE 610",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "610",
    "course_title" : "Electromagnetic and Optical Theory II",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Deterministic and probabilistic information. The pigeon-hole principle. Entropy, relative entropy, and mutual information. Random processes and entropy rate. The asymptotic equipartition property. Optimal codes and data compression. Channel capacity. Source channel coding. The ubiquitous nature of the theory will be illustrated with a selection of applications drawn from among: universal source coding, vector quantization, network communication, the stock market, hypothesis testing, algorithmic computation and kolmogorov complexity, and thermodynamics.",
    "course_id" : "ESE 674",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "674",
    "course_title" : "Information Theory",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 530 or equivalent exposure to probability theory",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1.5"
    }, {
      "activity_code" : "LAB",
      "credit" : "0"
    } ],
    "corequisites" : "MATH 240",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Introduction to signal and information processing (SIP). In SIP we discern patterns in data and extract the patterns from noise. Foundations of deterministic SIP in the form of frequency domain analysis, sampling, and linear filtering. Random signals and the modifications of deterministic tools that are necessary to deal with them. Multidimensional SIP where the goal is to analyze signals that are indexed by more than one parameter. Includes a hands-on lab component that implements SIP as standalone applications on modern mobile platforms.",
    "course_id" : "ESE 224",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "224",
    "course_title" : "Signal and Information Processing",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "PHYS 150, 151",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course is designed to provide an understanding of the physical aspects of telecommunications systems. This includes an understanding of waves and wave propagation, basic optics, the operation of optical fibers and fiber communication systems, an introduction to optical networks, free-space optical communications, and an understanding of simple antennas and arrays and their use in wireless communication.",
    "course_id" : "ESE 509",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "509",
    "course_title" : "Waves, Fibers and Antennas for Telecommunications",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course examines concepts of electromagnetism, vector analysis, electrostatic fields, Coulomb's Law, Gauss's Law, magnetostatic fields, Biot-Savart Law, Ampere's Law, electromagnetic induction, Faraday's Law, transformers, Maxwell equations and time-varying fields, wave equations, wave propagation, dipole antenna, polarization, energy flow, and applications.",
    "course_id" : "ESE 310",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "310",
    "course_title" : "Electric and Magnetic Fields I",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "02",
    "instructors" : "",
    "prerequisites" : "PHYS 151 and MATH 240",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Introduction to non-linear dynamics, chaos, bifurcation, and qualitative analysis of continuous and discrete dynamical systems and their use in understanding complex behavior of systems. Emphasis will be placed on understanding qualitative features of models of electrical, mechanical, and biological systems.",
    "course_id" : "ESE 412",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "412",
    "course_title" : "Chaotic Dynamics in Electrical and Biological Systems",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MATH 240, PHYS 150 or permission of the instructor",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This graduate-level course focuses on continuous and discrete n-dimensional linear systems with m inputs and p outputs in a time domain based on linear operators. The course covers general discussions of linear systems such as, linearization of non-linear systems, existence and uniqueness of state-equation solutions, transition matrices and their properties, methods for computing functions of matrices and transition matrices and state-variable changes. It also includes z-transform and Laplace transform methods for time-invariant systems and Floquet decomposition methods for periodic systems. The course then moves to stability analysis, including: uniform stability, uniform exponential stability, asymptotic stability, uniform asymptotic stability, Lyapunov transformations, Lyapunov stability criteria, eigenvalues conditions and input-output stability analysis. Applications involving the topics of controllability, observability, realizability, minimal realization, controller and observer forms, linear feedback, and state feedback stabilization are included, as time permits.",
    "course_id" : "ESE 500",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "500",
    "course_title" : "Linear Systems Theory",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Open to graduates and undergraduates who have taken undergraduate courses in linear algebra and differential equations.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Basic methods for analysis and design of feedback control in systems. Applications to practical systems. Methods presented include time response analysis, frequency response analysis, root locus, Nyquist and Bode plots, and the state-space approach.",
    "course_id" : "ESE 406",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "406",
    "course_title" : "Control of Systems",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "ESE 296",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "296",
    "course_title" : "Study Abroad",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "EG",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "In the context of this class wireless systems are defined as groups of wireless devices that collaborate to deliver information from generating sources to intended destinations. Wireless networks come in many varieties finding applicability in as many different settings. They can use different methods to access the shared wireless medium, they may or may not rely in a fixed infrast, and they can operate over different time scales. Despite these differences, a few recurrent characteristics and problems appear. Students in this class are exposed to different wireless networking modalities and led to understand commonalities and differences. Particular emphasis is in the roles of fading r variations in channel strength and interference detrimental effect of concurre communications as the defining characteristics of wireless networks. The use ooptimization tools to determine optimal operating points and the use of statistanalysis to deal with the inherent uncertainty introduced by fading are thorougly discussed. . The outcome of the class is a comprehensive exposure to the current state of the art on optimal design of wireless networks. The class is structured in blocks. An introductory section is followed by a formal discussion of wireless networking architectures. A third block discusses challenges presented by the inherent randomness present in wireless networks. The fourth part of the classthe theory to use in the discussion of algorithms and protocols for wireless networks.",
    "course_id" : "ESE 675",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "675",
    "course_title" : "Optimal Design of Wireless Systems",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "An advanced undergraduate course or graduate level course on the fundamental physical principles underlying the operation of traditional semiconducting electronic and optoelectronic devices and extends these concepts to novel nanoscale electronic and optoelectronic devices. The course assumes an undergraduate level understanding of semiconductors physics, as found in ESE 218 or PHYS 240. The course builds on the physics of solid state semiconductor devices to develop the operation and application of semiconductors and their devices in energy conversion devices such as solar photovoltaics, thermophotovoltaics, and thermoelectrics, to supply energy. The course also considers the importance of the design of modern semiconductor transistor technology to operate at low-power in CMOS.",
    "course_id" : "ESE 521",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "521",
    "course_title" : "The Physics of Solid State Energy Devices",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 218 or PHYS 240 or equivalent, or by permission of the instructor.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will present a survey of various areas from Operations Research and the methods used to solve problems in these areas. Some of these topics include: Transportation and Transshipment Problems, Introduction to Graphs and Trees, The LINGO Computer Package, The Transportation Simplex Method, Sensitivity Analysis, and Assignment Problems. The course also will discuss: Network Models, Shortest-Path Problems, Maximum-Flow Problems, and Minimum-Cost Network Flow. Integer Programming as applied to Knapsack Problems, Machine Scheduling Problems, and the Traveling Salesperson Problems is also discussed. Other topics include: Decision Making under Uncertainty, Utility Theory, Decision Trees, Decision Making with Multiple Objectives and Analytic Hierarchy Analysis. Some Game Theory involving Two-Person and n-Person Games is also included in the course. Other topics include: Deterministic and Probabilistic Inventory Models, Holding Cost and Lead Times, the Economic Order Quantity (EOQ), The Continuous Rate EOQ Model and Backorders, The News Vendor Problem, The Economic Order Quantity (EOQ) Model with Uncertain Demands. Other possible topics may include: Finite Regular and Finite Absorbing Markov Chains, Random Walks, and Queuing Models.",
    "course_id" : "ESE 403",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "403",
    "course_title" : "Applications of Operations Research in Systems Engineering",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 304 or some equivalent Linear Optimization Course",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This is a senior level course on scientific and technological fundamentals as they apply to two of the most utilized energy storage device systems, the electrochemical batteries and super-capacitors. The student will be taught how simple galvanic cells in series gave origin to those ubiquitous devices that combined excel in both power and energe density. The course will introduce the student to the modes of electrical energy storage by battieries and capacitors, different categories of electrochemical cells and batteries, primary and rechargeable batteries and their related chemistry, kinds of super-capacitors, charging and discharging profiles, equivalent series resistance (ESR), power capacities, and lifetimes. For super-capacitors, the student will be introduced to double-layer capacitance (DLC) and psuedo-capacitance types of energy storage, super-capacitor fundamentals through Faradaic and non-Faradaic processes, pseudo-capacitance of mental oxides and electro-active polymers (EAPs), non-ideal polarizable electrodes, energetics and kinetics of electrode processes, theories of dielectric polarization, inorganic and organic electolytes, carbonaceous materials, effective surface area (ESA) and functionalizations.",
    "course_id" : "ESE 418",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "418",
    "course_title" : "Electrical Energy Storage Systems",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "General Chemistry (CHEM 101), ESE 218, Calculus I",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "ESE 512",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "512",
    "course_title" : "Dyn Sys For Eng&Biol App",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "EG",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The course provides an introduction to modern logic design and digital systems. It starts with an overview of the major building blocks of a computer. It covers combinational logic including logic gates, minimization techniques, arithmetic circuits and modern logic devices such as programmable logic arrays. The next part deals with sequential circuits: flip-flops, registers memories, and state machines. Case studies of real-world applications are used to illustrate the design of sequential circuits. The use of hardware description language will be introduced. There is a companion lab-based course, ESE 171, required for EE/CMPE majors.",
    "course_id" : "ESE 170",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "170",
    "course_title" : "Principles of Digital Design",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Introduction to supply chains -- the production, distribution, and transportation of goods -- and the role of engineers and managers in the design and operation of that system. Supply chain as a physical process. Transportation service options and design. Impact of Information Technology (IT) and Intelligent Transportation Systems (ITS). Basic routing and distribution strategies. Future trends in transportation and supply chains in light of sustainability concerns.",
    "course_id" : "ESE 351",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "351",
    "course_title" : "Logistics, Manufacturing and Transportation",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 304, Freshmen and Sophmores require instructor permission",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "MST",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Register for this only once after all 10 course units are completed. This carries full time status with no credit.",
    "course_id" : "ESE 990",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "990",
    "course_title" : "Masters Thesis",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This is a 1.0 cu research-patterned, open-ended, laboratory-focused course addressing the interface between robotics and integrative biology. The goal is to identify and then explore and possibly add to a specific corner of the scientific literature wherein it is possible to reach the horizons of knowledge quickly because the relevant empirical tools have only recently become available for broad use. We will focus attention on the development of complex adaptive behavior in a legged robotic system with emphasis on such modalities as locomotion, manipulation, situational awareness, localization and mapping and so on.",
    "course_id" : "ESE 313",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "313",
    "course_title" : "Robotics and Bioinspired Systems",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 116 (or equivalent) and MATH 240 or by instructor permission.  Junior standing as measured by one of the following prior sophomore level courses (or equivalent): ESE 215 or MEAM 215 or MEAM 220 or MSE 220 or CIS 240.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1.5"
    }, {
      "activity_code" : "LAB",
      "credit" : "0"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "An introduction to interfacing real-world sensors and actuators to embedded microprocessor systems. Concepts needed for building electronic systems for real-time operation and user interaction, such as digital input/outputs, interrupt service routines, serial communications, and analog-to-digital conversion will be covered. The course will conclude with a final project where student-designed projects are featured in presentations and demonstrations.",
    "course_id" : "ESE 350",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "350",
    "course_title" : "Embedded Systems/Microcontroller Laboratory",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Knowledge of C programming or permission of the instructor",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course focuses on the mathematics behind Fourier theory and a wide variety of its applicationsin diverse problems in mathematics, engineering, and the sciences. The course is very mathematical in content and students signing up for it should have junior or senior standing. The topics covered are chosen from: functions and signals; systems of differential equations; superposition,memory, and non-linearity; resonance,eigenfunctions; the Fourier series and transform, spectra; convergence theorems; inner product spaces; mean-square approximation; interpolation and prediction, sampling; random processes, stationarity; wavelets, Brownian motion; stability and control, Laplace transforms. The applications of the mathematical theory that will be presented vary from year to year but a representative sample include: polynomial approximation, Weierstrass's theorem; efficient computation via Monte Carlo; linear and non-linear oscillators;the isoperimetric problem; the heat equation, underwate communication; the wave equation, tides; testing for randomness, fraud; nowhere differentiable continuous functions; does Brownian motion exist?; error-correction; phase conjugate optics and four-wave mixing; cryptography and secure communications; how fast can we compute?; X-ray crystallography; cosmology; and what the diffusion equation has to say about mathematical finance and arbitrage opportunities.",
    "course_id" : "ESE 325",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "325",
    "course_title" : "Fourier Analysis and Applications in Engineering, Mathematics, and the Sciences",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Math 240, Junior or Senior Standing",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LAB",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This is the companion course for ESE 170 and provides hands-on experience in modern digital circuit design. It makes use of state-of-the-art computer-aided design software including schematic capture, behavioral description, logic-simulation, minimization and implementation tools. The students will get familiar with programmable logic devices and hardware description languages (VHDL). The lab experiments make use of Xilinx FPGAs which allow rapid implementation and testing of the designed circuits. The course consists of weekly 3-hour laboratory sessions.",
    "course_id" : "ESE 171",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "171",
    "course_title" : "Principles of Digital Design Lab",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Advanced and specialized topics in both theory and application areas. Students should check Graduate Group office for offerings during each registration period.",
    "course_id" : "ESE 680",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "680",
    "course_title" : "Special Topics in Electrical and Systems Engineering",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course is designed to introduce students to the complexities of making decisions about threats to human health and the environment when people's perceptions of risks and their decision-making processes differ from expert views. Recognizing the limitations of individuals in processing information the course explores the role of techniques such as decision analysis, cost-benefit analysis, risk assessment and risk perception in structuring risk-management decisions. We will also examine policy tools such as risk communication, incentive systems, third party inspection, insurance and regulation in different problem contexts. The problem contexts for studying the interactions between analysis, perceptions, and communication will include risk-induced stigmatization of products (e.g. alar, British beef), places (e.g. Love Canal), and technologies (e.g. nuclear power); the siting of noxious facilities, radon, managing catastrophic risks including those from terrorism. A course project will enable students to apply the concepts discussed in the course to a concrete problem.",
    "course_id" : "ESE 567",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "567",
    "course_title" : "Risk Analysis and Environmental Management",
    "crosslistings" : [ {
      "course_id" : "261",
      "section_id" : "",
      "subject" : "OPIM"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Explores the design aspects involved in the realization of an integrated circuit from device up to the register/subsystem level. It addresses major design methodologies with emphasis placed on the structured design. The course includes the study of MOS device characteristics, the critical interconnect and gate characteristics which determine the performance of VLSI circuits, and NMOS and CMOS logic design. Students will use state-of-the-art CAD tools to verify designs and develop efficient circuit layouts.",
    "course_id" : "ESE 570",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "570",
    "course_title" : "Digital Integrated Circuits and VLSI-Fundamentals",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 319 (for undergraduates) or permission of the instructor",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "MST",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "ESE 597",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "597",
    "course_title" : "Master's Thesis",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "We model the stucture and function of neural systems in silicon using very large scale integration (VLSI) complimentary metal-oxide-semiconductor (CMOS) technology. To build these neuromorphic systems, we proceed from the device level, through the circuit level, to the system level. At the device level, we mimic electrodiffusion of ions through membrane channels with electrodiffusion of electrons through transistor channels. At the circuit level, we derive minimal implementation of synaptic interaction, dendritic integration, and active membrane behavior. At the system level, we synthesize the spatiotemporal dynamics of the cochlea, the retina, and early stages of cortical processing.",
    "course_id" : "ESE 573",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "573",
    "course_title" : "Building Brains in Silicon",
    "crosslistings" : [ {
      "course_id" : "526",
      "section_id" : "",
      "subject" : "BE"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Students with advanced knowledge in neurobiology but rudimentary knowledge in electrical engineering or vice versa are welcome.  Biology students should have a course in Cellular Neurobiology and BIOL 451, Systems Neuroscience. Engineering students should have ESE 218, Physics and Models of Semiconductor Devices and ESE 319, Fundamentals of Solid-State Circuits.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Failures of classical physics and the historical basis for quantum theory. Postulates of wave mechanics; uncertainty principle, wave packets and wave-particle duality. Shrodinger equation and operators; eigenvalue problems in 1 and 3 dimensions (barriers, wells, hydrogen atom). Mathematical equivalence to problems in optics. Perturbation theory; scattering of particles and light. Free electron theory of metals; Drude and Sommerfeld models, dispersion relations and optical properties of solids. Extensive use of computer-aided self-study will be made.",
    "course_id" : "ESE 514",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "514",
    "course_title" : "Physics of Materials I",
    "crosslistings" : [ {
      "course_id" : "570",
      "section_id" : "",
      "subject" : "MSE"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Undergraduate Physics and Math through modern physics and differential equations",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The course emphasizes a systems engineering approach to project management including the cycle costing and analysis, project scheduling, project organization and control, contract management, project monitoring and negotiations. In addition, the course will also examine management issues in large infrastructure projects like non-recourse or limited recourse project financing. Examples from the logistics planning process and global software project management will be used to highlight the course topics.",
    "course_id" : "ESE 544",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "544",
    "course_title" : "Project Management",
    "crosslistings" : [ {
      "course_id" : "444",
      "section_id" : "",
      "subject" : "ESE"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 304 or equivalent",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Overview of the communication process. Frequency response of linear channels. Random processes and power spectral densities. Modulation and Noise. Baseband data transmission: pulse amplitude modulation, inter-symbol interference, and equalization. Performance in noise. Digital band-pass modulation (PSK, QAM, FSK). Elements of information theory.",
    "course_id" : "ESE 408",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "408",
    "course_title" : "Data Communications",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 325 or permission of the instructor",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This is the first of a two-semester sequence in electrical and systems engineering senior design. Student work will focus on project/team definition, systems analysis, identification alternative design strategies and determination (experimental or by simulation) or specifications necessary for a detailed design. Project definition is focused on defining a product prototype that provides specific value to a lest one identified user group. Students will receive guidance on preparing professional written and oral presentations. Each project team will submit a project proposal and two written project reports that include coherent technical presentations, block diagrams and other illustrations appropriate to the project. Each student will deliver two formal Powerpoint presentations to an audience comprised of peers, instructors and project advisors. During the semester there will be periodic individual-team project reviews.",
    "course_id" : "ESE 450",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "450",
    "course_title" : "Senior Design Project I - EE and SSE",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Senior Standing or permission of the instructor",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Failures of free electron theory. Crystals and the reciprocal lattice; wave propagation in periodic media; Bloch's theorem. One-electron band structure models: nearly free electrons, tight binding. Semiclassical dynamics and transport. Cohesive energy, lattice dynamics and phonons. Dielectric properties of insulators. Homogeneous semiconductors and p-n junctions. Experimental probes of solid state phenomena: photo emission, energy loss spectroscopy, neutron scattering. As time permits, special topics selected from the following: correlation effects, semi-conductor alloys and heterostructures, amorphous semiconductors, electroactive polymers.",
    "course_id" : "ESE 515",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "515",
    "course_title" : "Physics of Materials - II",
    "crosslistings" : [ {
      "course_id" : "571",
      "section_id" : "",
      "subject" : "MSE"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MSE 570/ESE 514 or equivalent",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Model Building and Linear Programming: Graphical Methods and The Simplex Method, the LINDO and LINGO Computer Packages, Degeneracies, Minimization and the BigM and the Two-Phase Methods, and Goal Programming. Sensitivity Analysis: Geometric and Algebraic Approaches, The Computer and Sensitivity Analysis, The Dual of An LP Problem, The Dual Theorem, Shadow Prices, Complementary Slackness, The Dual Simplex Method, and The Revised Simplex Method. Integer Programming: The Branch and Bound Method, Enumeration Methods, and the Cutting Plane Method. Nonlinear Programming: Review of Differential Calculus, Convex and Concave Functions, Solving NLP Problems with One Variable, Uncontraint Nonlinear Optimization with Several Variables, Lagrange Multipliers and Constraint Nonlinear Optimization with Several Variables, The Kuhn-Tucker Conditions and Quadratic Programming.",
    "course_id" : "ESE 304",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "304",
    "course_title" : "Optimization of Systems",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MATH 240",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The course is designed to introduce students to modern statistical methods for analyzing spatial data. These methods include nearest-neighbor analyses of spatial point patterns, variogram and kriging analyses of continuous spatial data, and autoregression analyses of area data. The underlying statistical theory of each method is developed and illustrated in terms of selected GIS applications. Students are also given some experience with ARCMAP, JMPIN, and MATLAB software.",
    "course_id" : "ESE 502",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "502",
    "course_title" : "Introduction to Spatial Analysis",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 302 or equivalent",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course is cross-listed with an advanced-level undergraduate course (ESE 400). Compared to the undergraduate course, students will be required to do additional work and will be graded by a more rigourous performance standard. Topics include: money-time relationships, discrete and continuous compoundng, equivalence of cash flows, internal and external rate of return, design and production economics, life cycle cost analysis, depreciation, after-tax cash flow analysis, cost of capital, capital financing and allocation, parametric cost extemating models, pricing, foreign exchange rates, stochastic risk analysis, replacement analysis, benefit-cost analysis, and analysis of financial statements. Case studies apply these topics to engineering systems.",
    "course_id" : "ESE 540",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "540",
    "course_title" : "Engineering Economics",
    "crosslistings" : [ {
      "course_id" : "400",
      "section_id" : "",
      "subject" : "ESE"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    }, {
      "activity_code" : "LAB",
      "credit" : "0"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Provides an integrated introduction to selected fundamental concepts and principles in electrical and systems engineering: circuits, electronics, communication, control and computing. The course involves using the Boe-Bot, a robot based on the Parallax Javelin Stamp microprocessor. Team projects will include programming of the robot, controlling devices, and sensors, and navigation. Critical thinking, creativity, writing, communication, and leadership skills are also emphasized through a series of unique labs. Note: There are no prerequisites required for this course.",
    "course_id" : "ESE 112",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "112",
    "course_title" : "Introduction to Electrical and Systems Engineering - Devices",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "IND",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "An opportunity for the student to become closely associated with a professor in (1) a research effort to develop research skills and technique and/or (2) to develop a program of independent in-depth study in a subject area in which the professor and student have a common interest. The challenge of the task undertaken must be consistent with the student's academic level. To register for this course, the student and professor jointly submit a detailed proposal to the undergraduate curriculum chairman no later than the end of the first week of the term.",
    "course_id" : "ESE 099",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "A maximum of 2 c.u. of ESE 099 may be applied toward the B.A.S. or B.S.E. degree requirements",
    "course_number" : "099",
    "course_title" : "Undergraduate Research and/or Independent Study",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "06",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Introduction to the principles underlying electrical and systems engineering. Concepts used in designing circuits, processing signals on analog and digital devices, implementing computatin on embedded systems, analyzing communication networks, and understanding complex systems will be discussed in lectures and illustrated in the laboratory. This course provides an overview of the challenges and tools that Electrical Engineers and Systems Engineers address and some of the necessary foundations for students interested in more advanced courses in ESE.",
    "course_id" : "ESE 111",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "111",
    "course_title" : "Atoms, Bits, Circuits and Systems",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1.5"
    }, {
      "activity_code" : "LAB",
      "credit" : "0"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course is the companion lab for ESE 215 and provides an introduction to electrical measurements and measuring equipment; electrical sources; resistive, RL, RC, & RLC circuits and their non-electrical analogs; op-amp circuits; transient response and sinusoidal steady state for linear and nonlinear, e.g. neural/biological circuits and systems. LabVIEW and the use of data acquisition boards will be introduced.",
    "course_id" : "ESE 205",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "205",
    "course_title" : "Electrical Circuits and Systems I Lab",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course builds on OPIM 631 and OPIM 632 in developing the foundations of process management, with applications to manufacturing and supply chain coordination and integration. This course begins with a treatment of the foundations of process management, including quality (e.g. 6-sigma systems) and time (e.g., cycle time) as building blocks for the sucessful integration of plant operations with vertical and horizontal market structures. On the e-manufacturing side, the course consideres recent advances in enterprise-wide planning (ERP)systems, supplier management and contract manufacturing. Industry case studies highlight contrasting approaches to the integration of manufacturing operations and risk management with e-Logistics and e-Procurement providers and exchanges. The course is recommended for those interested in consulting or operations careers, and those wishing to understand the role of manufacturing as a general foundation for economics value creation.",
    "course_id" : "ESE 522",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "522",
    "course_title" : "Process Management in Manufacturing",
    "crosslistings" : [ {
      "course_id" : "656",
      "section_id" : "",
      "subject" : "OPIM"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "OPIM 621, OPIM 631, and OPIM 632 or equivalent",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Advanced and specialized topics in both theory and application areas. Students should check Graduate Group Office for offerings during each registration period.",
    "course_id" : "ESE 580",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "580",
    "course_title" : "Special Topics",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course covers the methodologies and techniques important to DESIGNING large complex, purposeful systems and to discovering policies that influence them throughout the stages of their lifecycle. The course focuses on hands-on synthetic thinking, where students assemble the big picture from modeling the individual actors, organizations, and artifacts in a socio-technical system of interest. This is the study of emergence of macro-behavior from the micro-decision making of the actors involved - to inquire into the design of a purposeful system, and to examine alternative futures that are ideal, yet affordable, sustainable, and workable. Specifically, the student learns systems theory, systems methodologies (design inquiry/learning systems, idealized design/interactive planning, and soft systems methodology/knowledge management), bottom up modeling (decision science, multi-attribute utility theory, affective reasoning, agent based modeling, simulated societies), and how to further research and apply the synthetic paradigm.",
    "course_id" : "ESE 590",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "590",
    "course_title" : "Systems Methodology",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LAB",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course is the companion lab for ESE 216. It covers experiments involving transformers, diodes, and transistors. DC and small signal model amplifiers, rectification, and non-linear op amp circuits.",
    "course_id" : "ESE 206",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "206",
    "course_title" : "Electrical Circuits and Systems II Lab",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "MATH 240",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This first course in systems modeling focuses on linear discrete-time systems. We draw on a set of examples used throughout the course as the necessary mathematical tools are developed. The examples demonstrate the breadth of systems models and are drawn from engineering, the biological sciences, and economics. MATLAB will be used extensively.",
    "course_id" : "ESE 210",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "210",
    "course_title" : "Introduction to Dynamic Systems",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The course provides an introduction to electric circuits that form the basis of modern microelectronic systems. After a brief discussion of electric power, the course will review passive and active filters, and frequency response of circuits. Laplace transforms will be used to analyze circuits and to represent network functions. The second half of the course will focus on modern solid-state devices and elctronic circuits including diodes, the metal-oxide-semiconductor (MOSFET) translator and their applications such as single stage MOS amplifiers. Use of the state-of-the-art CAD packages such as SPICE will be introduced.",
    "course_id" : "ESE 216",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "216",
    "course_title" : "Electrical Circuits and Systems II",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 215",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course covers the fundamentals of discrete-time signals and systems and digital filters. Specific topics covered include: review of discrete-time signal and linear system representations in the time and frequence domain, and convolution; discrete-time Fourier transform (DTFT); Z-transforms; frequency response of linear discrete-time systems; sampling of continuous-time signals, analog to digital conversion, sampling-rate conversion; basic discrete-time filter structures and types; finite imples response (FIR) and infinite impulse response (IIR) filters; design of FIR and IIR filters; discrete Fourier transform (DFT), the fast Fourier transform (FFT) algorithm and its applications in filtering and spectrum estimation. Selected applications.",
    "course_id" : "ESE 531",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "531",
    "course_title" : "Digital Signal Processing",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Undergraduate Signals and Systems",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Digital Signal Processing Laboratory focuses on the implementation of common digital signal processing functions using state-of-the-art DSP devices. The course introduces the fundamental or discrete-time signal processing and digital signal processor architectures and applications. Emphasis is on laboratory experience involving generation of deterministic and random signals; digital filter design; quantization effects; FFT computation; modulation techniques for communications.",
    "course_id" : "ESE 533",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "533",
    "course_title" : "Digital Signal Processing Laboratory",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 531",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course provides a study of discrete-event systems simulation. Some areas of application include: queuing systems, inventory systems, reliability systems Markov Chains, Random-Walks and Monte-Carlo systems. The course examines many of the discrete and continuous probability distributions used in simulation studies as well as the Poisson process. Long-run measurements of performances of queuing systems, steady-state behavior of infinite and finite-population queuing systems and network of queues are also examined. Fundamental to most simulation studies is the ability to generate reliable random numbers. The course investigates the basic properties of random numbers and techniques used for the generation of pseudo-random numbers. In addition, the course examines techniques used to test pseudo-random numbers for uniformity and independence. These include the Kolmogorov-Smirnov and chi-squared tests, runs tests, gap tests, and poker tests. Random numbers are used to generate random samples and the course examines the inverse-transform, convolution, composition and acceptance/rejection methods for the generation of random samples for many different types of probability distributions. Finally, since most inputs to simulation are probabilistic instead of deterministic in nature, the course examines some techniques used for identifying the probabilistic nature of input data. These include identifying distributional families with sample data, then using maximum-likelihood methods for parameter estimating within a given family and then testing the final choice of distribution using chi-squared goodness-of-fit tests.",
    "course_id" : "ESE 603",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "603",
    "course_title" : "Simulation Modeling and Analysis",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Probability (undergraduate level) and one computer language",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This is the second of a two term sequence in electrical and systems engineering senior design. Student work will focus on completing the product prototype design undertaken in ESE 450 and successfully implementing the said product prototype. Sucess will be verified using experimental and/or simulation methods appropriate to the project that test the degree to which the project objectives are achieved. Each project team will prepare a poster to support a final project presentation and demonmstration to peers, faculty and external judges. The course will conclude with the submission of a final project written team report. During the semester there will be periodic project reviews with individual teams.",
    "course_id" : "ESE 451",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "451",
    "course_title" : "Senior Design Project II - EE and SSE",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 450",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Design of analog circuits and subsystems using primarily MOS technologies at the transistor and higher levels. Transistor level design of building block circuits such as op amps, comparators, sample and hold circuits, voltage and current references, capacitors and resistor and class AB output stages. The Cadence Design System will be used to capture schematics and run simulations using Spectre for some homework problems and for the course project. Topics of stability, noise, device matching through good layout practice will also be covered. Students who take ESE419 will not be able to take ESE572 later. More will be expected of ESE572 students in the design project.",
    "course_id" : "ESE 419",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "419",
    "course_title" : "Analog Integrated Circuits",
    "crosslistings" : [ {
      "course_id" : "572",
      "section_id" : "",
      "subject" : "ESE"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "03",
    "instructors" : "",
    "prerequisites" : "ESE 319, ESE 570, or permission of the instructor",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course concentrates on recognizing and solving convex optimization problems that arise in engineeering. Topics include: convex sets, functions, and optimization problems. Basis of convex analysis. Linear, quadratic, geometric, and semidefinite programming. Optimality conditions, duality theory, theorems of alternative, and applications. Interior-point methods, ellipsoid algorithm and barrier methods, self-concordance. Applications to signal processing, control, digital and analog circuit design, computation geometry, statistics, and mechanical engineering.",
    "course_id" : "ESE 605",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "605",
    "course_title" : "Modern Convex Optimization",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Knowledge of linear algebra and willingness to do programming.  Exposure to numerical computing, optimization, and application fields is helpful but not required.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The course studies issues in nonlinear control theory, with a particular emphasis on the use of geometric principles. Topics include: controllability, accessibility, and observability, for nonlinear systems; Forbenius' theorem; feedback and input/outpub linearization for SISO and MIMO systems; dynamic extension; zero dynamics; output tracking and regulation; model matching disturbance decoupling; examples will be taken from mechanical systems, robotic systems, including those involving nonholonomic constraints, and active control of vibrations.",
    "course_id" : "ESE 617",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "617",
    "course_title" : "Non-Linear Control Theory",
    "crosslistings" : [ {
      "course_id" : "617",
      "section_id" : "",
      "subject" : "CBE"
    }, {
      "course_id" : "613",
      "section_id" : "",
      "subject" : "CIS"
    }, {
      "course_id" : "613",
      "section_id" : "",
      "subject" : "MEAM"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "A sufficient background to linear algebra (ENM 510/511 or equivalent) and a course in linear control theory (MEAM 513 or equivalent), or written permission of the instructor.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Sampling, source coding, and channel capacity. Quantization and coding of speech and video. Baseband data transmission: bandwidth, intersymbol interference, adaptive equalization, performance analysis. Digital modulation schemes, spectral efficiency, and performance. Error control coding; block and convolutional codes.",
    "course_id" : "ESE 576",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "576",
    "course_title" : "Digital Communication Systems",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Undergraduate linear systems, probability, random processes.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "IND",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "V",
    "course_credit_type" : "CU",
    "course_description" : "For students working on an advanced research program leading to the completion of master's thesis or Ph.D. dissertation requirements.",
    "course_id" : "ESE 999",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "999",
    "course_title" : "Thesis/Disseratation Research",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "DIS",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Register for this after completing four years of full-time study including two course units each Summer Session (and usually equal to 40 course units).",
    "course_id" : "ESE 995",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "995",
    "course_title" : "Dissertation",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Introduction to MEMS and NEMS technologies: MEMS/NEMS applications and key commercial success stories (accelerometers, gyroscopes, digital light projectors, resonators). Review of micromachining techniques and MEMS/NEMS fabrication approaches. Actuation methods in MEMS and NEMS, MEMS/NEMS design and modeling. Examples of MEMS/NEMS components from industry and academia. Case studies: MEMS inertial sensors, microscale mirrors, micro and nano resonators, micro and nano switches, MEMS/NEMS chem/bio sensors, MEMS gyroscopes, MEMS microphones.",
    "course_id" : "ESE 529",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "529",
    "course_title" : "Introduction to MEMS and NEMS",
    "crosslistings" : [ {
      "course_id" : "529",
      "section_id" : "",
      "subject" : "MEAM"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Physiology and anatomy of living neurons and neural networks; Brain organization; Elements of nonlinear dynamics, the driven pendulum as paradigm for complexity, synchronicity, bifurcation, self-organization and chaos; Iterative maps on the interval, period-doubling route to chaos, universality and the Feigenbaum constant, Lyapunov exponents, entropy and information; Geometric characterization of attractors; Fractals and the Mandelbrot set; Neuron dynamics: from Hudgkin-Huxley to integrate and fire, bifurcation neuron; Artificial neural networks and connectionist models, Hopfield (attractor-type) networks, energy functions, convergence theorems, storage capacity, associative memory, pattern classification, pattern completion and error correction, the Morita network; Stochastic networks, simulated annealing and the Boltzmann machine, solution of optimization problems, hardware implementations of neural networks; the problem of learning, algorithmic approaches: Perception learning, back-propagation, Kohonnen's self-organizing maps and other networks; Coupled-map lattices; Selected applications including financial markets.",
    "course_id" : "ESE 539",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "539",
    "course_title" : "Neural Networks, Chaos, and Dynamics: Theory and Application",
    "crosslistings" : [ {
      "course_id" : "539",
      "section_id" : "",
      "subject" : "BE"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Introduction to transportation and logistics. Quantitative methods for analysis, design, and operations of logistics networks, including physical, monetary, and information flows. Planning and operations of transportation services, with application to various modes. Information technology, supply chain and multi-modal integration. Field trips; guest speakers from industry.",
    "course_id" : "ESE 550",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "550",
    "course_title" : "Logistics and Transportation Systems",
    "crosslistings" : [ {
      "course_id" : "750",
      "section_id" : "",
      "subject" : "CPLN"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 504 or equivalent",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Analysis, design and operation of highway and urban transportation systems. Review of traffic engineering. Vehicle, driver, roadway and environment characteristics. Traffic behavior, volume and capacity. Design of intersections, interchanges, transportation terminals and major activity centers. Pedestrian traffic. Transit operations. Urban transportation networks. Transportation system management. Teams perform design projects for specific facilities or networks and make presentations to a jury of engineers.",
    "course_id" : "ESE 551",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "551",
    "course_title" : "Transportation Systems: Design and Operation",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Networks constitute an important component of modern technology and society. Networks have traditionally dominated communication technology in form of communication networks, distribution of energy in form of power grid networks, and have more recently emerged as a tool for social connectivity in form of social networks. In this course, we will study mathematical techniques that are key to the design and analysis of different kinds of networks. First, we will investigate techniques for modeling evolution of networks. Specifically, we will consider random graphs (all or none connectivity, size of components, diameters under random connectivity), small world problem, network formation and the role of topology in the evolution of networks. Next, we will investigate different kinds of stochastic processes that model the flow of information in networks. Specifically, we will develop the theory of markov processes, renewal processes, and basic queueing, diffusion models, epidemics and rumor spreading in networks.",
    "course_id" : "ESE 501",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "501",
    "course_title" : "Networking - Theory and Fundamentals",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 530 or STAT 530 or equivalent",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Role of transportation in founding and growth of cities. Classification, definitions, theory, and characteristics of urban transportation modes, their components and performance. Vehicle propulsion and travel time computations; energy consumption and its possible reduction. Bus, trolleybus, light rail, rapid transit, AGT and specialized modes - vehicles, ways, terminals, operations and costs. Paratransit modes, and their role in urban transportation. Theoretical and practical capacities of modes. Present and potential innovations in vehicle design, propulsion, automation, including fully automated rapid transit systems. Visit to a transit system.",
    "course_id" : "ESE 554",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "554",
    "course_title" : "Urban Transit Systems and Technology",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Transportation systems operations; concepts, scheduling and analyses. Applications of operations research methods. Rail and bus networks, lines, branches and feeders. Timed transfer system. Fares, other revenues and costs. Organization and management. Transit planning methodology; comparison of modes. Transit financing and policy. Urban transportation problems in developed and developing countries: their origins, causes and solutions. Definition and implementation of optimal role of cars, transit, bicycles and pedestrians in cities. Balanced transportation and livable cities. Field trip.",
    "course_id" : "ESE 555",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "555",
    "course_title" : "Cities and Transportation Systems",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Non-linear elements and networks: linear and polynomial threshold elements, sigmoidal units, radial basis functions. Finite (Boolean) problems: acyclic networks; Fourier analysis and efficient computation; projection pursuit; low frequency functions. Network capacity: Feedforward networks; Vapnik-Chervnenkis dimension. Learning theory: Valiant's learning model; the sample complexity of learning. Learning algorithms: Perception training, gradient descent algorithms, stochastic approximation. Learning complexity: the intractability of learning; model selection.",
    "course_id" : "ESE 630",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "630",
    "course_title" : "Elements of Neural Computation, Complexity, and Learning",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "A semester course in probability or equivalent exposure to probability (e.g. ESE 530)",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The course provides a detailed inroduction to linear and nonlinear optimization analysis as well as integer optimization analysis. It discusses methods for the mathematical formulation of linear programming (LP) integer programming (IP) and nonlinear programming (NLP) problems, as well as methods of computational tools used for their solutions. In discussions surrounding the solutions to LP problems, the Simplex method and the Revised Simplex methods are covered in a fairly rigorous fashion along with the LINDO computational computer package. Sensitivity analysis associated with the optimal solutions to LP problems is also discussed in detail using both geometric and algebraic methods. In discussions surrounding the solutions to IP problems, the course covers: (a) branch and bound, (b) enumeration and (c) cutting-plane methods, and these are applied to numerous classic problems in IP. In discussions surrounding the solutions to NLP problems, the course covers methods involving: (a) differential Calculus, (b) steepest ascent and decent and (c) Lagrange Multipliers. The Kuhn-Tucker Conditions are also presented and applied to problems in Quadratic Programming. Many examples are selected from a broad range of engineering and business problems.",
    "course_id" : "ESE 504",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "504",
    "course_title" : "Introduction to Optimization Theory",
    "crosslistings" : [ {
      "course_id" : "910",
      "section_id" : "",
      "subject" : "OPIM"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Linear Algebra",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Parametric signal models; autoregressive, moving average, and ARMA processes. Maximum entropy, AR spectrum estimation, and linear prediction. Eigenanalysis. Spatial processes and imaging arrays. High reso.ution imaging and source location. Linear predictive coding for speech and video. Wavelets and Multiresolution analysis.",
    "course_id" : "ESE 638",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "638",
    "course_title" : "Spectrum Estimation and Applications in Imaging and Coding",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 530 and exposure to statistical inference",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Design of analog circuits and subsystems using bipolar and MOS technologies at the transistor and higher levels. Transistor level design of building block circuits such as op amps, comparators, sample and hold circuits, voltage and current references, capacitors and resistor arrays, and class AB output stages. The course will include a design project of an analog circuit. The course will use the Cadence Design System for schematic capture and simulation with Spectre circuit simulator. This course is similar to ESE 570, except that it will not require the use of the physical layout tools associated with VLSI design and implementation.",
    "course_id" : "ESE 572",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "572",
    "course_title" : "Analog Integrated Circuits",
    "crosslistings" : [ {
      "course_id" : "419",
      "section_id" : "",
      "subject" : "ESE"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 570 and ESE 319 (for undergraduates) or permission of the instructor",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "M",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Development of transportation and its impact on society and the economy. Geometric characteristics of vehicles. Theory of traction and vehicle dynamic performance. Travel time computations. Transportation networks. Street design and traffic engineering. Railroad technology and operations. High-speed railroads. Air transportation system components and operations. Air traffic control and navigation. Transportation system performance and scheduling. Field trip to major transportation facilities.",
    "course_id" : "ESE 552",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "552",
    "course_title" : "Transportation Systems Engineering",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The principles of green design, life cycle analysis, industrial ecology, pollution prevention and waste minimization, and sustainable development are introduced to engineers of all disciplines as a means to identify and solve a variety of emerging environmental problems. Case studies are used to assess the problems and devise rational solutions to minimize environmental consequences.",
    "course_id" : "ESE 360",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "360",
    "course_title" : "Introduction to Environmental Systems",
    "crosslistings" : [ {
      "course_id" : "375",
      "section_id" : "",
      "subject" : "CBE"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "02",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1.5"
    }, {
      "activity_code" : "LAB",
      "credit" : "0"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Physical electronics of semiconductor devices. Energy bands in solids. Statistics governing the charge carriers in semiconductors. Equilibrium and nonequilibrium transport phenomena in semiconductors. Operation and equivalent circuits for the pn junction, bipolar and field effect transisto, and other semiconductor devices. Scaling issues in transistors and introduction to next-generation nanotechnologies.",
    "course_id" : "ESE 218",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "218",
    "course_title" : "Electronic, Photonic, and Electromechanical Devices",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 215",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Abstract Data Types and implementations of them for representing and manipulating information. Asymptotic notation for analysis of algorithms. Basic data structures such as Lists, Queues, Stacks, Trees. Algorithms: searching, sorting, spanning, finding shortest paths, finding network flows. Algorithm design paradigms: greedy, divide-and-conquer, backtracking, dynamic programming, randomization.",
    "course_id" : "ESE 220",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "220",
    "course_title" : "Introduction to Algorithms and Data Structures",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MATH 104, 114; ESE 115, CSE 260 beneficial",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This is an introductory course on packet networks and associated protocols, with a particular emphasis on IP-based networks such as the Internet. The course introduces design and implementation choices that underlie the development of modern networks, and emphasizes basic analytical understanding of the concepts. Topics are covered in a mostly \"bottom-up\" approach starting with a brief review of physica l layer issues such as digital transmission, error correction and error recovery strategies. This is followed by a discussion of link layer aspects, including multiple access strategies, local area networks (Ethernet and 802.11 wireless LANs), and general store-and-forward packet switching. Network layer solutions, including IP addressing, naming, and routing are covered next, before exploring transport layer and congestion control protocols (UDP and TCP). Finally, basic approaches for quality-of-service and network security are examined. Specific applications and aspects of data compression and streaming may also be covered.",
    "course_id" : "ESE 507",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Course open to Graduate Students in SEAS and Wharton",
    "course_number" : "507",
    "course_title" : "Introduction to Networks and Protocols",
    "crosslistings" : [ {
      "course_id" : "407",
      "section_id" : "",
      "subject" : "ESE"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    }, {
      "activity_code" : "LAB",
      "credit" : "0"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "A laboratory-based course on fabricating microelectronic and micromechanical devices using photolithographic processing and related fabrication technologies. Lectures discuss: clean room procedures; microelectronic and microstructural materials; photolithography; diffusion, oxidation; materials deposition; etching and plasma processes. Basic laboratory processes are covered for the first two thirds of the course with students completing structures appropriate to their major in the final third. Students registering for ESE 574 will be expected to do extra work (including term paper and additional project).",
    "course_id" : "ESE 460",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "460",
    "course_title" : "Principles of Microfabrication Technology",
    "crosslistings" : [ {
      "course_id" : "574",
      "section_id" : "",
      "subject" : "ESE"
    }, {
      "course_id" : "564",
      "section_id" : "",
      "subject" : "MEAM"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "02",
    "instructors" : "",
    "prerequisites" : "Any of the following: ESE 218, MEAM 333, CBE 351, CHEM 321/322, PHYS 250 or permission of the instructor",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "A",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    }, {
      "activity_code" : "LAB",
      "credit" : "0"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "A laboratory-based course on fabricating microelectronic and micromechanical devices using photolithographic processing and related fabrication technologies. Lectures discuss: clean room procedures; microelectronic and microstructural materials; photolithography; diffusion, oxidation; materials deposition; etching and plasma processes. Basic laboratory processes are covered for the first two thirds of the course with students completing structures appropriate to their major in the final third. Students registering for ESE 574 will be expected to do extra work (including term paper and additional project).",
    "course_id" : "ESE 574",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "574",
    "course_title" : "The Principles and Practice of Microfabrication Technology",
    "crosslistings" : [ {
      "course_id" : "460",
      "section_id" : "",
      "subject" : "ESE"
    }, {
      "course_id" : "564",
      "section_id" : "",
      "subject" : "MEAM"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Any of the following courses: ESE 218, MSE 321, MEAM 333, CBE 351, CHEM 321/322, PHYS 250 or permission of the instructor",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course looks at the information systems phenomena that are revolutionizing organizations (e.g., clicks & mortar shopping, net-centric value chains, telemedicine, emergent communities, online democracy, etc). To be effective in this milieu, organizations must do more than just push new information technology. They need to determine how to harness the new technology to manage complexity and to maximize stakeholder value. Processes need to be systematically analyzed and redesigned all along the value chain from supplies and procurement to electronic storefronts and customer support, from campaign headquarters to voter booth, etc. This course examines design principles task and information process modeling and analysis methodologies, and a range of underlying information technologies (e.g., webserver design, transaction processing, warehousing, datamining/knowledge management, bots and agents, XML, security, information theory/complexity, and more) that will help the modern organization or community to maximize its strategic objectives. We also examine failure case studies and derive lessons learned.",
    "course_id" : "ESE 508",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "508",
    "course_title" : "Info Systems for E-Commerce",
    "crosslistings" : [ {
      "course_id" : "660",
      "section_id" : "",
      "subject" : "OPIM"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "A computer programming language course such as CSE 120 (C++), plus ESE 301 (Probability) and ESE 302 (Statistics) or equivalent",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Principles and engineering applications of statistical inference. The basic topics covered are parameter estimation, confidence intervals, and hypothesis testing. Additional topics may include analysis of variance (ANOVA) and/or linear regression. Each method is treated both from theoretical and applied viewpoints, including software analysis of selected data sets.",
    "course_id" : "ESE 302",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "302",
    "course_title" : "Engineering Applications of Statistics",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 301",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Basic ideas of probability theory. Combinatorics. Random variables and functions of random variables. Means, moments and generating functions. Order statistics and special distributions. Inequalities and the central limit theorem.",
    "course_id" : "ESE 301",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "301",
    "course_title" : "Engineering Probability",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MATH 114",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Stochastic systems analysis and simulation (ESE 303) is a class that explores stochastic systems which we could loosely define as anything random that changes in time. Stochastic systems are at the core of a number of disciplines in engineering, for example communication systems and machine learning. They also find application elsewhere, including social systems, markets, molecular biology and epidemiology. The goal of the class is to learn how to model, analyze and simulate stochastic systems. With respect to analysis we distinguish between what we could call theoretical and experimental analysis. By theoretical analysis we refer to a set of tools which let us discover and understand properties of the system. These analysis can only take us so far and is usually complemented with numerical analysis of experimental outcomes. Although we use the word experiment more often than not we simulate the stochastic system in a computer and analyze the outcomes of these virtual experiments. The class's material is divided in four blocks respectively dealing with Markov chains, continuous time Markov chains, Gaussian processes and stationary processes. Emphasis is placed in the development of toolboxes to analyze these different classes of processes and on describing their applications to complex stochastic systems in different disciplines. Particular examples include: (i) the problem of ranking web pages by a search engine; (ii) the study of reputation and trust in social networks; (iii) modeling and analysis of communication networks; (iv) the use of queues in the modeling of transportation networks; (v) stochastic modeling and simulation of biochemical reactions and gene networks; (vi) arbitrages, pricing of stocks, and pricing of options through Black-Scholes formula; and (vii) linear filtering of stochastic processes to separate signals of interest from background noise. For more information visit the class's web page at http://alliance.seas.upenn.edu/~ese303/wiki/.",
    "course_id" : "ESE 303",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "303",
    "course_title" : "Stochastic Systems Analysis and Simulation",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 301 or equivalent and one computer language",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will cover the mathematical fundamentals and applications of machine learning algorithms to mobile robotics. Possible topics that will be discussed include probabalistic generative models for sensory feature learning. Bayesian filtering for localization and mapping, dimensionality reduction techniques formotor control, and reinforcement learning of behaviors. Students are expected to have a solid mathematical background in machine learning and signal processing, and will be expected to implement algorithms on a mobile robot platform for their course projects. Grading will be based upon course project assignments as well as class participation.",
    "course_id" : "ESE 650",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "650",
    "course_title" : "Learning in Robotics",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Students will need permission from the instructor.  They will be expected to have a good mathematical background with knowledge of machine learning techniques at the level of CIS 520, signal processing techniques at the level of ESE 531, as weill as have some robotics experience",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Wireless sensor networks (WSN) consist of many individual nodes that operate collaboratively to monitor, sense, and control their environments. While such networks share aspects common to other types of wireless networks, such as wireless mobile ad hoc networks, battery, processing, and communication constraints of sensor nodes pose several new challenges in routing, localization, addressing, and optimization of these networks. This course will introduce the characteristics of these networks by covering recent research trends from a range of disciplines - e.g. hardware design, operating systems, information and signal processing, and communication networks. The course will briefly touch on design and programming (OS, software) of sensor networks. The main focus will be on applications of wireless sensor networks and distributed networking/communication issues in such networks.",
    "course_id" : "ESE 575",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "575",
    "course_title" : "Introduction to Wireless Systems",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 507, Basic knowledge of wireless networks, protocols, and operating system concepts.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course reviews electrostatics, magnetostatics, electric and magnetic materials, induction, Maxwell's equations, potentials and boundary-value problems. Topics selected from the areas of wave propagation, wave guidance, antennas, and diffraction will be explored with the goal of equipping students to read current research literature in electromagnetics, microwaves, and optics.",
    "course_id" : "ESE 510",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "510",
    "course_title" : "Electromagnetic and Optical Theory",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    }, {
      "activity_code" : "LAB",
      "credit" : "0"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Basic methods for analysis and design of feedback control in systems. Applications to practical systems. Methods presented include time response analysis, frequency response analysis, root locus, Nyquist and Bode plots, and the state-space approach.",
    "course_id" : "ESE 505",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "505",
    "course_title" : "Control of Systems",
    "crosslistings" : [ {
      "course_id" : "513",
      "section_id" : "",
      "subject" : "MEAM"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "03",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1.5"
    }, {
      "activity_code" : "LAB",
      "credit" : "0"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Analysis and design of basic active circuits involving semiconductor devices including diodes and bipolar transistors. Single stage, differential, multi-stage, and operational amplifiers will be discussed including their high frequency response. Wave shaping circuits, filters, feedback, stability, and power amplifiers will also be covered. A weekl three-hour laboratory will illustrate concepts and circuits discussed in the class.",
    "course_id" : "ESE 319",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "319",
    "course_title" : "Fundamentals of Solid-State Circuits",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "03",
    "instructors" : "",
    "prerequisites" : "ESE 215",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1.5"
    }, {
      "activity_code" : "LAB",
      "credit" : "0"
    } ],
    "corequisites" : "MATH 240",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Common principles of Circuits, Systems and flows of electron, photons, and other entities as applied to electrical, and non-electrical systems such as optical (plasmonic), fluidic, traffic, neural, electrochemical, and biological circuits. Class demonstration and computer simulations will be given where applicable to help in rapid understanding of concepts and applications.",
    "course_id" : "ESE 215",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "215",
    "course_title" : "Electrical Circuits and Systems I",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "PHYS 151",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course investigates methods of economic analysis for decision making among alternative courses of action in engineering applications. Topics include: cost-driven design economics, break-even anlaysis, money-time relationships, rates of return, cost estimation, depreciation and taxes, foreign exchange rates, life cycle analysis, benefit-cost ratios, risk analysis, capital financing and allocation, and financial statement analysis. Case studies apply these topics to actual engineering problems.",
    "course_id" : "ESE 400",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "400",
    "course_title" : "Engineering Economics",
    "crosslistings" : [ {
      "course_id" : "540",
      "section_id" : "",
      "subject" : "ESE"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Knowledge of Differential Calculus",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course introduces students to the basic processes for system design and engineering and examines the management of systems engineering projects. We first discuss the systems viewpoint and the systems engineering process. Next we examine issues relating to requirements specification and problem formulation. We highlight different methods for systems modeling and forecasting and for choosing among different system alternatives. The course also provides specific examples of systems engineering taken from the fields of telecommunications, manufacturing, environment/resource systems, and transportation.",
    "course_id" : "ESE 405",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "405",
    "course_title" : "Systems Methodology",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "05",
    "instructors" : "",
    "prerequisites" : "MATH 240, ESE 301 or equivalent.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Key concepts of electromagnetic and optical fields and waves, and their implications in modern communication systems. Selected topics from areas such as plane waves in lossy media, reflection and refraction, transmission lines, optical fibers, microwave and photonic waveguides, and antennas and sensors and their applications in communication systems are discussed.",
    "course_id" : "ESE 411",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "411",
    "course_title" : "Electromagnetic Waves and Applications",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 310 or permission of instructor",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Convergence, continuity, stationarity and second order properties of random processes. Spectral representation. Markov processes, Wiener and Poisson processes. Karhunen-Loeve expansion. Optimum filtering: matched and Wiener filtering, finite observations, spectral factorization. Kalman filtering. Basic concepts of parameter estimation and hypothesis testing.",
    "course_id" : "ESE 632",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "632",
    "course_title" : "Random Processes and Optimum Filtering",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 530 or Permission of the Instructor",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "A modern introduction to the physical principles of optical imaging with biomedical applications. Propagation and interference of electromagnetic waves. Geometrical optics and the eikonal. Plane-wave expansions, diffraction and the Rayleigh criterion. Scattering theory and the Born approximation. Introduction to inverse problems. Multiple scattering and radiative transport. Diffusion approximation and physical optics of diffusing waves. Imaging in turbid media. Introduction to coherence theory and coherence imaging. Applications will be chosen from the recent literature in biomedical optics.",
    "course_id" : "ESE 517",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "517",
    "course_title" : "Optical Imaging",
    "crosslistings" : [ {
      "course_id" : "517",
      "section_id" : "",
      "subject" : "BE"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 310 and 325 or equivalent",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Development of transportation and its impact on society and the economy. Geometric characteristics of vehicles. Theory of traction and vehicle dynamic performance. Travel time computations. Transportation networks. Street design and traffic engineering. Railroad technology and operations. High-speed railroads. Air transportation system components and operations. Air traffic control and navigation. Transportation system performance and scheduling. Field trip to major transportation facilities.",
    "course_id" : "ESE 252",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "252",
    "course_title" : "Transportation Systems Engineering",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "ESE 297",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "297",
    "course_title" : "Engineering Management.",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "EG",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The application of systems methodology to the design of water supply and sanitation projects. The focus is on the designing for sustainability by emphasizing how technical solutions fit within the appropriate social context. A case studyapproach is used to demonstrate these principles across a range of examples from developed and developing countries.",
    "course_id" : "ESE 560",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "560",
    "course_title" : "Sustainable Development of Water Resource Systems",
    "crosslistings" : [ {
      "course_id" : "543",
      "section_id" : "",
      "subject" : "CBE"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Formulation, automation, and analysis of design mapping problems with emphasis on VLSI and computational realizations. Major themes include: formulating and abstracting problems, figures of merit (e.g. Energy, Delay, Throughput, Area, Mapping Time), representation, traditional decomposition of flow (logic optimization, covering, scheduling, retiming, assignment, partitioning, placement, routing), and techniques for solving problems (e.g., greedy, dynamic programming, search, (integer) linear programming, graph algorithms, randomization, satisfiability).",
    "course_id" : "ESE 535",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "535",
    "course_title" : "Electronic Design Automation",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Digital logic, Programming (need to be comfortable writing ~1-3K lines of code and working with a large, existing base code).",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The course emphasizes a systems engineering approach to project management including the cycle costing and analysis, project scheduling, project organization and control, contract management, project monitoring and negotiations. In addition, the coure will also examine management issues in large infrastructure projects like non-recourse or limited recourse project financing. Examples from the logistics planning process and global software project management will be used to highlight the course topics.",
    "course_id" : "ESE 444",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "444",
    "course_title" : "Project Management",
    "crosslistings" : [ {
      "course_id" : "544",
      "section_id" : "",
      "subject" : "ESE"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "02",
    "instructors" : "",
    "prerequisites" : "ESE 304 or equivalent",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Organization and design of physical computational systems, basic building block for computations, understanding and exploiting structure in computational problems, design space, costs, and tradeoffs in computer organization, common machine abstractions, and implementation/optimization techniques. The course will develop fundamental issues and tradeoffs which define computer organizational and architectural styles including RISC, VLIW, Super Scalar, EPIC, SIMD, Vector, MIMD, reconfigurable FPGA, PIM, and SoC. Basic topics in the design of computational units, instruction organization, memory systems, control and data flow, and interconnect will also be covered.",
    "course_id" : "ESE 534",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "534",
    "course_title" : "Computer Organization",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Basic computability and basic digital circuits, VLSI exposure helpful but not required.  CIS 371 adequate.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This research seminar deals with tools, methods, and algorithms for analysis and design of distributed dynamical systems. These are large collections of dynamical systems that are spatially interconnected to form a collective task or achieve a global behavior using local interactions. Over the past decade such systems have been studied in disciplines as diverse as statistical physics, computer graphics, robotics, and control theory. The purpose of this course is to build a mathematical foundation for study of such systems by exploring the interplay of control theory, distributed optimization, dynamical systems, graph theory, and algebraic topology. Assignments will consist of reading and resesarching the recent literature in this area. Topics covered in distributed coordination and consensus algorithms over networks, coverage problems, effects of delay in large scale networks. Power law graphs, gossip and consensus algorithms, synchronization phenomena in natural and engineered systems, etc.",
    "course_id" : "ESE 635",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "635",
    "course_title" : "Distributed Systems",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Basic knowledge of linear systems (ESE 500), linear algebra (MATH 312 or equivalent), and optimization (ESE 504 or equivalent) and some familiarity with basics of nonlinear systems (ESE 617 or equivalent).  Students without this background should consult with the instructor before registering.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course consists of an introduction to the C programming language focusing on its application to low-level computer resoruce control. C language instruction topics include: variable data types and scope, expressions, bitwise operations, control structures, preprocessor macros and include files, functions, arrays, and structs. The course contains an extended discussion of pointers and the relationship between variable values and their addresses in memory. Each student will gain individual practice in the use of the language by programming his/her own small microcontroller board to implement a series of \"real-world\" projects. These projects include a home automations system, an Internet controller for the automation system, and an accurate digital clock based on Internet time service. To encourage creativity, every student is given latitude to add his/her own extra-credit enhancements to these projects. Some previous knowledge of a high-level programming language will be helpful, but no prior knowledge of electronics is required.",
    "course_id" : "ESE 116",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "116",
    "course_title" : "Introduction to C Programming",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Knowledge of algorithms and at least one high-level programming language, e.g. ESE 112 or CIS 110",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The goal of this course is to provide a unified approach to modern optics, image formation, analysis, and understanding that form the theoretical basis for advanced imaging systems in use today in science, medicine and technology. The emphasis is on imaging systems that employ electromagnetic energy but the principles covered can be extended to systems employing other forms of radiant energy such as acoustical.",
    "course_id" : "ESE 511",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "511",
    "course_title" : "Modern Optics and Image Understanding",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 310, graduate standing, or permission of the instructor",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will begin with an introduction to virtual reality personas and web-based agents, including their usage to assist, train, and entertain people wherever digital interfaces exist (on the Web, in e-commerce, in games, in kitchen appliances, on your dashboard, etc.). What makes an agent rational? Emotionally appealing? Entertaining? We will explore mathematical theories of rationality and behavior, including those from cognitive, behavioral and decision science. We will then progress into human behavior, literature, personality and individual differences studies, and integlligent and emotive agent designs. We will examine various types of agents such as web shopping agents, emotive agents, personal support agents, chatterbots, mobile agents, virtual reality personas, game-based adversaries, pedagogical agent coaches, and multi-agent societies. Finally, students will learn principles about animation, simulated social interaction and speech generation, knowledge representation, agent planning and reasoning, agent communication languages, testing of the use of agent based systems, and methodologies/toolbenches for engineering of systems of intelligent and emotive agents.",
    "course_id" : "ESE 608",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "608",
    "course_title" : "Intelligent and Animated Software Agents",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Undergraduate courses in probability (ESE 301 or equivalent), optimization (ESE 304 or equivalent), knowledge of one computer programming language (Fortran, Pascal, or C), or permission of the instructor.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "ESE 298",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "298",
    "course_title" : "Study Abroad",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "EG",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Overview of existing device and manufacturing technologies in microelectronics, optoelectronics, magnetic storage, Microsystems, and biotechnology. Overview of near- and long-term challenges facing those fields. Near- and long-term prospects of nanoscience and related technologies for the evolutionary sustension of current approaches, and for the development of revolutionary designs and applications.",
    "course_id" : "ESE 525",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "525",
    "course_title" : "Nanoscale Science and Engineering",
    "crosslistings" : [ {
      "course_id" : "525",
      "section_id" : "",
      "subject" : "MSE"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 218 or PHYS 240 or MSE 220 or equivalent, or by permission.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    }, {
      "activity_code" : "REC",
      "credit" : "0"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This first course in decision models will introduce students to quantitative models for decision making, using optimization and monte-carlo simulation. Examples will be drawn from manufacturing, finance, logistics and supply chain management. Students will use EXCEL and @Risk to build and analyze models.",
    "course_id" : "ESE 204",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "204",
    "course_title" : "Decision Models",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MATH 104",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "ESE 321",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "321",
    "course_title" : "Phys&Mod Semicon Dev",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Circuit-level design and modeling of gates, storage, and interconnect. Emphasis on understanding physical aspects which drive energy, delay, area, and noise in digital circuits. Impact of physical effects on design and achievable performance.",
    "course_id" : "ESE 370",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "370",
    "course_title" : "Circuit-Level Modeling, Design, and Optimization for Digital Systems",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 170/171, ESE 215/205",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "ESE 570",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Introduction to RF (Radio Frequency) and Microwave Theory, Components, and Systems. The course aims at providing knowledge in RF transceiver design at both microwave and millimeter-wate frequencies. Both system and circuit level perspective will be addressed, supported by modeling and simulation using professinal tools (including Agilent ADS, Sonnet, and Cadence Design Systems). Topics include: Transmission Line Theory, S-parameters, Smith Chart for matching network design, stability, noise, and mised signal design. RF devices covred will include: hybrid/Wilkinson/Lange 3dB couplers, Small Signal Amplifiers (SSA), Low Noise Amps (LNA), and Power Amps (PA). CMOS technoogy will be largely used to design the devices mentioned.",
    "course_id" : "ESE 578",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "578",
    "course_title" : "RFIC (Radio Frequency Integrated Circuit) Design",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "ESE 572",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "J",
    "school_code" : "EG",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This is an introductory course on packet networks and associated protocols, with a particular emphasis on IP-based networks such as the Internet. The course introduces design and implementation choices that underlie the development of modern networks, and emphasizes basic analytical understanding of the concepts. Topics are covered in a mostly \"bottom-up\" approach starting with a brief review of physical layer issues such as digital transmission, error correction and error recovery strategies. This is followed by a discussion of link layer aspects, including multiple access strategies, local area networks (Ethernet and 802.11 wireless LANs), and general store-and-forward packet switching. Network layer solutions, including IP addressing, naming, and routing are covered next, before exploring transport layer and congestion control protocols (UDP and TCP). Finally, basic approaches for quality-of-service and network security are examined. Specific applications and aspects of data compression and streaming may also be covered.",
    "course_id" : "ESE 407",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Course open to Seniors in SEAS and Wharton",
    "course_number" : "407",
    "course_title" : "Introduction to Networks and Protocols",
    "crosslistings" : [ {
      "course_id" : "507",
      "section_id" : "",
      "subject" : "ESE"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Undergraduate probability and analysis.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "ESE 548",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "548",
    "course_title" : "Transp Planning Methods",
    "crosslistings" : [ {
      "course_id" : "650",
      "section_id" : "",
      "subject" : "CPLN"
    } ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "ESE 318",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "318",
    "course_title" : "Phys&Mod Semicon Dev",
    "crosslistings" : [ ],
    "department" : "ESE ",
    "department_of_record" : "ESE",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "C",
    "school_code" : "EG",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  } ],
  "service_meta" : {
    "current_page_number" : 1,
    "error_text" : "",
    "next_page_number" : 1,
    "number_of_pages" : 1,
    "previous_page_number" : 1,
    "results_per_page" : 999
  }
}
