
{
  "result_data" : [ {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Better forecasting can lead to better short-term and long-term planning and, in turn, to better decision-making. Forecasting Methods for Marketing examines judgmental forecasting methods such as prediction markets, structured analogies, simulated interactions, intentions, and expectations. The course also examines quantitative methods such as extrapolation and econometric, with the latter as especially useful for assessing the effects of changes in key variables such as pricing or advertising. These methods can be used to forecast consumer behavior, market share, and sales (for production and inventory control). They can also be used to forecast actions by competitors, unions, and retailers. We will examine such topics as how to predict success of CEO's, presidential elections, terrorism, and climate change. Recently developed methods have been shown to substantially improve accuracy and to provide better assessments of risk.  Inactive",
    "course_id" : "MKTG898",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Lecture, discussion, cases.",
    "course_number" : "898",
    "course_title" : "Forecasting Methods for Marketing",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Armstrong",
    "prerequisites" : "None.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The objective of this course is to enhance the students' creativity, ability to innovate, and ability to identify, recruit, develop, manage, retain, and collaborate with creative people. The course includes: (1) Interaction with creative guest lecturers from diverse fields; (2) A review of the literature on creativity, creative people, innovation, and design as well as the leadership and management of creative people and innovation; (3) Hands on learning of approaches for generating creative new products/services and business ideas; and (4) Applications of creativity tools to selected management domains. Approaches to the generation of creative options are not limited to the development of products and services or businesses, but can be applied to all areas of management, business, and life. The purpose of these sessions is to explore the applications of creative approaches to marketing, advertising, cost reduction efforts, M&A and strategic alliances, organizational design, and management challenges. Given the current global financial crisis and economic recession, much of the applications are going to focus on what corporations (and public policy decision makers) should do to creatively address their challenges. (5) Integration - Both via individual assignments and a group project in which interdisciplinary teams of students generate a creative project/ service/ business/ strategy.",
    "course_id" : "MKTG792",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Format: Lecture, class discussion, guest speakers.  (Former MKTG 892)",
    "course_number" : "792",
    "course_title" : "Creativity",
    "crosslistings" : [ {
      "course_id" : "292",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Wind, Schrift",
    "prerequisites" : "None.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "DIS",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "MKTG995",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "995",
    "course_title" : "Dissertation",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "As the concept of CRM becomes common parlance for every marketing executive, it is useful to take a step back to better understand the various different behaviors that underlie the development of successful CRM systems. These \"behaviors\" include customer-level decisions, firm actions, and the delicate but complex interplay between the two. Accordingly this course is comprised of four main modules. We start with the discussion of customer profitability - focusing on the concepts of \"customer lifetime value\" and \"customer equity\". We will examine how to measure long-run customer profitability in both business-to-customer and business-to-business environments, and the uses of these measures as major components assessing overall firm valuation. Second, we move to the value that the firm provides to its customers - better understanding the true nature of customer satisfaction and its non-trivial relationship with firm profitability. Third, we examine each of the three main components of the firm's management of its customer base: customer acquisition, development, and retention - and the complex resource allocation task that must be balanced across them. Finally, we conclude with a discussion of various tactical and organizational aspects of customer relationship management.",
    "course_id" : "MKTG775",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Format: Lecture and discussion",
    "course_number" : "775",
    "course_title" : "Managing Customer Value",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Fader",
    "prerequisites" : "None.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course addresses how to design and implement the best combination of marketing efforts to carry out a firm's strategy in its target markets. Specifically, this course seeks to develop the student's (1) understanding of how the firm can benefit by creating and delivering value to its customers and stakeholders, and (2) skills in applying the analytical concepts and tools of marketing to such decisions as segmentation and targeting, branding, pricing, distribution, and promotion. The course uses lectures and case discussions, case write-ups, student presentations, and a comprehensive final examination to achieve these objectives.",
    "course_id" : "MKTG621",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Lectures, case analyses, class discussions and final exam.  NOTE: This course is only offered in the Wharton Executive MBA program.",
    "course_number" : "621",
    "course_title" : "Marketing Management: Program Design",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "None.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course focuses on advertising via all media - print, digital, video, TV, Internet, etc. Emphasis is placed on understanding the communication development process and consumer behavior (psychology), the measurement and evaluation of advertising effects, and developing appropriate media plans.",
    "course_id" : "MKTG265",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "(Former MKTG 235)",
    "course_number" : "265",
    "course_title" : "Principles of Advertising",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 101.  NOTE: Students should not take both MKTG 265 (full semester version) and MKTG 224 (mini course version), since credit will not be given for both courses.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The pricing decision process including economic, marketing, and behavioral phenomena which constitute the environment for pricing decisions and the information and analytic tools useful to the decision maker.",
    "course_id" : "MKTG254",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "0.5 c.u.  One-half term. (Former MKTG 222) Students can not take both MKTG 254 and the full semester version of this course, MKTG 288, for credit.",
    "course_number" : "254",
    "course_title" : "Pricing Policy",
    "crosslistings" : [ {
      "course_id" : "754",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 101 and Sophomore standing.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course is a visual and practical approach of understanding global styles and it involves readings, active participation in the creation of lifestyle boards, brand books, exercises to develop all the senses and the development of a total lifestyle concept. Students will be exposed to the Through the Whitaker Lifestyle Segementation of the Global Consumer system and will learn: you will learn: How to anticipate and predict consumers needs and their style evolution; How to identify new retail opportunities; How to create innovative retail concepts and brands; How to merchandise the appropriate products for a specific lifestyle; and How to develop your intuition and creative power. In addition, students will critically evaluate this style segmentation system and compare it to other segmentation approaches. This course is relevant for students interested in developing their intuition and creativity. The topics of this course are a foundation for anyone working in any area of the retail industry: marketing, merchandising, visual merchandising, store design, planning, advertising, etc.",
    "course_id" : "MKTG802",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "802",
    "course_title" : "SPECIAL TOPICS: Visual Aesthetics and Style in Retail Merchandising",
    "crosslistings" : [ {
      "course_id" : "302",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course is a two part series. The first part concentrating on the Indian Consumer will be offered in January. The second part, concentrating on the Chinese Consumer will be offered in March. India and China add up to half of the world's population. Each presents its own challenges and opportunities. US and European MNCs have been in both countries for many years, but emerging market MNC's are becoming stronger and in many cases overtaking US and European companies despite their strong brands and know-how. Marketing to the Indian Consumer will provide a careful understanding of: The opportunity and challenges in the Indian consumer market 2) Various segments within the Indian consumer market. 3) Consumer psychology and decision making processes in each segment 4) Distribution channels in Indi Media in India: Mass, Local and non-traditional. 6) Bottom of the pyramid consumers and rural markets. 7) Product design and development decisions. The course will focus on the following industries: consumer packaged goods, mobile phones, financial services (insurance and banking), healthcare, sports and entertainment, and transportation. The course will involve case studies from local and international companies, guest lecturers, and visits to consumer homes to observe their tastes, habits, and preferences. Marketing to the Chinese Consumer will provide students with a critical understanding of the Chinese consumer, distribution channels, pricing environment, branding and competitive dynamics so as to enhance their ability to market to the Chinese consumer successfully. The course will consist of a combination of lectures, case studies, presentations by industry experts, and a short evening field trip.",
    "course_id" : "MKTG393",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Indian Consumer Section of the Course offered in Mubai, India The Chinese Consumer Section of the Course will be taught in Bejing, China.",
    "course_number" : "393",
    "course_title" : "Advanced Study: Marketing in Emerging Economies: Understanding & Marketing to the Chinese and Indian Consumer",
    "crosslistings" : [ {
      "course_id" : "893",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Raju and Zhang",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This PhD seminar is designed to help students understand the roles of marketing within the organization, its business strategy, and its success. It exposes students to the main issues in marketing strategy and marketing strategy research, and helps them critically evaluate both fundamental ideas and more recent developments. The course follows a weekly seminar discussion format requiring each participant to be actively involved in each session. Participants will be assigned readings to present or critique, but all participants will be expected to have read every paper. Students will be assessed based on class contributions, short response papers, and a term paper. The term paper will address an important issue in marketing strategy. It will comprise a research question that is grounded in the relevant literature, a motivation for studying the question, and a proposal for researching it. The proposed research could take the form of an analytical model with a well-specified structure or an empirical study involving an experiment, quasi-experiment, survey, analysis of secondary data, or meta-analysis. The paper will be due on the last day of the exam period. During the last class, each student will make a presentation of their proposed study and share what they have learned so far with the class.",
    "course_id" : "MKTG970",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "PhD Course.  Intended for 2nd year PhD students and above",
    "course_number" : "970",
    "course_title" : "Seminar in Marketing Strategy",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "New retail brands and opportunities for growth are emerging at an unprecedented rate, for online retailers and offline retailers alike. In this course we will: (1) articulate key principles for successful branding and for understanding consumer shopping behavior in retail environments, (2) demonstrate unique challenges and opportunities that luxury brands face, and (3) discuss concepts and empirical methods for analyzing consumer shopping behavior.",
    "course_id" : "MKTG397",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "397",
    "course_title" : "Advanced Study: Luxury Branding and Retailing in Italy and Beyond",
    "crosslistings" : [ {
      "course_id" : "897",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Barbara Kahn, David Bell",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "WH",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Students who take this course will learn the basic functions of sales force management as well as theories and concepts about appropriately managing that function; become familiar with recent research in sales management that underlies the theories and concepts; and be able to apply the research, theories, and concepts to practical situations. The course is concerned with how to manage a sales force rather than with how to sell. The emphasis is on business to business (rather than consumer) sales force management. Topics covered include salesperson effectiveness, deployment, motivation, organizational design, compensation, and evaluation.",
    "course_id" : "MKTG751",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Format: Lectures and discussion of cases and readings, including recent research.",
    "course_number" : "751",
    "course_title" : "Sales Force Management",
    "crosslistings" : [ {
      "course_id" : "251",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Completion of MKTG 611 or 621 and MKTG 612, 613 or 622 concurrently",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Which brands make you happy? Apple? Starbucks? The Daily Show? Google? What draws you into these brands? How do companies create compelling brand experiences? How could you cultivate a well-loved brand? This course explores such questions with the goal of identifying the ingredients for building an inspired brand, where brand is defined as \"a sensibility\" - departing from traditional perspectives of brand. The course is created for students interested in building their own brands and/or immersing themselves in the enhancement of an existing brand, and it is comprised of lectures, cases, guest speakers, discussions, in and out of class exercises, all of which culminate in a brand audit group project that students will present in the final class session. Broadly, the course will be divided into four parts: 1) Understanding Brand, 2) Crafting Brand, 3) Measuring Brand, and 4) Managing Brand. The course will provide students with an appreciation of the role of branding and (taking a consumer-centric approach) will augment students' ability to think creatively and critically about the strategies and tactics involved in building, leveraging, defending, and sustaining inspired brands.",
    "course_id" : "MKTG278",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "278",
    "course_title" : "Strategic Brand Management",
    "crosslistings" : [ {
      "course_id" : "778",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Mogilner",
    "prerequisites" : "MKTG 101",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Which brands make you happy? Apple? Starbucks? The Daily Show? Google? What draws you into these brands? How do companies create compelling brand experiences? How could you cultivate a brand that makes consumers happy? well-loved brand? This course explores such questions with the goal of identifying the ingredients for building an inspired brand, where brand is defined as \"a reputation\" - departing from traditional perspectives of brand. The course is created for students interested in building their own brands and/or immersing themselves in the enhancement of an existing brand, and it is comprised of lectures, cases, guest speakers, discussions, in and out of class exercises, all of which culminate in a brand audit group project that students will present in the final class session. Broadly, the course will be divided into four parts: 1) Understanding Brand, 2) Crafting Brand, 3) Measuring Brand, and 4) Managing Brand. The course will provide students with an appreciation of the role of branding and (taking a consumer-centric approach) will augment students' ability to think creatively and critically about the strategies and tactics involved in building, leveraging, defending, and sustaining inspired brands.",
    "course_id" : "MKTG778",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Format: Lectures, cases, discussions, exercises, and a group project",
    "course_number" : "778",
    "course_title" : "Strategic Brand Management",
    "crosslistings" : [ {
      "course_id" : "278",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Mogilner",
    "prerequisites" : "MKTG 611 or 621 and MKTG 612, 613 or 622",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Better forecasting can lead to better short-term and long-term planning and, in turn, to better decision-making. Forecasting Methods for Marketing examines s judgmental forecasting methods such as prediction markets, structured analogies, simulated interactions, intentions, and expectations. The course also examines quantitative methods such as extrapolation and econometric, with the latter as especially useful for assessing the effects of changes in key variables such as pricing or advertising. These methods can be used to forecast consumer behavior, market share, and sales (for production and inventory control). They can also be used to forecast actions by competitors, unions, and retailers. We will examine such topics as how to predict success of CEO's, presidential elections, terrorism and climate change. Recently developed methods have been shown to substantially improve accuracy and to provide better assessments of risk.",
    "course_id" : "MKTG774",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "774",
    "course_title" : "Forecasting Methods for Marketing",
    "crosslistings" : [ {
      "course_id" : "274",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Armstrong",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Why do some products catch on and achieve huge popularity while others fail? Why do some behaviors spread like wildfire while others languish? How do certain ideas seem to stick in memory while others disappear the minute you hear them? More broadly, what factors lead to trends, social contagion, and social epidemics? Interactive media, word of mouth, and viral marketing are important issues for companies, brands, and organizations. This course looks at these and other topics as it examines how products, ideas, and behaviors catch on and become popular. Marketers want their product to be popular, organizations want their social change initiative to catch on and entrepreneurs want their ideas to stick. This course will touch on four main aspects: (1) Characteristics of products, ideas, and behaviors that lead them to be successful. (2) Aspects of individual psychology that influence what things are successful. (3) Interpersonal processes, or how interactions between individuals drive success. (4) Social networks, or how patterns of social ties influence success.",
    "course_id" : "MKTG768",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Lecture, class discussion, cases. (Former MKTG 728)",
    "course_number" : "768",
    "course_title" : "Contagious: How Products, Ideas and Behaviors Catch On",
    "crosslistings" : [ {
      "course_id" : "268",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Berger",
    "prerequisites" : "MKTG 711 and MKTG 712 are recommended but not required.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "See Operations and Information Management OPIM 655",
    "course_id" : "MKTG655",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Format: Lectures, cases, and group presentations",
    "course_number" : "655",
    "course_title" : "Integrating Marketing and Operations",
    "crosslistings" : [ {
      "course_id" : "655",
      "section_id" : "",
      "subject" : "OPIM"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 611 or 621; and MKTG 612, 613 or 622; and either OPIM 622/623 or OPIM 656, or permission of instructor.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "MKTG599",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "599",
    "course_title" : "Appl Prob Models Mktg",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "EMTM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "EG",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course focuses on the key marketing concepts and methods relevant for entrepreneurs. In particular, it covers the marketing elements of new venture initiation (including a business plan), as well as marketing decisions for small and growing organizations. Topics include product/service design, assessment of market potential, creation of successful distribution relationships, and new product pricing. In contrast to the product development course, the emphasis here is on a new startup business rather than a new offering from an existing business. Topics covered in this course also include low-budget or no-budget market research, successful strategic alternatives for small business, alternatives to high-cost advertising (e.g., direct marketing, alternative media, and personal selling) segmentation, and targeted marketing. Students will prepare a marketing plan for an entrepreneurial organization of their choice, possibly for a new venture they are considering.",
    "course_id" : "MKTG241",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "0.5 cu half credit course. (Former MKTG 281)",
    "course_number" : "241",
    "course_title" : "Entrepreneurial Marketing",
    "crosslistings" : [ {
      "course_id" : "741",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 101; MKTG 212 (can take concurrently); students are discouraged from taking this course and MKTG 221 without the permission of the marketing undergraduate faculty advisor.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "In today's business environment, marketing executives are involved in complex decision-making and they become responsible for return on their marketing investments. The first objective of this course is to help participants become better executives. By exposing students to various analytical and computer-based tools, developed for solving marketing problems, it will help to prepare them for careers in industries such as consumer packaged goods, hi-tech, financial services, media and entertainment, pharmaceutical, consulting, and venture capital. The course's main focus is on various existing models, such as models that predict the consumer's dynamic adoption of an innovative product. However, at some point in their career, students may find themselves facing business problems for which a model can assist in making decisions, but no existing model is available. Hence, the second objective of the course is to provide participants with critical skills necessary to evaluate new models to which they may be exposed by attending presentations or reading the literature. The models to be discussed in the class have been implemented and proven useful in a wide range of industries (e.g., business-to-consumers and business-to-business). The course is not only about models, however. It also covers modeling needs. Some industries such as the media and entertainment or the pharmaceutical industries present unique problems and modeling needs. The third objective of the course is to expose participants to the nature and essence of such idiosyncratic problems as well as modeling needs in such industries. Overall, the course will make participants understand better critical marketing problems by analyzing them rigorously and will enhance their skills in either designing or evaluating models-based strategies.",
    "course_id" : "MKTG771",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Format: Evaluating marketing models; practicing with computer-based models and software; discussing case studies that describe modeling applications; group presentations of model-based marketing analysis and strategy.",
    "course_number" : "771",
    "course_title" : "Models for Marketing Strategy",
    "crosslistings" : [ {
      "course_id" : "271",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Eliashberg",
    "prerequisites" : "Completion of: MKTG 611 or 621; MKTG 612, 613 or 622; basic calculus; exposure to basic statistical analysis, and some tolerance for expressing critical ideas in simple math.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Better forecasting can lead to better short-term and long-term planning and, in turn, to better decision-making. Forecasting Methods for Marketing examines s judgmental forecasting methods such as prediction markets, structured analogies, simulated interactions, intentions, and expectations. The course also examines quantitative methods such as extrapolation and econometric, with the latter as especially useful for assessing the effects of changes in key variables such as pricing or advertising. These methods can be used to forecast consumer behavior, market share, and sales (for production and inventory control). They can also be used to forecast actions by competitors, unions, and retailers. We will examine such topics as how to predict success of CEO's, presidential elections, terrorism and climate change. Recently developed methods have been shown to substantially improve accuracy and to provide better assessments of risk.",
    "course_id" : "MKTG274",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "274",
    "course_title" : "Forecasting Methods for Marketing",
    "crosslistings" : [ {
      "course_id" : "774",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Armstrong.",
    "prerequisites" : "MKTG 101",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Discusses the forces that shape a company's marketing structure and the methods of marketing goods and services. Topics studied include the role of marketing in the economic system, the industrial and consumer marketplaces, market segmentation, consumer demand, and buing motivation. Students will discuss retail and wholesale marketing structures, product management, pricing, promotiom, and distribution strategies. Using case studies, the unit will also look at the relation of government to marketing, market research, and methods for measuring the efficieincy of a marketing operation.",
    "course_id" : "MKTG411",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "WPWP",
    "course_number" : "411",
    "course_title" : "Introduction to Marketing",
    "crosslistings" : [ {
      "course_id" : "011",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "None",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "M",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The effect of the Internet and related technologies on business and social institutions is more profound than that of any prior invention, including the printing press and the internal combustion engine. Furthermore, marketing plays a key role in shaping the modern consumption-led economies fueled by these technologies. MKTG 227 provides a research-based and framework-driven approach to understanding digital marketing and electronic commerce. The course is organized around three sections and utilizes relevant theory, empirical analysis, and practical examples to develop the key learning points. Part I presents will establish the behavioral foundations for understanding electronic commerce and covers relevant phenomena and theory from economics, marketing, and related fields. Part II examines ecommerce business models and institutions including Internet retail, subscription commerce, curated commerce and so on. Part III focuses on how digital marketing fosters ecommerce business growth. In particular, we survey, critique, and evaluate common digital marketing methods and tactics. Guests from the entrepreneur and investor communities participate, as appropriate (former and illustrative speakers include Pooja Batra (Bollywood Actress), Joe Cohen (Lore.com), Mike Cohen (Birchbox.com) and Rob Coneybeer (Shasta Ventures).",
    "course_id" : "MKTG227",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "0.5 c.u.  One-half term.  Students may not take both MKTG 227 and the full semester version of this course, MKTG 230x for credit.",
    "course_number" : "227",
    "course_title" : "Digital Marketing and Electronic Commerce",
    "crosslistings" : [ {
      "course_id" : "727",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Bell",
    "prerequisites" : "MKTG 101",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course develops appreciation of the role of marketing research in the formulation and solution of marketing problems and development of the student's basic skills in conducting and evaluating marketing research projects. Special emphasis is placed on problem formulation, research design, alternative methods of data collection (including data collection instruments, sampling, and field operations), and data analysis techinques. Application of modern marketing research procedures to a variety of marketing problems are explored. Lecture, discussions, and case studies are used to convey curriculum.",
    "course_id" : "MKTG423",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "WPWP",
    "course_number" : "423",
    "course_title" : "Marketing Research",
    "crosslistings" : [ {
      "course_id" : "023",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG411",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "M",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "In the past decade, massive shifts in how companies interact with their customers have suddenly made field experiments an economically feasible way to learn about a variety of business questions such as what types of promotions are most effective, what products should be stocked at a store, how e-mail promotions should be designed, how sales staff should be compensated, etc. Many marketers engaged in online retailing, direct-marketing, online advertising, media management, etc. are rapidly embracing a \"test and learn\" philosophy and a number of platforms such as Google Website Optimizer, have been developed to facilitate rigorous field experiments in the online environment. Just as with the quality revolution in manufacturing during the 1980s and 1990s, the rapid rise of the \"test and learn\" philosophy in marketing has created a huge demand for those who can design, field, and analyze marketing experiments. Through this course, you will learn and practice a wide range of critical skills, from the statistical methods used to design and analyze experiments to the management and strategy required to execute an experiment and act on the results. Although the cases and examples will focus on marketing problems, the material covered can be applied in a number of other domains particularly operations management and product design.",
    "course_id" : "MKTG809",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "(Former MKTG 669)",
    "course_number" : "809",
    "course_title" : "Special Topics: Experiments for Business Decision Making",
    "crosslistings" : [ {
      "course_id" : "309",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 611 or 621 required; STAT 431 or equivalent required; MKTG 712 or MKTG 756 recommended but not required.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The development of new products (goods or services) is an intensively cross-functional process. This course examines that process from the marketing perspective and identifies the key points of contact with operations, finance, organizational policy, and strategic planning. Although an overview of the entire process is provided in the course, special emphasis is placed on the evaluation of concepts early in the process. Thus, this course is very much concerned with ideas and how to select the best ideas and make them a reality. The main objectives of the course are (1) to familiarize students with the strategies, frameworks, conceptual tools, and types of marketing research that are considered best practices in the development of new products and (2) to give students the opportunity to apply these ideas and methods in the evaluation of a specific product concept, customizing the learning experience to their own needs and interests. MKTG 232 is an expanded version of the mini-course on this topic (MKTG 221). The added time allows for (1) increased depth for the topics normally covered in MKTG 221 (especially in the area of marketing research methods for NPD), (2) the addition of more topics (such as social implications of innovation and new product portfolio management), (3) increased depth for the term project, and (4) guest speakers. It is recommended for students who are considering careers (1) in product management, (2) that involve the evaluation of new products and the ability of companies to produce successful new products, or (3) that focus on developing scientific or artistic ideas in to commercially viable goods and services.",
    "course_id" : "MKTG232",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "232",
    "course_title" : "New Product Development",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Hutchinson",
    "prerequisites" : "MKTG 101; NOTE: Students may not take both MKTG232 and MKTG221 for credit.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "W",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The purpose of this course is to investigate advanced topics in consumer behavior. This class will be organized in a way that allows you to 1) gain depth in important areas of consumer behavior research identified by faculty; 2) gain exposure to various faculty in marketing and their research values and styles; and 3) develop and advance your own research interests.",
    "course_id" : "MKTG969",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "PhD Course.  Offered alternate weeks from (MKTG 968) Advanced Topics in Marketing Research",
    "course_number" : "969",
    "course_title" : "Advanced Topics in Consumer Behavior",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "MKTG598",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "598",
    "course_title" : "Models and Tools For Mkt",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "EMTM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "N",
    "school_code" : "EG",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "IND",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Requires written permission of instructor and the department graduate adviser.",
    "course_id" : "MKTG999",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Ph.D. course.",
    "course_number" : "999",
    "course_title" : "Supervised Independent Study",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course provides a detailed introduction to the role of merchandising at various retailers, including apparel and other soft lines businesses, grocery stores, mass-merchandisers and \"category killers\". Selected topics may include product development, line planning, sourcing, product life cycle, forecasting, planning and allocation, pricing and markdowns, and vendor relations.",
    "course_id" : "MKTG806",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "0.5 cu half credit course.  Format: Lecture, discussion. (Former MKTG 896)",
    "course_number" : "806",
    "course_title" : "Special Topics: Retail Merchandising",
    "crosslistings" : [ {
      "course_id" : "306",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 611 or 621; or MKTG 725 or MKTG 793",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "See Legal Studies, LGST 205/805.",
    "course_id" : "MKTG760",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "760",
    "course_title" : "Law of Marketing and Antitrust",
    "crosslistings" : [ {
      "course_id" : "205",
      "section_id" : "",
      "subject" : "LGST"
    }, {
      "course_id" : "805",
      "section_id" : "",
      "subject" : "LGST"
    }, {
      "course_id" : "260",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "MKTG580",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "580",
    "course_title" : "Marketing Strategies",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "EMTM",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "N",
    "school_code" : "EG",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course presents concepts and analytical tools necessary to manage distribution channels. Channels will be viewed as both as value delivery systems and as inter-organizational systems. The course is organized around three themes: designing a go-to-market approach and channel structure, coordinating the channel participants, and changing channels. Specific topics include going direct vs. indirect, incorporating the Internet into hybrid systems, e-commerce and value migration, franchising, channel conflict, legal issues regarding channel policies, category management and efficient consumer response (ECR) initiatives.  Inactive",
    "course_id" : "MKTG759",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Format: Lectures, case discussions, small group project.",
    "course_number" : "759",
    "course_title" : "Channel Management",
    "crosslistings" : [ {
      "course_id" : "259",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 611 or 621; MKTG 612, 613 or 622 concurrently.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Private and public sector firms increasingly use marketing strategies to engage their customers and stakeholders around social impact. To do so, managers need to understand how best to engage and influence customers to behave in ways that have positive social effects. This course focuses on the strategies for changing the behavior of a target segment of consumers on key issues in the public interest (e.g., health behaviors, energy efficiency, poverty reduction, fund-raising for social causes). How managers partner with organizations (e.g., non-profits, government) to achieve social impact will also be explored.",
    "course_id" : "MKTG233",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "One half term - 0.5 c.u.",
    "course_number" : "233",
    "course_title" : "Marketing for Social Impact",
    "crosslistings" : [ {
      "course_id" : "733",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Deborah Small",
    "prerequisites" : "MKTG 101 or permission of instructor",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Private and public sector firms increasingly use marketing strategies to engage their customers and stakeholders around social impact. To do so, managers need to understand how best to engage and influence customers to behave in ways that have positive social effects. This course focuses on the strategies for changing the behavior of a target segment of consumers on key issues in the public interest (e.g., health behaviors, energy efficiency, poverty reduction, fund-raising for social causes). How managers partner with organizations (e.g., non-profits, government) to achieve social impact will also be explored.",
    "course_id" : "MKTG733",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Format: Lecture, class discussion, simulations, cases and guest lecturers.",
    "course_number" : "733",
    "course_title" : "Marketing for Social Impact",
    "crosslistings" : [ {
      "course_id" : "233",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Deborah Small",
    "prerequisites" : "MKTG 611 or 621 or permission of instructor",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "MST",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "MKTG990",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "990",
    "course_title" : "Masters Thesis in Marketing.",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This mini-course (6 weeks) covers the marketing aspects of products or services exclusive of their promotion, pricing, or distribution. It focuses on decisions regarding product introduction, positioning, improvements, deletion, and the tools available for making these decisions.",
    "course_id" : "MKTG453",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "WPWP",
    "course_number" : "453",
    "course_title" : "New Product Management",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG411",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "M",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course is designed to equip students with the concepts, techniques, and latest thinking on pricing issues, with an emphasis on ways in which to help a firm improve its pricing. The orientation of the course is about practice of pricing, not theory. We will focus on how firms can improve profitability through pricing, look at how firms set their prices and how to improve current practices to increase profitability. The first part of the course focuses on how to analyze costs, customers, and competitors in order to formulate proactive pricing strategies. The second part focuses on price promotions, price bundling, price discrimination, versioning, nonlinear pricing, pricing through a distribution channel, dynamic pricing, etc.",
    "course_id" : "MKTG288",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "NOTE: Students may not take both MKTG 288 and MKTG 254 (former MKTG 222) for credit.",
    "course_number" : "288",
    "course_title" : "Pricing Strategies",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Zhang",
    "prerequisites" : "MKTG 101",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "New retail brands and opportunities for growth are emerging at an unprecedented rate, for online retailers and offline retailers alike. In this course we will: (1) articulate key principles for successful branding and for understanding consumer shopping behavior in retail environments, (2) demonstrate unique challenges and opportunities that luxury brands face, and (3) discuss concepts and empirical methods for analyzing consumer shopping behavior.",
    "course_id" : "MKTG897",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "897",
    "course_title" : "Advanced Study: Luxury Branding and Retailing in Italy and Beyond",
    "crosslistings" : [ {
      "course_id" : "218",
      "section_id" : "",
      "subject" : "WH"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "David Bell, Barbara Kahn",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "IND",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "A",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "MKTG399",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Content arranged by project supervisor, 1.0 c.u",
    "course_number" : "399",
    "course_title" : "Independent Study",
    "crosslistings" : [ {
      "course_id" : "899",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 212 and written permission of instructor and the department undergraduate advisor",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "REC",
      "credit" : "1"
    }, {
      "activity_code" : "LEC",
      "credit" : "0"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The objective of this course is to introduce students to the concepts, analyses, and activities that comprise marketing management, and to provide practice in assessing and solving marketing problems. The course is also a foundation for advanced electives in Marketing as well as other business/social disciplines. Topics include marketing strategy, customer behavior, segmentation, market research, product management, pricing, promotion, sales force management and competitive analysis.",
    "course_id" : "MKTG101",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Recitation Section 220 is reserved only for Wharton Scholars.",
    "course_number" : "101",
    "course_title" : "Introduction to Marketing",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Niedermeier",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course views marketing as both a general management responsibility and an orientation of an organization that helps one to create, capture and sustain customer value. The focus is on the business unit and its network of channels, customer relationships, and alliances. Specifically, the course attempts to help develop knowledge and skills in the application of advanced marketing frameworks, concepts, and methods for making strategic choices at the business level.",
    "course_id" : "MKTG777",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Format varies by instructor.  Typically: case, lecture, group projects and class discussion.  See syllabus.",
    "course_number" : "777",
    "course_title" : "Marketing Strategy",
    "crosslistings" : [ {
      "course_id" : "277",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Wind",
    "prerequisites" : "Completion of MKTG 611 or 621 and MKTG 612 or 613 or 622",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will expose students to the theoretical and empirical \"building blocks\" that will allow them to construct, estimate, and interpret powerful models of consumer behavior. Over the years, researchers and practitioners have used these models for a wide variety of applications, such as new product sales, forecasting, analyses of media usage, and targeted marketing programs. Other disciplines have seen equally broad utilization of these techniques. The course will be entirely lecture-based with a strong emphasis on real-time problem solving. Most sessions will feature sophisticated numerical investigations using Microsoft Excel. Much of the material is highly technical.",
    "course_id" : "MKTG476",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "476",
    "course_title" : "Applied Probability Models for Marketing",
    "crosslistings" : [ {
      "course_id" : "776",
      "section_id" : "",
      "subject" : "MKTG"
    }, {
      "course_id" : "476",
      "section_id" : "",
      "subject" : "STAT"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Fader",
    "prerequisites" : "A high comfort level with basic integral calculus and recent exposure to a formal course in probability and statistics such as STAT 430 is strongly recommended.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "B",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "IND",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "A student contemplating an independent study project must first find a faculty member who agrees to supervise and approve the student's written proposal as an independent study (MKTG 899). If a student wishes the proposed work to be used to meet the ASP requirement, he/she should then submit the approved proposal to the MBA adviser who will determine if it is an appropriate substitute. Such substitutions will only be approved prior to the beginning of the semester.",
    "course_id" : "MKTG899",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "899",
    "course_title" : "Independent Study",
    "crosslistings" : [ {
      "course_id" : "399",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 611 or 621; and MKTG 612, 613 or 622; and the written permission of instructor and the department MBA faculty advisor",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1.5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "V",
    "course_credit_type" : "CU",
    "course_description" : "The principal objectives of this course are to provide opportunities for undertaking an in-depth study of a marketing problem and to develop the students' skills in evaluating research and designing marketing strategies for a variety of management situations. Selected projects can touch on any aspect of marketing as long as this entails the elements of problem structuring, data collection, data analysis, and report preparation. The course entails a considerable amount of independent work. (Strict library-type research is not appropriate) Class sessions are used to monitor progress on the project and provide suggestions for the research design and data analysis. The last portion of the course often includes an oral presentation by each group to the rest of the class and project sponsors. Along with marketing, the projects integrate other elements of management such as finance, production, research and development, and human resources.",
    "course_id" : "MKTG890",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Individual group meetings with the instructor.",
    "course_number" : "890",
    "course_title" : "Advanced Study Project (ASP)",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "For GCP Advanced Study Projects: Acceptance to this course is by application only.  Students must apply and be interviewed in September for spring participation.  Visit www.whartongcp.org.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "In today's business environment, marketing executives are involved in complex decision-making and they become responsible for return on their marketing investments. The first objective of this course is to help participants become better executives. By exposing students to various analytical and computer-based tools, developed for solving marketing problems, it will help to prepare them for careers in industries such as consumer packaged goods, hi-tech, financial services, media and entertainment, pharmaceutical, consulting, and venture capital. The course's main focus is on various existing models, such as models that predict the consumer's dynamic adoption of an innovative product. However, at some point in their career, students may find themselves facing business problems for which a model can assist in making decisions, but no existing model is available. Hence, the second objective of the course is to provide participants with critical skills necessary to evaluate new models to which they may be exposed by attending presentations or reading the literature. The models to be discussed in the class have been implemented and proven useful in a wide range of industries (e.g., business-to-consumers and business-to-business). The course is not only about models, however. It also covers modeling needs. Some industries such as the media and entertainment or the pharmaceutical industries present unique problems and modeling needs. The third objective of the course is to expose participants to the nature and essence of such idiosyncratic problems as well as modeling needs in such industries. Overall, the course will make participants understand better critical marketing problems by analyzing them rigorously and will enhance their skills in either designing or evaluating models-based strategies.",
    "course_id" : "MKTG271",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "271",
    "course_title" : "Models for Marketing Strategy",
    "crosslistings" : [ {
      "course_id" : "771",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Eliashberg",
    "prerequisites" : "MKTG 101, STAT 101 and some tolerance for expressing critical ideas in simple math",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Taught collectively by the faculty members from the Marketing Department, this course investigates advanced topics in marketing. It is organized in a way that allows students to 1) gain depth in important areas of research identified by faculty; 2) gain exposure to various faculty in marketing and their research values and styles; and 3) develop and advance their own research interests.",
    "course_id" : "MKTG971",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Wednesday Seminar.  Half credit course meets entire semester.",
    "course_number" : "971",
    "course_title" : "Advanced Topics in Marketing - Part A",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course is taught collectively by the faculty members from the Marketing Department. It is designed to expose Doctoral students to the cutting-edge research in marketing models in order to help them to define and advance their research interests. This course will offer: in-depth discussions on some important topics in marketing by experts in respective areas; tools, and methodologies required for conducting research in those areas; broad exposure to our faculty members and their proven research styles.",
    "course_id" : "MKTG973",
    "course_level" : "4",
    "course_level_description" : "Graduate",
    "course_notes" : "Thursday Seminar.  Half credit course meets entire semester.",
    "course_number" : "973",
    "course_title" : "Research Seminar in Marketing - Part A",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Taught collectively by the faculty members from the Marketing Department, this course investigates advanced topics in marketing. It is organized in a way that allows students to 1) gain depth in important areas of research identified by faculty; 2) gain exposure to various faculty in marketing and their research values and styles; and 3) develop and advance their own research interests.",
    "course_id" : "MKTG972",
    "course_level" : "4",
    "course_level_description" : "Graduate",
    "course_notes" : "Wednesday Seminar.  Half credit course meets entire semester.",
    "course_number" : "972",
    "course_title" : "Advanced Topics in Marketing - Part B",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course is taught collectively by the faculty members from the Marketing Department. It is designed to expose Doctoral students to the cutting-edge research in marketing models in order to help them to define and advance their research interests. This course will offer: in-depth discussions on some important topics in marketing by experts in respective areas; tools, and methodologies required for conducting research in those areas; broad exposure to our faculty members and their proven research styles.",
    "course_id" : "MKTG974",
    "course_level" : "4",
    "course_level_description" : "Graduate",
    "course_notes" : "Thursday Seminar.  Half credit course meets entire semester.",
    "course_number" : "974",
    "course_title" : "Research Seminar in Marketing - Part B",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Private and public sector firms increasingly use marketing strategies to engage their customers and stakeholders around social impact. To do so, managers need to understand how best to engage and influence customers to behave in ways that have positive social effects. This course focuses on the strategies for changing the behavior of a target segment of consumers on key issues in the public interest (e.g., health behaviors, energy efficiency, poverty reduction, fundraising for social causes). How managers partner with organizations (e.g., non-profits, government) to achieve social impact will also be explored.",
    "course_id" : "MKTG266",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Students may not take both MKTG 266 and MKTG 233 (the 0.5 cu version of the course) for credit.",
    "course_number" : "266",
    "course_title" : "Marketing for Social Impact",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Deborah Small",
    "prerequisites" : "MKTG 101 or instructor permission",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The objective of this course is to enhance the students' creativity, ability to innovate, and ability to identify, recruit, develop, manage, retain, and collaborate with creative people. The course includes: (1) Interaction with creative guest lecturers from diverse fields; (2) A review of the literature on creativity, creative people, innovation, and design as well as the leadership and management of creative people and innovation; (3) Hands on learning of approaches for generating creative new products/services and business ideas; and (4) Applications of creativity tools to selected management domains. Approaches to the generation of creative options are not limited to the development of products and services or businesses, but can be applied to all areas of management, business, and life. The purpose of these sessions is to explore the applications of creative approaches to marketing, advertising, cost reduction efforts, M&A and strategic alliances, organizational design, and management challenges. Given the current global financial crisis and economic recession, much of the applications are going to focus on what corporations (and public policy decision makers) should do to creatively address their challenges.",
    "course_id" : "MKTG734",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Students may not take both MKTG 792 and MKTG 734 for credit.",
    "course_number" : "734",
    "course_title" : "Creativity",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Rom Schrift",
    "prerequisites" : "None",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "",
    "course_id" : "MKTG076",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "",
    "course_number" : "076",
    "course_title" : "Specialtopics-E-Commerce",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Marketing begins and ends with the customer, from determining customers' needs and wants to providing customer satisfaction and maintaining customer relationships. This course examines the basic concepts and principles in customer behavior with the goal of understanding how these ideas can be used in marketing decision making. The class will consist of a mix of lectures, discussions, cases, assignments, project work and exams. Topics covered include customer psychological processes (e.g., motivation, perception, attitudes, decision-making) and their impact on marketing (e.g., segmentation, branding, customer satisfaction). The goal is to provide you with a set of approaches and concepts to consider when faced with a decision involving understanding customer responses to marketing actions.",
    "course_id" : "MKTG711",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Format: Lectures and discussion, case analyses, presentations.(Former MKTG 773)",
    "course_number" : "711",
    "course_title" : "Consumer Behavior",
    "crosslistings" : [ {
      "course_id" : "211",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Reed, Kahn, Small, Mellers",
    "prerequisites" : "Completion of MKTG 611 or 621",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The objective of the course is to provide a rigorous experience in marketing research methods. The course is aimed at the manager, who is the ultimate user of the research and is responsible for determining the major scope and direction of research activities. Techniques of data collection, evaluation of alternative sources of information, and methods of evaluating data and presenting the results are covered. The course should help managers recognize the role of systematic information gathering and analysis in making marketing decisions. The course also deals with how to define information needs; the use of test marketing procedures; forms of analysis applicable to marketing research information; and the role of models in decision making.",
    "course_id" : "MKTG712",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Format: Lecture, discussion, and cases.(Former MKTG 756)",
    "course_number" : "712",
    "course_title" : "Marketing Research",
    "crosslistings" : [ {
      "course_id" : "212",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Eliashberg, Yildirim, Shen, Iyengar",
    "prerequisites" : "MKTG 611 or 621; MKTG 612, 613 or 622 concurrently; STAT 613 or 621 strongly recommended",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The primary objective of this course is to provide the students with an opportunity to learn and apply the core theories, strategies, principles and practices of effective advertising management. The course utilizes theory, marketing and communications research, and significant management experience that are relevant to the design, evaluation and management of advertising. The specific topics covered in the course include consumer segmentation and target selection, consumer motivation and insight, developing a powerful communications strategy and advertising idea, evaluating and optimizing advertising execution, and developing a targeted and effective consumer connections and media plan.",
    "course_id" : "MKTG724",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Format: Class discussion, cases, and presentation centered around the core subjects of the advertising development process. (Former MKTG 755)",
    "course_number" : "724",
    "course_title" : "Advertising Management",
    "crosslistings" : [ {
      "course_id" : "224",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Completion of MKTG 611 or 621; MKTG 612, 613 or 622 concurrently.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course provides a total immersion in the new product development process - from sourcing ideas and innovation, through new product sales forecasting. The focus is on collective learning, what works, what doesn't, and why. While the primary focus is the new product development process within a corporate structure, some coverage is given to key issues surrounding start-ups.",
    "course_id" : "MKTG721",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Format: Lectures, cases, simulations, class discussions, and guest speakers. (Former MKTG 753)",
    "course_number" : "721",
    "course_title" : "New Product Management",
    "crosslistings" : [ {
      "course_id" : "221",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 611 or MKTG 621",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course provides a detailed introduction to the role of merchandising at various retailers, including apparel and other soft lines businesses, grocery stores, mass-merchandisers and \"category killers\". Selected topics may include product development, line planning, sourcing, product lifecycle, forecasting, planning and allocation, pricing and markdowns, and vendor relations.",
    "course_id" : "MKTG306",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "0.5 c.u., One-half term (Former MKTG 396)",
    "course_number" : "306",
    "course_title" : "Special Topics: Retail Merchandising",
    "crosslistings" : [ {
      "course_id" : "806",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 101; MKTG 225",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The effect of the Internet and related technologies on business and social institutions is more profound than that of any prior invention, including the printing press and the internal combustion engine. Furthermore, marketing plays a key role in shaping the modern consumption-led economies fueled by these technologies. MKTG 727 provides a research-based and framework-driven approach to understanding digital marketing and electronic commerce. The course is organized around three sections and utilizes relevant theory, empirical analysis, and practical examples to develop the key learning points. Part I presents will establish the behavioral foundations for understanding electronic commerce and covers relevant phenomena and theory from economics, marketing, and related fields. Part II examines ecommerce business models and institutions including Internet retail, subscription commerce, curated commerce and so on. Part III focuses on how digital marketing fosters ecommerce business growth. In particular, we survey, critique, and evaluate common digital marketing methods and tactics. Guests from the entrepreneur and investor communities participate, as appropriate (former and illustrative speakers include Pooja Batra (Bollywood Actress), Joe Cohen (Lore.com), Mike Cohen (Birchbox.com) and Rob Coneybeer (Shasta Ventures).",
    "course_id" : "MKTG727",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "0.5 c.u.  One-half term (Former MKTG 784) Students may not take both MKTG 727 and the full semester version of this course, MKTG 730 for credit.",
    "course_number" : "727",
    "course_title" : "Digital Marketing and Electronic Commerce",
    "crosslistings" : [ {
      "course_id" : "227",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Bell",
    "prerequisites" : "Completion of MKTG 611 or 621 and MKTG 612, 613 or 622",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course provides an interdisciplinary overview of the retailing industry. Primary focus will be on the customer facing activities of retailers, including assortment planning, private-label development and the management of in-store operations, and the back-door activities (forecasting and supply chain management) that support customer interaction. In addition, current issues facing retailers, such as customer relationship management, industry consolidation and supplier relations, will be explored. The course will also survey topics in finance, operations, information technology and real estate as they relate to retail.",
    "course_id" : "MKTG725",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Format: Lecture and discussion, case analyses, and guest speakers. (Former MKTG 793)",
    "course_number" : "725",
    "course_title" : "Principles of Retailing",
    "crosslistings" : [ {
      "course_id" : "225",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 611 or 621 and MKTG 612, 613 or 622; or permission of instructor",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "See Legal Studies, LGST 205",
    "course_id" : "MKTG260",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "(Former MKTG 236)",
    "course_number" : "260",
    "course_title" : "Law of Marketing and Antitrust",
    "crosslistings" : [ {
      "course_id" : "205",
      "section_id" : "",
      "subject" : "LGST"
    }, {
      "course_id" : "805",
      "section_id" : "",
      "subject" : "LGST"
    }, {
      "course_id" : "760",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 101",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "W",
    "school_code" : "WH",
    "terms_offered_code" : "",
    "terms_offered_description" : ""
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "In the past decade, massive shifts in how companies interact with their customers have suddenly made field experiments an economically feasible way to learn about a variety of business questions such as what types of promotions are most effective, what products should be stocked at a store, how e-mail promotions should be designed, how sales staff should be compensated, etc. Many marketers engaged in online retailing, direct-marketing, online advertising, media management, etc. are rapidly embracing a \"test and learn\" philosophy and a number of platforms such as Google Website Optimizer, have been developed to facilitate rigorous field experiments in the online environment. Just as with the quality revolution in manufacturing during the 1980s and 1990s, the rapid rise of the \"test and learn\" philosophy in marketing has created a huge demand for those who can design, field, and analyze marketing experiments. Through this course, you will learn and practice a wide range of critical skills, from the statistical methods used to design and analyze experiments to the management and strategy required to execute an experiment and act on the results. Although the cases and examples will focus on marketing problems, the material covered can be applied in a number of other domains particularly operations management and product design.",
    "course_id" : "MKTG309",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "(Former MKTG 269)",
    "course_number" : "309",
    "course_title" : "Special Topics: Experiments for Business Decision Making",
    "crosslistings" : [ {
      "course_id" : "809",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 101 or faculty permission is required; STAT 101, STAT 431, or equivalent is recommended.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The purpose of this course is to provide students with an opportunity to analyze, design, and evaluate various marketing channel structures and decisions. The course takes the perspective of the manufacturer and is organized around the two main tasks of channel management; designing channel structure and coordinating the channel. The course views a marketing channel both as a value delivery system and as an inter- organizational system. Specific topics covered include direct v. indirect channels, functional unbundling and hybrid channel systems, franchising, channel conflict, trust and power in channel relations, some legal issues, efficient consumer response (ECR) initiatives, and the impact of electronic commerce on channel management.",
    "course_id" : "MKTG259",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "0.5 c.u.  One-half term (Former MKTG 223)",
    "course_number" : "259",
    "course_title" : "Channel Management",
    "crosslistings" : [ {
      "course_id" : "759",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG101",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course focuses on the key marketing concepts and methods relevant for entrepreneurs. In particular, it covers the marketing elements of new venture initiation (including a business plan), as well as marketing decisions for small and growing organizations. Topics include product/service design, assessment of market potential, creation of successful distribution relationships, and new product pricing. In contrast to the product development course, the emphasis here is on a new startup business rather than a new offering from an existing business. Topics covered in this course also include low-budget or no-budget market research, successful strategic alternatives for small business, alternatives to high-cost advertising (e.g., direct marketing, alternative media and personal selling), segmentation, and targeted marketing. Students will prepare a marketing plan for an entrepreneurial organization of their choice, possibly for a new venture they are considering.",
    "course_id" : "MKTG741",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Format: Case, lecture, class discussions. (Former MKTG 781)",
    "course_number" : "741",
    "course_title" : "Entrepreneurial Marketing",
    "crosslistings" : [ {
      "course_id" : "241",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Completion of MKTG 611 or 621; MKTG 612, 613 or 622 concurrently; MKTG 712 concurrently; students are discouraged from taking this course and MKTG 721 except with permission of an MBA adviser.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Global marketing is an extremely demanding discipline but, from a career standpoint, one which is both challenging and rewarding. Inherent to the success of any global marketing professional, yet many times overlooked and/or underappreciated, is the critical nature of human understanding and relationships in business planning and execution. This is especially relevant in today's business environment when you consider the dual multinational company imperative of continued revenue and profit growth in mature markets and successfully expanding into new growth and emerging markets. This course assumes an understanding of marketing principles and some exposure to and appreciation of the global environment. The objective of the course is to provide an understanding of how the global environment (particularly cultural diversity) affects the application of marketing principles and business practice on a global basis and the competencies necessary to be a successful global manager.",
    "course_id" : "MKTG242",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "0.5 c.u.  One-half term (Former MKTG 282)",
    "course_number" : "242",
    "course_title" : "Multinational Marketing",
    "crosslistings" : [ {
      "course_id" : "742",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG101",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Global marketing is an extremely demanding discipline but, from a career standpoint, one which is both challenging and rewarding. Inherent to the success of any global marketing professional, yet many times overlooked and/or underappreciated, is the critical nature of human understanding and relationships in business planning and execution. This is especially relevant in today's business environment when you consider the dual multinational company imperative of continued revenue and profit growth in mature markets and successfully expanding into new growth and emerging markets. This course assumes an understanding of marketing principles and some exposure to and appreciation of the global environment. The objective of the course is to provide an understanding of how the global environment (particularly cultural diversity) affects the application of marketing principles and business practice on a global basis and the competencies necessary to be a successful global manager.",
    "course_id" : "MKTG742",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Format: Cases, lectures, discussions. (Former MKTG 782)",
    "course_number" : "742",
    "course_title" : "Multinational Marketing",
    "crosslistings" : [ {
      "course_id" : "242",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "Completion of MKTG 611; and MKTG 612 or MKTG 613.  MKTG 612 or MKTG 613 may be taken concurrently with MKTG 742.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The development of new products (goods or services) is an intensively cross-functional process. This course examines that process from the marketing perspective and identifies the key points of contact with operations, finance, organizational policy, and strategic planning. Although an overview of the entire process is provided in the course, special emphasis is placed on the evaluation of concepts early in the process. Thus, this course is very much concerned with ideas and how to select the best ideas and make them a reality. The main objectives of the course are (1) to familiarize students with the strategies, frameworks, conceptual tools, and types of marketing research that are considered best practices in the development of new products and (2) to give students the opportunity to apply these ideas and methods in the evaluation of a specific product concept, customizing the learning experience to their own needs and interests. MKTG 262 is an expanded version of the mini-course on this topic (MKTG 221). The added time allows for (1) increased depth for the topics normally covered in MKTG 221 (especially in the area of marketing research methods for NPD), (2) the addition of more topics (such as social implications of innovation and new product portfolio management), (3) increased depth for the term project, and (4) guest speakers. It is recommended for students who are considering careers (1) in product management, (2) that involve the evaluation of new products and the ability of companies to produce successful new products, or (3) that focus on developing scientific or artistic ideas in to commercially viable goods and services.",
    "course_id" : "MKTG262",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "(Former MKTG 232)",
    "course_number" : "262",
    "course_title" : "NEW PRODUCT DEVELOPMENT",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 101; NOTE: Students may not take both MKTG 262 and MKTG 221 for credit.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "W",
    "school_code" : "WH",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Why do some products catch on and achieve huge popularity while others fail? Why do some behaviors spread like wildfire while others languish? How do certain ideas seem to stick in memory while others disappear the minute you hear them? More broadly, what factors lead to trends, social contagion, and social epidemics? Interactive media, word of mouth, and viral marketing are important issues for companies, brands, and organizations. This course looks at these and other topics as it examines how products, ideas, and behaviors catch on and become popular. Marketers want their product to be popular, organizations want their social change initiative to catch on and entrepreneurs want their ideas to stick. This course will touch on four main aspects: (1) Characteristics of products, ideas, and behaviors that lead them to be successful. (2) Aspects of individual psychology that influence what things are successful. (3) Interpersonal processes, or how interactions between individuals drive success. (4) Social networks, or how patterns of social ties influence success.",
    "course_id" : "MKTG268",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "(Former MKTG 228)",
    "course_number" : "268",
    "course_title" : "Contagious: How Products, Ideas, and Behaviors Catch On",
    "crosslistings" : [ {
      "course_id" : "768",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Berger",
    "prerequisites" : "Marketing 101 and 211 are recommended, but not required",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course is designed to provide an opportunity for students to develop an understanding of the process by which industrial and other institutional buyers' needs are identified and met. Following an examination of the setting in which business to business marketing takes place (i.e., market and system characteristics), the course focuses on the managerial process of identifying and evaluating industrial marketing opportunities and strategy decisions to effectively serve industrial markets.",
    "course_id" : "MKTG246",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "0.5 c.u.  One-half term. (Former MKTG 286)",
    "course_number" : "246",
    "course_title" : "Business to Business Marketing",
    "crosslistings" : [ {
      "course_id" : "746",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 101",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course is designed to provide an opportunity for students to develop an understanding of the process by which industrial and other institutional buyers' needs are identified and met. Following an examination of the setting in which business to business marketing takes place (i.e., market and system characteristics), the course focuses on the managerial process of identifying and evaluating industrial marketing opportunities and strategy decisions to effectively serve industrial markets.",
    "course_id" : "MKTG746",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "0.5 c.u.  One-half term.  Format: Lecture and cases.  Requirements: Active participation in discussion of cases and selected readings. (Former MKTG 786)",
    "course_number" : "746",
    "course_title" : "Business to Business Marketing",
    "crosslistings" : [ {
      "course_id" : "246",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 611 or 621.  MKTG 612, 613 or 622 concurrently",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Students who take this course will learn the basic functions of sales force management as well as theories and concepts about appropriately managing that function; become familiar with some recent research in sales management that underlies the theories and concepts; and be able to apply the research, theories and concepts to practical situations. The course is concerned with how to manage a sales force rather than with how to sell. The emphasis is on business to business (rather than consumer) sales force management. Topics covered include salesperson effectiveness, deployment, organizational design, compensation, and evaluation.",
    "course_id" : "MKTG251",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "0.5 c.u.  One-half term. (Former MKTG 226)",
    "course_number" : "251",
    "course_title" : "Sales Force Management",
    "crosslistings" : [ {
      "course_id" : "751",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 101",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The purpose of this course is to provide a solid foundation for critical thinking and research on the judgment, decision-making and choice aspects of consumer behavior. There is a focus on how people process information when making judgments and choices and how the processes of judgment and choice might be improved. Topics of discussion include rationality, judgment under uncertainty, judgment heuristics and biases, risk taking, dealing with conflicting values, framing effects, prospect theory, inter-temporal choice, preference formation, and the psychology of utility. The focus will be on the individual decision-maker, although the topics will also have some applicability to group and organizational decision-making and behavioral research methodologies.",
    "course_id" : "MKTG950",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "PhD Course.  Alternates with MKTG 951.  Offered every other year. (Formerly part of MKTG 960)",
    "course_number" : "950",
    "course_title" : "Judgment and Decision Making Perspectives on Consumer Behavior - Part A",
    "crosslistings" : [ ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "H",
    "school_code" : "WH",
    "terms_offered_code" : "A",
    "terms_offered_description" : "Course usually offered in fall term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The course will use design as the medium to link consumer need to retail. This will include basic design elements, such as space, form and color, as well as retail-specific topics like point-of-purchase displays. Both macro and microl elelements of retail design will be explored, including issues from mall development to individual customer transactions. Selected topics may include principles of design, environmental design, stroe design (micro and macro), graphic arts, visual merchandising, comparison of shopping venues, role of consumer behavior and psychology as drivers for design and architecture and design of virtual retailing channels (online and catalog).",
    "course_id" : "MKTG307",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "0.5 cu., one half term. (Former MKTG 397)",
    "course_number" : "307",
    "course_title" : "Special Topics: Retail Designscape",
    "crosslistings" : [ {
      "course_id" : "807",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 101; MKTG 225",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course will expose students to the theoretical and empirical \"building blocks\" that will allow them to develop and implement powerful models of customer behavior. Over the years, researchers and practitioners have used these methods for a wide variety of applications, such as new product sales forecasting, analyses of media usage, customer valuation, and targeted marketing programs. These same techniques are also very useful for other types of business (and non-business) problems. The course will be entirely lecture-based with a strong emphasis on real-time problem solving. Most sessions will feature sophisticated numerical investigations using Microsoft Excel. Much of the material is highly technical.",
    "course_id" : "MKTG776",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Format: Lecture, real-time problem solving",
    "course_number" : "776",
    "course_title" : "Applied Probability Models in Marketing",
    "crosslistings" : [ {
      "course_id" : "476",
      "section_id" : "",
      "subject" : "MKTG"
    }, {
      "course_id" : "476",
      "section_id" : "",
      "subject" : "STAT"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Fader",
    "prerequisites" : "Students must have a high comfort level with basic integral calculus, and recent exposure to a formal course in probability and statistics is strongly recommended.",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "P",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "The course will use design as the medium to link consumer need to retail. This will include basic design elements, such as space, form and color, as well as retail-specific topics like point-of-purchase displays. Both macro and microl elelements of retail design will be explored, including issues from mall development to individual customer transactions. Selected topics may include principles of design, environmental design, stroe design (micro and macro), graphic arts, visual merchandising, comparison of shopping venues, role of consumer behavior and psychology as drivers for design and architecture and design of virtual retailing channels (online and catalog).",
    "course_id" : "MKTG807",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "(Former MKTG897)",
    "course_number" : "807",
    "course_title" : "Special Topics: Retail Designscape",
    "crosslistings" : [ {
      "course_id" : "307",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "MKTG 725",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : ".5"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This course is a visual and practical approach of understanding global styles and it involves readings, active participation in the creation of lifestyle boards, brand books, exercises to develop all the senses and the development of a total lifestyle concept. Students will be exposed to the Through the Whitaker Lifestyle Segementation of the Global Consumer system and will learn: you will learn: How to anticipate and predict consumers needs and their style evolution; How to identify new retail opportunities; How to create innovative retail concepts and brands; How to merchandise the appropriate products for a specific lifestyle; and How to develop your intuition and creative power. In addition, students will critically evaluate this style segmentation system and compare it to other segmentation approaches. This course is relevant for students interested in developing their intuition and creativity. The topics of this course are a foundation for anyone working in any area of the retail industry: marketing, merchandising, visual merchandising, store design, planning, advertising, etc.",
    "course_id" : "MKTG302",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "0.5 c.u., half term course (Former MKTG 392)",
    "course_number" : "302",
    "course_title" : "SPECIAL TOPICS: Visual Aesthetics and Style in Retail Merchandising",
    "crosslistings" : [ {
      "course_id" : "802",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "V",
    "school_code" : "WH",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Financial decision making is a significant aspect of consumers' decisions, providing great business opportunities, and with mistakes, having significant individual and societal consequences. We have all witnessed what amassing household debt, taking on a large mortgage without financial reserves, and having insufficient savings for retirement can do to individuals, households, and communities. The basic premise of this course is that better understanding of the psychology of consumer decision making in the context of financial products and services can provide significant business opportunities, and more importantly, provide better public policy that will increase consumer well-being. Note that this course is rooted in the psychology of financial decisions and will not focus on financial or economic models. This is a course about the psychology of individual consumers rather than financial models of the firm. In this course the perspective of the individual is taken, rather than that of the firm. The focus is on actual behavior rather than normative rational behavior. This course is fundamentally about individual decision making in the context of the consumption of financial products and services. As such, the course will cover some concepts and theories (risk aversion, loss aversion, hyperbolic discounting, etc.) covered in other courses examining the behavioral aspects of consumers and managers, such as Consumer Behavior (MKTG 211) and Decision Processes (OPIM 290).",
    "course_id" : "MKTG231",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Experimental course.",
    "course_number" : "231",
    "course_title" : "The Psychology of Consumer Financial Decisions",
    "crosslistings" : [ {
      "course_id" : "731",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Gal Zauberman",
    "prerequisites" : "MKTG 101",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "W",
    "school_code" : "WH",
    "terms_offered_code" : "B",
    "terms_offered_description" : "Course usually offered in spring term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "LEC",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "Financial decision making is a significant aspect of consumers' decisions, providing great business opportunities, and with mistakes, having significant individual and societal consequences. We have all witnessed what amassing household debt, taking on a large mortgage without financial reserves, and having insufficient savings for retirement can do to individuals, households, and communities. The basic premise of this course is that better understanding of the psychology of consumer decision making in the context of financial products and services can provide significant business opportunities, and more importantly, provide better public policy that will increase consumer well-being. Note that this course is rooted in the psychology of financial decisions and will not focus on financial or economic models. This is a course about the psychology of individual consumers rather than financial models of the firm. In this course the perspective of the individual is taken, rather than that of the firm. The focus is on actual behavior rather than normative rational behavior. This course is fundamentally about individual decision making in the context of the consumption of financial products and services. As such, the course will cover some concepts and theories (risk aversion, loss aversion, hyperbolic discounting, etc.) covered in other courses examining the behavioral aspects of consumers and managers, such as Customer Behavior (MKTG 711) and Managerial Decision-Making (OPIM 690).",
    "course_id" : "MKTG731",
    "course_level" : "",
    "course_level_description" : "",
    "course_notes" : "Experimental course.",
    "course_number" : "731",
    "course_title" : "The Psychology of Consumer Financial Decisions",
    "crosslistings" : [ {
      "course_id" : "231",
      "section_id" : "",
      "subject" : "MKTG"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Gal Zauberman",
    "prerequisites" : "None",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "L",
    "school_code" : "WH",
    "terms_offered_code" : "C",
    "terms_offered_description" : "One-term course offered either term"
  }, {
    "activities_and_credits" : [ {
      "activity_code" : "SEM",
      "credit" : "1"
    } ],
    "corequisites" : "",
    "course_credit_connector" : "F",
    "course_credit_type" : "CU",
    "course_description" : "This is an interdisciplinary senior seminar for media and business students constructed to discover, analyze and advance revenue models for content online and off. Participants will investigate the history of mass media economics and the effects of digital revolution, with a focus on identifying sustainable solutions. Students completing the class will leave as experts thoroughly grounded in the breadth of the media-financing landscape, prepared and empowered to engineer the media future.",
    "course_id" : "MKTG490",
    "course_level" : "3",
    "course_level_description" : "Advanced",
    "course_notes" : "This course will not count toward the Marketing Concentration elective requirement.",
    "course_number" : "490",
    "course_title" : "Special Topics in Communication: Reinventing the Media Economy -Experiments in Averting E-pocalypse.",
    "crosslistings" : [ {
      "course_id" : "490",
      "section_id" : "",
      "subject" : "COMM"
    } ],
    "department" : "MKTG",
    "department_of_record" : "MKTG",
    "distribution_requirement" : "",
    "eas_credit_factor_code" : "",
    "instructors" : "Bob Garfield",
    "prerequisites" : "",
    "register_subgroup_one" : "",
    "register_subgroup_two" : "",
    "requirements_met" : [ ],
    "scheduling_priority" : "S",
    "school_code" : "WH",
    "terms_offered_code" : "M",
    "terms_offered_description" : "Course not offered every year"
  } ],
  "service_meta" : {
    "current_page_number" : 1,
    "error_text" : "",
    "next_page_number" : 1,
    "number_of_pages" : 1,
    "previous_page_number" : 1,
    "results_per_page" : 999
  }
}
