{"coursehistories": {"path": "/coursehistories/4813"}, "description": "What do you know about Berlin's history, architecture, culture, and political life? The present course will offer a survey of the history of Prussia, beginning with the seventeenth century, and the unification of the small towns of Berlin and koelln to establish a new capital for this country. It will tell the story of Berlin's rising political prominence in the eighteenth century, its transformation into an industrial city in the late nineteenth century, its rise to metropolis in the early twentieth century, its history during the Third Reich, and the post-war cold war period. The course will conclude its historical survey with a consideration of Berlin's position as a capital in reunified Germany. The historical survey will be supplemented by a study of Berlin's urban structre, its significant architecture from the eighteenth century (i.e. Schinkel) to the nineteenth (new worker's housing, garden suburbs) and twentieth centuries (Bauhaus, Speer designs, postwar rebuilding, GDR housing projects, post-unification building boom). In addition, we wil ready literary texts about the city, and consider the visual art and music created in and about Berlin. Indeed, Berlin will be a specific example to explore German history and cultural life of the last 300 years. \n\nThe course will be interdisciplinary with the fields of German Studies, history, history of art, and urban studies. It is also designed as a preparation for undergraduage students who are considering spending a junior semester with the Penn Abroad Program in Berlin. \n\n", "semester": "2012C", "name": "BERLIN: HIST POL CULTURE", "reviews": {"path": "/courses/29033/reviews", "values": [{"ratings": {"rDifficulty": "2.59", "rTAQuality": "2.14", "rStimulateInterest": "3.73", "rCourseQuality": "3.09", "rWorkRequired": "2.68", "rInstructorQuality": "3.63", "rCommAbility": "3.32", "rInstructorAccess": "3.55"}, "section": {"name": "BERLIN: HIST POL CULTURE", "sectionnum": "401", "primary_alias": "GRMN-237-401", "path": "/courses/29033/sections/401", "id": "29033-401", "aliases": ["GRMN-237-401", "COML-237-401", "ARTH-237-401", "HIST-237-401", "URBS-237-401"]}, "comments": "", "num_students": 36, "path": "/courses/29033/sections/401/reviews/1332-LILIANE-WEISSBERG", "instructor": {"path": "/instructors/1332-LILIANE-WEISSBERG", "first_name": "LILIANE", "last_name": "WEISSBERG", "id": "1332-LILIANE-WEISSBERG", "name": "LILIANE WEISSBERG"}, "num_reviewers": 25, "id": "29033-401-1332-LILIANE-WEISSBERG"}]}, "credits": null, "primary_alias": "GRMN-237", "path": "/courses/29033", "sections": {"path": "/courses/29033/sections", "values": [{"name": "BERLIN: HIST POL CULTURE", "sectionnum": "401", "primary_alias": "GRMN-237-401", "path": "/courses/29033/sections/401", "id": "29033-401", "aliases": ["GRMN-237-401", "COML-237-401", "ARTH-237-401", "HIST-237-401", "URBS-237-401"]}]}, "id": 29033, "aliases": ["GRMN-237", "COML-237", "ARTH-237", "HIST-237", "URBS-237"]}