{"coursehistories": {"path": "/coursehistories/3328"}, "description": "This course will examine the evolving nature of local news, with a focus on the economic crisis facing metropolitan newspapers and the effect on the coverage of cities and regions. The course will begin with an analysis of how economic forces have influenced local news coverage over the last century, focusing on the importance of geography and political fragmentation. We will look at how suburbanization and the rise of local TV newscasts affected metropolitan newspapers in the 20th century, and then considered \"local news.\" We will then zero in on the structural transformation that has accelerated in the last year--exacerbated by the economic downturn--which now threatens the existence of many metropolitan newspapers. We will examine new models for producing local news, including freestanding local news websites, \"hyperlocalism,\" citizen-generated content and blogging, and free dailies targeted to young people. \n\nAt the same time, the course will examine how local news affects local government. We will examine the changing professional values and \"standard operating procedures\" of local journalists in the face of new competition and new online news products. We will also consider how local news is influenced by the media strategies (or lack thereof) of local public officials, and the extent to which they are able to understand the economic forces and professional constraints of the reporters who cover them. \n\n", "semester": "2006C", "name": "FUT OF NEWS & YOUNG AUD: The Future of News & the Young Audience", "reviews": {"path": "/courses/8706/reviews", "values": [{"ratings": {"rAmountLearned": "2.60", "rDifficulty": "2.19", "rStimulateInterest": "2.71", "rRecommendMajor": "3.29", "rCourseQuality": "2.76", "rWorkRequired": "2.43", "rInstructorAccess": "3.52", "rReadingsValue": "2.81", "rRecommendNonMajor": "2.19", "rCommAbility": "3.00", "rInstructorQuality": "3.05"}, "section": {"name": "FUT OF NEWS & YOUNG AUD: The Future of News & the Young Audience", "sectionnum": "301", "primary_alias": "COMM-335-301", "path": "/courses/8706/sections/301", "id": "8706-301", "aliases": ["COMM-335-301"]}, "comments": "Reviewers thought this class was excellent and quite informative, and were especially enthusiastic about the guest speakers. Other students thought the class was sometimes repetitive.", "num_students": 25, "path": "/courses/8706/sections/301/reviews/3249-PHYLLIS-C-KANISS", "instructor": {"path": "/instructors/3249-PHYLLIS-C-KANISS", "first_name": "PHYLLIS C", "last_name": "KANISS", "id": "3249-PHYLLIS-C-KANISS", "name": "PHYLLIS C KANISS"}, "num_reviewers": 21, "id": "8706-301-3249-PHYLLIS-C-KANISS"}]}, "credits": null, "primary_alias": "COMM-335", "path": "/courses/8706", "sections": {"path": "/courses/8706/sections", "values": [{"name": "FUT OF NEWS & YOUNG AUD: The Future of News & the Young Audience", "sectionnum": "301", "primary_alias": "COMM-335-301", "path": "/courses/8706/sections/301", "id": "8706-301", "aliases": ["COMM-335-301"]}]}, "id": 8706, "aliases": ["COMM-335"]}