[{"ratings": {"rAmountLearned": "2.76", "rDifficulty": "2.71", "rStimulateInterest": "3.00", "rRecommendMajor": "2.81", "rCourseQuality": "2.67", "rWorkRequired": "2.55", "rInstructorAccess": "2.76", "rReadingsValue": "2.33", "rRecommendNonMajor": "2.71", "rCommAbility": "3.05", "rInstructorQuality": "3.00"}, "section": {"name": "INTRO AFRICANA STUDIES", "sectionnum": "401", "primary_alias": "AFRC-001-401", "path": "/courses/26911/sections/401", "id": "26911-401", "aliases": ["AFRC-001-401", "ARTH-005-401"]}, "comments": "The aim of this course is to provide an interdisciplinary examination of the complex array of African American and other African Diaspora social practices and experiences. This class will focus on both classic texts and modern works that provide an introduction to the dynamics of African American and African Diaspora thought and practice. Topics include: What is Afro-American Studies?; The History Before 1492; Creating the African Diaspora After 1500; The Challenge of Freedom; Race, Gender and Class in the 20th Century; From Black Studies to Africana Studies: The Future of Afro-American Studies.\r\n\r\nStudents found this course to be an “interesting introduction” to a variety of subjects pertaining African American studies.  Participants especially enjoyed the way various approaches converged on a central theme.  However, students found the course “disorganized at times” and did not value the readings as highly as the lectures.\r\n\r\nProfessor Shaw was generally described as an “interesting” lecturer.  However, some students felt his focus on art detracted slightly from the overall aims of the course.  Furthermore, some students did not feel he expressed his expectations for assignments clearly enough.\r\n\r\nStudents generally found this course more challenging than they anticipated.  Some noted that the “weighting” of tests disadvantaged the students.  Many also claimed that workload was “excessive,” albeit interesting.  Class members came from a variety of majors, but most said they would recommend the course far more strongly to Africana Studies or Art History majors than other students.", "num_students": 32, "path": "/courses/26911/sections/401/reviews/2862-GWENDOLYN-D-SHAW", "instructor": {"path": "/instructors/2862-GWENDOLYN-D-SHAW", "first_name": "GWENDOLYN D", "last_name": "SHAW", "id": "2862-GWENDOLYN-D-SHAW", "name": "GWENDOLYN D SHAW"}, "num_reviewers": 25, "id": "26911-401-2862-GWENDOLYN-D-SHAW"}]