[{"ratings": {"rAmountLearned": "2.19", "rDifficulty": "2.56", "rStimulateInterest": "1.74", "rRecommendMajor": "2.10", "rCourseQuality": "1.91", "rWorkRequired": "3.02", "rInstructorAccess": "2.56", "rReadingsValue": "1.81", "rRecommendNonMajor": "2.05", "rCommAbility": "2.42", "rInstructorQuality": "2.09"}, "section": {"name": "RENEW ENERGY&IT'S IMPACT", "sectionnum": "401", "primary_alias": "EAS-402-401", "path": "/courses/15577/sections/401", "id": "15577-401", "aliases": ["EAS-402-401", "EAS-502-401"]}, "comments": "The objective of this course is to introduce students to the major aspects of renewable energy, with its foundations in technology, association to economics, and impacts on ecology and society. This introduction is intended both for general education and awareness and for preparation for careers related to this field. The course spans from basic principles to applications. A review of solar, wind, biomass, hydroelectric, geothermal energy, and prospects for future energy systems such as renewable power generation in space.\r\n\r\nStudents typically found the course to be “engaging” and “interesting.” Many cited a heavy focus on calculations and quantitative analysis, rather than conceptual understanding of the material. As a result, many felt the class was geared more for engineers than non-engineers, in opposition with the course description.\r\n\r\nMost students felt that Professor Lior had “command of the subject matter” and was “highly knowledgeable,” but did not explain core engineering principles, making the course very difficult for non-engineering majors.\r\n\r\nMany students found the course to be very difficult and a lot of work. Many students felt that the grading structure was vague and that the course was heavily focused on calculations rather than theory. The class was aimed for all majors at Penn, but many non-engineering students in the class felt that the subject matter put them at an inherent disadvantage.", "num_students": 45, "path": "/courses/15577/sections/401/reviews/776-NOAM-LIOR", "instructor": {"path": "/instructors/776-NOAM-LIOR", "first_name": "NOAM", "last_name": "LIOR", "id": "776-NOAM-LIOR", "name": "NOAM LIOR"}, "num_reviewers": 45, "id": "15577-401-776-NOAM-LIOR"}]