[{"ratings": {"rAmountLearned": "2.90", "rDifficulty": "3.34", "rStimulateInterest": "3.15", "rRecommendMajor": "3.12", "rCourseQuality": "2.82", "rWorkRequired": "3.12", "rInstructorAccess": "3.05", "rReadingsValue": "2.73", "rRecommendNonMajor": "1.10", "rCommAbility": "3.22", "rInstructorQuality": "3.27"}, "section": {"name": "ADV TPC IN PHYS/CHEM BE", "sectionnum": "001", "primary_alias": "BE-324-001", "path": "/courses/22685/sections/001", "id": "22685-001", "aliases": ["BE-324-001"]}, "comments": "This course covers advanced topics in physical chemistry including solution and colloid chemistry, electrochemistry, surface phenomena, and macromolecules applied to biological systems. Junior standing is required for this course.\r\n\r\nMany students reported that during class there was so much copying from the board that needed to be done that there was very little time to “actually absorb the concepts.” Several students felt that the test and homework questions were difficult, but reported that the class “usually [covered] the course material well.” However, some felt that the homework and the example problems were “miles apart in difficulty.” Many students had trouble understanding how the physical chemistry they learned about in the course “[connected] to real world situations.” At the same time, they felt that “[the] emphasis on biological examples in a physical chemistry course was very illuminating and refreshing.” \r\n\r\nThe general opinion towards Dr Hammer was a positive one. Many students claimed that he was the best teacher they'd had at Penn. They described him as an “effective and engaging lecturer” and reported that he was able to effectively explain concepts and “[convey] the subject matter” to them. His availability outside of the classroom, in office hours, and during review sessions was very much appreciated. The only complaints were that at times the professor seemed to display a lack of professionalism, and he sometimes “[failed] to relate the significance of formulas in terms of their conceptual meanings.”\r\n\r\nOverall, students considered this to be a good course because the instructor was good at explaining course content, was accessible for help, and was able to stimulate students’ interest in the material, even those who didn't like chemistry. Many students reported that the course was quite difficult and required a lot of work. This course is required for all BE majors, and it wasn’t recommended to non-majors.\r\n", "num_students": 48, "path": "/courses/22685/sections/001/reviews/160-DANIEL-A--HAMMER", "instructor": {"path": "/instructors/160-DANIEL-A--HAMMER", "first_name": "DANIEL A.", "last_name": "HAMMER", "id": "160-DANIEL-A--HAMMER", "name": "DANIEL A. HAMMER"}, "num_reviewers": 45, "id": "22685-001-160-DANIEL-A--HAMMER"}, {"ratings": {"rAmountLearned": "2.59", "rDifficulty": "3.68", "rStimulateInterest": "2.30", "rRecommendMajor": "3.12", "rCourseQuality": "2.47", "rWorkRequired": "2.79", "rInstructorAccess": "3.00", "rReadingsValue": "2.53", "rRecommendNonMajor": "1.09", "rCommAbility": "2.68", "rInstructorQuality": "2.82"}, "section": {"name": "ADV TPC IN PHYS/CHEM BE", "sectionnum": "002", "primary_alias": "BE-324-002", "path": "/courses/22685/sections/002", "id": "22685-002", "aliases": ["BE-324-002"]}, "comments": "This class covers advanced topics in physical chemistry, including solution and colloid chemistry, electrochemistry, surface phenomena, and macromolecules applied to biological systems. \r\n\r\nMost students felt that the course material was “incredibly challenging,” with many calling it “the most difficult class” they had taken at Penn. According to many, the material was “extremely dense” and “[took] time to master it.” Exams and quizzes in the class are open-note and many students found them to be “difficult” yet “fair.” Several noted that the lectures were fast paced and “non-stop.” One student stated, “more in class examples would be more helpful” in understanding the theories. \r\n\r\nMany students were grateful for Dr. Radhakrishnan’s help. They felt that he “helped make the material extremely interesting” and “accessible to everyone.” Students generally agreed that the professor was able to “clarify things exceptionally well” and did “his best” to make the material “approachable for the class.” One student claimed that Dr. Radhakrishnan was “the best professor I have had at Penn.” Many credit his “willingness to help” as a primary reason for their understanding of the material. Students describe him as “fantastic,” “interesting,” “engaging,” and “knowledgeable.”\r\n", "num_students": 46, "path": "/courses/22685/sections/002/reviews/2874-RAVI-RADHAKRISHNAN", "instructor": {"path": "/instructors/2874-RAVI-RADHAKRISHNAN", "first_name": "RAVI", "last_name": "RADHAKRISHNAN", "id": "2874-RAVI-RADHAKRISHNAN", "name": "RAVI RADHAKRISHNAN"}, "num_reviewers": 38, "id": "22685-002-2874-RAVI-RADHAKRISHNAN"}]