[{"ratings": {"rAmountLearned": "2.65", "rDifficulty": "2.47", "rStimulateInterest": "2.90", "rRecommendMajor": "3.40", "rCourseQuality": "2.84", "rWorkRequired": "2.86", "rInstructorAccess": "2.76", "rReadingsValue": "2.61", "rRecommendNonMajor": "2.55", "rCommAbility": "3.08", "rInstructorQuality": "3.10"}, "section": {"name": "ANCIENT ROME", "sectionnum": "401", "primary_alias": "ANCH-027-401", "path": "/courses/26933/sections/401", "id": "26933-401", "aliases": ["ANCH-027-401", "HIST-027-401"]}, "comments": "The Roman Empire was one of the few great world states—one that unified a large area around the Mediterranean Sea—an area never subsequently united as part of a single state. Whereas the great achievements of the Greeks were in the realm of ideas and concepts (democracy, philosophy, art, literature, drama) those of the Romans tended to be in the pragmatic spheres of ruling and controlling subject peoples and integrating them under the aegis of an imperial state. Conquest, warfare, administration, and law making were the great successes of the Roman state. This course looks at this process from its inception and traces the formation of Rome's Mediterranean empire over the last three centuries BC; it then considesr the social, economic and political consequences of this great achievement, especially the great political transition from the Republic (rule by the Senate) to the Principate (rule by emperors). The course also considers limitations to Roman power and various types of challenges, military, cultural, and religious, to the hegemony of the Roman state. Finally, students try to understand the process of the development of a distinctive Roman culture from the emergence new forms of literature, like satire, to the gladiatorial arena as typical elements that contributed to a Roman social order. \r\n\r\nReviews of this course were overwhelmingly positive. One student even proclaimed, “This was the best class I’ve taken in my entire life.” Students commented that for the amount that they ended up learning, it was well worth it to do all the readings and attend all the lectures. One student also enjoyed “the emphasis on concepts and themes rather than just slogging through the history in a chronological manner.” \r\n\r\nProfessor Grey is described by many of his students as a phenomenal lecturer whose “enthusiasm is clearly evident.” Professor Grey is also praised by several students for not just lecturing, but also opening up the class to questions and involved discussion. Finally, several students appreciated that Professor Grey was very approachable outside of class and supportive of his students.  \r\n\r\nMost of the complaints lodged against the course had to do with the work it required. A few students commented that the readings seemed to be tangential to the main focus of the course. Many students also expressed that the amount of work was copious and unreasonable. However, another student countered that the readings were, “crucial for a full understanding of the course.” In addition, while some students warned that students should only take this course if they have a very genuine interest in learning about Ancient Rome, other students said they would recommend the course to anyone. One previously non-Ancient Studies major reflected, “This course influenced me to change my major entirely from systems engineering to history.” This course fulfills the History & Tradition Sector requirement.", "num_students": 155, "path": "/courses/26933/sections/401/reviews/2844-CAMPBELL-AINSWORTH-GREY", "instructor": {"path": "/instructors/2844-CAMPBELL-AINSWORTH-GREY", "first_name": "CAMPBELL AINSWORTH", "last_name": "GREY", "id": "2844-CAMPBELL-AINSWORTH-GREY", "name": "CAMPBELL AINSWORTH GREY"}, "num_reviewers": 128, "id": "26933-401-2844-CAMPBELL-AINSWORTH-GREY"}]