{"coursehistories": {"path": "/coursehistories/4535"}, "description": "What are the basic mathematical concepts and techniques needed in computer science? This course provides an introduction to proof principles and logics, functions and relations, induction principles, combinatorics and graph theory, as well as a rigorous grounding in writing and reading mathematical proofs. \n\n", "semester": "2010A", "name": "MATH FOUND COMP SCI", "reviews": {"path": "/courses/25796/reviews", "values": [{"ratings": {"rAmountLearned": "1.95", "rDifficulty": "2.78", "rStimulateInterest": "0.70", "rRecommendMajor": "2.54", "rCourseQuality": "1.45", "rWorkRequired": "2.56", "rInstructorAccess": "2.08", "rReadingsValue": "2.23", "rRecommendNonMajor": "0.70", "rCommAbility": "0.86", "rInstructorQuality": "1.02"}, "section": {"name": "MATH FOUND COMP SCI", "sectionnum": "001", "primary_alias": "CIS-160-001", "path": "/courses/25796/sections/001", "id": "25796-001", "aliases": ["CIS-160-001"]}, "comments": "This course, titled “Mathematical Foundations of Computer Science, introduces basic mathematical concepts utilized in computer science. Topics discussed include proof principles and logic, functions and relations, induction principles, and combinatorics and graph theory.\r\n\r\nStudents expressed difficulty understanding the correlation between the material presented in this class and computer science, and desired that the class focus more on “concepts most relevant to computer science.”\r\n\r\nOverall, students were unsatisfied with Professor Nenkova’s presentation of class material, with several lamenting that her lectures were “unhelpful,” “insipid” or “condescending.” Students were especially troubled when she “called out students” to answer questions and “publicly embarrassed them” for incorrect responses. However, a few students pointed out that the TAs were pleasant and helpful.\r\n\r\nStudents did not report unusual difficulties with completing homework, but many complained that the exam grading gave partial credit too infrequently. Students felt that this grading scheme made “memorizing the material” more important than understanding concepts.\r\n", "num_students": 49, "path": "/courses/25796/sections/001/reviews/4282-ANI-NENKOVA", "instructor": {"path": "/instructors/4282-ANI-NENKOVA", "first_name": "ANI", "last_name": "NENKOVA", "id": "4282-ANI-NENKOVA", "name": "ANI NENKOVA"}, "num_reviewers": 47, "id": "25796-001-4282-ANI-NENKOVA"}]}, "credits": null, "primary_alias": "CIS-160", "path": "/courses/25796", "sections": {"path": "/courses/25796/sections", "values": [{"name": "MATH FOUND COMP SCI", "sectionnum": "001", "primary_alias": "CIS-160-001", "path": "/courses/25796/sections/001", "id": "25796-001", "aliases": ["CIS-160-001"]}]}, "id": 25796, "aliases": ["CIS-160"]}