[{"ratings": {"rAmountLearned": "3.67", "rDifficulty": "3.63", "rStimulateInterest": "3.64", "rRecommendMajor": "3.64", "rCourseQuality": "3.41", "rWorkRequired": "4.00", "rInstructorAccess": "3.03", "rReadingsValue": "2.34", "rRecommendNonMajor": "2.06", "rCommAbility": "3.17", "rInstructorQuality": "3.40"}, "section": {"name": "DSGN OF MECHATRONIC SYS", "sectionnum": "401", "primary_alias": "MEAM-410-401", "path": "/courses/24723/sections/401", "id": "24723-401", "aliases": ["MEAM-410-401", "MEAM-510-401"]}, "comments": "In many modern systems, mechanical elements are tightly coupled with electronic\r\ncomponents and embedded computers. Mechatronics is the study of how these domains\r\nare interconnected, and this hands-on, project-based course provides an integrated\r\nintroduction to the fundamental components within each of the three domains, including:\r\nmechanical elements (prototyping, materials, actuators and sensors, transmissions, and\r\nfundamental kinematics), electronics (basic circuits, filters, op amps, discrete logic, and\r\ninterfacing with mechanical elements), and computing (interfacing with the analog world,\r\nmicroprocessor technology, basic control theory, and programming).\r\nStudents generally found this course \"tough, but it's probably one of the most\r\nrewarding classes at Penn\" because they \"felt that they could come in knowing very little\r\nand gain a workable understanding of complex subject material.\" Many others\r\nemphasized that they had \"learned a lot hands-on and practical skills.\" One student\r\ncommented that \"the course provides an ideal setting for integrating concepts from all the\r\nvarious courses one might have taken and applying those theories.\"\r\nStudents found Professor Fiene a good professor and one student commented that\r\n\"Professor Fiene's ability to come up with such fun and interesting projects is\r\nastounding.\" Students felt that learned a lot of useful and practical information from\r\nProfessor Fiene's class.\r\nMost students felt that the course \"requires a large time investment, but the effort\r\nis appropriate for the depth and importance of the material and the educational value of\r\nthe course.\" Students recommended this class to anyone interested in Robotics and\r\nMechatronics, but to be aware that the course \"requires a lot of time.\" Some prerequisites\r\nfor this class exist; students must be in Junior or Senior standing in MEAM and have\r\nsome programming background.", "num_students": 82, "path": "/courses/24723/sections/401/reviews/3916-JONATHAN-FIENE", "instructor": {"path": "/instructors/3916-JONATHAN-FIENE", "first_name": "JONATHAN", "last_name": "FIENE", "id": "3916-JONATHAN-FIENE", "name": "JONATHAN FIENE"}, "num_reviewers": 72, "id": "24723-401-3916-JONATHAN-FIENE"}]