[{"ratings": {"rAmountLearned": "3.81", "rDifficulty": "2.88", "rStimulateInterest": "3.74", "rRecommendMajor": "3.83", "rCourseQuality": "3.51", "rWorkRequired": "2.50", "rInstructorAccess": "3.50", "rReadingsValue": "3.57", "rRecommendNonMajor": "3.36", "rCommAbility": "3.71", "rInstructorQuality": "3.71"}, "section": {"name": "EMERGING ECONOMIES", "sectionnum": "001", "primary_alias": "LGST-216-001", "path": "/courses/24642/sections/001", "id": "24642-001", "aliases": ["LGST-216-001"]}, "comments": "Legal Studies 216 explores important issues in conducting business internationally in, and with, emerging economies. Much of the course attempts to define emerging economies and to understand the changes occurring in these countries. The course also examines the position of emerging economies in the global context, and how broad social issues affect the development of emerging economies and the ability to establish relationships or conduct business in emerging economies.\r\n\r\nStudents said the course “challenges the way you think” and that they found it “full of great material.”  Another student said that the content learned “will help in life regardless of what you eventually decide to pursue,” making this course recommended to both majors and non-majors. A majority of students thought the class was very interesting and engaging. One student found the “course concepts very worthwhile” and described the course as the only class in which “every reading is relevant.”\r\n\r\nStudents had positive reviews for Professor Nichols. A student found that Professor Nichols “cares very much about the course and about his students” and that his “Socratic approach to teaching” encourages “students to think critically about the material.” One student summarized Professor Nichols’ style as “very non-traditional” and found his “unorthodox method of teaching” daunting early on in the course.  Throughout the semester, Professor Nichols engaged in cold calls, which numerous students found “intimidating.” Professor Nichols was described by nearly all of his students as “very strict about things like tardiness and completing all of the readings.”  Some students believed that this encouraged students to engage in the class discussions.  Students praised Professor Nichols for his accessibility. Professor Nichols “encouraged students to ask questions where possible” and “to attend his office hours,” which were described by several students as “extremely helpful.”  Students praised Professor Nichols’ experience doing fieldwork all around the world, which one student said “added a lot to his perspective.”  His teaching style does encourage the class, in one student’s opinion, to form “a very strong bond” and noticed that Professor Nichols, by the end of the semester, had “established a very strong rapport within the class.”  \r\n\r\nThe readings were described as very useful and “not incredibly time-consuming.” While some readings are “dense and difficult to fully understand,” Professor Nichols is credited with doing “an excellent job of explaining and putting them into context.”  The exams were “fair” and often “open note,” so that adequate preparation made them manageable.  This course is highly recommended for both majors and non-majors.\r\n", "num_students": 48, "path": "/courses/24642/sections/001/reviews/1540-PHILIP-M-NICHOLS", "instructor": {"path": "/instructors/1540-PHILIP-M-NICHOLS", "first_name": "PHILIP M", "last_name": "NICHOLS", "id": "1540-PHILIP-M-NICHOLS", "name": "PHILIP M NICHOLS"}, "num_reviewers": 45, "id": "24642-001-1540-PHILIP-M-NICHOLS"}]