[{"ratings": {"rAmountLearned": "2.64", "rDifficulty": "2.73", "rStimulateInterest": "2.93", "rRecommendMajor": "3.09", "rCourseQuality": "2.53", "rWorkRequired": "2.62", "rInstructorAccess": "3.22", "rReadingsValue": "2.36", "rRecommendNonMajor": "1.67", "rCommAbility": "2.93", "rInstructorQuality": "3.04"}, "section": {"name": "CONTROL OF SYSTEMS", "sectionnum": "401", "primary_alias": "ESE-406-401", "path": "/courses/25995/sections/401", "id": "25995-401", "aliases": ["ESE-406-401", "MEAM-513-401", "ESE-505-401"]}, "comments": "This course covers the basic methods for analysis and design of feedback control in systems and applications to practical systems. Methods presented include time response analysis, frequency response analysis, root locus, Nyquist and Bode plots, and the state-space approach.\r\n\r\nStudents praised this course as a “very good course of being exposed to undergraduate level control theory.” Graduate students noted that it helped “lay a good foundation” for future graduate level controls courses.\r\n\r\nStudents noted that Professor Kothmann’s “enthusiasm for the subject is commendable – he is extremely approachable and helpful.” One student noted that he “takes great pain to explain the practical meaning of every single equation.” Another noted that he does “a good job of connecting theory back to real-life examples.” Several students noted that you could quickly be left behind; however, he is very open to questions and emails.\r\n\r\nMany students had difficulty with the cross listing of the class as both graduate and undergraduate. Students thought that this course should be required for MEAM and ESE majors alike. However, some thought that there were too many mechanical engineering examples and thought that the course should focus more on electrical engineering. ", "num_students": 83, "path": "/courses/25995/sections/401/reviews/3294-BRUCE-D--KOTHMANN", "instructor": {"path": "/instructors/3294-BRUCE-D--KOTHMANN", "first_name": "BRUCE D.", "last_name": "KOTHMANN", "id": "3294-BRUCE-D--KOTHMANN", "name": "BRUCE D. KOTHMANN"}, "num_reviewers": 69, "id": "25995-401-3294-BRUCE-D--KOTHMANN"}]