{"coursehistories": {"path": "/coursehistories/4418"}, "description": "This course approaches some of today's important social and political issues from a sociological vantage point. The course begins by asking where social problems come from. The main sociological perspectives of Marx, Weber and Durkheim are developed in connection with the issues of inequality, social conflict and community. We then turn to the social construction of social problems by examining how various issues become defined as social problems. This involves a consideration of the role of the media, social experts and social movements. The last section of the course considers how social problems are addressed. Here we discuss the relative strengths and weaknesses of government programs and regulations versus market-based approached. We also discuss the role of philanthropy and volunteerism. Finally, we consider the risk of unanticipated consequences of reforms. Along the way, we will consider a variety of social issues and social and social problems, including poverty, immigration, crime, global warming, and education. \n\n", "semester": "2011C", "name": "SOCIAL PROB & PUB POLICY", "reviews": {"path": "/courses/25105/reviews", "values": [{"ratings": {"rAmountLearned": "2.23", "rDifficulty": "1.85", "rStimulateInterest": "2.27", "rRecommendMajor": "2.98", "rCourseQuality": "2.44", "rWorkRequired": "1.80", "rInstructorAccess": "2.83", "rReadingsValue": "2.12", "rRecommendNonMajor": "2.56", "rCommAbility": "2.76", "rInstructorQuality": "2.64"}, "section": {"name": "SOCIAL PROB & PUB POLICY", "sectionnum": "301", "primary_alias": "SOCI-002-301", "path": "/courses/25105/sections/301", "id": "25105-301", "aliases": ["SOCI-002-301"]}, "comments": "Sociology 002 approaches some of today's important social and political issues from a sociological vantage point. The course begins by asking where social problems come from. The main sociological perspectives of Marx, Weber and Durkheim are developed in connection with the issues of inequality, social conflict and community. The social construction of social problems is discussed by examining how various issues become defined as social problems. This involved a consideration of the role of the media, social experts and social movements. The last section of the course considered how social problems are addressed. Here, the relative strengths and weaknesses of government programs and regulations versus market-based approached are discussed. The role of philanthropy and volunteerism is also discussed. Finally, the risk of unanticipated consequences of reforms is considered. Along the way, a variety of social issues and social and social problems, including poverty, immigration, crime, global warming, and education are considered.\r\nIn general, students found the class to be “interesting,” but at times “dull”. Many found that they were not stimulated enough. \r\nProfessor Jacobs was enthusiastic about the material and was considered a “great” professor by most. \r\nThe class is recommended to non-majors and majors alike. Students commented that it would be a great class to take as a GPA-booster. \r\n", "num_students": 59, "path": "/courses/25105/sections/301/reviews/1092-JERRY-A-JACOBS", "instructor": {"path": "/instructors/1092-JERRY-A-JACOBS", "first_name": "JERRY A", "last_name": "JACOBS", "id": "1092-JERRY-A-JACOBS", "name": "JERRY A JACOBS"}, "num_reviewers": 52, "id": "25105-301-1092-JERRY-A-JACOBS"}]}, "credits": null, "primary_alias": "SOCI-002", "path": "/courses/25105", "sections": {"path": "/courses/25105/sections", "values": [{"name": "SOCIAL PROB & PUB POLICY", "sectionnum": "301", "primary_alias": "SOCI-002-301", "path": "/courses/25105/sections/301", "id": "25105-301", "aliases": ["SOCI-002-301"]}]}, "id": 25105, "aliases": ["SOCI-002"]}