[{"ratings": {"rAmountLearned": "3.09", "rDifficulty": "1.97", "rStimulateInterest": "3.74", "rRecommendMajor": "3.52", "rCourseQuality": "3.31", "rWorkRequired": "2.47", "rInstructorAccess": "3.85", "rReadingsValue": "3.52", "rRecommendNonMajor": "3.15", "rCommAbility": "3.64", "rInstructorQuality": "3.69"}, "section": {"name": "GENDER,SEXUALITY & LIT", "sectionnum": "401", "primary_alias": "ENGL-090-401", "path": "/courses/22965/sections/401", "id": "22965-401", "aliases": ["ENGL-090-401", "GSOC-090-401"]}, "comments": "This class charts a history of writing by American women, beginning just before the American Revolution, and continuing to the present. It considers the diverse ways these women addressed issues of national and gender identity. It examines how women negotiated between the two, particularly during periods in which women were legally excluded from certain kinds of participation in the national and political spheres due to their gender and/or race. Though the class has a longer historical sweep, it focuses primarily on the late nineteenth and early twentieth centuries and includes poetry, novels, short stories, and some selected journalism and critical texts. Class requirements include three short (2-3 pages) essays, a final 5-7 page essay, and a final exam.&#8232;&#8232;\r\n\r\nStudents had a “mutual respect and interest for what is being taught.” Overall, they agreed that the class was “fantastic.” Students found the course and texts unique and interesting. The class is large and discussion based, which made students feel that the conversation didn't go in depth enough. Most students thought that the course would benefit from smaller class sizes.&#8232;\r\n\r\n&#8232;Professor Edwards is described as “enthusiastic,” “knowledgeable,” and good at connecting with the class.” Students had nothing but good things to say about the professor. They note that he always sparks student interest when discussions fall flat and that he is “personable” and “really fun and nice guy.”&#8232;&#8232;\r\n\r\nAlthough there was a lot of reading in the class, students expressed that it was “assigned in reasonable amounts.” The majority of the students in the class were freshman. One student said that she “took the class to fulfill a requirement and ended up changing to an English major because of it.”\r\n", "num_students": 38, "path": "/courses/22965/sections/401/reviews/2448-JEFFREY-A-EDWARDS", "instructor": {"path": "/instructors/2448-JEFFREY-A-EDWARDS", "first_name": "JEFFREY A", "last_name": "EDWARDS", "id": "2448-JEFFREY-A-EDWARDS", "name": "JEFFREY A EDWARDS"}, "num_reviewers": 36, "id": "22965-401-2448-JEFFREY-A-EDWARDS"}]