[{"ratings": {"rAmountLearned": "3.02", "rDifficulty": "2.90", "rStimulateInterest": "2.90", "rRecommendMajor": "3.73", "rCourseQuality": "2.91", "rWorkRequired": "3.02", "rInstructorAccess": "3.33", "rReadingsValue": "2.56", "rRecommendNonMajor": "1.33", "rCommAbility": "3.02", "rInstructorQuality": "3.26"}, "section": {"name": "MATERIAL&ENERGY BALANCES", "sectionnum": "001", "primary_alias": "CBE-230-001", "path": "/courses/17058/sections/001", "id": "17058-001", "aliases": ["CBE-230-001"]}, "comments": "This course introduces the principles of material and energy balance and their applications to the analysis of single- and multiple-phase processes used in the chemical, pharmaceutical, and environmental industries. The course focuses on the conceptual understanding of properties of pure fluids, equations of state, and heat effects accompanying phase changes and chemical reactions. Problem-solving skills needed to solve a wide range of realistic, process-related problems are also covered.\r\n\r\nStudents found the course material to be “really useful,” although one remarked that the “nut-and-bolts” nature of the material made the course “monotonous at times.” Students felt that the material was entirely necessary for the major.\r\n\r\nStudents regarded Professor Shieh as an excellent teacher, who shows passion and dedication for what he’s teaching. His recitations were found to be “incredibly helpful,” and his explanations and teaching styles made the material “both interesting and easy to understand.” Students also found Professor Shieh to be accessible and helpful for questions. \r\n\r\nStudents felt prepared for the examinations and were pleased with the medium workload required for the course, although individual learning is sometimes required. Students appreciated the exams as well, one remarking that they “force you to fully demonstrate confidence without placing undue emphasis on time or tricks.” There was disdain for the Koretsky textbook (“Engineering and Chemical Thermodynamics”). This course is required for CBE sophomores.\r\n", "num_students": 55, "path": "/courses/17058/sections/001/reviews/1168-WEN-K-SHIEH", "instructor": {"path": "/instructors/1168-WEN-K-SHIEH", "first_name": "WEN K", "last_name": "SHIEH", "id": "1168-WEN-K-SHIEH", "name": "WEN K SHIEH"}, "num_reviewers": 53, "id": "17058-001-1168-WEN-K-SHIEH"}]