[{"ratings": {"rAmountLearned": "2.30", "rDifficulty": "2.47", "rStimulateInterest": "2.19", "rRecommendMajor": "2.60", "rCourseQuality": "2.22", "rWorkRequired": "2.77", "rInstructorAccess": "2.54", "rReadingsValue": "2.43", "rRecommendNonMajor": "1.87", "rCommAbility": "2.53", "rInstructorQuality": "2.42"}, "section": {"name": "MODERN JAPANESE HIST", "sectionnum": "401", "primary_alias": "HIST-091-401", "path": "/courses/15890/sections/401", "id": "15890-401", "aliases": ["HIST-091-401", "EALC-071-401"]}, "comments": "This course will survey the major political, economic, social, and intellectual trends responsible for the making of modern Japan. Special emphasis will be given to the turbulent relationship between state and society from 1800 to present.&#8232;&#8232;\r\nStudents found this course to be “very interesting.” Assigned novels made “good supplements” and were “interesting” from a cultural standpoint, but essay prompts and most other assignments were “not useful.” The midterm exam “required more memorization than analysis,” and many felt they had to cram because the post-WWII material seemed “rushed.” Despite this, students reported that they “truly learned a lot” and enjoyed exploring a new topic.\r\n&#8232;&#8232;Professor Dickinson is “very knowledgeable,” and “passionate about Japan.” Some felt he conveyed the material in a “stimulating manner” by exploring from multiple perspectives. His enthusiasm and interest in the subject matter is contagious. He “lives, breathes, and seems to function on a day-to-day basis solely on modern Japanese politics.” Some students found this to be “engaging” while others believe it inspired him to “go on tangents.” He had a “tendency to rant on unrelated topics” at the expense of course material; for this reason, some students found his lecture style “hard to follow.” Further more, he wasted time on administrative issues so that “15-30 minutes of every class goes by” before the real lecture begins. &#8232;&#8232;\r\nThis class may not be for those without any interest in history. Very few students were troubled by the workload, but they did express a desire for “a little less writing” and perhaps an accompanying recitation. While some “did not find this course stimulating at all,” others called it “interesting” and “a delight.”", "num_students": 55, "path": "/courses/15890/sections/401/reviews/619-FREDERICK-R--DICKINSON", "instructor": {"path": "/instructors/619-FREDERICK-R--DICKINSON", "first_name": "FREDERICK R.", "last_name": "DICKINSON", "id": "619-FREDERICK-R--DICKINSON", "name": "FREDERICK R. DICKINSON"}, "num_reviewers": 51, "id": "15890-401-619-FREDERICK-R--DICKINSON"}]