{"coursehistories": {"path": "/coursehistories/866"}, "description": "The course is devoted to the study of the strategic use of information and the related role of information technology. The topics of the course vary year to year, but generally include current issues in selling digital products, intermediation, and disintermediation, designing and competing in electronic markets, outsourcing, and technology project management. Heavy emphasis is placed on utilizing information economics to analyze new and existing businesses in information-intensive industries. Technology skills are not required, although a background in information technology management (equivalent to OPIM210), strategic management or managerial economics is helpful. \n\n", "semester": "2012A", "name": "INFO STRAT&ECON", "reviews": {"path": "/courses/27966/reviews", "values": [{"ratings": {"rAmountLearned": "3.47", "rDifficulty": "2.68", "rStimulateInterest": "3.53", "rRecommendMajor": "3.61", "rCourseQuality": "3.53", "rWorkRequired": "1.94", "rInstructorAccess": "3.57", "rReadingsValue": "3.03", "rRecommendNonMajor": "3.10", "rCommAbility": "3.53", "rInstructorQuality": "3.69"}, "section": {"name": "INFO STRAT&ECON", "sectionnum": "001", "primary_alias": "OPIM-469-001", "path": "/courses/27966/sections/001", "id": "27966-001", "aliases": ["OPIM-469-001"]}, "comments": "OPIM 469 is devoted to the strategic use of information and the related role of information technology. Although the topics of the course vary from year to year, topics covered generally include current issues in selling digital products, intermediation, and disintermediation, designing and competing in electronic markets, outsourcing, and technology project management. The course places heavy emphasis on utilizing information economics to analyze new and existing businesses in information-intensive industries.\r\n\r\nOverall, this course was described as being challenging, yet rewarding. The challenging aspect comes from the large number of suggested readings, and a few students found it difficult to focus on key concepts. Nonetheless, the course was described as rewarding, with one student saying it was \"eye-opening\" and the \"best class I've taken at Penn.\" This is mainly because the class does not emphasize memorizing small details and regurgitating definitions but instead, on developing critical thinking skills around the issue of information products and strategy that students can apply in any situation.  \r\n\r\nThe majority of the students had nothing but high regards for Professor Hitt. He is described as a \"brilliant\" and \"engaging\" professor who cares very much about the success of his students. According to one student, \"Professor Hitt is always well prepared to lead engaging and insightful lectures. He was always easy to work with he genuinely cared about improving the students' experience with the material.\" However, one complaint that a few students had was that the professor glossed over a few slides and did not make it clear which readings were required and which weren't, making it hard to study for the exams.\r\n\r\nThe class is recommended for anyone interested in the subject of information technology, especially for those who are interested in tech consulting, due to the interesting material and the great professor. Although there are no prerequisites, a background in information technology (equivalent to OPIM 210), strategic management or managerial economics is helpful.\r\n", "num_students": 40, "path": "/courses/27966/sections/001/reviews/938-LORIN-M--HITT", "instructor": {"path": "/instructors/938-LORIN-M--HITT", "first_name": "LORIN M.", "last_name": "HITT", "id": "938-LORIN-M--HITT", "name": "LORIN M. HITT"}, "num_reviewers": 36, "id": "27966-001-938-LORIN-M--HITT"}]}, "credits": null, "primary_alias": "OPIM-469", "path": "/courses/27966", "sections": {"path": "/courses/27966/sections", "values": [{"name": "INFO STRAT&ECON", "sectionnum": "001", "primary_alias": "OPIM-469-001", "path": "/courses/27966/sections/001", "id": "27966-001", "aliases": ["OPIM-469-001"]}]}, "id": 27966, "aliases": ["OPIM-469"]}