[{"ratings": {"rAmountLearned": "2.95", "rDifficulty": "2.24", "rStimulateInterest": "3.43", "rRecommendMajor": "3.58", "rCourseQuality": "3.19", "rWorkRequired": "2.07", "rInstructorAccess": "3.47", "rReadingsValue": "2.52", "rRecommendNonMajor": "3.15", "rCommAbility": "3.44", "rInstructorQuality": "3.50"}, "section": {"name": "INTRO.POSITIVE PSYCH.", "sectionnum": "001", "primary_alias": "PSYC-166-001", "path": "/courses/26692/sections/001", "id": "26692-001", "aliases": ["PSYC-166-001"]}, "comments": "Positive psychology is the scientific study of happiness, meaning, engagement, accomplishment, and virtue. This course focuses on valid assessments of these constructs, their causes and correlates, and interventions that have been shown to promote them. In addition to reading selected textbook chapters and primary research articles, students will complete positive psychology exercises and reflect upon their experience in written assignments.\r\nOverall, students were very appreciative of the content of the course. Several felt that this was the best class they had taken at Penn. Students frequently used words such as “enlightening,” “interesting,” and “engaging,” with one student claiming that it was “a pleasure and great experience to come to class.” Another said that “the lecture material was so interesting most of the time that I personally did not have to make any effort to concentrate; engagement came naturally.”\r\nProfessor Duckworth received near unanimous praise from her students. She was described as “kind,” “knowledgeable,” and “stimulating,” a “phenomenal instructor with a real gift for teaching.” One student said that Professor Duckworth was “very good at explaining the material [and] connecting the information to other areas of the course,” while another claimed that “she has a gift of making a large lecture feel like a small seminar.” Some students, however, felt that Professor Duckworth could sometimes come across as “condescending” by continually explaining her expectations of the class.\r\nMany were quick to suggest this class to their peers. One student said, “I am obsessed with this course and recommend it to every single student at Penn,” while another called it “a fantastic class, and one which everybody should take (regardless of major).” Several did caution, however, against assuming that the course will be easy. In the words of one student, “you have to work for your grade and the exams are not as easy as you think they will be.”", "num_students": 117, "path": "/courses/26692/sections/001/reviews/3612-ANGELA-LEE-DUCKWORTH", "instructor": {"path": "/instructors/3612-ANGELA-LEE-DUCKWORTH", "first_name": "ANGELA LEE", "last_name": "DUCKWORTH", "id": "3612-ANGELA-LEE-DUCKWORTH", "name": "ANGELA LEE DUCKWORTH"}, "num_reviewers": 105, "id": "26692-001-3612-ANGELA-LEE-DUCKWORTH"}, {"ratings": {"rAmountLearned": "3.04", "rDifficulty": "1.96", "rStimulateInterest": "3.00", "rRecommendMajor": "3.52", "rCourseQuality": "3.12", "rWorkRequired": "2.20", "rInstructorAccess": "3.04", "rReadingsValue": "2.96", "rRecommendNonMajor": "3.08", "rCommAbility": "3.36", "rInstructorQuality": "3.20"}, "section": {"name": "INTRO.POSITIVE PSYCH.", "sectionnum": "601", "primary_alias": "PSYC-166-601", "path": "/courses/26692/sections/601", "id": "26692-601", "aliases": ["PSYC-166-601"]}, "comments": "This course is an introduction to the study of positive emotions, positive character traits, and positive institutions. The positive emotions consist of emotions about the past (serenity, satisfaction, pride), about the future (hope, optimism, faith), and emotions about the present (pleasure and gratification). In this course, distinction between the pleasant life, the good life, and the meaningful life is drawn.\r\n\r\nMost students said that they greatly enjoyed this course, with one saying, “[This class was] one of the only [ones] I was excited to go to.” Many praised it for the knowledge they felt they gained; the course was described as laying a solid foundation for students’ understanding of the new field of positive psychology. Students used words such as “excellent” and “amazing” to describe the course, while one claimed the following: “It could change your life!”\r\n\r\nStudents also had plenty of praise for Professor Parks-Sheiner, calling her “a great teacher who conveys knowledge with passion and zest while making the classroom a welcome place for all students.” She reputedly is a skilled lecturer and often led “interesting class discussions.”\r\n\r\nThe class has weekly response papers and requires posting on an online discussion board. The grading was described as “very fair” and the work as “well-balanced.” Students praised the course format and were pleased that the course had no midterms and no final exam, just a final paper. The class is open to all class levels but has PSYC-001 as a prerequisite. *This review is based on the 7 student comments that were submitted. ", "num_students": 28, "path": "/courses/26692/sections/601/reviews/3608-ACACIA-C-PARKS-SHEINER", "instructor": {"path": "/instructors/3608-ACACIA-C-PARKS-SHEINER", "first_name": "ACACIA C", "last_name": "PARKS-SHEINER", "id": "3608-ACACIA-C-PARKS-SHEINER", "name": "ACACIA C PARKS-SHEINER"}, "num_reviewers": 25, "id": "26692-601-3608-ACACIA-C-PARKS-SHEINER"}]