[{"ratings": {"rAmountLearned": "2.57", "rDifficulty": "2.33", "rStimulateInterest": "2.52", "rRecommendMajor": "2.95", "rCourseQuality": "2.60", "rWorkRequired": "1.90", "rInstructorAccess": "2.81", "rReadingsValue": "2.14", "rRecommendNonMajor": "2.48", "rCommAbility": "2.81", "rInstructorQuality": "2.88"}, "section": {"name": "INTERNATIONAL LAW", "sectionnum": "601", "primary_alias": "PSCI-358-601", "path": "/courses/23684/sections/601", "id": "23684-601", "aliases": ["PSCI-358-601"]}, "comments": "This course intends to familiarize the student with the concept of \"law,\" its use as a constitutive and regulative force in the international arena, and the expanding scope of international law through the inclusion of transnational law and human rights.\r\n\r\nStudents said the course was “informative” and “thought provoking.” However, some commented that it lacked class discussion time and had minimal student participation.  \r\n\r\nMost students praised Professor Fetni for his knowledge of the field. He speaks with “passion” and “confidence” and is able to offer a unique perspective on the materials discussed in class. However, some students said that the lectures were not organized and that there was a lack of control over classroom conduct. Professor Fetni was able to stimulate students’ interest in class, although some wished he would have been more open to different opinions. \r\n\r\nMost students found the workload manageable. This political science course is described as excellent for students with background knowledge in the field. It is also a good course for freshmen, provided they are willing to do extra reading to catch up. This review is based on 6 responses.\r\n", "num_students": 31, "path": "/courses/23684/sections/601/reviews/1011-HOCINE-FETNI", "instructor": {"path": "/instructors/1011-HOCINE-FETNI", "first_name": "HOCINE", "last_name": "FETNI", "id": "1011-HOCINE-FETNI", "name": "HOCINE FETNI"}, "num_reviewers": 27, "id": "23684-601-1011-HOCINE-FETNI"}]