[{"ratings": {"rAmountLearned": "2.35", "rDifficulty": "3.47", "rStimulateInterest": "2.71", "rRecommendMajor": "2.73", "rCourseQuality": "2.35", "rWorkRequired": "2.88", "rInstructorAccess": "3.12", "rReadingsValue": "2.44", "rRecommendNonMajor": "0.50", "rCommAbility": "1.88", "rInstructorQuality": "2.53"}, "section": {"name": "ELECTROMAGNETIC PHENOMEN", "sectionnum": "001", "primary_alias": "PHYS-516-001", "path": "/courses/20704/sections/001", "id": "20704-001", "aliases": ["PHYS-516-001"]}, "comments": "This course overviews topics in electrodynamics with a focus on departmental research at Penn. The course emphasizes a mathematical approach to topics such as optical manipulation, astrophysical phenomena, and the generalizations from Maxwell’s theory to other fundamental interactions, such as strong, electroweak and gravitational forces. \r\n\r\nThis course was rated as very challenging. One student said it was a “difficult but valuable class.” Students wished notes on the board were clearer due to the heavy focus on mathematics in lecture. \r\n\r\nMany students agreed that one of Professor’s Nelsons strengths was his approach to teaching. His lectures would focus on the big picture and “show you how to think about the material like a true physicist.” Others added that he is a “brilliant lecturer” and that his “teaching style is a nice change from other [professors].” \r\n\r\nHowever, some students noted that the focus on math was too intense, and that lectures were very fast-paced, making it difficult to take notes. But Professor Nelson was more than willing to meet with students after class and was rated high on accessibility by students.", "num_students": 18, "path": "/courses/20704/sections/001/reviews/1675-PHILIP-NELSON", "instructor": {"path": "/instructors/1675-PHILIP-NELSON", "first_name": "PHILIP", "last_name": "NELSON", "id": "1675-PHILIP-NELSON", "name": "PHILIP NELSON"}, "num_reviewers": 17, "id": "20704-001-1675-PHILIP-NELSON"}]