{"coursehistories": {"path": "/coursehistories/3865"}, "description": "This course is an introduction to the practice of statistics in social and behavioral sciences. It is open to beginning graduate students and--with the permission of the instructor--advanced undergraduates. Topics covered include the description of social science data, in graphical and non-graphical form; correlation and other forms of association, including cross-tabulation; bivariate regression; an introduction to probability theory; the logic of sampling; the logic of statistical inference and significance tests. Some data manipulation will require the use of a statistical computer \"package,\" STATA; but the greater emphasis of the course will be on conceptualization and the ability to manipulate these new ideas both with and without access to statistical software. There is a lecture twice weekly and a mandatory \"lab.\" \n\n", "semester": "2011C", "name": "QUANTITATIVE METHODS I", "reviews": {"path": "/courses/24234/reviews", "values": [{"ratings": {"rAmountLearned": "1.18", "rDifficulty": "2.80", "rStimulateInterest": "0.76", "rRecommendMajor": "0.88", "rCourseQuality": "0.89", "rWorkRequired": "3.00", "rInstructorAccess": "1.82", "rReadingsValue": "1.76", "rRecommendNonMajor": "0.76", "rCommAbility": "0.94", "rInstructorQuality": "1.06"}, "section": {"name": "QUANTITATIVE METHODS I", "sectionnum": "001", "primary_alias": "CRIM-535-001", "path": "/courses/24234/sections/001", "id": "24234-001", "aliases": ["CRIM-535-001"]}, "comments": "*Criminology 535 is an introduction to the practice of statistics in social and behavioral sciences. It is open to beginning graduate students and--with the permission of the instructor--advanced undergraduates. Topics covered include the description of social science data, in graphical and non-graphical form; correlation and other forms of association, including cross-tabulation; bivariate regression; an introduction to probability theory; the logic of sampling; the logic of statistical inference and significance tests. Some data manipulation will require the use of a statistical computer \"package,\" STATA; but the greater emphasis of the course will be on conceptualization and the ability to manipulate these new ideas both with and without access to statistical software. There is a lecture twice weekly and a mandatory \"lab.\"\r\n\r\nMany students had “high hopes for this masters-level course,” but were ultimately let down in the execution. While it was recognized that statistics is hard to teach, most students were underwhelmed and confused by course content, which many deemed had “nothing to do with criminology” and “covered topics that were redundant” from undergraduate courses. Furthermore, the tests and assignments were “both vague and difficult to complete.”\r\n\r\nWhile Professor Perrins was noted as a “skilled statistician,” students viewed his teaching style as “scattered and poor” and “repetitive from the readings.” Many people believed he taught solely from the textbook and PowerPoints and wasn’t able to discuss the material beyond these tools. In addition, students felt Professor Perrins wasn’t “clear and logical” in his teaching method, which caused “ambiguous” assignments and “confusing” presentations.\r\n\r\nThe laboratory portion of this course uses a computer program that students deemed “expensive and only available at certain Penn labs,” which led to difficulty in completing assignments. As much of the work in class was done in pairs, students needed to coordinate with each other in order to complete their assignments.\r\n\r\n*This review is based on nine student comments.\r\n", "num_students": 26, "path": "/courses/24234/sections/001/reviews/5604-GERALD-PERRINS", "instructor": {"path": "/instructors/5604-GERALD-PERRINS", "first_name": "GERALD", "last_name": "PERRINS", "id": "5604-GERALD-PERRINS", "name": "GERALD PERRINS"}, "num_reviewers": 18, "id": "24234-001-5604-GERALD-PERRINS"}]}, "credits": null, "primary_alias": "CRIM-535", "path": "/courses/24234", "sections": {"path": "/courses/24234/sections", "values": [{"name": "QUANTITATIVE METHODS I", "sectionnum": "001", "primary_alias": "CRIM-535-001", "path": "/courses/24234/sections/001", "id": "24234-001", "aliases": ["CRIM-535-001"]}]}, "id": 24234, "aliases": ["CRIM-535"]}