[{"ratings": {"rAmountLearned": "3.07", "rDifficulty": "2.63", "rStimulateInterest": "3.51", "rRecommendMajor": "3.72", "rCourseQuality": "3.41", "rWorkRequired": "2.86", "rInstructorAccess": "3.00", "rReadingsValue": "3.04", "rRecommendNonMajor": "3.31", "rCommAbility": "3.69", "rInstructorQuality": "3.60"}, "section": {"name": "AMERICA IN THE 1960S", "sectionnum": "401", "primary_alias": "HIST-373-401", "path": "/courses/21877/sections/401", "id": "21877-401", "aliases": ["HIST-373-401", "URBS-217-401"]}, "comments": "This course examines the political, cultural, and intellectual history of America between 1954 and 1974. It considers the civil rights movement, the New Frontier and Great Society, the Supreme Court and right politics, the rise of the New Right, the debate over Vietnam, student radicalism, sexual liberation movements, black power, the counterculture, the urban crisis, and white backlash.&#8232;&#8232;Students generally took pleasure in taking this class making claims such as the material was, \"intriguing.\" One student claimed the class material, \"achieved its self proclaimed goal of changing the way I look at the 1960s.\"&#8232;&#8232;The students who took this class praised Professor Sugrue for the enthusiasm and energy he brings to class. One student noted that Professor Sugrue, \"brings all the energy to class that the subject matter deserves. He also brings an incredible amount of knowledge and scholarly ability.\" Another student said, \"I always looked forward to Sugrue's lectures because you could tell he was passionate about the subject matter.\"&#8232;&#8232;The work required for the class mainly revolves around reading. The work for the course includes a paper and final exam at the end of the semester. This class is recommended to majors and those that have interests in this period of history.", "num_students": 146, "path": "/courses/21877/sections/401/reviews/2779-THOMAS-J--SUGRUE", "instructor": {"path": "/instructors/2779-THOMAS-J--SUGRUE", "first_name": "THOMAS J.", "last_name": "SUGRUE", "id": "2779-THOMAS-J--SUGRUE", "name": "THOMAS J. SUGRUE"}, "num_reviewers": 130, "id": "21877-401-2779-THOMAS-J--SUGRUE"}]