[{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "1.90", "rStimulateInterest": "3.62", "rRecommendMajor": "3.57", "rCourseQuality": "3.47", "rWorkRequired": "2.28", "rInstructorAccess": "3.66", "rReadingsValue": "3.07", "rRecommendNonMajor": "3.45", "rCommAbility": "3.59", "rInstructorQuality": "3.72"}, "section": {"name": "INT'L BUSINESS ETHICS", "sectionnum": "401", "primary_alias": "LGST-220-401", "path": "/courses/24644/sections/401", "id": "24644-401", "aliases": ["LGST-220-401", "LGST-820-401"]}, "comments": "Legal Studies 220 is a multidisciplinary, interactive study of business ethics within a global economy. A central aim of the course is to enable students to develop a framework to address ethical challenges as they arise within and across different countries. Alternative theories about acting ethically in global environments are presented, and critical current issues are introduced and analyzed. Examples include bribery, global sourcing, environmental sustainability, social reports, intellectual property, e-commerce, and dealing with conflicting standards and values across cultures. As part of this study, the course considers non-Western ethical traditions and practices as they relate to business. \r\n\r\nThis course was described as “fantastic,” “interesting,” and “incredibly enjoyable.” Students raved about the class discussions, claiming that the course overall was “worth taking” for this reason. This course was recommended to majors and non- majors, undergraduates, and MBAs. \r\n\r\nStudents could not say enough positive things about Professor Robertson. One student claimed that she was their “best professor at Penn thus far.” Others described her as “engaging” and “passionate,” in addition to capable of “initiating good discussion.” \r\n\r\nMost students believed that this course had a manageable workload and they enjoyed the reading very much. This course is open to all students, including undergraduates and MBA students. \r\n", "num_students": 38, "path": "/courses/24644/sections/401/reviews/4399-DIANA-C--ROBERTSON", "instructor": {"path": "/instructors/4399-DIANA-C--ROBERTSON", "first_name": "DIANA C.", "last_name": "ROBERTSON", "id": "4399-DIANA-C--ROBERTSON", "name": "DIANA C. ROBERTSON"}, "num_reviewers": 33, "id": "24644-401-4399-DIANA-C--ROBERTSON"}]