{"coursehistories": {"path": "/coursehistories/3628"}, "description": "Translation Workshop In this class we will study and translate some of the major figures in 20th century poetry, including Translation Workshop. In this class we will study and translate some of the major figures in 20th century poetry, including Rainer Maria Rilke, Claire Malroux, Pablo Neruda, Cesare Pavese, Anna Akhmatova, and Bei Dao. While the curriculum will be tailored to the interests and linguistic backgrounds of the students who enroll, all those curious about world poetry and the formidable, irrestible act of translation are welcome.No knowledge of a language other than English is required: we will study multiple translations of seminal poems and render our own versions in response. Students with knowledge of other languages will have the additional opportunity to work directly from the original; students may also work in pairs, or groups. A portion of the course will be set up as a creative writing workshop in which to examine the overall effect of each others translations so that first drafts can become successful revisions. While class discussions will explore the contexts and particularity of (among others) Urdu, Italian, French, and Polish poetry, they might ultimately reveal how notions of national literature have radically shifted in recent years to more polyglotic and globally textured forms. \n\nNo problem is as consubstantial with literature and its modest mystery as the one posed by translation. --Jorge Luis Borges In this class we will study and translate some of the major figures in 20th century poetry, including Rainer Maria Rilke, Claire Malroux, Pablo Neruda, Cesare Pavese, Anna Akhmatova, and Bei Dao. While the curriculum will be tailored to the interests and linguistic backgrounds of the students who enroll, all those curious about world poetry and the formidable, irresistible act of translation are welcome. No knowledge of a language other than English is required: we will study multiple translations of seminal poems and render our own versions in response. Students with knowledge of other languages will have the additional opportunity to work directly from the original; students may also work in pairs, or groups. A portion of the course will be set up as a creative writing workshop in which to examine the overall effect of each others translations so that first drafts can become successful revisions. While class discussions will explore the contexts and particularity of (among others) Urdu, Italian, French, and Polish poetry, they might ultimately reveal how notions of national literature have radically shifted in recent years to more polyglottic and globally textured \n\n", "semester": "2012C", "name": "TRANSLATION WORKSHOP", "reviews": {"path": "/courses/28849/reviews", "values": [{"ratings": {"rDifficulty": "2.14", "rStimulateInterest": "3.75", "rCourseQuality": "3.78", "rWorkRequired": "2.43", "rInstructorQuality": "3.78", "rCommAbility": "3.88", "rInstructorAccess": "3.75"}, "section": {"name": "TRANSLATION WORKSHOP", "sectionnum": "401", "primary_alias": "ENGL-120-401", "path": "/courses/28849/sections/401", "id": "28849-401", "aliases": ["ENGL-120-401", "COML-121-401"]}, "comments": "", "num_students": 11, "path": "/courses/28849/sections/401/reviews/6261-TAIJE-JALAYA-SILVERMAN", "instructor": {"path": "/instructors/6261-TAIJE-JALAYA-SILVERMAN", "first_name": "TAIJE JALAYA", "last_name": "SILVERMAN", "id": "6261-TAIJE-JALAYA-SILVERMAN", "name": "TAIJE JALAYA SILVERMAN"}, "num_reviewers": 9, "id": "28849-401-6261-TAIJE-JALAYA-SILVERMAN"}]}, "credits": null, "primary_alias": "ENGL-120", "path": "/courses/28849", "sections": {"path": "/courses/28849/sections", "values": [{"name": "TRANSLATION WORKSHOP", "sectionnum": "401", "primary_alias": "ENGL-120-401", "path": "/courses/28849/sections/401", "id": "28849-401", "aliases": ["ENGL-120-401", "COML-121-401"]}]}, "id": 28849, "aliases": ["ENGL-120", "COML-121"]}