[{"ratings": {"rAmountLearned": "2.58", "rDifficulty": "2.13", "rStimulateInterest": "2.54", "rRecommendMajor": "3.23", "rCourseQuality": "2.58", "rWorkRequired": "2.06", "rInstructorAccess": "2.89", "rReadingsValue": "1.93", "rRecommendNonMajor": "2.69", "rCommAbility": "3.10", "rInstructorQuality": "2.90"}, "section": {"name": "LAND OF THE PHARAOHS", "sectionnum": "401", "primary_alias": "NELC-062-401", "path": "/courses/22133/sections/401", "id": "22133-401", "aliases": ["NELC-062-401", "AFST-062-401"]}, "comments": "This course provides an introduction to the society, culture and history of ancient Egypt. The objective of the course is to establish an understanding of the characteristics of the civilization of ancient Egypt and how that ancient society succeeded as one of the most successful and long-lived civilizations in world history. \r\n\r\nMost students felt this course was a “nice overview of Ancient Egypt,” and judged it to be a “very interesting class.” One student, who pointed out that he/she is a pre-med major, stated, “this was probably my favorite class this semester.” Several students found lectures to be enjoyable and interesting, though some felt that they became “somewhat monotonous” over time and were often “very cut-and-dry with little room for class participation.”\r\n\r\nProfessor Wegner received mostly positive reviews. Students felt he made lectures “fun,” “interesting and worthwhile,” and one declared that he was “one of the best professor’s I’ve had at Penn.” He was commended for being “very accessible and fair” and for his adeptness at “explaining the material and keeping the lectures understandable.” However, some felt that the material was sometimes “presented in a rather dull style,” and one noted that while he sometimes let his personality shine through by peppering humor into the lectures, he/she wished that he had done so more often.\r\n\r\nThe coursework was considered manageable as long as students were willing to put the necessary work in to the class. Students felt the assigned texts “were all incredibly useful” and that the study sheets provided were helpful and made it so the tests were “fair.” One student stated that it was “easy to get a good grade if you put effort in.” Another commented, “if you went to class and did the readings, you were totally prepared.” Still, some felt that the exams tended to be “far too specific,” and that they called for a “somewhat unrealistic amount of memorization.” One commented that, for a general requirement course offered to non-majors, there was “far too much work.”\r\n", "num_students": 97, "path": "/courses/22133/sections/401/reviews/76-JOSEF-W-WEGNER", "instructor": {"path": "/instructors/76-JOSEF-W-WEGNER", "first_name": "JOSEF W", "last_name": "WEGNER", "id": "76-JOSEF-W-WEGNER", "name": "JOSEF W WEGNER"}, "num_reviewers": 85, "id": "22133-401-76-JOSEF-W-WEGNER"}]