[{"ratings": {"rAmountLearned": "2.20", "rDifficulty": "2.53", "rStimulateInterest": "2.87", "rRecommendMajor": "2.47", "rCourseQuality": "2.40", "rWorkRequired": "2.93", "rInstructorAccess": "3.27", "rReadingsValue": "2.64", "rRecommendNonMajor": "2.33", "rCommAbility": "3.00", "rInstructorQuality": "3.07"}, "section": {"name": "TOPICS - CULTURAL STDS: FANTASTIC VOYAGES", "sectionnum": "301", "primary_alias": "ENGL-395-301", "path": "/courses/27335/sections/301", "id": "27335-301", "aliases": ["ENGL-395-301"]}, "comments": "Where do we come from? Where to we wish we could go? This class explores the deep and intimate relationship between our sense of the past and our fantasies of other, more magical worlds. L. P. Hartley famously wrote that “the past is a foreign country”: in recreating not only past events, but the worldview, myths, and magic of past societies, writers of historical fiction and poetry created strange and fantastic new worlds. And in seeking out the features of those new fictional environments, writers drew upon encounters with the larger world beyond their local experience, exploring how places and people that they knew almost nothing about could reshape the past into something rich and strange. A key question for this course is to ask how the imperial ambitions of Anglo-American culture shaped both an understanding of the past and the imagination of what fantastic history might look like. Texts for the course may include fiction, poetry, and films, and in order to help theorize these works, the course draws on a range of philosophical, psychological, and critical writings as well. This seminar-format course includes class discussions, short and long-form writing assignments, and a collective online editing project based upon an unpublished nineteenth-century manuscript of fantastic literature. The work in this course foregrounds the relationship between transcription and research, translation and imagination that coordinates fantastic and historical literature. There are also options for creative projects. \r\n\r\nStudents had both positive and negative impressions of this course. Some said they enjoyed the subject matter—like the novels read and associated readings—as well as the project that they worked on. Others, however, said that the highly experimental and ambitious character of this course did not always bring about the best results. One student explained that, “both components (the web-based project and the fantasy literature) could have been very rewarding separately executed; but together it was a little too much.” \r\n\r\nProfessor Griffiths’ instruction received mixed reviews as well. While one student described Professor Griffiths as, “a fantastic teacher who is passionate about this subject and very eager to engage with each student’s opinion,” another student felt that Professor Griffiths was, “generally unwilling to let go of the reigns and let the conversation go where the students’ interests lay.” A few students also mentioned that they felt Professor Griffiths could have structured the course much more efficiently. \r\n\r\nA couple students expressed that the workload for this course was a bit overwhelming, with one student even saying that the, “rubric of expectations for the project was never posted or firmly discussed.” As to whether they would recommend this course, one student advised that this course would be interesting for all majors, as it is perhaps not as “English-y” as a typical English class. This course fulfills the Sector 5, Sector 6, and Elective Seminar requirements of the English Standard Major. ", "num_students": 18, "path": "/courses/27335/sections/301/reviews/5343-DEVIN-S-GRIFFITHS", "instructor": {"path": "/instructors/5343-DEVIN-S-GRIFFITHS", "first_name": "DEVIN S", "last_name": "GRIFFITHS", "id": "5343-DEVIN-S-GRIFFITHS", "name": "DEVIN S GRIFFITHS"}, "num_reviewers": 15, "id": "27335-301-5343-DEVIN-S-GRIFFITHS"}]