{"coursehistories": {"path": "/coursehistories/3964"}, "description": "Advanced courses are designed to explore one particular facet of Urdu's range in depth, often through multi-media exposure and use of authentic materials. Recent courses: urdu Media in the age of globalization. We will be working with a variety of new urdu media such as blogs, satellite transmissions and radio and tv talk shows as well as contemporary performing arts: dramas, music, etc. Besides the three fold skill set of reading, writing and listening, students will develop skills in urdu computing using Unicode fints, as well as propriety siftware. Finally there will be a selection of critical readings in english designed to contextualize these media in academic debates. Religion in the urdu public sphere: The goals of this course will be to familiazize students with specific vocabulary and interpretive tools to access discourses surrounding religion in urdu, espicially after the developement of mass printing. we will be working with religious materials and materials about religion. this will include devotional peotry in wrting and musical performance as well as contemporary scholarly writing in islamic genres. Finally we will look into prominent public discourses about religion from sources as diverse as short story writing , liberal histography and call in talk shows. \n\nPartition and literature media: The events at partition represent a breakdown of ordinary social conventions one in which many social conflicts and contradictions involving gender, nation, religion, honor, community, caste/class and ethnicity among others.This course is intended both starkness and confusion of partition as a fical point to explore a few of the most powerful and interesting and powerful pieces of urdu prose work produced in the 20th century. these include debates over how people have prtrayed nations ans nationalism; and debates about how the history must be written to represent the experiences and actionas of individuals left out of colonial,national, or state centered histories-espicially women, and members of dominated classes, caste or minorities. \n\n", "semester": "2008A", "name": "ADVANCED URDU: PROSE", "reviews": {"path": "/courses/20836/reviews", "values": [{"ratings": {"rAmountLearned": "3.20", "rDifficulty": "2.20", "rStimulateInterest": "4.00", "rRecommendMajor": "3.80", "rCourseQuality": "3.60", "rWorkRequired": "2.60", "rInstructorAccess": "4.00", "rReadingsValue": "3.60", "rRecommendNonMajor": "3.40", "rCommAbility": "3.80", "rInstructorQuality": "3.40"}, "section": {"name": "ADVANCED URDU: PROSE", "sectionnum": "001", "primary_alias": "SAST-441-001", "path": "/courses/20836/sections/001", "id": "20836-001", "aliases": ["SAST-441-001"]}, "comments": "", "num_students": 5, "path": "/courses/20836/sections/001/reviews/1956-RUBAB-QURESHI", "instructor": {"path": "/instructors/1956-RUBAB-QURESHI", "first_name": "RUBAB", "last_name": "QURESHI", "id": "1956-RUBAB-QURESHI", "name": "RUBAB QURESHI"}, "num_reviewers": 5, "id": "20836-001-1956-RUBAB-QURESHI"}]}, "credits": null, "primary_alias": "SAST-441", "path": "/courses/20836", "sections": {"path": "/courses/20836/sections", "values": [{"name": "ADVANCED URDU: PROSE", "sectionnum": "001", "primary_alias": "SAST-441-001", "path": "/courses/20836/sections/001", "id": "20836-001", "aliases": ["SAST-441-001"]}]}, "id": 20836, "aliases": ["SAST-441"]}