{"coursehistories": {"path": "/coursehistories/5725"}, "description": "Spring 2013 Topic: Magic and Sorcery in Medieval Jewish and Christian Cultures \n\nMagical beliefs, practices, and texts were widespread in Europe during the Middle Ages, forming an important, but often overlooked, aspect of contemporary Jewish and Christian cultures. In this seminar, we will explore the historical evidence for Christian and Jewish magical traditions, including their sources and development, the integration of magic into diverse aspects of medieval culture, and the condemnation and persecution of those accused of sorcery. In exploring these traditions, we will pay special attention to the points of intersection between Christian and Jewish magic, which will help us understand different forms of interactions and relations between medieval Christians and Jews. Students in this seminar will learn to read medieval treatises of magic as products of a particular time and place, to recognize the particular rationality underlying magical beliefs, and to assess the relationship between magic, science, and religion in medieval thought. No prior background is necessary, and all readings will be in English. \n\nKatelyn Mesler (Ph.D. in Religious Studies, Northwestern University) is a historian of medieval Europe, with particular interests in Jewish-Christian relations, the history of science and medicine, magical beliefs and practices, apocalyptic thought, mysticism, heretical movements, and angelology. Her research has taken her to manuscript collections throughout the U.S., Italy, France, England, and Israel, where she has investigated unpublished texts and discovered long-lost sources. This year, Katelyn is a fellow at the Katz Center for Advanced Judaic Studies; afterwards, she will begin a research fellowship at the Hebrew University of Jerusalem. \n\n", "semester": "2013A", "name": "Magic and Sorcery in Medieval Jewish and Christian Cultures", "reviews": {"path": "/courses/30957/reviews", "values": [{"ratings": {"rDifficulty": "2.60", "rStimulateInterest": "3.80", "rCourseQuality": "3.67", "rWorkRequired": "2.60", "rInstructorQuality": "4.00", "rCommAbility": "3.80", "rInstructorAccess": "4.00"}, "section": {"name": "Magic and Sorcery in Medieval Jewish and Christian Cultures", "sectionnum": "401", "primary_alias": "RELS-222-401", "path": "/courses/30957/sections/401", "id": "30957-401", "aliases": ["RELS-222-401", "JWST-222-401"]}, "comments": "", "num_students": 7, "path": "/courses/30957/sections/401/reviews/6585-KATELYN-N-MESLER", "instructor": {"path": "/instructors/6585-KATELYN-N-MESLER", "first_name": "KATELYN N", "last_name": "MESLER", "id": "6585-KATELYN-N-MESLER", "name": "KATELYN N MESLER"}, "num_reviewers": 6, "id": "30957-401-6585-KATELYN-N-MESLER"}]}, "credits": null, "primary_alias": "RELS-222", "path": "/courses/30957", "sections": {"path": "/courses/30957/sections", "values": [{"name": "Magic and Sorcery in Medieval Jewish and Christian Cultures", "sectionnum": "401", "primary_alias": "RELS-222-401", "path": "/courses/30957/sections/401", "id": "30957-401", "aliases": ["RELS-222-401", "JWST-222-401"]}]}, "id": 30957, "aliases": ["RELS-222", "JWST-222"]}