{"coursehistories": {"path": "/coursehistories/483"}, "description": "The purpose of this course is to provide the student with the necessary skills to value and to employ options, futures, and related financial contracts. In order to provide a useful treatment of these topics in an environment that is changing rather rapidly, it is necessary to stress the fundamentals and to explore the topics at a technical level. The topics that will be covered include the valuation of futures contracts on stock indices, on commodities and Treasury instruments; the valuation of options; empirical evidence; strategies with respect to these assets; dynamic asset allocation strategies, of which portfolio insurance is an example; swaps; and the use (and misuse) of derivatives in the context of corporate applications. One-third of the course will be devoted to futures, a third to options, and a third to their applications. Many of the applications will be sprinkled along with the coverage of futures and options. \n\n", "semester": "2009A", "name": "FINANCIAL DERIVATIVES", "reviews": {"path": "/courses/15769/reviews", "values": [{"ratings": {"rAmountLearned": "3.02", "rDifficulty": "3.57", "rStimulateInterest": "2.49", "rRecommendMajor": "3.29", "rCourseQuality": "2.80", "rWorkRequired": "2.95", "rInstructorAccess": "2.76", "rReadingsValue": "2.29", "rRecommendNonMajor": "1.61", "rCommAbility": "2.68", "rInstructorQuality": "2.97"}, "section": {"name": "FINANCIAL DERIVATIVES", "sectionnum": "001", "primary_alias": "FNCE-206-001", "path": "/courses/15769/sections/001", "id": "15769-001", "aliases": ["FNCE-206-001"]}, "comments": "The purpose of FNCE206 is to provide the student with the necessary skills to value and to employ options, futures, and related financial contracts. In order to provide a useful treatment of these topics in a rapidly changing environment, it is necessary to stress the fundamentals and to explore the topics at a technical level. One-third of the course will be devoted to futures, a third to options, and a third to their applications. Many of the applications will be sprinkled along with the coverage of futures and options.\r\n\r\nMost students find FNCE 206 extremely difficult. The course is certainly not for the faint-of-heart, and requires significant knowledge of finance and math. Course concepts are high level and in-depth. Many wish that the class would “dumb down” and be more geared toward students without prior knowledge. Those pursuing a career in trading will find the class especially interesting. Students felt that they learned a great deal in FNCE 206 if they stayed afloat.\r\n\r\nProfessor Ramaswamy is described by his students as “ridiculously brilliant.” Some find Professor Ramaswamy’s intelligence overbearing, noting that he comes off as “smug.” Many claim he is the “smartest” and “best” professor they’ve had at Wharton. Professor Ramaswamy is “dedicated” and “organized” but those are not on his level may nonetheless find him somewhat difficult.\r\n\r\nProfessor Ramaswamy’s FNCE 206 is taught with lecture slides containing many graphs, diagrams, and figures. Some find them confusing but nonetheless highly informative and insightful. Students advised that attending office hours is a must.", "num_students": 68, "path": "/courses/15769/sections/001/reviews/1854-KRISHNA-RAMASWAMY", "instructor": {"path": "/instructors/1854-KRISHNA-RAMASWAMY", "first_name": "KRISHNA", "last_name": "RAMASWAMY", "id": "1854-KRISHNA-RAMASWAMY", "name": "KRISHNA RAMASWAMY"}, "num_reviewers": 64, "id": "15769-001-1854-KRISHNA-RAMASWAMY"}]}, "credits": null, "primary_alias": "FNCE-206", "path": "/courses/15769", "sections": {"path": "/courses/15769/sections", "values": [{"name": "FINANCIAL DERIVATIVES", "sectionnum": "001", "primary_alias": "FNCE-206-001", "path": "/courses/15769/sections/001", "id": "15769-001", "aliases": ["FNCE-206-001"]}]}, "id": 15769, "aliases": ["FNCE-206"]}