{"coursehistories": {"path": "/coursehistories/1904"}, "description": "Analysis of the political use of force, both in theory and in practice, through analytical readings and study of selected wars. Readings include Sun Zi, Kautilya, Machiavelli, Clauseqitz and other strategists. Case studies vary but may include the Peloponnesian War, the Mongol conquests, the Crusades, the Crimean War, Russo-Japanese War, World War II, Korea, or the Falklands, among others, with focus on initiation, strategic alternatives, decision and termination. Some discussion of the law of war and international attempts to limit it. \n\n", "semester": "2012A", "name": "STRATEGY,POLICY & WAR", "reviews": {"path": "/courses/27566/reviews", "values": [{"ratings": {"rAmountLearned": "3.13", "rDifficulty": "2.41", "rStimulateInterest": "2.76", "rRecommendMajor": "3.50", "rCourseQuality": "3.14", "rWorkRequired": "2.57", "rInstructorAccess": "2.91", "rReadingsValue": "2.83", "rRecommendNonMajor": "2.98", "rCommAbility": "2.98", "rInstructorQuality": "3.12"}, "section": {"name": "STRATEGY,POLICY & WAR", "sectionnum": "001", "primary_alias": "HIST-160-001", "path": "/courses/27566/sections/001", "id": "27566-001", "aliases": ["HIST-160-001"]}, "comments": "This course involves an analysis of the political use of force, both in theory and in practice, through analytical readings and study of selected wars.  Readings include Sun Zi, Kautilya, Machiavelli, Clauseqitz and other strategists.  Case studies vary but may include the Peloponnesian War, the Mongol conquests, the Crusades, the Crimean War, Russo-Japanese War, World War II, Korea, or the Falklands, among others, with focus on initiation, strategic alternatives, decision and termination.  There is some discussion of the law of war and international attempts to limit it.\r\n\r\n\tOverall, students found this class to be interesting and intellectually stimulating.  They reported that it was “very helpful in terms of analytical thinking,” and appreciated the fact that “the course required no prior knowledge.”  A few students noted that the first few weeks of the course required a lot of reading and that “planning was essential” to avoid falling behind, but a couple of students stated that “the professor doesn’t expect you to” complete all the readings.  One student reported that the “lectures didn’t have much form” and another wished there was more “interactive material,\" but overall students felt the class offered a “unique perspective” with information that would be “useful down the road.”\r\n\r\n\tProfessor Waldron was well-liked by students, some calling him “phenomenal” and “a very interesting professor.”  While noting that he was “very open to discussion and student feedback,” a couple of students felt that he “often went on tangents” and could be “monotone at times.”  Still, he was considered “a wonderful scholar” who was “very knowledgeable and friendly.”\r\n\r\n\tThough many students considered the class to be very reading-heavy, they felt that “the workload wasn’t too bad” because not all of the readings had to be completed to understand what was going on.  Still, one student said it was helpful to be “genuinely interested in the material.”  Another student stated that he was not aware “of any class similar in nature at Penn,” and thus “really appreciated the opportunity to take this course.”", "num_students": 62, "path": "/courses/27566/sections/001/reviews/628-ARTHUR-N--WALDRON", "instructor": {"path": "/instructors/628-ARTHUR-N--WALDRON", "first_name": "ARTHUR N.", "last_name": "WALDRON", "id": "628-ARTHUR-N--WALDRON", "name": "ARTHUR N. WALDRON"}, "num_reviewers": 58, "id": "27566-001-628-ARTHUR-N--WALDRON"}]}, "credits": null, "primary_alias": "HIST-160", "path": "/courses/27566", "sections": {"path": "/courses/27566/sections", "values": [{"name": "STRATEGY,POLICY & WAR", "sectionnum": "001", "primary_alias": "HIST-160-001", "path": "/courses/27566/sections/001", "id": "27566-001", "aliases": ["HIST-160-001"]}]}, "id": 27566, "aliases": ["HIST-160"]}