{"coursehistories": {"path": "/coursehistories/4942"}, "description": "This course will provide an overview of the cross-disciplinary fields of civil engineering, environmental sciences, urban hydrology, landscape architecture, green building, public outreach and politics. Students will be expected to conduct field investigations, review scientific data and create indicator reports, working with stakeholders and presenting the results at an annual symposium. There is no metaphor like water itself to describe the cumulative effects of our practices, with every upstream action having an impact downstream. In our urban environment, too often we find degraded streams filled with trash, silt, weeds and dilapidated structures. The water may look clean, but is it? We blame others, but the condition of the creeks is directly related to how we manage our water resources and our land. In cities, these resources are often our homes, our streets and our communities. This course will define the current issues of the urban ecosystem and how we move toward managing this system in a sustainable manner. We will gain an understanding of the dynamic, reciprocal relationship between practices in an watershed and its waterfront. Topics discussed include: drinking water quality and protection, green infrastructure, urban impacts of climate change, watershed monitoring, public education, creating strategies and more. \n\n", "semester": "2012C", "name": "CLEAN WATER-GREEN CITIES", "reviews": {"path": "/courses/28888/reviews", "values": [{"ratings": {"rDifficulty": "2.14", "rTAQuality": "3.38", "rStimulateInterest": "3.50", "rCourseQuality": "3.14", "rWorkRequired": "2.36", "rInstructorQuality": "3.14", "rCommAbility": "3.46", "rInstructorAccess": "2.93"}, "section": {"name": "CLEAN WATER-GREEN CITIES", "sectionnum": "301", "primary_alias": "ENVS-410-301", "path": "/courses/28888/sections/301", "id": "28888-301", "aliases": ["ENVS-410-301"]}, "comments": "", "num_students": 14, "path": "/courses/28888/sections/301/reviews/5345-HOWARD-MARK-NEUKRUG", "instructor": {"path": "/instructors/5345-HOWARD-MARK-NEUKRUG", "first_name": "HOWARD MARK", "last_name": "NEUKRUG", "id": "5345-HOWARD-MARK-NEUKRUG", "name": "HOWARD MARK NEUKRUG"}, "num_reviewers": 14, "id": "28888-301-5345-HOWARD-MARK-NEUKRUG"}]}, "credits": null, "primary_alias": "ENVS-410", "path": "/courses/28888", "sections": {"path": "/courses/28888/sections", "values": [{"name": "CLEAN WATER-GREEN CITIES", "sectionnum": "301", "primary_alias": "ENVS-410-301", "path": "/courses/28888/sections/301", "id": "28888-301", "aliases": ["ENVS-410-301"]}]}, "id": 28888, "aliases": ["ENVS-410"]}