[{"ratings": {"rAmountLearned": "2.86", "rDifficulty": "2.71", "rStimulateInterest": "2.41", "rRecommendMajor": "3.10", "rCourseQuality": "2.75", "rWorkRequired": "2.72", "rInstructorAccess": "3.21", "rReadingsValue": "2.52", "rRecommendNonMajor": "2.28", "rCommAbility": "3.17", "rInstructorQuality": "2.94"}, "section": {"name": "INTL LAW & INSTITUTIONS", "sectionnum": "001", "primary_alias": "PSCI-153-001", "path": "/courses/16350/sections/001", "id": "16350-001", "aliases": ["PSCI-153-001"]}, "comments": "This is an undergraduate lecture course examining the role that international law and institutions play in international relations. The course begins by exploring broad theoretical questions—questions about why states create international law and international relations; how states design institutions; the impact that institutional design may have on the effectiveness of international relations; and the conditions under which states are likely to comply with the rules set out by international institutions and the dictates of international law. The remainder of the course is organized topically, looking at how international institutions and law function in various arenas of international affairs. Topics include collective security institutions such as the League of Nations, the United Nations, and NATO; human rights law; the laws of war; international intervention and peacekeeping; international justice and the International Criminal Court; environmental law; international trade law and the World Trade Organization; economic development and the World Bank; and international finance and the role of the International Monetary Fund.&#8232;\r\n\r\n&#8232;Students felt the course was very organized and thorough. Some felt that it would have helped to spend less time on theory and more on real-world examples. One student thought it was too similar to PSCI 150 International Relations Theory and Practice. Another student complained that “expectations for the quality of work were a little high; it was not clear how to achieve an A, or how to improve grades after.” Most students also said that there was too much reading that was unnecessarily verbose and long. &#8232;&#8232;\r\n\r\nProfessor Stanton has been complimented as a great teacher. Students felt she was an “intelligent, great resource” who “explains the material really well.” Students said Professor Stanton came to class well prepared, was very accessible, and always willing to answer questions. Some suggested that Professor Stanton’s lectures could be a bit dry and would have preferred she conducted lecture in a less rigid and rehearsed manner.\r\n\r\nThis course is a Political Science elective course. ", "num_students": 34, "path": "/courses/16350/sections/001/reviews/4537-JESSICA-STANTON", "instructor": {"path": "/instructors/4537-JESSICA-STANTON", "first_name": "JESSICA", "last_name": "STANTON", "id": "4537-JESSICA-STANTON", "name": "JESSICA STANTON"}, "num_reviewers": 32, "id": "16350-001-4537-JESSICA-STANTON"}]