[{"ratings": {"rAmountLearned": "2.60", "rDifficulty": "2.31", "rStimulateInterest": "2.57", "rRecommendMajor": "2.97", "rCourseQuality": "2.44", "rWorkRequired": "2.46", "rInstructorAccess": "3.12", "rReadingsValue": "2.80", "rRecommendNonMajor": "2.14", "rCommAbility": "2.29", "rInstructorQuality": "2.62"}, "section": {"name": "LATIN AMER 1791-PRES", "sectionnum": "401", "primary_alias": "HIST-071-401", "path": "/courses/21845/sections/401", "id": "21845-401", "aliases": ["HIST-071-401", "LALS-071-401"]}, "comments": "&#8232;&#8232;This course explores the history of Latin American from the early 19th century to the present. This course focuses primarily on a thematic survey of the region, emphasizing the legacy of colonialism, democracy and dictatorship, poverty and development, and integration of the region internationally. Students will study these major themes and review detailed national and sub national examples. &#8232;&#8232;Students in this course found material interesting but lacking in coherence. Many students suggested that the course attempted to, “cram too much” material into the semester. The result was a course, which at times felt, “disjointed and chaotic.”&#8232;&#8232;Students praised Professor Farnsworth-Alvear for enthusiasm and energy. According to one student, Professor Farnsworth-Alvear, “speaks very quickly and her lectures are unorganized.” Students agreed that Professor Farnsworth-Alvear, “cares about her students” and makes efforts to be available to answer questions.&#8232;This course is not listed as fulfilling any major college requirements. In addition, there are no prerequisites listed. The course is open to both college freshmen and upperclassmen.", "num_students": 47, "path": "/courses/21845/sections/401/reviews/1511-ANN-C--FARNSWORTH-ALVEAR", "instructor": {"path": "/instructors/1511-ANN-C--FARNSWORTH-ALVEAR", "first_name": "ANN C.", "last_name": "FARNSWORTH-ALVEAR", "id": "1511-ANN-C--FARNSWORTH-ALVEAR", "name": "ANN C. FARNSWORTH-ALVEAR"}, "num_reviewers": 43, "id": "21845-401-1511-ANN-C--FARNSWORTH-ALVEAR"}]