{"coursehistories": {"path": "/coursehistories/3153"}, "description": "This course focuses on the creative side of mathematics, with an emphasis on discovery, reasoning, proofs and effective communication, while at the same time studying arithmetic, algebra, linear algebra, groups, rings and fields. Small class sizes permit an informal, discussion-type atmosphere, and often the entire class works together on a given problem. Homework is intended to be thought-provoking, rather than skill-sharpening. \n\n", "semester": "2011A", "name": "PROVING THINGS: ALGEBRA", "reviews": {"path": "/courses/21994/reviews", "values": [{"ratings": {"rAmountLearned": "3.19", "rDifficulty": "2.72", "rStimulateInterest": "3.16", "rRecommendMajor": "3.59", "rCourseQuality": "3.11", "rWorkRequired": "2.69", "rInstructorAccess": "3.56", "rReadingsValue": "2.28", "rRecommendNonMajor": "2.06", "rCommAbility": "3.09", "rInstructorQuality": "3.43"}, "section": {"name": "PROVING THINGS: ALGEBRA", "sectionnum": "001", "primary_alias": "MATH-203-001", "path": "/courses/21994/sections/001", "id": "21994-001", "aliases": ["MATH-203-001"]}, "comments": "This course focuses on the creative side of mathematics, with an emphasis on discovery, reasoning, proofs and effective communication, while at the same time studying arithmetic, algebra, linear algebra, groups, rings and fields. The small class size permits an informal, discussion-type atmosphere, and often the entire class works together on a given problem. Homework is intended to be thought-provoking rather than skill-sharpening.\r\n\r\nStudents thought the class was indeed \"thought-provoking\" and a \"great introduction into higher math [courses].\" They learned \"a lot from the course both conceptually and in terms of raw material.\"\r\n\r\nProfessor Nicoara was a \"great instructor,\" \"formatting the class more as a discussion and less as a lecture.\" She is \"willing to communicate\" and ensures that students understand the basics. However, her notes were sometimes illegible, and students had to “frantically tak[e] down notes for the entire class [period]” instead of processing the material.\r\n\r\nThe homework was \"extremely helpful,\" but it \"would be nice to have an answer key.\" Students would not recommend this to freshmen as the class is mostly composed of juniors and seniors who have \"extensive math backgrounds.\" One student explained that even though there is no prerequisite, this does not mean that “anyone can take it” successfully.\r\n", "num_students": 39, "path": "/courses/21994/sections/001/reviews/4412-ANDREEA-C--NICOARA", "instructor": {"path": "/instructors/4412-ANDREEA-C--NICOARA", "first_name": "ANDREEA C.", "last_name": "NICOARA", "id": "4412-ANDREEA-C--NICOARA", "name": "ANDREEA C. NICOARA"}, "num_reviewers": 38, "id": "21994-001-4412-ANDREEA-C--NICOARA"}]}, "credits": null, "primary_alias": "MATH-203", "path": "/courses/21994", "sections": {"path": "/courses/21994/sections", "values": [{"name": "PROVING THINGS: ALGEBRA", "sectionnum": "001", "primary_alias": "MATH-203-001", "path": "/courses/21994/sections/001", "id": "21994-001", "aliases": ["MATH-203-001"]}]}, "id": 21994, "aliases": ["MATH-203"]}