{"coursehistories": {"path": "/coursehistories/1838"}, "description": "The course covers introductory microeconomics and macroeconomics with particular attention given to global and long-run growth issues. The microeconomic portion introduces the discipline and fundamental tools of economics. It proceeds to study the workings of a price system and theories of consumer and firm decision-making. It further analyzes particular market structures characterized by perfect and imperfect competition, reviews the strengths and weaknesses of a market economy, and considers the government's role in correcting market failures and promoting competition. The macroeconomic portion studies the domestic and international forces that govern the determination of the aggregate level of economic activity, and pays particular attention to the determinants of long-run economic growth and stabilization policies used to dampen business cycles. The course concludes with global issues including the determinants of trade, trade policy, capital mobility, international financial instability, and international economic integration and the extent of globalization. \n\n", "semester": "2010C", "name": "BUSINESS ECONOMICS", "reviews": {"path": "/courses/23085/reviews", "values": [{"ratings": {"rAmountLearned": "3.42", "rDifficulty": "3.29", "rStimulateInterest": "3.00", "rRecommendMajor": "3.73", "rCourseQuality": "3.19", "rWorkRequired": "2.74", "rInstructorAccess": "3.23", "rReadingsValue": "3.00", "rRecommendNonMajor": "2.43", "rCommAbility": "3.23", "rInstructorQuality": "3.45"}, "section": {"name": "BUSINESS ECONOMICS", "sectionnum": "301", "primary_alias": "FNCE-103-301", "path": "/courses/23085/sections/301", "id": "23085-301", "aliases": ["FNCE-103-301"]}, "comments": "This introductory class covers microeconomics and macroeconomics, focusing attention given to global and long run growth issues. The first half of the class focuses on the microeconomic portion, which introduces the fundamental tools of economics. Some topics the course studies are workings of a price system, market structures, and the government’s role in correcting market failures. The second half of the class is the macroeconomic portion, which studies the domestic and international forces that govern the determination of the aggregate level of economic activity. The course will look at topics such as determinants of trade, capital mobility, and the extent of globalization. \r\n\r\nMany students commented the class was “a very tough course.” There was a huge variability of knowledge among students, and the students who didn’t come into the course with an economics background had a hard time keeping up the fast pace of the class. All of the students learned a lot and competed very hard against their peers. \r\n\r\nDr Asher taught the course very well and many students claimed he was a “great professor.” He was a great lecturer and he reportedly easily expressed his enthusiasm for teaching this class. One student claimed “the fact that he is able to support the theoretical content with examples from his personal experience makes for a truly exciting learning experience.” Furthermore, Dr. Asher did a good job integrating the test book with his notes and fostered a sense of learning. \r\n\r\nThis class is only available to freshman Joseph Wharton honors scholar students only. Non-honors students will need permission to enroll in the class. Furthermore, “this class is a heaven for those who value knowledge and reason” but quite challenging “for those who don't really want to study economics.” The exams are very tough and a student must be willing to put in a lot of effort to do well in the course. However, many students said it was a worthwhile experience. \r\n", "num_students": 38, "path": "/courses/23085/sections/301/reviews/1427-MARTIN-A--ASHER", "instructor": {"path": "/instructors/1427-MARTIN-A--ASHER", "first_name": "MARTIN A.", "last_name": "ASHER", "id": "1427-MARTIN-A--ASHER", "name": "MARTIN A. ASHER"}, "num_reviewers": 36, "id": "23085-301-1427-MARTIN-A--ASHER"}]}, "credits": null, "primary_alias": "FNCE-103", "path": "/courses/23085", "sections": {"path": "/courses/23085/sections", "values": [{"name": "BUSINESS ECONOMICS", "sectionnum": "301", "primary_alias": "FNCE-103-301", "path": "/courses/23085/sections/301", "id": "23085-301", "aliases": ["FNCE-103-301"]}]}, "id": 23085, "aliases": ["FNCE-103"]}