[{"ratings": {"rAmountLearned": "2.75", "rDifficulty": "2.57", "rStimulateInterest": "2.68", "rRecommendMajor": "3.39", "rCourseQuality": "2.77", "rWorkRequired": "2.61", "rInstructorAccess": "2.79", "rReadingsValue": "2.04", "rRecommendNonMajor": "1.50", "rCommAbility": "2.57", "rInstructorQuality": "2.68"}, "section": {"name": "FIN MGMT HEALTH INST", "sectionnum": "001", "primary_alias": "HCMG-849-001", "path": "/courses/24517/sections/001", "id": "24517-001", "aliases": ["HCMG-849-001"]}, "comments": "Health Care Management 849 focuses on the application of financial analysis to financial and operating decisions in the health care industry. Valuation methods covered include: net present value of free cash flows, decision tree analysis, real options, and multiples. The cases allow students to apply these skills to examine the following types of decisions and situations: estimate the value of a drug that is being developed using both traditional NPV and option pricing, evaluate an R&D limited partnership as an alternative to traditional methods of financing biotech R&D, estimate the value of a pharmaceutical company using publicly available data, identify the best way for a new medical device company to price its products and raise funds, determine why a Medicare HMO is losing money, recommend whether the plan should remain in the market, and recommend changes in benefit design and reimbursement methods if the plan decides to remain in the market, analyze a health system's profitability by product line and discuss the implications for pure play or carve-out companies.\r\n\r\nMost students felt that this was great class. They described it as a “practical, interesting and useful” class. Most students agreed that the information they learned in this class would be useful and applicable throughout their studies and into their career. \r\n\r\nMost students agreed that Professor Harrington was very engaging. Several students felt, however, that Professor Harrington could be difficult to understand and at times he went too quickly. One student mentioned that Professor Harrington “assumed that everyone had an underlying knowledge of everything.”\r\n\r\nRegarding grading, one student mentioned that the course was difficult. In terms of target audience, one student explained that this course is great for students interested in a career in “healthcare banking, as well as, healthcare consulting.” Regarding workload, students are expected to attend lecture, review cases and complete a midterm and final exam. \r\n", "num_students": 33, "path": "/courses/24517/sections/001/reviews/3320-SCOTT-HARRINGTON", "instructor": {"path": "/instructors/3320-SCOTT-HARRINGTON", "first_name": "SCOTT", "last_name": "HARRINGTON", "id": "3320-SCOTT-HARRINGTON", "name": "SCOTT HARRINGTON"}, "num_reviewers": 33, "id": "24517-001-3320-SCOTT-HARRINGTON"}]