{"coursehistories": {"path": "/coursehistories/560"}, "description": "This introductory course takes a policy and politics angle to health care's three persistent issues - access, cost and quality. The roles of patients, physicians, hospitals, insurers, and pharmaceutical companies will be established. The interaction between the government and these different groups will also be covered. Current national health care policy initiatives and the interests of class members will steer the specific topics covered in The course aims to provide skills for critical and analytical thought about the U.S. health care system and the people in it. \n\n", "semester": "2010C", "name": "HEALTH CARE SYSTEMS", "reviews": {"path": "/courses/23176/reviews", "values": [{"ratings": {"rAmountLearned": "2.91", "rDifficulty": "2.38", "rStimulateInterest": "2.21", "rRecommendMajor": "3.55", "rCourseQuality": "2.77", "rWorkRequired": "1.88", "rInstructorAccess": "2.68", "rReadingsValue": "2.21", "rRecommendNonMajor": "2.69", "rCommAbility": "2.69", "rInstructorQuality": "2.63"}, "section": {"name": "HEALTH CARE SYSTEMS", "sectionnum": "001", "primary_alias": "HCMG-101-001", "path": "/courses/23176/sections/001", "id": "23176-001", "aliases": ["HCMG-101-001"]}, "comments": "This course introduces and examines the various components of the U.S. health care system. It will cover both private and public financing mechanisms, the forces of market competition and government regulation, and the impact of health policy on key stakeholders. While developing an understanding of the various parts of the U.S. health care system, students will also learn how to apply simple economic reasoning to examine health policy issues.\r\n\r\nThis course received mixed reviews. Some students thought the course was very interesting and covered a reasonable amount of relevant material, but others thought the course did not stimulate enough discussion or interest. Some students thought the guest speakers were inadequate and diluted the usefulness of the course. In addition, many students thought the exams did not properly test knowledge or mastery of material covered in class.\r\n\r\nProfessor Polsky also received mixed reviews. Course content was interesting but the lectures were described as mundane. Some students thought Professor Polsky came off as “dry” and not into the material, but others found him “personable.” Many students though Professor Polsky's lectures were better than any of the guest speakers and would have preferred his lecturing over those of guest speakers.\r\n\r\nThis course received mediocre rating. Students who hope to enter the healthcare field as a physician may find this course useful in terms of getting an overview of the field through the issues of health insurance and reform.\r\n", "num_students": 94, "path": "/courses/23176/sections/001/reviews/2994-DANIEL-E--POLSKY", "instructor": {"path": "/instructors/2994-DANIEL-E--POLSKY", "first_name": "DANIEL E.", "last_name": "POLSKY", "id": "2994-DANIEL-E--POLSKY", "name": "DANIEL E. POLSKY"}, "num_reviewers": 87, "id": "23176-001-2994-DANIEL-E--POLSKY"}]}, "credits": null, "primary_alias": "HCMG-101", "path": "/courses/23176", "sections": {"path": "/courses/23176/sections", "values": [{"name": "HEALTH CARE SYSTEMS", "sectionnum": "001", "primary_alias": "HCMG-101-001", "path": "/courses/23176/sections/001", "id": "23176-001", "aliases": ["HCMG-101-001"]}]}, "id": 23176, "aliases": ["HCMG-101"]}