{"coursehistories": {"path": "/coursehistories/968"}, "description": "This course focuses on international comparisons of housing finance systems and housing market outcomes. This includes comparative analyses of the economic factors that underlay housing market differences and similarities. Changing housing market institutions and policies in previously socialist economies and newly emerging countries are examined. The course also addresses integration of global financial markets for national housing markets. International speakers present their views on institutional innovations and the policy setting process in their respective markets. Various approaches to understanding these issues will be used, including readings, written assignments, and group projects. \n\n", "semester": "2009A", "name": "INT'L HOUSING COMPARISNS", "reviews": {"path": "/courses/16399/reviews", "values": [{"ratings": {"rAmountLearned": "2.97", "rDifficulty": "2.41", "rStimulateInterest": "2.63", "rRecommendMajor": "3.34", "rCourseQuality": "2.68", "rWorkRequired": "2.28", "rInstructorAccess": "2.88", "rReadingsValue": "2.06", "rRecommendNonMajor": "2.59", "rCommAbility": "2.66", "rInstructorQuality": "2.86"}, "section": {"name": "INT'L HOUSING COMPARISNS", "sectionnum": "401", "primary_alias": "REAL-236-401", "path": "/courses/16399/sections/401", "id": "16399-401", "aliases": ["REAL-236-401", "BPUB-236-401"]}, "comments": "REAL236 focuses on international comparisons of housing finance systems and housing market outcomes. This includes comparative analyses of the economic factors that underlay housing market differences and similarities. Changing housing market institutions and policies in previously socialist economies and newly emerging countries are examined. The course also addresses integration of global financial markets for national housing markets. International speakers present their views on institutional innovations and the policy setting process in their respective markets. Various approaches to understanding these issues will be used, including readings, written assignments, and group projects.\r\n\r\nOverall students found this course “educational and informative.” They felt the assignments helped them learn and were easily managed.\r\n\r\nStudents felt that Professor Wachter was, at times, difficult to reach and sometimes difficult to follow in lecture. However, most students felt that overall, she was very helpful outside of class and very knowledgeable in her field.\r\n\r\nStudents found the workload to be manageable and useful, though the assigned readings were not highly valued. Some students felt that some outside knowledge was required to fully understand the material being taught. This class comes highly recommended to majors.", "num_students": 42, "path": "/courses/16399/sections/401/reviews/1046-SUSAN-M-WACHTER", "instructor": {"path": "/instructors/1046-SUSAN-M-WACHTER", "first_name": "SUSAN M", "last_name": "WACHTER", "id": "1046-SUSAN-M-WACHTER", "name": "SUSAN M WACHTER"}, "num_reviewers": 39, "id": "16399-401-1046-SUSAN-M-WACHTER"}]}, "credits": null, "primary_alias": "REAL-236", "path": "/courses/16399", "sections": {"path": "/courses/16399/sections", "values": [{"name": "INT'L HOUSING COMPARISNS", "sectionnum": "401", "primary_alias": "REAL-236-401", "path": "/courses/16399/sections/401", "id": "16399-401", "aliases": ["REAL-236-401", "BPUB-236-401"]}]}, "id": 16399, "aliases": ["REAL-236", "BPUB-236"]}