{"coursehistories": {"path": "/coursehistories/4166"}, "description": "This course will examine the ways in which humans manipulate - and have been manipulated by - the organisms we depend on for food, with particular emphasis on the biological factors that influence this interaction. The first part of the course will cover the biology, genetics, evolution, and breeding of cultivated plants and animals; the second part will concern the ways in which food/plants can cause and cure human disease. \n\n", "semester": "2011A", "name": "DNA, DIET, AND DISEASE: The Biology of Food", "reviews": {"path": "/courses/21344/reviews", "values": [{"ratings": {"rAmountLearned": "2.39", "rDifficulty": "2.45", "rStimulateInterest": "2.74", "rRecommendMajor": "2.39", "rCourseQuality": "2.71", "rWorkRequired": "2.06", "rInstructorAccess": "2.77", "rReadingsValue": "1.71", "rRecommendNonMajor": "2.90", "rCommAbility": "3.03", "rInstructorQuality": "3.12"}, "section": {"name": "DNA, DIET, AND DISEASE: The Biology of Food", "sectionnum": "001", "primary_alias": "BIOL-017-001", "path": "/courses/21344/sections/001", "id": "21344-001", "aliases": ["BIOL-017-001"]}, "comments": "This non-science-major course presents major themes in biology by examining the nature of food and the ways in which humans modify, and have been modified by, the organisms they eat. The first part of the course concerns the chemistry, structure, and physiology of plants and animals, and provides brief introduction to human nutrition. The second part of the course deals with evolution and genetics in the context of the origin and genetic modification of domesticated organisms. Finally, the course explores how food is produced and the place of agriculture in the global economy. Lectures will be supplemented by demonstrations, laboratory exercises, field trips, and movies.\r\n\r\n“This was a mind-expanding class,” one student said. Another noted: “this course singlehandedly rejuvenated my interest in science.” A student commented that the lecture slides are “pithy and interesting.”\r\n\r\nMost students raved about Professor Poethig. He is a “fantastic lecturer” who is “truly passionate about the course content.” Professor Poethig was “exceptionally competent in running the class,” and produced “engaging lectures and thoughtful assignments.” Some students felt that he moved through difficult concepts too quickly and had too much material planned for each lecture, leaving less time to properly answer questions. \r\n\r\nWork for this course was generally considered “very manageable and tests are fair.” However, some found it “excessive for the information we were expected to know,” and others felt the exam questions were a bit too specific.\r\n", "num_students": 36, "path": "/courses/21344/sections/001/reviews/208-RICHARD-SCOTT-POETHIG", "instructor": {"path": "/instructors/208-RICHARD-SCOTT-POETHIG", "first_name": "RICHARD SCOTT", "last_name": "POETHIG", "id": "208-RICHARD-SCOTT-POETHIG", "name": "RICHARD SCOTT POETHIG"}, "num_reviewers": 35, "id": "21344-001-208-RICHARD-SCOTT-POETHIG"}]}, "credits": null, "primary_alias": "BIOL-017", "path": "/courses/21344", "sections": {"path": "/courses/21344/sections", "values": [{"name": "DNA, DIET, AND DISEASE: The Biology of Food", "sectionnum": "001", "primary_alias": "BIOL-017-001", "path": "/courses/21344/sections/001", "id": "21344-001", "aliases": ["BIOL-017-001"]}]}, "id": 21344, "aliases": ["BIOL-017"]}