[{"ratings": {"rAmountLearned": "2.56", "rDifficulty": "1.37", "rStimulateInterest": "2.29", "rRecommendMajor": "3.40", "rCourseQuality": "2.55", "rWorkRequired": "1.18", "rInstructorAccess": "2.88", "rReadingsValue": "2.43", "rRecommendNonMajor": "3.11", "rCommAbility": "2.59", "rInstructorQuality": "2.58"}, "section": {"name": "CRIMINOLOGY", "sectionnum": "401", "primary_alias": "CRIM-100-401", "path": "/courses/24230/sections/401", "id": "24230-401", "aliases": ["CRIM-100-401", "SOCI-233-401"]}, "comments": "Criminology 100 is an introductory course that examines the multi-disciplinary science of law making, law breaking, and law enforcing. It reviews theories and data predicting where, when, by whom and against whom crimes happen. It also addresses the prevention of different offense types by different kinds of offenders against different kinds of people. Police, courts, prisons, and other institutions are critically examined as both preventing and causing crime. The course uses Professor Adler's textbook Criminology.\r\n\r\nStudents described this course as \"very interesting\" and \"highly relevant to today's world.\"  The course textbook was interesting and easy to read.  Lectures were often \"engaging\" and students reported enjoying Professor Adler's many anecdotes. Students also really liked the guest lecturers.\r\n\r\nStudents praised Professor Adler for her enthusiasm, her engagement, and her extensive knowledge as a leading expert in the field of Criminology.  One student reported that \"Professor Adler literally wrote the book on criminology, and it really shows.\"  Students appreciated Professor Adler's approachability and her \"willingness to discuss anything with her students.\"  Some students complained that at times it was difficult to hear Professor Adler, particularly if you sat in the back.\r\n\r\nStudents overall found this course to be easy. Very little reading was assigned. The course consisted of one midterm, one final, and a handful of pop-quizzes. Some students reported that attending lecture was sufficient preparation for these examinations. This course was recommended for freshmen. This course satisfies the Society Sector.  \r\n", "num_students": 185, "path": "/courses/24230/sections/401/reviews/4770-FREDA-ADLER", "instructor": {"path": "/instructors/4770-FREDA-ADLER", "first_name": "FREDA", "last_name": "ADLER", "id": "4770-FREDA-ADLER", "name": "FREDA ADLER"}, "num_reviewers": 165, "id": "24230-401-4770-FREDA-ADLER"}]