[{"ratings": {"rAmountLearned": "2.54", "rDifficulty": "1.89", "rStimulateInterest": "3.07", "rRecommendMajor": "3.74", "rCourseQuality": "2.85", "rWorkRequired": "2.22", "rInstructorAccess": "3.75", "rReadingsValue": "2.36", "rRecommendNonMajor": "0.52", "rCommAbility": "3.50", "rInstructorQuality": "3.62"}, "section": {"name": "POLITICAL SCIENCE HONORS", "sectionnum": "301", "primary_alias": "PSCI-497-301", "path": "/courses/23688/sections/301", "id": "23688-301", "aliases": ["PSCI-497-301"]}, "comments": "This is a mandatory seminar for all students planning to submit an honors thesis for the purpose of possibly earning distinction in Political Science upon graduation. The course is aimed at helping students identify a useful and feasible research question, become familiar with the relevant literatures and debates pertaining to that question, develop a basic understanding of what might constitute \"good\" and \"original\" research in different subfields, identify a faculty advisor who can supervise the honors thesis, and set up a preliminary plan for conducting and presenting the research. (Note: it is not possible to pre-register for this seminar. All interested students should submit an application for the Honors Program, and students who are accepted into the program will be automatically enrolled in PSCI 497.)\r\n\r\nAlmost all of the students in this class enjoyed the content. Students found that they had time to discuss their topic of interest with the professor. The whole course was discussion based, which was praised by a lot of the students. However, a small minority of students felt that more time should have been spent on working on the thesis rather than merely talking to the class about it. \r\n\r\nProfessor Doherty-Sil received great reviews. She is smart and thought provoking in conducting class discussions. Students commented on her ability to make difficult concepts far more tangible. Professor Doherty-Sil is also “extremely approachable” and “offers great advice” on thesis writing. \r\n\r\nMost students felt that the assessment structure for the thesis paper was sensible. This course is highly recommended to anyone pursuing a political science major. A few students mentioned that there is a large amount of reading for the class.\r\n", "num_students": 36, "path": "/courses/23688/sections/301/reviews/3336-EILEEN-M--DOHERTY-SIL", "instructor": {"path": "/instructors/3336-EILEEN-M--DOHERTY-SIL", "first_name": "EILEEN M.", "last_name": "DOHERTY-SIL", "id": "3336-EILEEN-M--DOHERTY-SIL", "name": "EILEEN M. DOHERTY-SIL"}, "num_reviewers": 34, "id": "23688-301-3336-EILEEN-M--DOHERTY-SIL"}]