[{"ratings": {"rAmountLearned": "3.24", "rDifficulty": "2.63", "rStimulateInterest": "3.39", "rRecommendMajor": "3.74", "rCourseQuality": "3.09", "rWorkRequired": "2.92", "rInstructorAccess": "3.05", "rReadingsValue": "2.76", "rRecommendNonMajor": "3.03", "rCommAbility": "3.08", "rInstructorQuality": "3.28"}, "section": {"name": "MANAGEMENT INFO SYSTEMS", "sectionnum": "001", "primary_alias": "OPIM-210-001", "path": "/courses/23592/sections/001", "id": "23592-001", "aliases": ["OPIM-210-001"]}, "comments": "This course provides a broad-based introduction to the management of information technology focusing on three interrelated themes: technology, organization, and strategy. The goal of this course is to equip students with the knowledge and tools to utilize information systems to pursue a firm's strategic and organizational goals. The course has no prerequisites other than a general interest in the applications of information technology.\r\n\r\nOverall, students enjoyed this “interesting” and “unbelievably thought-provoking” class. While some of the reading and homework cases were seen as boring and not very instructive, students agreed that this class would be valuable for the real world and had many “classroom take-aways.” In addition, this class afforded students “the ability to develop critical thinking skills which aren’t emphasized in other classes.”\r\n\r\nWhile Professor Clemons can originally seem “pompous,” students generally agree that he is a “nice-professor-in-disguise.” He is definitely willing to provide extra help for students who are struggling in the class. Students also classified him as a “tremendous teacher” and “absolutely brilliant.” While reviews were mixed about Professor Clemons, students agreed that he is fair and capable of teaching well.\r\n\r\nDespite the average raw grade being an A-, the students said that the curve in this class was challenging. In addition, the final project was described as “a little ridiculous.” Overall, the students agreed that the readings and class participation are the keys to doing well in this class.\r\n", "num_students": 48, "path": "/courses/23592/sections/001/reviews/4075-ERIC-K-CLEMONS", "instructor": {"path": "/instructors/4075-ERIC-K-CLEMONS", "first_name": "ERIC K", "last_name": "CLEMONS", "id": "4075-ERIC-K-CLEMONS", "name": "ERIC K CLEMONS"}, "num_reviewers": 46, "id": "23592-001-4075-ERIC-K-CLEMONS"}]