{"coursehistories": {"path": "/coursehistories/1809"}, "description": "An overview of Asian American literature from its beginnings at the turn of the twentieth century to the present. This course covers a wide range of Asian American novels, plays, and poems, situating them in the contexts of American history and minority communities and considering the variety of formal strategies these different texts take. \n\nSee the English Department's website at www.english.upenn.edu for a description of the current offerings. \n\n", "semester": "2010C", "name": "ASIAN-AMERICAN LIT", "reviews": {"path": "/courses/22960/reviews", "values": [{"ratings": {"rAmountLearned": "3.28", "rDifficulty": "2.36", "rStimulateInterest": "3.73", "rRecommendMajor": "3.73", "rCourseQuality": "3.62", "rWorkRequired": "2.58", "rInstructorAccess": "3.81", "rReadingsValue": "3.58", "rRecommendNonMajor": "3.27", "rCommAbility": "3.84", "rInstructorQuality": "3.77"}, "section": {"name": "ASIAN-AMERICAN LIT", "sectionnum": "601", "primary_alias": "ENGL-072-601", "path": "/courses/22960/sections/601", "id": "22960-601", "aliases": ["ENGL-072-601", "ASAM-002-601"]}, "comments": "“Introduction to Asian American Literature” provides an overview of Asian American literature from its beginnings at the turn of the twentieth century to the present. Through novels, short stories, films, and poetry, it asks what constitutes Asian American literature, and how these representations have changed over time as “Asian America” has changed. In each instance, we will read these forms in the context of their historical and cultural moments, asking how these expressions reveal and respond to the conditions of modern minority life in the United States. Readings and films may include Chinatown stories, representations of Japanese internment, pan-ethnic activist literature, works by such authors as Maxine Hong Kingston, Jhumpa Lahiri, and Ruth Ozeki, and films such as The Namesake. &#8232;&#8232;\r\n\r\nStudents generally agreed that this class was “really enjoyable,” “fun and exciting.” One student commented that the course “makes you think in the \"bigger\" picture sense and consider all points of view and perspectives.” The “discussion was always lively,” and the “course taught me how to read and analyze literature in a way that I've never done in any other class.” Certain students affirmed that their “critical thinking skills grew dramatically over the course of the semester,” confirming they attained a “broadened and deepened understanding” of the material.” Students said they “learned a lot more than [they] expected to” and “loved this course.” &#8232;\r\n\r\nProfessor Saha is universally described as a “great instructor” who was “truly passionate about the subject,” able “to stimulate interest among students of all majors and backgrounds,” and “led discussions really well.” This “engaging and thought provoking” professor was “phenomenal” in that she “did a great job drawing out unifying themes throughout the semester” and also “led class discussions without dominating them.” Because she was “very well-versed in the genre,” students were comfortable communicating with and interacting with her throughout the semester. &#8232;&#8232;Students “found readings to be extremely captivating, the conversations in class stimulating and the instruction informative.” They appreciated the smaller class size as it nurtured significant discussion, and they felt the professor “chose some great texts for us to read.” \r\n\r\nThis course fulfills Sector 2: Language, Literature and Culture and Sector 6: 20th Century Literature of the English Standard Major of the English Standard Major. It also fulfills Sector 3: Arts and Letters. It typically includes two three to five page essays, a midterm, and a final exam.\r\n", "num_students": 27, "path": "/courses/22960/sections/601/reviews/4609-POULOMI-SAHA", "instructor": {"path": "/instructors/4609-POULOMI-SAHA", "first_name": "POULOMI", "last_name": "SAHA", "id": "4609-POULOMI-SAHA", "name": "POULOMI SAHA"}, "num_reviewers": 27, "id": "22960-601-4609-POULOMI-SAHA"}]}, "credits": null, "primary_alias": "ENGL-072", "path": "/courses/22960", "sections": {"path": "/courses/22960/sections", "values": [{"name": "ASIAN-AMERICAN LIT", "sectionnum": "601", "primary_alias": "ENGL-072-601", "path": "/courses/22960/sections/601", "id": "22960-601", "aliases": ["ENGL-072-601", "ASAM-002-601"]}]}, "id": 22960, "aliases": ["ENGL-072", "ASAM-002"]}