{"coursehistories": {"path": "/coursehistories/5745"}, "description": "Stories told about the past have long been understood as moral lessons. And historical narratives have also been susceptible to different readings by opposed parties. But the strength of appeals to the past is not a constant: historical experience has at some times and in some places been seen as irrelevant to practical action. Today, in the United States as well as in many other parts of the world, appeals to historical precedent carry considerable weight, and are made for many purposes. For example, the dissolution of Yugoslavia, has been explained as a result of centuries-old ethic tensions, yet when Yugoslavia was created at the end of World War I, objections were countered with the anthropological judgment that the new nation's ethnic divisions were not really significant. Or consider the debate over the ownership of the bones of so-called \"Kennewick Man,\" which pitted Native Amerians against scientists over questions of identity and legal claims. Or, historical generalizations in biology over the value of Darwin's theory, resulting in political debates in local and school board elections and presidential contests. This course will discuss the uses of history in contemporary and past situations, drawing examples from the United States, Europe, the Midfle East, and Africa. \n\n", "semester": "2013A", "name": "WHO OWNS THE PAST", "reviews": {"path": "/courses/31070/reviews", "values": [{"ratings": {"rDifficulty": "2.09", "rTAQuality": "3.50", "rStimulateInterest": "2.45", "rCourseQuality": "2.43", "rWorkRequired": "2.55", "rInstructorQuality": "2.71", "rCommAbility": "2.64", "rInstructorAccess": "3.09"}, "section": {"name": "WHO OWNS THE PAST", "sectionnum": "301", "primary_alias": "STSC-388-301", "path": "/courses/31070/sections/301", "id": "31070-301", "aliases": ["STSC-388-301"]}, "comments": "", "num_students": 16, "path": "/courses/31070/sections/301/reviews/6600-JASON-A-OAKES", "instructor": {"path": "/instructors/6600-JASON-A-OAKES", "first_name": "JASON A", "last_name": "OAKES", "id": "6600-JASON-A-OAKES", "name": "JASON A OAKES"}, "num_reviewers": 15, "id": "31070-301-6600-JASON-A-OAKES"}]}, "credits": null, "primary_alias": "STSC-388", "path": "/courses/31070", "sections": {"path": "/courses/31070/sections", "values": [{"name": "WHO OWNS THE PAST", "sectionnum": "301", "primary_alias": "STSC-388-301", "path": "/courses/31070/sections/301", "id": "31070-301", "aliases": ["STSC-388-301"]}]}, "id": 31070, "aliases": ["STSC-388"]}