[{"ratings": {"rAmountLearned": "3.32", "rDifficulty": "3.06", "rStimulateInterest": "3.32", "rRecommendMajor": "3.74", "rCourseQuality": "3.39", "rWorkRequired": "2.82", "rInstructorAccess": "3.18", "rReadingsValue": "3.18", "rRecommendNonMajor": "3.16", "rCommAbility": "3.56", "rInstructorQuality": "3.50"}, "section": {"name": "MARKETS,MORALITY&CAPITAL: Markets, Morality & the Future of Capitalism", "sectionnum": "401", "primary_alias": "LGST-226-401", "path": "/courses/15993/sections/401", "id": "15993-401", "aliases": ["LGST-226-401", "PHIL-279-401"]}, "comments": "This course is based on the idea that markets play a central role in the life of a capitalist democracy. But is this a good thing? The goal of this class is to examine the market from the perspective of various social values to see whether we should want a market system and, if so, what kind of market system we should want. Students will read several important philosophers, economists and political theorists writing on these issues, including Adam Smith, John Rawls, Amartya Sen, Friedrich Hayek, Karl Marx, Robert Nozick, Ronald Dworkin, Jergen Habermas, Peter Singer, and others.\r\n\r\nStudents described this course as an “interesting merger of business and liberal minded arguments to address questions of morality” and one of the “best classes taken at Penn.” This “unique” and “provocative” course comes “highly recommended.”\r\n\r\nProfessor Hussain is “captivating” and “a master teacher.” He provides the students with a “comprehensive understanding of the material,” enabling him to elicit “rare and refreshing” class discussion. Although the class size was large, Professor Hussain remembered the students’ names and made the lecture “feel like a seminar.” Some students felt he “made himself available,” while others claim he was “not accessible,” “didn’t give enough guidance on essays,” and was a harsh grader.\r\n\r\nStudents commented that the readings were “difficult” and “unnecessarily long.” This course is “more suited for upperclassmen,” who have backgrounds in philosophy and “are not intimidated by the discussion of complex philosophical ideas in a lecture of 60 students.”", "num_students": 55, "path": "/courses/15993/sections/401/reviews/2538-WAHEED-HUSSAIN", "instructor": {"path": "/instructors/2538-WAHEED-HUSSAIN", "first_name": "WAHEED", "last_name": "HUSSAIN", "id": "2538-WAHEED-HUSSAIN", "name": "WAHEED HUSSAIN"}, "num_reviewers": 55, "id": "15993-401-2538-WAHEED-HUSSAIN"}]