{"coursehistories": {"path": "/coursehistories/5405"}, "description": "This course offers an exhaustive interdisciplinary examination of criminal conduct in business organizations. First, it provides an overview of federal and state laws addressing corporate and white collar crime will be explored in depth. Next, the course examines leading social science research on corporate deviance and its control. Finally, the course raises some of the many normative and policy questions left largely unaddressed by sociologists, criminologists, and legal scholars. \n\n", "semester": "2012A", "name": "CORPORATE & WHITE COLLAR CRIME", "reviews": {"path": "/courses/27223/reviews", "values": [{"ratings": {"rAmountLearned": "2.75", "rDifficulty": "1.79", "rStimulateInterest": "3.15", "rRecommendMajor": "3.52", "rCourseQuality": "2.81", "rWorkRequired": "1.56", "rInstructorAccess": "3.44", "rReadingsValue": "2.54", "rRecommendNonMajor": "3.19", "rCommAbility": "3.19", "rInstructorQuality": "3.48"}, "section": {"name": "CORPORATE & WHITE COLLAR CRIME", "sectionnum": "001", "primary_alias": "CRIM-250-001", "path": "/courses/27223/sections/001", "id": "27223-001", "aliases": ["CRIM-250-001"]}, "comments": "This course offers an exhaustive interdisciplinary examination of criminal conduct in business organizations.  First, it provides an overview of federal and state laws addressing corporate and white collar crime will be explored in depth.  Next, the course examines leading social science research on corporate deviance and its control. Finally, the course raises some of the many normative and policy questions left largely unaddressed by sociologists, criminologists, and legal scholars.\r\n\r\n\tStudents described this course as “incredibly interesting” and “balances the usage of technology like video clips and traditional lectures effectively.” Prominent guest speakers were brought in such as the Director of the FBI. However, some students voiced that the “class seemed very disorganized” but that “there is a lot of potential to this class.”\r\n\r\n\tStudents had high regard for Professor Laufer. They described him as “extremely thoughtful and thorough with every subject he instructs.” He also “did an incredibly good job of stimulating interest in the material covered” and “made himself incredibly accessible to students.” Others mentioned that he is “funny” and “knows how to connect with his students in a real way.”\r\n\r\n\tThe overall difficulty of this course is not very challenging. However, some of the assignments are not posted in a timely manner, according to some students. They commented that they would recommend this course to “anyone who might be interested in law and corporate crimes.” There are no prerequisites for this course.", "num_students": 64, "path": "/courses/27223/sections/001/reviews/1719-WILLIAM-S--LAUFER", "instructor": {"path": "/instructors/1719-WILLIAM-S--LAUFER", "first_name": "WILLIAM S.", "last_name": "LAUFER", "id": "1719-WILLIAM-S--LAUFER", "name": "WILLIAM S. LAUFER"}, "num_reviewers": 57, "id": "27223-001-1719-WILLIAM-S--LAUFER"}]}, "credits": null, "primary_alias": "CRIM-250", "path": "/courses/27223", "sections": {"path": "/courses/27223/sections", "values": [{"name": "CORPORATE & WHITE COLLAR CRIME", "sectionnum": "001", "primary_alias": "CRIM-250-001", "path": "/courses/27223/sections/001", "id": "27223-001", "aliases": ["CRIM-250-001"]}]}, "id": 27223, "aliases": ["CRIM-250"]}