{"coursehistories": {"path": "/coursehistories/2547"}, "description": "Common principles of Circuits, Systems and flows of electron, photons, and other entities as applied to electrical, and non-electrical systems such as optical (plasmonic), fluidic, traffic, neural, electrochemical, and biological circuits. Class demonstration and computer simulations will be given where applicable to help in rapid understanding of concepts and applications. \n\n", "semester": "2011C", "name": "ELEC CIRCUITS & SYS I", "reviews": {"path": "/courses/24358/reviews", "values": [{"ratings": {"rAmountLearned": "2.96", "rDifficulty": "2.97", "rStimulateInterest": "2.76", "rRecommendMajor": "3.46", "rCourseQuality": "2.79", "rWorkRequired": "2.72", "rInstructorAccess": "2.73", "rReadingsValue": "2.32", "rRecommendNonMajor": "1.77", "rCommAbility": "3.06", "rInstructorQuality": "3.10"}, "section": {"name": "ELEC CIRCUITS & SYS I", "sectionnum": "001", "primary_alias": "ESE-215-001", "path": "/courses/24358/sections/001", "id": "24358-001", "aliases": ["ESE-215-001"]}, "comments": "The course covers common principles of circuits, systems and flows of electron,\r\nphotons, and other entities as applied to electrical and non-electrical systems such as\r\noptical (plasmonic), fluidic, traffic, neural, electrochemical, and biological circuits. Class\r\ndemonstration and computer simulations are given where applicable to help in rapid\r\nunderstanding of concepts and applications.\r\nThis course teaches you how to analyze complex circuit. Students reported this\r\ncourse being “helpful” and “interesting.” Students stated that this course was “basically a\r\nreview of PHYS 151 until the first midterm” and then got into completely new and\r\ninteresting topics afterwards.\r\nProfessor Lee was highly regarded by his students. Students reported him as\r\nbeing “great,” an “excellent professor,” and an “awesome lecturer. Students stated that\r\nthe course felt rushed towards the end and one suggested that Lee could “cover the first\r\nfew chapters much faster and cover the harder material such as phasors in more detail and\r\nfor more time.” Students reported Professor Lee and the TAs as both being extremely\r\nhelpful and easy to meet with. Students praised Professor Lee for being clear and concise\r\nin his lectures, and coming well prepared to class.\r\nThe class generally consisted of undergraduates between freshman and junior year\r\nand requires PHYS 151 experience. Students complained that the final consisted of 45%\r\nof the grade and wished there was a higher grade on homework, which “can take up to 6-\r\n8 hours a week if done properly.” Students in systems engineering reported some\r\ndifficulty in the class while electrical systems engineers found this course’s course\r\ncontent to be fair.", "num_students": 88, "path": "/courses/24358/sections/001/reviews/355-DANIEL-D--LEE", "instructor": {"path": "/instructors/355-DANIEL-D--LEE", "first_name": "DANIEL D.", "last_name": "LEE", "id": "355-DANIEL-D--LEE", "name": "DANIEL D. LEE"}, "num_reviewers": 85, "id": "24358-001-355-DANIEL-D--LEE"}]}, "credits": null, "primary_alias": "ESE-215", "path": "/courses/24358", "sections": {"path": "/courses/24358/sections", "values": [{"name": "ELEC CIRCUITS & SYS I", "sectionnum": "001", "primary_alias": "ESE-215-001", "path": "/courses/24358/sections/001", "id": "24358-001", "aliases": ["ESE-215-001"]}]}, "id": 24358, "aliases": ["ESE-215"]}