{"coursehistories": {"path": "/coursehistories/3779"}, "description": "The comparative study of South Asian politics begins with many antecedent questions. What are the reasons why a strong national political identity in the Indian subcontinent was no consolidated and territorial boundaries defined until the advent of the British Raj? Alternatively, given major regional diversities, why did the subcontinent not become differentiated into a large number of national states on the model of Europe? To what extent was the movement toward a unified territorial state weakened by colonial policies that recast social groups in terms of new pan-Indian categories based on caste and religious identities? What factors led to the partition of the subcontinent at the time of independence on the basis of religion, and what consequences did partition have for the strategies adopted by each state to develop an overarching national identity and universal principles of legitimate state power? Although the greater part of the course will address these questions by analyzing the social and political dynamics of democracy in India, they are equally relevant for understanding the difficulties encountered by Pakistan in defining a core identity and a stable form of government. \n\n", "semester": "2008A", "name": "COMP. S. ASIAN POLITICS", "reviews": {"path": "/courses/20732/reviews", "values": [{"ratings": {"rAmountLearned": "3.38", "rDifficulty": "2.75", "rStimulateInterest": "2.06", "rRecommendMajor": "2.75", "rCourseQuality": "2.50", "rWorkRequired": "2.75", "rInstructorAccess": "3.06", "rReadingsValue": "3.19", "rRecommendNonMajor": "1.81", "rCommAbility": "2.56", "rInstructorQuality": "2.44"}, "section": {"name": "COMP. S. ASIAN POLITICS", "sectionnum": "301", "primary_alias": "PSCI-220-301", "path": "/courses/20732/sections/301", "id": "20732-301", "aliases": ["PSCI-220-301"]}, "comments": "Contemporary South Asian Politics is cross-listed as PSCI220 and SAST223. The course focuses on contemporary politics in India and Pakistan. The greater part of the course analyzes the social and political dynamics of democracy in India, but the material is also relevant to better understanding the difficulties encountered by Pakistan in defining a core identity and a stable form of government.\r\n\r\nOverall, students enjoyed this class calling it “a joy to take” and “very informative.” They also liked how Professor Frankel integrated films, readings, and lectures to give students a better understanding of the subject. However, students did have grievances with the class structure and content, saying they wished the class would also include information on other South Asian countries.   “A course on contemporary South Asian politics should not ignore the larger dynamics of the region,” said one student. \r\n\r\nStudents liked Professor Frankel, commenting that it was “a privilege to learn from such a renowned professor” and that she was always “very helpful during office hours.” However they wished she had given better feedback on paper topics.\r\n\r\nStudents found the hardest part of the course were the papers as the assigned subject was often very broad and it was hard to know what the professor was looking for. They also mentioned that there were too many assigned readings and that it was difficult to keep up with the pace of the class. “At a certain point the value of so many readings greatly diminishes and becomes incredibly difficult to analyze and comprehend.” Students commented that there was not enough time between paper assignments, as papers were not handed back before the next one was due.", "num_students": 18, "path": "/courses/20732/sections/301/reviews/1685-FRANCINE-R-FRANKEL", "instructor": {"path": "/instructors/1685-FRANCINE-R-FRANKEL", "first_name": "FRANCINE R", "last_name": "FRANKEL", "id": "1685-FRANCINE-R-FRANKEL", "name": "FRANCINE R FRANKEL"}, "num_reviewers": 16, "id": "20732-301-1685-FRANCINE-R-FRANKEL"}]}, "credits": null, "primary_alias": "PSCI-220", "path": "/courses/20732", "sections": {"path": "/courses/20732/sections", "values": [{"name": "COMP. S. ASIAN POLITICS", "sectionnum": "301", "primary_alias": "PSCI-220-301", "path": "/courses/20732/sections/301", "id": "20732-301", "aliases": ["PSCI-220-301"]}]}, "id": 20732, "aliases": ["PSCI-220"]}