[{"ratings": {"rAmountLearned": "1.65", "rDifficulty": "1.71", "rStimulateInterest": "1.75", "rRecommendMajor": "1.82", "rCourseQuality": "1.59", "rWorkRequired": "1.93", "rInstructorAccess": "2.48", "rReadingsValue": "2.00", "rRecommendNonMajor": "1.54", "rCommAbility": "2.00", "rInstructorQuality": "2.05"}, "section": {"name": "MULT BUS STRAT", "sectionnum": "001", "primary_alias": "MGMT-871-001", "path": "/courses/27781/sections/001", "id": "27781-001", "aliases": ["MGMT-871-001"]}, "comments": "Management 871 focuses on the creation of competitive advantage in the multinational firm. It examines the nature of global competition by exploring the characteristics of global vs. non-global industries and strategies that have been successful in a global context. The course also considers issues regarding make, vs. buy, sourcing, location decisions, and alliances - all issues related to designing and coordinating the global value chain for maximum advantage. Additionally, the course examines how firms attempt to build a national presence, including examining the market entry decision, the role of the country manager, as well as design and human resource management policies in the multinational firm.\r\n\r\nThis course discussed a broad range of areas with good content. However, students said the lectures and final consulting project of this course were not very “simulating.” Many students also complained that the course was “poorly structured” and students received little guidance and feedback from teaching staff on exams and the final project. In addition, a few students noted the lectures only covered “20% or so” of the slide materials.\r\n\r\nStudents described Professor Kapstein as “engaging” and “accessible.”\r\n\r\nSome students suggested the grade policy could be more transparent. This is an MBA course, and undergraduates need permission to attend this course.\r\n", "num_students": 41, "path": "/courses/27781/sections/001/reviews/6127-ETHAN-B--KAPSTEIN", "instructor": {"path": "/instructors/6127-ETHAN-B--KAPSTEIN", "first_name": "ETHAN B.", "last_name": "KAPSTEIN", "id": "6127-ETHAN-B--KAPSTEIN", "name": "ETHAN B. KAPSTEIN"}, "num_reviewers": 37, "id": "27781-001-6127-ETHAN-B--KAPSTEIN"}]