{"coursehistories": {"path": "/coursehistories/897"}, "description": "This course parallels and extends the content of PHYS 151, at a somewhat higher mathematical level. Recommended for well-prepared students in engineering and the physical sciences, and particularly for those planning to major in physics. Electric and magnetic fields; Coulomb's, Ampere's, and Faraday's laws; special relativity; Maxwell's equations, electromagnetic radiation. \n\n", "semester": "2008A", "name": "HONORS PHYSICS II", "reviews": {"path": "/courses/20694/reviews", "values": [{"ratings": {"rAmountLearned": "3.75", "rDifficulty": "3.67", "rStimulateInterest": "3.56", "rRecommendMajor": "4.00", "rCourseQuality": "3.56", "rWorkRequired": "3.75", "rInstructorAccess": "3.81", "rReadingsValue": "2.80", "rRecommendNonMajor": "2.25", "rCommAbility": "3.38", "rInstructorQuality": "3.75"}, "section": {"name": "HONORS PHYSICS II", "sectionnum": "301", "primary_alias": "PHYS-171-301", "path": "/courses/20694/sections/301", "id": "20694-301", "aliases": ["PHYS-171-301"]}, "comments": "Honors Physics II: Electromagnetism and Radiation is an honors course and Benjamin Franklin seminar, which mirrors the content of Physics 151 but at a significantly higher mathematical level. Prerequisites for this course include Math 114 and either Physics 150 or 170.  According to the course description, the course is recommended “for well-prepared students in engineering and the physical sciences, and particularly for those planning to major in physics.”  It also fulfills the Physical World Sector requirement.\r\n\r\nThe course covers electric and magnetic fields; Coulomb\\'s, Ampere\\'s, and Faraday\\'s laws; special relativity; Maxwell\\'s equations, and electromagnetic radiation, according to the course description.  Students found the course to be extremely difficult; one wrote that it was the “most rigorous course this year, with the most amount of work required.”  They especially thought the homework problem sets were extremely challenging and at times “overwhelming.”  Many students requested that, in the future, a TA be provided to assist them.\r\n\r\nDespite the difficult nature of the course, students described it as “excellent” and “worthwhile.”  One student commented, “Dr. Mele is an excellent lecturer, although he sometimes can be a bit dry.” Overall, they were pleased with Professor Mele’s teaching style, and thought that he did a good job of presenting the material.  ", "num_students": 20, "path": "/courses/20694/sections/301/reviews/982-EUGENE-J-MELE", "instructor": {"path": "/instructors/982-EUGENE-J-MELE", "first_name": "EUGENE J", "last_name": "MELE", "id": "982-EUGENE-J-MELE", "name": "EUGENE J MELE"}, "num_reviewers": 16, "id": "20694-301-982-EUGENE-J-MELE"}]}, "credits": null, "primary_alias": "PHYS-171", "path": "/courses/20694", "sections": {"path": "/courses/20694/sections", "values": [{"name": "HONORS PHYSICS II", "sectionnum": "301", "primary_alias": "PHYS-171-301", "path": "/courses/20694/sections/301", "id": "20694-301", "aliases": ["PHYS-171-301"]}]}, "id": 20694, "aliases": ["PHYS-171"]}