{"coursehistories": {"path": "/coursehistories/4982"}, "description": "The overreaching goal of this course is to explore and analyze tough sports social impact issues and develop strategies and solutions. The content will be both theoretical and practical. All students will be provided opportunities to address real sports and social impact issues. The concept of social responsibility may be more dominant in sports than any other business sector. From the impact of hosting global sporting events, building stadiums and arenas to recreation center basketball programs designed to keep kids out of trouble, sports is involved at many levels. This course will focus primarily on sport and social impact and explore how this concept has evolved since sports programs were first introduced into Americas schools in the early 1900s. Students will be required to assist an enterprise involved in a sport and social impact endeavor. Student presentations of those Semester Team Projects will be a major component of the student grade. The course will also feature several timely guest speakers. The broad question throughout the course will be: How can sports be used to have a positive impact on society? Students in this course will search for the great idea, great delivery and whathas sustainable impact. \n\n", "semester": "2012A", "name": "SPORTS VENTURES & SOC IM", "reviews": {"path": "/courses/27670/reviews", "values": [{"ratings": {"rAmountLearned": "2.04", "rDifficulty": "1.12", "rStimulateInterest": "2.50", "rRecommendMajor": "2.25", "rCourseQuality": "2.17", "rWorkRequired": "1.60", "rInstructorAccess": "2.04", "rReadingsValue": "2.00", "rRecommendNonMajor": "2.13", "rCommAbility": "2.68", "rInstructorQuality": "2.63"}, "section": {"name": "SPORTS VENTURES & SOC IM", "sectionnum": "001", "primary_alias": "LGST-231-001", "path": "/courses/27670/sections/001", "id": "27670-001", "aliases": ["LGST-231-001"]}, "comments": "The overreaching goal of LGST231 is to explore and analyze tough sports social impact issues and develop strategies and solutions. The content will be both theoretical and practical. All students will be provided opportunities to address real sports and social impact issues. The concept of social responsibility may be more dominant in sports than any other business sector. From the impact of hosting global sporting events, building stadiums and arenas to recreation center basketball programs designed to keep kids out of trouble, sports is involved at many levels. This course will focus primarily on sport and social impact and explore how this concept has evolved since sports programs were first introduced into Americas schools in the early 1900s. Students will be required to assist an enterprise involved in a sport and social impact endeavor. Student presentations of those Semester Team Projects will be a major component of the student grade. The course will also feature several timely guest speakers. The broad question throughout the course will be: How can sports be used to have a positive impact on society? Students in this course will search for the great idea, great delivery and what has sustainable impact.\r\n\t\r\nOverall, students found that this course needed “more organization” because it was “drawn out” “without enough material to support it.” Students stressed that there was “too much time watching videos and not enough time thinking critically about sports and social impact” and that the slides were “not informative.” One student thought the group size was “too large.” However, some students did think the class was a “real-life look at/example” of the material discussed and learned in class.\r\n\t\r\nMost students thought that Professor Shropshire had an “apparent lack of preparation” and provided “no guidance regarding the semester projects.” A few students thought Professor Shropshire did not “know exactly what to teach” and had an over-reliance “on students for material rather than presenting stuff they had prepared on their own.” Students noticed that as the course went on, that Professor Shropshire was getting “more guest speakers and showing more videos rather than engaging with the class.” Although one student noted that their “favorite part of the course was having guest speakers come in.”\r\n\t\r\nMany students thought that assignments in this course were “quite subjective” and that “group projects with clients also varied in how heavily they were tied to course concepts.” One student thought the textbook was the “worst textbook of any college class” because it was “hard to understand, hard to tie to other course material” and “boring.” Students complained that a “substantial amount of reading was assigned but rarely mentioned in class” and that assignments “were also never mentioned outside of the syllabus” providing a lack of guidance. This course has no prerequisites and is open to all students. \r\n", "num_students": 46, "path": "/courses/27670/sections/001/reviews/718-KENNETH-L--SHROPSHIRE", "instructor": {"path": "/instructors/718-KENNETH-L--SHROPSHIRE", "first_name": "KENNETH L.", "last_name": "SHROPSHIRE", "id": "718-KENNETH-L--SHROPSHIRE", "name": "KENNETH L. SHROPSHIRE"}, "num_reviewers": 38, "id": "27670-001-718-KENNETH-L--SHROPSHIRE"}, {"ratings": {"rAmountLearned": "2.04", "rDifficulty": "1.12", "rStimulateInterest": "2.67", "rRecommendMajor": "2.25", "rCourseQuality": "2.17", "rWorkRequired": "1.60", "rInstructorAccess": "2.04", "rReadingsValue": "2.00", "rRecommendNonMajor": "2.13", "rCommAbility": "2.68", "rInstructorQuality": "2.77"}, "section": {"name": "SPORTS VENTURES & SOC IM", "sectionnum": "001", "primary_alias": "LGST-231-001", "path": "/courses/27670/sections/001", "id": "27670-001", "aliases": ["LGST-231-001"]}, "comments": "The overreaching goals of Sports Ventures & Social Impact is to explore and analyze tough sports social impact issues and develop strategies and solutions. The content will be both theoretical and practical. All students will be provided opportunities to address real sports and social impact issues. The concept of social responsibility may be more dominant in sports than any other business sector. From the impact of hosting global sporting events, building stadiums and arenas to recreation center basketball programs designed to keep kids out of trouble, sports is involved at many levels. LGST 231 will focus primarily on sport and social impact and explore how this concept has evolved since sports programs were first introduced into American schools in the early 1900s. Students will be required to assist an enterprise involved in a sport and social impact endeavor. Student presentations of Semester Team Projects will be a major component of the grade. LGST 231 will also feature several timely guest speakers. The broad question throughout the course will be: How can sports be used to have a positive impact on society? \r\n\r\n\tStudents described LGST 231 as “interesting” in concept, but “poorly executed” as a course. Multiple students enjoyed the guest speakers and readings. However, the majority of students reported that the course was “disorganized” and that the course content was “too narrow,” which resulted in assignments that were “quite subjective.” Students commented that too much time was spent “watching videos,” than learning from lecture.\r\n\r\n\tMultiple professors, who students described as unprepared “and” lacking enthusiasm, taught LGST 231. Students commented that the lectures had “no general direction,” which made it “difficult for students to grasp their role in the discussion.” Additionally, they found the slides to be “uninformative.” Multiple students reported that as the semester progressed, the professors focused more on guest speakers and videos than on “engaging with the class.”\r\n\r\n\tOverall, students did not recommend LGST 231 for majors or non-majors due to the lack of organization and course quality. Multiple students commented that the group projects were “disastrous” because the group size was too large. Additionally, students reported that the reading assignments were “rarely mentioned in class.”\r\n", "num_students": 46, "path": "/courses/27670/sections/001/reviews/3032-MORVARID-TAHERIPOUR", "instructor": {"path": "/instructors/3032-MORVARID-TAHERIPOUR", "first_name": "MORVARID", "last_name": "TAHERIPOUR", "id": "3032-MORVARID-TAHERIPOUR", "name": "MORVARID TAHERIPOUR"}, "num_reviewers": 38, "id": "27670-001-3032-MORVARID-TAHERIPOUR"}]}, "credits": null, "primary_alias": "LGST-231", "path": "/courses/27670", "sections": {"path": "/courses/27670/sections", "values": [{"name": "SPORTS VENTURES & SOC IM", "sectionnum": "001", "primary_alias": "LGST-231-001", "path": "/courses/27670/sections/001", "id": "27670-001", "aliases": ["LGST-231-001"]}]}, "id": 27670, "aliases": ["LGST-231"]}