[{"ratings": {"rAmountLearned": "2.91", "rDifficulty": "3.13", "rStimulateInterest": "1.46", "rRecommendMajor": "3.24", "rCourseQuality": "2.23", "rWorkRequired": "3.56", "rInstructorAccess": "2.40", "rReadingsValue": "1.56", "rRecommendNonMajor": "1.33", "rCommAbility": "1.94", "rInstructorQuality": "1.91"}, "section": {"name": "EMBED SYS/MICROCONT LAB", "sectionnum": "001", "primary_alias": "ESE-350-001", "path": "/courses/15706/sections/001", "id": "15706-001", "aliases": ["ESE-350-001"]}, "comments": "“Embedded Systems” emphasizes the synthesis of hardware and software through lectures and laboratory experience. This course introduces the use of real-world sensors and actuators in microprocessor systems, and major concepts include digital inputs/outputs, interrupt service routines, serial communications, and analog-to-digital conversion. Students are required to design and present a final project.\r\n\r\nStudents judged the lab and project components of this class to be engaging and worthwhile. They generally felt that knowledge and skills gained from these portions of the class would be “relevant” in the future.\r\n\r\nHowever, many found Professor Khuon’s lectures to be “difficult to understand” or “almost worthless,” though they used the slides for lab work. A few students expressed appreciation for his organization and quick responses to e-mail.\r\n\r\nStudents described all portions of this class (exams, labs, and projects) as time-consuming. This class consisted of mainly electrical engineering and systems engineering students, and systems engineers found the class to be challenging due to the frequent use of electrical circuits and programming.", "num_students": 61, "path": "/courses/15706/sections/001/reviews/4319-LUNAL-KHUON", "instructor": {"path": "/instructors/4319-LUNAL-KHUON", "first_name": "LUNAL", "last_name": "KHUON", "id": "4319-LUNAL-KHUON", "name": "LUNAL KHUON"}, "num_reviewers": 58, "id": "15706-001-4319-LUNAL-KHUON"}]