{"coursehistories": {"path": "/coursehistories/1234"}, "description": "This course is designed to examine the various roles played by the nervous and endocrine systems in controlling both physiological processes and behavior. First, the course will build a foundation in the concepts of neural and endocrine system function. Then, we will discuss how these mechanisms form the biological underpinnings of various behaviors and their relevant physiological correlates. We will focus on sexual and parental behaviors, stress, metabolism, neuroendocrine-immune interactions, and mental health. \n\n", "semester": "2009A", "name": "NEUROENDOCRINOLOGY", "reviews": {"path": "/courses/15391/reviews", "values": [{"ratings": {"rAmountLearned": "2.58", "rDifficulty": "2.91", "rStimulateInterest": "2.26", "rRecommendMajor": "3.16", "rCourseQuality": "2.58", "rWorkRequired": "2.26", "rInstructorAccess": "2.90", "rReadingsValue": "1.88", "rRecommendNonMajor": "1.50", "rCommAbility": "2.60", "rInstructorQuality": "2.73"}, "section": {"name": "NEUROENDOCRINOLOGY", "sectionnum": "401", "primary_alias": "BIBB-260-401", "path": "/courses/15391/sections/401", "id": "15391-401", "aliases": ["BIBB-260-401", "PSYC-139-401"]}, "comments": "This course explores the nervous and endocrine systems and how they work together to produce different physiological processes and behaviors in diverse vertebrate species. A wide range of topics are covered including sexual and parental behaviors, metabolism, stress, immunity, and mental health. While most of class time is dedicated to lectures, students are expected to participate in “Journal Clubs,” in which students write about and present primary literature. This, along with two exams, comprises the student’s final grade.\r\n\r\nMany students reported learning a lot and found the subject matter interesting. Students liked how the course was geared toward “practical” skills, such as public speaking and analyzing primary literature, and appreciated that exams tested critical thinking more than rote memorization. However, some students complained there was not enough focus. Assigned readings were valued for being the most recent research out there, but many found the textbook superfluous and having little correspondence to the content covered in lecture.\r\n\r\nReviews of Professor Flanagan-Cato were generally positive. One student said she was “top notch in every way,” while others described her as sweet, “extremely friendly,” and “approachable.” Some thought she was very clear, but others thought her PowerPoint slides were “boring” and scattered. Everyone respected her as a “leading researcher” in the field and really felt she knew what she was doing. Many students felt they would have benefited greatly from having lecture recordings made available on Blackboard.\r\n\r\nA background in biology is assumed, and Bibb109 or one year of biology are prerequisites. The course is highly recommend to majors but not recommended to non-majors. Although there is a lot of reading, most students enjoyed them greatly. As one student said, “[This course will] help me tremendously as a medical student.”", "num_students": 48, "path": "/courses/15391/sections/401/reviews/1281-LORETTA-MARIE-FLANAGAN-CATO", "instructor": {"path": "/instructors/1281-LORETTA-MARIE-FLANAGAN-CATO", "first_name": "LORETTA MARIE", "last_name": "FLANAGAN-CATO", "id": "1281-LORETTA-MARIE-FLANAGAN-CATO", "name": "LORETTA MARIE FLANAGAN-CATO"}, "num_reviewers": 45, "id": "15391-401-1281-LORETTA-MARIE-FLANAGAN-CATO"}]}, "credits": null, "primary_alias": "BIBB-260", "path": "/courses/15391", "sections": {"path": "/courses/15391/sections", "values": [{"name": "NEUROENDOCRINOLOGY", "sectionnum": "401", "primary_alias": "BIBB-260-401", "path": "/courses/15391/sections/401", "id": "15391-401", "aliases": ["BIBB-260-401", "PSYC-139-401"]}]}, "id": 15391, "aliases": ["BIBB-260", "PSYC-139"]}