[{"ratings": {"rAmountLearned": "3.03", "rDifficulty": "2.71", "rStimulateInterest": "2.89", "rRecommendMajor": "3.55", "rCourseQuality": "3.05", "rWorkRequired": "2.47", "rInstructorAccess": "2.63", "rReadingsValue": "2.21", "rRecommendNonMajor": "2.16", "rCommAbility": "3.35", "rInstructorQuality": "3.37"}, "section": {"name": "MGMT&ECONOFPHARMA,BIOTEC", "sectionnum": "001", "primary_alias": "HCMG-215-001", "path": "/courses/15861/sections/001", "id": "15861-001", "aliases": ["HCMG-215-001"]}, "comments": "HCMG 215 provides an overview of the management, economic and policy issues facing the pharmaceutical, biotechnology, and medical device industries. The course has a global perspective but with emphasis on the U.S. as the largest and most profitable market. Critical issues examined include: R&D intensive cost structure and rapid technological change; biotechnology and genomics startups and alliances with the pharmaceutical industry; a complex global marketplace in which prices are regulated in most countries and customers include governments and insurers, as well as physicians, pharmacists and consumers now reachable through DTC; intense and evolving M&A; government regulation of every business function: R&D, pricing, manufacturing, and promotion; and global products and multinational firms. Industry and Wharton experts from various disciplines will come in to address these issues.\r\n\r\nStudents commented that they learned a great deal in this class. They also thought the information was “exceptionally well presented.”\r\n\r\nStudents praised Professor Danzon for her vast knowledge of the industry and for being a leader in her field. Many thought she was the best professor they had encountered at Penn and referred to her as a “gem.” The guest speakers were universally well-liked and appreciated for their perspective being close to the industry.\r\n\r\nWhile students enjoyed the course, some commented that there was too much required reading. A few students wished there had been a more visible connection linking the information between lectures, but were overall very interested in what was presented to them.", "num_students": 45, "path": "/courses/15861/sections/001/reviews/602-PATRICIA-M-DANZON", "instructor": {"path": "/instructors/602-PATRICIA-M-DANZON", "first_name": "PATRICIA M", "last_name": "DANZON", "id": "602-PATRICIA-M-DANZON", "name": "PATRICIA M DANZON"}, "num_reviewers": 43, "id": "15861-001-602-PATRICIA-M-DANZON"}]