[{"ratings": {"rAmountLearned": "2.98", "rDifficulty": "2.38", "rStimulateInterest": "2.43", "rRecommendMajor": "2.94", "rCourseQuality": "2.74", "rWorkRequired": "2.41", "rInstructorAccess": "3.37", "rReadingsValue": "2.55", "rRecommendNonMajor": "2.60", "rCommAbility": "2.80", "rInstructorQuality": "2.56"}, "section": {"name": "VENTURE CAP & ENT MGMT", "sectionnum": "001", "primary_alias": "MGMT-804-001", "path": "/courses/27774/sections/001", "id": "27774-001", "aliases": ["MGMT-804-001"]}, "comments": "", "num_students": 75, "path": "/courses/27774/sections/001/reviews/215-STEPHEN-M-SAMMUT", "instructor": {"path": "/instructors/215-STEPHEN-M-SAMMUT", "first_name": "STEPHEN M", "last_name": "SAMMUT", "id": "215-STEPHEN-M-SAMMUT", "name": "STEPHEN M SAMMUT"}, "num_reviewers": 66, "id": "27774-001-215-STEPHEN-M-SAMMUT"}, {"ratings": {"rAmountLearned": "3.50", "rDifficulty": "2.75", "rStimulateInterest": "3.07", "rRecommendMajor": "3.67", "rCourseQuality": "3.53", "rWorkRequired": "3.21", "rInstructorAccess": "2.79", "rReadingsValue": "3.21", "rRecommendNonMajor": "3.14", "rCommAbility": "3.07", "rInstructorQuality": "3.09"}, "section": {"name": "VENTURE CAP & ENT MGMT", "sectionnum": "701", "primary_alias": "MGMT-804-701", "path": "/courses/27774/sections/701", "id": "27774-701", "aliases": ["MGMT-804-701"]}, "comments": "Management 804 is an elective half-semester course that focuses on venture capital management issues in the context of the typical high-growth start-up company. The course is fundamentally pragmatic in outlook. It covers six principal areas relevant to the privately held high-growth start up, including: commentary on the venture capital industry generally, as well as a discussion of the typical venture fund structure and related venture capital objectives and investment strategies; common organizational issues encountered in the formation of a venture backed start-up, including issues relating to initial capitalization, intellectual property and early stage equity arrangements; valuation that form the basis of the negotiation between the entrepreneur and the venture capitalist in anticipation of a venture investment; The challenges of fundraising, financing strategies and the importance of the business plan and the typical dynamics that play out between VC and entrepreneur; Typical investment terms found in the term sheet and the dynamics of negotiation between the entrepreneur and the venture capitalist; Corporate governance in the context of a privately-held, venture capital-backed start-up company and the typical dynamics that play out between VC and entrepreneur in an insider-led, “down round” financing. \r\n\tStudents commented that this course was “great” and “should be an essential course for all MBA students.” Many students commented that they “learned a lot” and “are more comfortable with the concepts surrounding venture capital.” One student commented that it is a “must take for a building entrepreneur who does not have a whole lot of idea about the VC market.” However, students agreed, “there was an exceptional amount of work for a .5 unit course.” Additionally, some students commented that the course was “fast paced.”\r\n\tReviews of Professor Amit were positive. Students praised Professor Amit’s “domain expertise” and thought he “delivered a balanced and reasoned perspective on the course material.” Another student called Professor Amit an “excellent instructor” and enjoyed how he “[drew] from real life deals and scenarios to help illustrate core concepts.”\r\n\tThis class consists of case studies (25%), class participation (15%), final quiz (45%), and negotiations (15%). The cases can be done in groups. This is an MBA course, and undergraduates need permission to enroll, and is recommended to growing entrepreneurs, but not for someone who doesn’t have any background in the course concepts. \r\n", "num_students": 35, "path": "/courses/27774/sections/701/reviews/2563-RAPHAEL-H-AMIT", "instructor": {"path": "/instructors/2563-RAPHAEL-H-AMIT", "first_name": "RAPHAEL H", "last_name": "AMIT", "id": "2563-RAPHAEL-H-AMIT", "name": "RAPHAEL H AMIT"}, "num_reviewers": 32, "id": "27774-701-2563-RAPHAEL-H-AMIT"}, {"ratings": {"rAmountLearned": "3.50", "rDifficulty": "2.75", "rStimulateInterest": "3.39", "rRecommendMajor": "3.67", "rCourseQuality": "3.53", "rWorkRequired": "3.21", "rInstructorAccess": "3.21", "rReadingsValue": "3.21", "rRecommendNonMajor": "3.14", "rCommAbility": "3.43", "rInstructorQuality": "3.31"}, "section": {"name": "VENTURE CAP & ENT MGMT", "sectionnum": "701", "primary_alias": "MGMT-804-701", "path": "/courses/27774/sections/701", "id": "27774-701", "aliases": ["MGMT-804-701"]}, "comments": "This elective half-semester course focuses on venture capital management issues in the context of the typical high-growth start-up company. The course is fundamentally pragmatic in outlook. It covers six principal areas relevant to the privately held high-growth start-up, including: commentary on the venture capital industry generally, as well as a discussion of the typical venture fund structure and related venture capital objectives and investment strategies; common organizational issues encountered in the formation of a venture backed start-up, including issues relating to initial capitalization, intellectual property and early stage equity arrangements; valuation that form the basis of the negotiation between the entrepreneur and the venture capitalist in anticipation of a venture investment; The challenges of fundraising, financing strategies and the importance of the business plan and the typical dynamics that play out between VC and entrepreneur; Typical investment terms found in the term sheet and the dynamics of negotiation between the entrepreneur and the venture capitalist; Corporate governance in the context of a privately-held, venture capital-backed start-up company and the typical dynamics that play out between VC and entrepreneur in an insider-led, \"down round\" financing.\r\n\r\nAlmost all students loved MGMT 804.  They felt that they “learned a lot” and that the course provided a great introduction for students with no previous exposure to venture capital.  Students described the class as group work intensive, and, in particular, several felt that the negotiation assignment was “a great learning experience.”\r\n\r\nProfessor Collom, one member of the two member teaching team, was praised by a few students for his “extensive experience and contacts in the venture capital space.”  A few also appreciated the interest Professor Collom took in their learning and felt that he was effective in prompting them to think.\r\n\r\nMany students felt that the course was “a lot of work for half a credit,” and almost all felt that the course would have been better “spread…out over more weeks.”  In particular, students noted that seven assignments and one quiz in three weeks was a lot.  MGMT 804 is an MBA course that counts towards the Entrepreneurial Management and Management majors.", "num_students": 35, "path": "/courses/27774/sections/701/reviews/5419-DOUGLAS-H--COLLOM", "instructor": {"path": "/instructors/5419-DOUGLAS-H--COLLOM", "first_name": "DOUGLAS H.", "last_name": "COLLOM", "id": "5419-DOUGLAS-H--COLLOM", "name": "DOUGLAS H. COLLOM"}, "num_reviewers": 32, "id": "27774-701-5419-DOUGLAS-H--COLLOM"}, {"ratings": {"rAmountLearned": "3.46", "rDifficulty": "2.89", "rStimulateInterest": "3.37", "rRecommendMajor": "3.65", "rCourseQuality": "3.47", "rWorkRequired": "3.46", "rInstructorAccess": "3.23", "rReadingsValue": "3.06", "rRecommendNonMajor": "3.31", "rCommAbility": "3.26", "rInstructorQuality": "3.28"}, "section": {"name": "VENTURE CAP & ENT MGMT", "sectionnum": "751", "primary_alias": "MGMT-804-751", "path": "/courses/27774/sections/751", "id": "27774-751", "aliases": ["MGMT-804-751"]}, "comments": "", "num_students": 58, "path": "/courses/27774/sections/751/reviews/2563-RAPHAEL-H-AMIT", "instructor": {"path": "/instructors/2563-RAPHAEL-H-AMIT", "first_name": "RAPHAEL H", "last_name": "AMIT", "id": "2563-RAPHAEL-H-AMIT", "name": "RAPHAEL H AMIT"}, "num_reviewers": 36, "id": "27774-751-2563-RAPHAEL-H-AMIT"}]