[{"ratings": {"rAmountLearned": "2.85", "rDifficulty": "2.27", "rStimulateInterest": "1.69", "rRecommendMajor": "3.41", "rCourseQuality": "2.27", "rWorkRequired": "2.68", "rInstructorAccess": "2.12", "rReadingsValue": "1.87", "rRecommendNonMajor": "2.69", "rCommAbility": "1.69", "rInstructorQuality": "1.75"}, "section": {"name": "INTRO TO COMP PROG", "sectionnum": "001", "primary_alias": "CIS-110-001", "path": "/courses/21443/sections/001", "id": "21443-001", "aliases": ["CIS-110-001"]}, "comments": "&#8232;&#8232;CIS 110 explores such topics as how you program computers to accomplish tasks and how you break down complex tasks into simpler ones. CIS 110 is a \"Java lite\" course that covers the fundamentals of object-oriented programming such as objects, classes, state, methods, loops, arrays, inheritance, and recursion using the Java programming language.&#8232;&#8232;The course begins with students learning Scratch as an introduction to programming. Each lecture is paired with a discussion group of about 15 students that meets once a week during the second weekly class time. Overall, students had negative reactions toward discussion groups, stating, that “TAs are often too young to explain the material well” and that “discussion group leaders lacked enthusiasm.” In addition, students were required to attend a two-hour lab once a week. Students generally felt that labs had the potential to be useful, but were “often spent staring at the screen with no idea how to approach the problem.”&#8232;&#8232;Several students felt that Professor Griffin tried to convey the material in an exciting and interesting way, but that she fell short when it came to effectively and engagingly teaching the class. Some agreed that she appeared “distant” and “out of touch,” but noted that her interest in computer science was “genuine” and “translatable.”&#8232;&#8232;Although an introductory Java course, many students who take it already have Java experience, resulting in a difficult class curve that favors those who should be in a higher-level course. A popular comment among students was that “homework was a good reinforcement of skills and concepts but lectures had zero value for learning the concepts.”", "num_students": 163, "path": "/courses/21443/sections/001/reviews/1353-JEAN-GRIFFIN", "instructor": {"path": "/instructors/1353-JEAN-GRIFFIN", "first_name": "JEAN", "last_name": "GRIFFIN", "id": "1353-JEAN-GRIFFIN", "name": "JEAN GRIFFIN"}, "num_reviewers": 149, "id": "21443-001-1353-JEAN-GRIFFIN"}]