{"coursehistories": {"path": "/coursehistories/1050"}, "description": "This course relies on a variety of sociological perspectives to examine the role of the media and popular culture in society, with a particular emphasis on the power of the entertainment industries, the relationship between cultural consumption and status, and the social organization of leisure activities from sports to shopping. Specific course topics include the globalization of branding and popular culture, the rise of aesthetics and style in everyday life, the importance of social networks in the diffusion of fads, fashions, and mass media; and the social effects of new media technologies in the digital age. \n\n", "semester": "2008A", "name": "Sociology of Media and Popular Culture", "reviews": {"path": "/courses/20857/reviews", "values": [{"ratings": {"rAmountLearned": "2.62", "rDifficulty": "2.01", "rStimulateInterest": "3.00", "rRecommendMajor": "3.14", "rCourseQuality": "2.90", "rWorkRequired": "2.16", "rInstructorAccess": "2.56", "rReadingsValue": "2.66", "rRecommendNonMajor": "3.06", "rCommAbility": "3.06", "rInstructorQuality": "2.89"}, "section": {"name": "Sociology of Media and Popular Culture", "sectionnum": "401", "primary_alias": "SOCI-137-401", "path": "/courses/20857/sections/401", "id": "20857-401", "aliases": ["SOCI-137-401", "FOLK-137-401"]}, "comments": "This course relies on a variety of sociological perspectives to examine the role of media and popular culture in everyday life, with a particular emphasis on the organization of the mass media industry, the relationship between cultural consumption and status, and the social significance of leisure activities from sports to shopping.  Specific course topics include the production of tabloid TV talk shows; the marketing of Disney, Nike and Starbucks; and the rise of new media technologies in the digital age.  Readings include articles from a variety of sources along with Malcolm Gladwell’s Tipping Point, and Professor Grazian’s own book on urban nightlife.\r\n\r\nOverall, students agreed this was a “really fun class” and considered the information presented in lecture “informative and entertaining.”  Students recommended this course for others “looking for an enjoyable, interesting course” as topics presented in lecture were described as relevant to our daily lives.\r\n\r\nMost students enjoyed Professor Grazian’s lectures, calling him a “great professor” who delivers “stimulating lectures.”  One student commented that his “passion for the material shows through his teaching.”  While some students praised Professor Grazian’s detailed lecture slides, others criticized him for reading off the slides without thoroughly explaining them.\r\n\r\nMany students commented that the midterm was long and rushed, requiring students to cover too much information.  Also, the assigned readings were “interesting” but “sometimes too much for one week.”  Apart from the midterm, assignments included writing an urban ethnography and a final paper.  This class fulfills the Society sector requirement and has no prerequisites, ideal for both a non-major looking for an elective course and a major student.", "num_students": 189, "path": "/courses/20857/sections/401/reviews/1109-DAVID-GRAZIAN", "instructor": {"path": "/instructors/1109-DAVID-GRAZIAN", "first_name": "DAVID", "last_name": "GRAZIAN", "id": "1109-DAVID-GRAZIAN", "name": "DAVID GRAZIAN"}, "num_reviewers": 84, "id": "20857-401-1109-DAVID-GRAZIAN"}]}, "credits": null, "primary_alias": "SOCI-137", "path": "/courses/20857", "sections": {"path": "/courses/20857/sections", "values": [{"name": "Sociology of Media and Popular Culture", "sectionnum": "401", "primary_alias": "SOCI-137-401", "path": "/courses/20857/sections/401", "id": "20857-401", "aliases": ["SOCI-137-401", "FOLK-137-401"]}]}, "id": 20857, "aliases": ["SOCI-137", "FOLK-137"]}