[{"ratings": {"rAmountLearned": "3.33", "rDifficulty": "2.95", "rStimulateInterest": "3.50", "rRecommendMajor": "3.35", "rCourseQuality": "3.44", "rWorkRequired": "3.73", "rInstructorAccess": "3.30", "rReadingsValue": "3.40", "rRecommendNonMajor": "3.23", "rCommAbility": "3.58", "rInstructorQuality": "3.51"}, "section": {"name": "ENG ENTREPRENEURSHIP I", "sectionnum": "001", "primary_alias": "EAS-545-001", "path": "/courses/22915/sections/001", "id": "22915-001", "aliases": ["EAS-545-001"]}, "comments": "\r\nEngineers and scientists create and lead great companies, hiring managers when and where needed to help execute their vision. Designed expressly for students having a keen interest in technological innovation, this course investigates the roles of inventors and founders in successful technology ventures. Through case studies and guest speakers, we introduce the knowledge and skills needed to recognize and seize a high-tech entrepreneurial opportunity - be it a product or service - and then successfully launch a startup or spin-off company. The course studies key areas of intellectual property, its protection and strategic value; opportunity analysis and concept testing; shaping technology driven inventions into customer-driven products; constructing defensible competitive strategies; acquiring resources in the form of capital, people and strategic partners; and the founder's leadership role in an emerging high-tech company. Throughout the course emphasis is placed on decisions faced by founders, and on the sequential risks and determinants of success in the early growth phase of a technology venture. The course is designed for, but not restricted to, students of engineering and applied science and assumes no prior business education.\r\n\r\nThe course material was well-regarded by students. Students generally indicated that they learned a great deal, from “a whole new set of thinking skills” to many “aspects in business.” Many felt that the readings and case studies were very useful, though one student indicated that the case studies should have been more catered to the background of students in the class.\r\n\r\nStudents generally enjoyed Professor Babin’s lecture style very much, and they appreciated the participatory nature of the class. However, one student indicated that class participation was of low quality; students simply spoke to gain participation points. Students also described Professor Babin as “humorous and inspiring” and “captivating.”\r\n\r\nWith a quiz and essay due every week, most students thought that the course was too fast-paced and had a very heavy workload.\r\n", "num_students": 54, "path": "/courses/22915/sections/001/reviews/1595-JEFFREY-A--BABIN", "instructor": {"path": "/instructors/1595-JEFFREY-A--BABIN", "first_name": "JEFFREY A.", "last_name": "BABIN", "id": "1595-JEFFREY-A--BABIN", "name": "JEFFREY A. BABIN"}, "num_reviewers": 43, "id": "22915-001-1595-JEFFREY-A--BABIN"}, {"ratings": {"rAmountLearned": "3.60", "rDifficulty": "2.86", "rStimulateInterest": "3.69", "rRecommendMajor": "3.68", "rCourseQuality": "3.64", "rWorkRequired": "3.74", "rInstructorAccess": "3.48", "rReadingsValue": "3.55", "rRecommendNonMajor": "3.29", "rCommAbility": "3.74", "rInstructorQuality": "3.63"}, "section": {"name": "ENG ENTREPRENEURSHIP I", "sectionnum": "002", "primary_alias": "EAS-545-002", "path": "/courses/22915/sections/002", "id": "22915-002", "aliases": ["EAS-545-002"]}, "comments": "", "num_students": 51, "path": "/courses/22915/sections/002/reviews/317-THOMAS-A--CASSEL", "instructor": {"path": "/instructors/317-THOMAS-A--CASSEL", "first_name": "THOMAS A.", "last_name": "CASSEL", "id": "317-THOMAS-A--CASSEL", "name": "THOMAS A. CASSEL"}, "num_reviewers": 46, "id": "22915-002-317-THOMAS-A--CASSEL"}]