[{"ratings": {"rAmountLearned": "2.89", "rDifficulty": "3.22", "rStimulateInterest": "2.00", "rRecommendMajor": "3.72", "rCourseQuality": "2.73", "rWorkRequired": "2.94", "rInstructorAccess": "2.78", "rReadingsValue": "2.31", "rRecommendNonMajor": "1.76", "rCommAbility": "2.94", "rInstructorQuality": "2.74"}, "section": {"name": "PROVING THINGS: ANALYSIS", "sectionnum": "001", "primary_alias": "MATH-202-001", "path": "/courses/24693/sections/001", "id": "24693-001", "aliases": ["MATH-202-001"]}, "comments": "This course focuses on the creative side of mathematics, with an emphasis on\r\ndiscovery, reasoning, proofs and effective communication, while at the same time\r\nstudying real and complex numbers, sequences, series, continuity, differentiability and\r\nintegrability. Small class sizes permit an informal, discussion-type atmosphere, and often\r\nthe entire class works together on a given problem. Homework is intended to be thought\r\nprovoking, rather than skill sharpening.\r\nMany students felt this course was “a good introduction,” featuring a variety of\r\ntopics. One student reported that MATH 202 was “very useful.” Some students\r\ncomplained that the course material could be “dry” though. Some students expected a\r\nseminar style class, but one student recognized “the biggest concern was always to write\r\neverything down, so we could do the homework.” One student noted they “learned a\r\ntremendous amount and made a real jump in… mathematical ability.”\r\nStudents agreed Professor Lieberman was “fairly engaging, but the lecturing style\r\nwas sometimes monotonous.” One student noted, “Professor Lieberman was able to\r\ncommunicate the ideas to the class in a very clear manner.” Another student felt\r\n“Professor Lieberman’s style was perfect.”\r\nOne student suggested that “only math majors or minors should take this course.”\r\nAnother felt “computer science majors should all be recommended to take it as\r\nfreshmen.” Students agreed that “unless you are a math major or accustomed to thinking\r\nin that way, this course can be very difficult.”", "num_students": 25, "path": "/courses/24693/sections/001/reviews/4871-MICHAEL-LIEBERMAN", "instructor": {"path": "/instructors/4871-MICHAEL-LIEBERMAN", "first_name": "MICHAEL", "last_name": "LIEBERMAN", "id": "4871-MICHAEL-LIEBERMAN", "name": "MICHAEL LIEBERMAN"}, "num_reviewers": 24, "id": "24693-001-4871-MICHAEL-LIEBERMAN"}]