{"coursehistories": {"path": "/coursehistories/1906"}, "description": "The course surveys the development of law in the U.S. to 1877, including such subjects as: the evolution of the legal profession, the transformation of English law during the American Revolution, the making and implementation of the Constitution, and issues concerning business and economic development, the law of slavery, the status of women, and civil rights. \n\n", "semester": "2009C", "name": "HIST OF AMER LAW TO 1877", "reviews": {"path": "/courses/17501/reviews", "values": [{"ratings": {"rAmountLearned": "3.35", "rDifficulty": "2.78", "rStimulateInterest": "3.25", "rRecommendMajor": "3.62", "rCourseQuality": "3.16", "rWorkRequired": "2.92", "rInstructorAccess": "3.14", "rReadingsValue": "3.41", "rRecommendNonMajor": "2.73", "rCommAbility": "3.38", "rInstructorQuality": "3.30"}, "section": {"name": "HIST OF AMER LAW TO 1877", "sectionnum": "401", "primary_alias": "HIST-168-401", "path": "/courses/17501/sections/401", "id": "17501-401", "aliases": ["HIST-168-401", "AFRC-168-401"]}, "comments": "This course surveys the development of law in the United States to 1877. The emphasis is on the interaction between law and social forces. Such subjects as the evolution of the legal profession, the transformation of English law during the American Revolution, the making and implementation of the Constitution, and issues concerning business and economic development, the law of slavery, the status of women, and civil liberties will be included. This course is open to history majors and legal studies minors ONLY during pre-registration.\r\n\r\nStudents overwhelming loved this course. Many students thought that this was a \"fantastic course to teach anyone about the origins and workings of American legal concepts.\" Many students said they enjoyed the discussions they had in class. They did, however, remark, \"you need to stay on top of readings as Professor Berry will randomly call on students to discuss certain aspects of the reading.\"\r\n\r\nStudents were nearly unanimous in their love of Professor Berry. Many students said that she \"challenged us and asked some very thought-provoking questions.\" They also said that she is an \"experienced and dynamic professor who is willing to make students squirm.\" One student even said, \"you come to Penn to take classes like this one with professors like Mary Frances Berry.\"\r\n\r\nSeveral students remarked that this was a very challenging course and that you needed to stay on top of all reading to be successful in the class. However many said the readings were not too long-- about 10 to 15 pages-- and that it was worth reading. \r\n", "num_students": 48, "path": "/courses/17501/sections/401/reviews/629-MARY-FRANCES-BERRY", "instructor": {"path": "/instructors/629-MARY-FRANCES-BERRY", "first_name": "MARY FRANCES", "last_name": "BERRY", "id": "629-MARY-FRANCES-BERRY", "name": "MARY FRANCES BERRY"}, "num_reviewers": 42, "id": "17501-401-629-MARY-FRANCES-BERRY"}]}, "credits": null, "primary_alias": "HIST-168", "path": "/courses/17501", "sections": {"path": "/courses/17501/sections", "values": [{"name": "HIST OF AMER LAW TO 1877", "sectionnum": "401", "primary_alias": "HIST-168-401", "path": "/courses/17501/sections/401", "id": "17501-401", "aliases": ["HIST-168-401", "AFRC-168-401"]}]}, "id": 17501, "aliases": ["HIST-168", "AFRC-168"]}