{"coursehistories": {"path": "/coursehistories/4201"}, "description": "Athens in the 5th century BC witnesses a cultural flowering of extraordinary power and importance for Western culture. In this class we will examine the achievements of Athens in its Golden Age, beginning with the Persian Wars, seminal events that saw the Greeks defeat the numercially superior Persians. In the generation that followed, Athens rapidly transformed the alliance of Greek states dedicated to taking the war back to Persia into an Aegean empire, dominated b y the Athenians and their fleet. At the same time, this dramatic in power and prestige was accompnaied by the growth of fill participatory democracy. We examine the daily working of that democracy, asking how an Athenian was trained for citizenship. What did democracy mean in practice? What did freedom and autinomy mean to a society that relied on slaves and was ruthless in its treatment of its subject? In order to answer these questions we juxtapose the breathtaking accomplishments of the Athenians, in fields such as philosophy, tragedy, comedy, sculpture and architecture, with the exclusion of women from public life, the torture and abuse of slaves, and the execution of other Greek populations. \n\nWe will follow them from the height of their power to defeat at the hands of the Spartans. The picture that emerges is a portrait of a complex people and a complicated culture. Restless, adventurous, sophisticated, crude, pious, the Athenians are a people whose culture has a special significance for us. The ties between us are not casual, but deeply meangingful. \n\n", "semester": "2009A", "name": "PERICLEAN ATHENS", "reviews": {"path": "/courses/15525/reviews", "values": [{"ratings": {"rAmountLearned": "3.14", "rDifficulty": "2.43", "rStimulateInterest": "2.86", "rRecommendMajor": "3.86", "rCourseQuality": "3.14", "rWorkRequired": "2.17", "rInstructorAccess": "3.57", "rReadingsValue": "2.86", "rRecommendNonMajor": "2.00", "rCommAbility": "3.57", "rInstructorQuality": "3.43"}, "section": {"name": "PERICLEAN ATHENS", "sectionnum": "301", "primary_alias": "CLST-319-301", "path": "/courses/15525/sections/301", "id": "15525-301", "aliases": ["CLST-319-301"]}, "comments": "", "num_students": 7, "path": "/courses/15525/sections/301/reviews/1328-DAVID-GILMAN-ROMANO", "instructor": {"path": "/instructors/1328-DAVID-GILMAN-ROMANO", "first_name": "DAVID GILMAN", "last_name": "ROMANO", "id": "1328-DAVID-GILMAN-ROMANO", "name": "DAVID GILMAN ROMANO"}, "num_reviewers": 7, "id": "15525-301-1328-DAVID-GILMAN-ROMANO"}]}, "credits": null, "primary_alias": "CLST-319", "path": "/courses/15525", "sections": {"path": "/courses/15525/sections", "values": [{"name": "PERICLEAN ATHENS", "sectionnum": "301", "primary_alias": "CLST-319-301", "path": "/courses/15525/sections/301", "id": "15525-301", "aliases": ["CLST-319-301"]}]}, "id": 15525, "aliases": ["CLST-319"]}