[{"ratings": {"rAmountLearned": "3.54", "rDifficulty": "3.48", "rStimulateInterest": "2.93", "rRecommendMajor": "3.68", "rCourseQuality": "3.14", "rWorkRequired": "3.93", "rInstructorAccess": "3.44", "rReadingsValue": "3.05", "rRecommendNonMajor": "1.73", "rCommAbility": "3.10", "rInstructorQuality": "3.17"}, "section": {"name": "INTERNET & WEB SYSTEMS", "sectionnum": "401", "primary_alias": "CIS-455-401", "path": "/courses/21460/sections/401", "id": "21460-401", "aliases": ["CIS-455-401", "CIS-555-401"]}, "comments": "This course focuses on Internet and web technologies and the underlying principles of distributed systems, information retrieval, and data management. The material covered includes web and applications of server architectures, XML and semi-structured data, schema mediation, document indexing and retrieval peer-to-peer systems, distributed transactions and remote procedure calls. The course has a substantial group implementation project.&#8232;&#8232;Overall, students found this course to be “extremely interesting” and “worthwhile.” They also felt that this course was very educational in that they learned many “useful concepts” throughout the semester. Students enjoyed the hands-on experience during the assigned projects. &#8232;&#8232;Professor Haeberlen received mixed reviews. Some felt his lectures were intriguing, while others thought his slides could have been put together more clearly. Some students even felt that Professor Haeberlen should have given extra class sessions for the large number of students who were confused with the lecture material. &#8232;&#8232;This class was extremely difficult and resulted in an “incredibly heavy workload.” Students noted that there was a lot of coding required for the assignments, and most of the work outside of class comprised of completing the major projects. However, the large amount of work was compensated for by “very fair exams.” Taking CIS 121 and 380 is recommended before enrolling in this class.", "num_students": 51, "path": "/courses/21460/sections/401/reviews/5319-ANDREAS-HAEBERLEN", "instructor": {"path": "/instructors/5319-ANDREAS-HAEBERLEN", "first_name": "ANDREAS", "last_name": "HAEBERLEN", "id": "5319-ANDREAS-HAEBERLEN", "name": "ANDREAS HAEBERLEN"}, "num_reviewers": 43, "id": "21460-401-5319-ANDREAS-HAEBERLEN"}]