[{"ratings": {"rAmountLearned": "2.97", "rDifficulty": "1.79", "rStimulateInterest": "3.09", "rRecommendMajor": "3.45", "rCourseQuality": "3.10", "rWorkRequired": "2.12", "rInstructorAccess": "3.33", "rReadingsValue": "3.21", "rRecommendNonMajor": "3.09", "rCommAbility": "3.42", "rInstructorQuality": "3.37"}, "section": {"name": "AFRO AMER HIST 1876-PRES", "sectionnum": "401", "primary_alias": "HIST-177-401", "path": "/courses/27571/sections/401", "id": "27571-401", "aliases": ["HIST-177-401", "AFRC-177-401"]}, "comments": "A study of the major events, issues, and personalities in Afro-American history from Reconstruction to the present. It will also examine the different slave experiences and the methods of black resistance and rebellion in the various slave systems. \r\n \r\nThis course serves as a broad exploration of African-American history from 1876 through the present.  Students were generally quite pleased with the course.  Many students considered “a valuable foundation” for further study and a “well-organized course.”  A few students found the material to be “a bit of a review,” but most found the lectures and readings “insightful.”\r\n\r\nStudents praised Professor Savage as an outstanding historian and lecturer.  Students found her enthusiasm for the material “contagious.”  She was further described as “knowledgeable,” “interesting,” and “thoughtful.”  Students especially appreciated Professor Savage’s investment in their progress and understanding.  Many participants also noted how well Professor Savage incorporates “various media” to convey concepts.\r\n\r\nStudents found the course appropriately challenging.  Many commented that “a lot of reading” is required in order to succeed.  However, grading was described as “fair.”  Students from a variety of majors took the course, and recommended it regardless.", "num_students": 43, "path": "/courses/27571/sections/401/reviews/1867-BARBARA-D--SAVAGE", "instructor": {"path": "/instructors/1867-BARBARA-D--SAVAGE", "first_name": "BARBARA D.", "last_name": "SAVAGE", "id": "1867-BARBARA-D--SAVAGE", "name": "BARBARA D. SAVAGE"}, "num_reviewers": 41, "id": "27571-401-1867-BARBARA-D--SAVAGE"}]