{"coursehistories": {"path": "/coursehistories/4286"}, "description": "This course examines the history, politics, and significance of foreign aid to Africa since the late 19th century. While we do not typically think about the European colonial period in Africa in terms of 'foreign aid,' that era introduced ideas and institutions which formed the foundations for modern aid policies and practices. So we start there and move forward into more contemporary times. In addition to examining the objectives behind foreign assistance and the intentions of donors and recipients, we will look at some of the consequences (intended or unintended) of various forms of foreign aid to Africa over the past century. While not designed to be a comprehensive history of development theory, of African economics, or of international aid organizations, the course will touch on all of these topics. Previous course work on Africa is strongly advised. \n\n", "semester": "2009A", "name": "HIST FOREIGN AID IN AFRC", "reviews": {"path": "/courses/15917/reviews", "values": [{"ratings": {"rAmountLearned": "2.83", "rDifficulty": "2.29", "rStimulateInterest": "2.83", "rRecommendMajor": "3.10", "rCourseQuality": "2.61", "rWorkRequired": "2.24", "rInstructorAccess": "3.17", "rReadingsValue": "2.83", "rRecommendNonMajor": "2.67", "rCommAbility": "2.67", "rInstructorQuality": "3.06"}, "section": {"name": "HIST FOREIGN AID IN AFRC", "sectionnum": "401", "primary_alias": "HIST-372-401", "path": "/courses/15917/sections/401", "id": "15917-401", "aliases": ["HIST-372-401", "AFST-542-401", "AFST-372-401"]}, "comments": "This course examines the history, politics, and significance of foreign aid to Africa since the late 19th century. While we do not typically think about the European colonial period in Africa in terms of 'foreign aid,' that era introduced ideas and institutions which formed the foundations for modern aid policies and practices. So we start there and move forward into more contemporary times. In addition to examining the objectives behind foreign assistance and the intentions of donors and recipients, we will look at some of the consequences (intended or unintended) of various forms of foreign aid to Africa over the past century. While not designed to be a comprehensive history of development theory, of African economics, or of international aid organizations, the course will touch on all of these topics. &#8232;&#8232;\r\n\r\nStudent responsibilities include a weekly on-line journal, three 3-page essays on topics to be assigned, and a 10-12 final paper on a topic related to one of the course's many themes. Several students agreed that this course is on a “great topic,” and students seemed to really enjoy the many guest lecturers.\"\r\n\r\nMany students seemed to think that Professor Cassanelli is an “excellent instructor.” However, some students complained about Professor Cassanelli’s “unorganized,” sometimes “hard to follow,” and “off-topic” lectures, which may have made it “difficult to develop a cohesive view of the subject.” Regarding his accessibility, students commented that Professor Cassanelli went “above and beyond” to ensure the interests and knowledge of his students were met. Professor Cassanelli was also known to take time to meet with his students outside of class. Overall, students agreed Professor Cassanelli is “very intelligent and passionate about African history.”&#8232;&#8232;\r\n\r\nThis course is cross-listed with HIST 542, AFST 372 and AFST 542. As an upper-level history course, previous course work on Africa is strongly advised.", "num_students": 56, "path": "/courses/15917/sections/401/reviews/658-LEE-V-CASSANELLI", "instructor": {"path": "/instructors/658-LEE-V-CASSANELLI", "first_name": "LEE V", "last_name": "CASSANELLI", "id": "658-LEE-V-CASSANELLI", "name": "LEE V CASSANELLI"}, "num_reviewers": 53, "id": "15917-401-658-LEE-V-CASSANELLI"}]}, "credits": null, "primary_alias": "HIST-372", "path": "/courses/15917", "sections": {"path": "/courses/15917/sections", "values": [{"name": "HIST FOREIGN AID IN AFRC", "sectionnum": "401", "primary_alias": "HIST-372-401", "path": "/courses/15917/sections/401", "id": "15917-401", "aliases": ["HIST-372-401", "AFST-542-401", "AFST-372-401"]}]}, "id": 15917, "aliases": ["HIST-372", "AFST-542", "AFST-372"]}