[{"ratings": {"rAmountLearned": "3.42", "rDifficulty": "3.27", "rStimulateInterest": "3.06", "rRecommendMajor": "3.72", "rCourseQuality": "3.17", "rWorkRequired": "3.48", "rInstructorAccess": "2.90", "rReadingsValue": "2.26", "rRecommendNonMajor": "1.53", "rCommAbility": "3.24", "rInstructorQuality": "3.26"}, "section": {"name": "INTRO TO COMP SYSTEMS", "sectionnum": "001", "primary_alias": "CIS-240-001", "path": "/courses/24168/sections/001", "id": "24168-001", "aliases": ["CIS-240-001"]}, "comments": "How do millions of transistors come together to form a complete computing\r\nsystem? This bottom-up course begins with transistors and simple computer hardware\r\nstructures, continues with low-level programming using primitive machine instructions,\r\nand finishes with an introduction to the C programming language. This course is a broad\r\nintroduction to all aspects of computer systems architecture and serves as the foundation\r\nfor subsequent computer systems courses, such as Digital Systems Organization and\r\nDesign (CIS 371), Computer Operating Systems (CIS 380), and Compilers and\r\nInterpreters (CIS 341).\r\nStudents unanimously praised this class as “awesome”, “fascinating”, and\r\n“infinitely educational.” They found the bottom up structure of the course from\r\ntransistors to C to be very effective.\r\nProfessor Taylor was well regarded by the students, who found him to be\r\n“knowledgeable” and “funny.” They found his lectures to be clear and appreciated him\r\ndrilling important concepts throughout the semester.\r\nOverall, students described this course as “tough” and “challenging.” The\r\nhomework assignments required a lot of time to complete, and required keeping up with\r\nthe lecture material. Many students felt that the difficulty increased greatly towards the\r\nend of the semester, especially for the final homework. Even so, many students\r\ncommented that this was their favorite and “one of the most enlightening courses at\r\nPenn.”", "num_students": 147, "path": "/courses/24168/sections/001/reviews/309-CAMILLO-JOSE-TAYLOR", "instructor": {"path": "/instructors/309-CAMILLO-JOSE-TAYLOR", "first_name": "CAMILLO JOSE", "last_name": "TAYLOR", "id": "309-CAMILLO-JOSE-TAYLOR", "name": "CAMILLO JOSE TAYLOR"}, "num_reviewers": 135, "id": "24168-001-309-CAMILLO-JOSE-TAYLOR"}]