[{"ratings": {"rAmountLearned": "2.90", "rDifficulty": "1.76", "rStimulateInterest": "3.13", "rRecommendMajor": "3.83", "rCourseQuality": "2.90", "rWorkRequired": "1.93", "rInstructorAccess": "3.47", "rReadingsValue": "3.07", "rRecommendNonMajor": "3.10", "rCommAbility": "3.33", "rInstructorQuality": "3.43"}, "section": {"name": "INDIA'S LITERATURE: India's Literature: Love, War, Wisdom and Humor", "sectionnum": "401", "primary_alias": "SAST-004-401", "path": "/courses/28124/sections/401", "id": "28124-401", "aliases": ["SAST-004-401", "COML-005-401"]}, "comments": "This course introduces students to the extraordinary quality of literary production during the past four millennia of South Asian civilization.  Students read texts in translation from all parts of South Asia up to the sixteenth century.  They read selections from hymns, lyric poems, epics, wisdom literature, plays, political works, and religious texts.\r\n\r\nStudents really enjoyed the course overall, with one summing it up as “a great class full of stimulating discussion!” Many loved the readings throughout the semester, which were found to be “very interesting.” Though some complained that the course tried to be too broadly focused, “as the whole of Indian literature is not accessible in one semester,” most students liked the subject matter and found it “culturally relevant.”\r\n\r\nProfessor Patel received positive reviews from his students, with many praising his knowledge of the subject matter. He was described as “very engaging” whose “enthusiasm for the topic [was] contagious and great at creating discussions on topics dealing with abstract themes.” While some criticized his lectures as somewhat disorganized, most students appreciated his “accommodating and engaging manner” and commitment to his students.\r\n\r\nThe workload for this course consisted of a midterm, final and a final paper. While students noted that the course “required a great deal of reading,” many were thankful for review sheets provided for the exams, making them seem fair and useful tests of students’ knowledge. This course fulfills the Arts and Letters sector. ", "num_students": 55, "path": "/courses/28124/sections/401/reviews/4103-DEVEN-M--PATEL", "instructor": {"path": "/instructors/4103-DEVEN-M--PATEL", "first_name": "DEVEN M.", "last_name": "PATEL", "id": "4103-DEVEN-M--PATEL", "name": "DEVEN M. PATEL"}, "num_reviewers": 46, "id": "28124-401-4103-DEVEN-M--PATEL"}]