{"coursehistories": {"path": "/coursehistories/561"}, "description": "This course will explore the effects of the changing health care environment on the physician, patient and health care manager. It is intended for any undergraduate with an interest in how 1/7th of the American economy is organized as well as those planning careers as health care providers and managers. The course complements other health care courses (that take a societal perspective) by focusing on the individuals who participate in the health care enterprise. There are no prerequisites, as the course will stand on its own content. The course will be divided into modules that focus on the participants of the health care process and the process itself. We will analyze the patient, the doctor, and manager in light of the patient-doctor interaction, the turbulent health care marketplace, expensive new technologies,resource allocation, and ethics. \n\n", "semester": "2012A", "name": "CLIN ISS IN HLTH CR MGMT", "reviews": {"path": "/courses/27529/reviews", "values": [{"ratings": {"rAmountLearned": "3.13", "rDifficulty": "2.14", "rStimulateInterest": "3.58", "rRecommendMajor": "3.45", "rCourseQuality": "3.17", "rWorkRequired": "1.88", "rInstructorAccess": "2.42", "rReadingsValue": "2.88", "rRecommendNonMajor": "3.04", "rCommAbility": "3.50", "rInstructorQuality": "3.56"}, "section": {"name": "CLIN ISS IN HLTH CR MGMT", "sectionnum": "001", "primary_alias": "HCMG-203-001", "path": "/courses/27529/sections/001", "id": "27529-001", "aliases": ["HCMG-203-001"]}, "comments": "Health Care Management 203 explores the effects of the changing health care environment on the physician, patient, and health care manager. It is intended for any undergraduate with an interest in how 1/7th of the American economy is organized as well as those planning careers as health care providers and managers. The course is divided into modules that focus on the participants of the health care process and the process itself. Students will analyze the patient, the doctor, and manager in light of the patient-doctor interaction, the turbulent health care marketplace, expensive new technologies, resource allocation, and ethics. \r\n\tAll Students had positive reviews for this course. Some commented that they learned a great deal about the “wide variety of stakeholders and the issues they faced.” One student commented that they would recommend the course to anyone who is looking to go into the field of health care. Some students did comment that it was unclear what was expected from them for the midterm and final exercises.  \r\n\tStudents described Professor Asch as “funny, engaging, and interesting.” One student reported that Professor Asch was able to “stimulate student interest thorough the engaging manner in which he lectures and his thoughtful selection of guest lecturers.” \r\n\tThe course complements other health care courses (that take a societal perspective) by focusing on the individuals who participate in the health care enterprises. There are no prerequisites, as the course will stand on its own content. Any student can take this class. One student commented that they would, “recommend this course to anyone with an interest in healthcare, whether you’re a pre-med, a nurse, or you simply want to better understand how the industry works.” \r\n", "num_students": 66, "path": "/courses/27529/sections/001/reviews/601-DAVID-A-ASCH", "instructor": {"path": "/instructors/601-DAVID-A-ASCH", "first_name": "DAVID A", "last_name": "ASCH", "id": "601-DAVID-A-ASCH", "name": "DAVID A ASCH"}, "num_reviewers": 66, "id": "27529-001-601-DAVID-A-ASCH"}]}, "credits": null, "primary_alias": "HCMG-203", "path": "/courses/27529", "sections": {"path": "/courses/27529/sections", "values": [{"name": "CLIN ISS IN HLTH CR MGMT", "sectionnum": "001", "primary_alias": "HCMG-203-001", "path": "/courses/27529/sections/001", "id": "27529-001", "aliases": ["HCMG-203-001"]}]}, "id": 27529, "aliases": ["HCMG-203"]}