[{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "1.89", "rStimulateInterest": "3.11", "rRecommendMajor": "3.50", "rCourseQuality": "3.07", "rWorkRequired": "2.21", "rInstructorAccess": "3.79", "rReadingsValue": "3.04", "rRecommendNonMajor": "2.75", "rCommAbility": "3.46", "rInstructorQuality": "3.39"}, "section": {"name": "HEALTH COMMUNICATION", "sectionnum": "001", "primary_alias": "COMM-237-001", "path": "/courses/19967/sections/001", "id": "19967-001", "aliases": ["COMM-237-001"]}, "comments": "This course examines the influence of public health communication on health behavior. The course will consider: intervention programs addressing behaviors related to cancer, cardiovascular disease, HIV/AIDS, drug use, obesity and others; theories of health behavior change; issues in the design of effective health communication programs; concerns about the portrayal of health and medicine on mass media.\r\n\r\nOverall, students enjoyed the course and one commented that it was “the best I’ve had at Penn.”  Multiple students commented that they enjoyed attending lecture and were always engaged in discussions.\r\n\r\nStudents described Professor Jacobsohn as “knowledgeable,” “encouraging,” and “approachable.”  Multiple students commented that she “truly cares about her students” and tailored the class to students’ interests.  Students praised the instructor for her ability to communicate subject matter clearly while keeping students interested, relaxed, and involved.\r\n\r\nStudents highly recommend the course to others.  They commented that Professor Jacobsohn assigned a manageable amount of work, was realistic in her expectations of the students, and graded fairly.\r\n", "num_students": 29, "path": "/courses/19967/sections/001/reviews/1986-LELA-JACOBSOHN", "instructor": {"path": "/instructors/1986-LELA-JACOBSOHN", "first_name": "LELA", "last_name": "JACOBSOHN", "id": "1986-LELA-JACOBSOHN", "name": "LELA JACOBSOHN"}, "num_reviewers": 28, "id": "19967-001-1986-LELA-JACOBSOHN"}]