[{"ratings": {"rAmountLearned": "2.75", "rDifficulty": "2.20", "rStimulateInterest": "3.19", "rRecommendMajor": "3.38", "rCourseQuality": "2.91", "rWorkRequired": "2.04", "rInstructorAccess": "3.09", "rReadingsValue": "2.13", "rRecommendNonMajor": "2.99", "rCommAbility": "3.41", "rInstructorQuality": "3.35"}, "section": {"name": "TECHNOLOGY & SOCIETY", "sectionnum": "401", "primary_alias": "STSC-003-401", "path": "/courses/28199/sections/401", "id": "28199-401", "aliases": ["STSC-003-401", "SOCI-033-401", "HSOC-003-401"]}, "comments": "This course surveys the ways in which technology has shaped our societies and our relations with the natural world. Students will examine the origins and impact of technical developments throughout human history and across the globe--from stone tools, agriculture and cave painting to ancient cities, metallurgy and aqueducts; from windmills, cathedrals, steam engines and electricity to atom bombs, the internet and genetic engineering. The class will pay attention to the aesthetic, religious and mythical dimensions of technological change and consider the circumstances in which innovations emerge and their effects on social order, on the environment and on the ways humans understand themselves.\r\nThis course was praised by students as “well-organized” and interesting. Many students described it as one of their favorites, describing the material as “interesting” and “important.” However, some felt that there were “too many readings” and that these readings were too long and “not always necessary.” Some students complained about the large class size which they felt detracted from the learning experience. Many reported enjoying the “extra-credit type activities.”\r\nProfessor Hersch was liked by his students, who described him as “knowledgeable and helpful.” One student mentioned that Professor Hersch was “excellent at taking something so esoteric and abstract and making students care about it.” Professor Hersch was further praised as a “fantastic lecturer.”\r\nThis class was recommended for both majors and non-majors, and fulfills the Society Sector Requirement. Students were very fond of the professor, and although there was a lot of reading, enjoyed the course. ", "num_students": 153, "path": "/courses/28199/sections/401/reviews/4581-MATTHEW-H--HERSCH", "instructor": {"path": "/instructors/4581-MATTHEW-H--HERSCH", "first_name": "MATTHEW H.", "last_name": "HERSCH", "id": "4581-MATTHEW-H--HERSCH", "name": "MATTHEW H. HERSCH"}, "num_reviewers": 136, "id": "28199-401-4581-MATTHEW-H--HERSCH"}]