[{"ratings": {"rAmountLearned": "3.43", "rDifficulty": "3.43", "rStimulateInterest": "3.00", "rRecommendMajor": "3.60", "rCourseQuality": "3.14", "rWorkRequired": "3.23", "rInstructorAccess": "3.33", "rReadingsValue": "2.97", "rRecommendNonMajor": "1.30", "rCommAbility": "3.00", "rInstructorQuality": "3.37"}, "section": {"name": "ELECTROMAG II", "sectionnum": "401", "primary_alias": "PHYS-362-401", "path": "/courses/22295/sections/401", "id": "22295-401", "aliases": ["PHYS-362-401", "PHYS-562-401"]}, "comments": "Electromagnetism II: Magnetism, Maxwell's Equations, and Electromagnetic Waves is a continuation of PHYS 361. It explores magnetic fields and potentials, electromagnetic induction, Maxwell's equations, electromagnetic waves, and radiation.\r\n\r\nThe course was described as very difficult and challenging, though one commented that it was “excellent” and another said it was his “favorite physics course to date.” One student remarked that there was a greater focus on Electromagnetism rather than Electrodynamics.\r\n\r\nProfessor Mele was described as very knowledgeable and approachable. Students described him as “fantastic” and “one of the best teachers” they’ve had. The main complaint was that his lectures were too quick and hard to follow. However, his lectures were available to students since they were recorded. Regardless, students felt that most of the exam came from the textbook rather than lectures and homework. \r\n\r\nOne student wrote that the difficulties of the exams were quite variable, though they were still fair. Many thought it was a challenging course requiring “a lot of effort.” A prerequisite for this course is PHYS 361.\r\n", "num_students": 37, "path": "/courses/22295/sections/401/reviews/982-EUGENE-J-MELE", "instructor": {"path": "/instructors/982-EUGENE-J-MELE", "first_name": "EUGENE J", "last_name": "MELE", "id": "982-EUGENE-J-MELE", "name": "EUGENE J MELE"}, "num_reviewers": 35, "id": "22295-401-982-EUGENE-J-MELE"}]