[{"ratings": {"rAmountLearned": "2.41", "rDifficulty": "1.89", "rStimulateInterest": "2.36", "rRecommendMajor": "3.21", "rCourseQuality": "2.43", "rWorkRequired": "1.67", "rInstructorAccess": "2.46", "rReadingsValue": "2.02", "rRecommendNonMajor": "2.61", "rCommAbility": "2.96", "rInstructorQuality": "2.71"}, "section": {"name": "CRIMINAL JUSTICE", "sectionnum": "401", "primary_alias": "CRIM-200-401", "path": "/courses/27222/sections/401", "id": "27222-401", "aliases": ["CRIM-200-401", "SOCI-200-401"]}, "comments": "This course examines how the criminal justice system responds to crime in society. The course reviews the historical development of criminal justice agencies in the United States and Europe and the available scientific evidence on the effect these agencies have on controlling crime. The course places an emphasis on the functional creation of criminal justice agencies and the discretionary role decision makers in these agencies have in deciding how to enforce criminal laws and whom to punish. Evidence on how society measures crime and the role that each major criminal justice agency plays in controlling crime is examined from the perspective of crime victims, police, prosecutors, jurors, judges, prison officials, probation officers and parole board members. \r\n\r\n\tOverall, this course was described as a “good introduction to criminology” and a “very interesting course.” It is taught in a big lecture and the “work is straightforward.” However, others stated that it was “dull” and the slides were “not that necessary.” There is a policy paper that is required, but one student commented that he wished it came later in the semester so that there was more information learned.\r\n\r\n\tStudents described Professor Macdonald as a “good professor” but “was pretty boring at times.” He is a “great lecturer,” but sometimes he “does not post helpful material on slides online” and “is not the most entertaining.” His lecturing style could be “somewhat monotonous.”\r\n\r\nStudents mentioned that the “workload was extremely light, and the “paper and midterm were all extremely fair.” There are some long assigned readings. There is a policy paper that students are required to complete. There are no prerequisites for this course. This course fulfills the society sector.", "num_students": 175, "path": "/courses/27222/sections/401/reviews/4292-JOHN-M--MACDONALD", "instructor": {"path": "/instructors/4292-JOHN-M--MACDONALD", "first_name": "JOHN M.", "last_name": "MACDONALD", "id": "4292-JOHN-M--MACDONALD", "name": "JOHN M. MACDONALD"}, "num_reviewers": 167, "id": "27222-401-4292-JOHN-M--MACDONALD"}]