[{"ratings": {"rAmountLearned": "3.04", "rDifficulty": "2.94", "rStimulateInterest": "3.06", "rRecommendMajor": "3.04", "rCourseQuality": "2.98", "rWorkRequired": "2.65", "rInstructorAccess": "3.62", "rReadingsValue": "2.87", "rRecommendNonMajor": "2.88", "rCommAbility": "3.56", "rInstructorQuality": "3.47"}, "section": {"name": "GALAXIES & UNIVERSE", "sectionnum": "001", "primary_alias": "ASTR-005-001", "path": "/courses/21308/sections/001", "id": "21308-001", "aliases": ["ASTR-005-001"]}, "comments": "Officially known as “Galaxies and Universe,” this survey course is designed to provide an introduction to stars, galaxies, and the history of the universe. Subjects that will be covered include the Sun, supernovae, black holes, the Milky Way, dark matter and energy, and the Big Bang. Discussions center on understanding the properties of astronomical bodies using physical theories such as Relativity. The course can be taken to fulfill the Physical World Sector requirement.\r\n\r\nOverall students seemed to enjoy the class quite a lot. Students felt like they learned a great deal, especially in terms of the “scientific method” as well as general “astronomy and physics” concepts. Some described concepts as “far reaching,” and most finished with a more “informed outlook” on the universe.\r\n\r\nAcross the board, students acclaimed Professor Bernstein’s teaching style. Many appreciated his “humor” and “clear, engaging” communication abilities and how “enthusiastic” and accessible he was. There were several students who were pleasantly surprised as the class exceeded their expectations. One senior, attempting to fulfill a sector requirement, described it as “one of [his] three favorite classes [he’s] ever taken at UPenn.”\r\n\r\nMost students who took this class were College upperclassmen fulfilling their Physical World Sector requirement. Many described the homework as extremely difficult and time-consuming. Some explained that attending office hours was the only way they could complete assignments. Midterms were also difficult with most of the class scoring in the 60-70% range. The course was recommended to both majors and non-majors.\r\n", "num_students": 62, "path": "/courses/21308/sections/001/reviews/2060-GARY-M--BERNSTEIN", "instructor": {"path": "/instructors/2060-GARY-M--BERNSTEIN", "first_name": "GARY M.", "last_name": "BERNSTEIN", "id": "2060-GARY-M--BERNSTEIN", "name": "GARY M. BERNSTEIN"}, "num_reviewers": 58, "id": "21308-001-2060-GARY-M--BERNSTEIN"}]