[{"ratings": {"rAmountLearned": "3.36", "rDifficulty": "2.53", "rStimulateInterest": "3.60", "rRecommendMajor": "3.84", "rCourseQuality": "3.45", "rWorkRequired": "2.73", "rInstructorAccess": "2.82", "rReadingsValue": "3.25", "rRecommendNonMajor": "3.42", "rCommAbility": "3.71", "rInstructorQuality": "3.61"}, "section": {"name": "A WORLD AT WAR", "sectionnum": "001", "primary_alias": "HIST-431-001", "path": "/courses/27595/sections/001", "id": "27595-001", "aliases": ["HIST-431-001"]}, "comments": "This course is designed to explore the diplomatic origins, military course, and domestic implications of World War II. \r\n\r\nThe majority of students said this course was their favorite at Penn. According to students, “Although the course is very specifically confined to WWII, it also brings up an issue that we still don't have an answer to today -- the morality of war.”  As one stated, “One of the best courses at Penn. Period.” Many students believed they learned a lot from this course. One student noted that “the class [was] very interesting, pace was great, and I was able to learn a lot.” Many students were amazed by the course quality and many agreed the sentiment that it was a class they consistently looked forward to attending. Almost every student found the course extremely engaging, to the degree that many commented that they lost track of time while in lecture.  Another student noted, “I was not disappointed with this class. It was exciting and challenging. I will miss it dearly.”\r\n\r\nAccording to many reviewers, Professor Childers’s reputation as “a god” has been well earned. Many students described Childers as incredible. One wrote, “I love Childers. He is my hero. Actually. His lectures are like stories. With cliffhangers and protagonists and antagonists.” Another agreed, explaining that “during most lectures he had the entire class on the edge of their seats.” Every single reviewer found that Childers was unquestionably knowledgeable about the material. Although a few thought that Childers lived up to — and, at times, exceeded — his reputation, a few students felt that “the legend of this course and professor sometimes overshadow the content and experience of the class.” A couple of students struggled to connect the lectures to the readings and felt it was difficult to take notes on class. As one student noted, “While Childers is a wonderful story-teller, he can sometimes lose sight of the fact that he’s teaching.” A few other students found that although Childers was available for discussion, his fan club filled his office hours and limited student-professor interaction. \r\n\r\nA few students suggested that this course should be made mandatory for all students. The majority of students would recommend the course to a major or non-major. One noted that this “is a must-take class for anyone with WII interest.” Another student said that, “This is a class that you must take an undergraduate at Penn.” However, a few students found that the course was unnecessarily difficult. A large portion of students also felt that it was difficult to keep up with the readings. The course also requires weekly journal entries and analytical essays, with an emphasis on recitations. A couple of students also found that they did not know what to expect on the exam and that there was “a large disconnect between students and the professor.”", "num_students": 217, "path": "/courses/27595/sections/001/reviews/655-THOMAS-C-CHILDERS", "instructor": {"path": "/instructors/655-THOMAS-C-CHILDERS", "first_name": "THOMAS C", "last_name": "CHILDERS", "id": "655-THOMAS-C-CHILDERS", "name": "THOMAS C CHILDERS"}, "num_reviewers": 193, "id": "27595-001-655-THOMAS-C-CHILDERS"}]