{"coursehistories": {"path": "/coursehistories/1673"}, "description": "Impressionism opened the pictorial field to light, perception, science, modernity, bourgeois leisure and, famously, the material qualities of painting itself. This course will survey the movement's major contexts and proponents-Magnet, Monet, Morisot, Cezanne, Guaguin, Van Gogh, Rodin-from its origins in the 1860s to its demise in the 1890s, as well as its subsequent adaptations throughout the world until WWI. We will pay particular attention to Impressionsim's critical reception and the historical conditions, which allowed one nation, France, to claim the emergence of early Modernism so firmly for itself. Questions to be addressed include: how can an art of vision and light figure the complexities of history and politics, and especially the revolutions that marked the period? What are the gendered and sexual politics of Impressionsm's obsession with the nude female body? How did the invention of the new technologies and media effect the development of modern art? \n\nThroughout the course, we will also analyze the effects the rapidly changing social and cultural fabric of Paris had on artistic developments. Arguable, Paris was the \"capital of the nineteenth century,\" and it is here where most artistic innovation of the time took place. None-the-less, we will look outside of France's borders with some frequency, especially to Germany and Britain. \n\n", "semester": "2009C", "name": "IMPRESSIONISM", "reviews": {"path": "/courses/16975/reviews", "values": [{"ratings": {"rAmountLearned": "3.13", "rDifficulty": "2.78", "rStimulateInterest": "2.87", "rRecommendMajor": "3.69", "rCourseQuality": "3.05", "rWorkRequired": "2.85", "rInstructorAccess": "2.89", "rReadingsValue": "2.77", "rRecommendNonMajor": "2.63", "rCommAbility": "3.00", "rInstructorQuality": "3.15"}, "section": {"name": "IMPRESSIONISM", "sectionnum": "401", "primary_alias": "ARTH-285-401", "path": "/courses/16975/sections/401", "id": "16975-401", "aliases": ["ARTH-285-401", "ARTH-685-401"]}, "comments": "French Impressionism is the centerpiece of this course, which will explore paintings, and some sculptures, produced between 1848 and 1906. The class considers French, Dutch, and Scandanavian artists who painted and exhibited in Paris during these years, exploring not only their historical stature and reputation, but their contemporary relevance. It will reflect on such myths of modernism as the \"misogyny\"of Degas; the \"obsessiveness\" of Cezanne; the \"primitivism\" of Gauguin; and, of course, the \"madness\" of Van Gogh. All art is considered within the context of the social, economic and political changes that were taking place in Paris--the capital of the nineteenth--century.&#8232;&#8232;\r\n\r\nStudents generally enjoyed the “highly engaging” course. They appreciated that they “discussed so much more than arts in this class.” Other topics, which included prostitution, photography, physiognomy and more, were “fascinating in their own right and even more interesting when connected by the professor to the art of the Impressionists.” The course exposed students to “a variety of themes and methodologies.”&#8232;&#8232;\r\n\r\nStudents commented that Professor Dombrowski’s way of teaching was both “smart and fascinating.” Students appreciated that he asked “questions that were tough, well-considered, and provocative, while creating a learning-friendly and compassionate atmosphere in the classroom.” Professor Dombrowski’s ability to artfully summarize large amounts of complex historical and theoretical intro was “nothing less than astounding.” &#8232;&#8232;\r\n\r\nDespite the fascinating course design and the professor, some students complained that too much work was required for this course. Notwithstanding the vast amount of work, which included long readings and many papers, however, students recommended this course to anyone interested in the subject.\r\n", "num_students": 60, "path": "/courses/16975/sections/401/reviews/4746-ANDRE-DOMBROWSKI", "instructor": {"path": "/instructors/4746-ANDRE-DOMBROWSKI", "first_name": "ANDRE", "last_name": "DOMBROWSKI", "id": "4746-ANDRE-DOMBROWSKI", "name": "ANDRE DOMBROWSKI"}, "num_reviewers": 56, "id": "16975-401-4746-ANDRE-DOMBROWSKI"}]}, "credits": null, "primary_alias": "ARTH-285", "path": "/courses/16975", "sections": {"path": "/courses/16975/sections", "values": [{"name": "IMPRESSIONISM", "sectionnum": "401", "primary_alias": "ARTH-285-401", "path": "/courses/16975/sections/401", "id": "16975-401", "aliases": ["ARTH-285-401", "ARTH-685-401"]}]}, "id": 16975, "aliases": ["ARTH-285", "ARTH-685"]}