{"coursehistories": {"path": "/coursehistories/1050"}, "description": "This course relies on a variety of sociological perspectives to examine the role of the media and popular culture in society, with a particular emphasis on the power of the entertainment industries, the relationship between cultural consumption and status, and the social organization of leisure activities from sports to shopping. Specific course topics include the globalization of branding and popular culture, the rise of aesthetics and style in everyday life, the importance of social networks in the diffusion of fads, fashions, and mass media; and the social effects of new media technologies in the digital age. \n\n", "semester": "2010C", "name": "SOC. OF MEDIA & POP CULT", "reviews": {"path": "/courses/23793/reviews", "values": [{"ratings": {"rAmountLearned": "2.83", "rDifficulty": "2.13", "rStimulateInterest": "2.39", "rRecommendMajor": "3.04", "rCourseQuality": "2.50", "rWorkRequired": "2.54", "rInstructorAccess": "2.75", "rReadingsValue": "2.42", "rRecommendNonMajor": "2.71", "rCommAbility": "2.92", "rInstructorQuality": "2.69"}, "section": {"name": "SOC. OF MEDIA & POP CULT", "sectionnum": "601", "primary_alias": "SOCI-137-601", "path": "/courses/23793/sections/601", "id": "23793-601", "aliases": ["SOCI-137-601"]}, "comments": "This course relies on a variety of sociological perspectives to examine the role of the media and popular culture in everyday society, with a particular emphasis on the power of the mass media industry, the relationship between cultural consumption and status, and the social organization of leisure activities from sports to shopping. Specific course topics include the marketing of Starbucks, the rise of aesthetics and style in everyday life, the reception of film and rock music in contemporary American society, and the social effects of new media technologies in the digital age.\r\n\r\nStudents generally liked this class. One student said, \"I loved this course--I definitely learned a lot. Despite being a long class at the end of the day, paying attention in class was never an issue.\" However, there was some mention of the course material being out of date. One student noted, \"The material could be updated. Pop culture today is not the same as pop culture in the 80s.\"\r\n\r\nStudents by and large liked Professor Rubin. Professor Rubin ensures that students keep up with course content throughout the semester by consistently giving quizzes. “While demanding, it is effective.” Many found her to be “a great instructor.” On the other hand, some criticized her teaching method because of the volume of reading and the weight of the quizzes on one's overall grade. \r\n\r\nThere is a lot of reading every week, but it is said to be manageable. There were four quizzes (15% of the overall grade) on the reading so students did have to pay attention to detail. This course has no prerequisite and fulfills the Society Sector requirement.\r\n", "num_students": 28, "path": "/courses/23793/sections/601/reviews/5678-MOLLIE-RUBIN", "instructor": {"path": "/instructors/5678-MOLLIE-RUBIN", "first_name": "MOLLIE", "last_name": "RUBIN", "id": "5678-MOLLIE-RUBIN", "name": "MOLLIE RUBIN"}, "num_reviewers": 26, "id": "23793-601-5678-MOLLIE-RUBIN"}]}, "credits": null, "primary_alias": "SOCI-137", "path": "/courses/23793", "sections": {"path": "/courses/23793/sections", "values": [{"name": "SOC. OF MEDIA & POP CULT", "sectionnum": "601", "primary_alias": "SOCI-137-601", "path": "/courses/23793/sections/601", "id": "23793-601", "aliases": ["SOCI-137-601"]}]}, "id": 23793, "aliases": ["SOCI-137"]}