{"coursehistories": {"path": "/coursehistories/2599"}, "description": "This course surveys the history of medical knowledge and practice from antiquity to the present. No prior background in the history of science or medicine is required. The course has two principal goals: (1)to give students a practical introduction to the fundamental questions and methods of the history of medicine, and (2)to foster a nuanced, critical understanding of medicine's complex role in contemporary society. The couse takes a broadly chronological approach, blending the perspectives of the patient,the physician,and society as a whole--recognizing that medicine has always aspired to \"treat\" healthy people as well as the sick and infirm. Rather than history \"from the top down\"or \"from the bottom up,\"this course sets its sights on history from the inside out. This means, first, that medical knowledge and practice is understood through the personal experiences of patients and caregivers. It also means that lectures and discussions will take the long-discredited knowledge and treatments of the past seriously,on their own terms, rather than judging them by todays's standards. Required readings consist largely of primary sources, from elite medical texts to patient diaries. Short research assignments will encourge students to adopt the perspectives of a range of actors in various historical eras. \n\n", "semester": "2007C", "name": "MEDICINE IN HISTORY", "reviews": {"path": "/courses/13422/reviews", "values": [{"ratings": {"rAmountLearned": "3.16", "rDifficulty": "2.47", "rStimulateInterest": "3.03", "rRecommendMajor": "3.53", "rCourseQuality": "3.03", "rWorkRequired": "2.77", "rInstructorAccess": "3.24", "rReadingsValue": "3.04", "rRecommendNonMajor": "2.56", "rCommAbility": "3.00", "rInstructorQuality": "3.27"}, "section": {"name": "MEDICINE IN HISTORY", "sectionnum": "401", "primary_alias": "HSOC-002-401", "path": "/courses/13422/sections/401", "id": "13422-401", "aliases": ["HSOC-002-401", "STSC-002-401", "HIST-036-401"]}, "comments": "Many of the students enjoyed Barnes\\' class.  They found that he was passionate, told great stories, and was  a well-spoken professor.  One student noted that he enjoyed the class on most days, but that it got a “bit lecture-heavy.”  Overall, the reviews were mostly good, although a few students found the course to be disorganized.", "num_students": 81, "path": "/courses/13422/sections/401/reviews/1520-DAVID-S--BARNES", "instructor": {"path": "/instructors/1520-DAVID-S--BARNES", "first_name": "DAVID S.", "last_name": "BARNES", "id": "1520-DAVID-S--BARNES", "name": "DAVID S. BARNES"}, "num_reviewers": 73, "id": "13422-401-1520-DAVID-S--BARNES"}]}, "credits": null, "primary_alias": "HSOC-002", "path": "/courses/13422", "sections": {"path": "/courses/13422/sections", "values": [{"name": "MEDICINE IN HISTORY", "sectionnum": "401", "primary_alias": "HSOC-002-401", "path": "/courses/13422/sections/401", "id": "13422-401", "aliases": ["HSOC-002-401", "STSC-002-401", "HIST-036-401"]}]}, "id": 13422, "aliases": ["HSOC-002", "STSC-002", "HIST-036"]}