{"coursehistories": {"path": "/coursehistories/1457"}, "description": "This course surveys the institutional development of the American presidency from the Constitutional convention through the current administration. It examines the politics of presidential leadership, and how the executive branch functions. An underlying theme of the course is the tensions bewteen the presidency, leadership, and democracy. \n\n", "semester": "2010A", "name": "THE AMERICAN PRESIDENCY", "reviews": {"path": "/courses/26665/reviews", "values": [{"ratings": {"rAmountLearned": "3.15", "rDifficulty": "3.04", "rStimulateInterest": "3.19", "rRecommendMajor": "3.58", "rCourseQuality": "3.28", "rWorkRequired": "3.19", "rInstructorAccess": "3.35", "rReadingsValue": "3.11", "rRecommendNonMajor": "2.63", "rCommAbility": "3.56", "rInstructorQuality": "3.45"}, "section": {"name": "THE AMERICAN PRESIDENCY", "sectionnum": "001", "primary_alias": "PSCI-237-001", "path": "/courses/26665/sections/001", "id": "26665-001", "aliases": ["PSCI-237-001"]}, "comments": "This course surveys the institutional development of the American presidency from the Constitutional Convention through the current administration. It examines the politics of presidential leadership, and how the executive branch functions. An underlying theme of the course is the tension between the presidency, leadership, and democracy.\r\n\r\nStudents generally had positive feelings about the content of the course. For the most part, they agreed that both the lecture and readings were interesting and relevant. Many students mentioned that they “learned a lot” from the course. However, a few students expressed discontent with the consistent slant of the readings. One stated the following: “Readings could have been more balanced, since most [came] blatantly from the left wing.”\r\n\r\nProfessor Gottschalk was relatively well-liked by the students, being described as a “very good” and “devoted” lecturer. Students praised the fact that she was “always willing to stop and answer student questions.” One student relates that Gottschalk is one of the “nicest professors” at Penn, while another lauds her sharp sense of humor.\r\n\r\nStudents considered the course to be somewhat difficult, with a decent workload. One student complained that the two large papers were “graded rather harshly.” Another student registered a complaint about being forced to buy and carry a bulk pack of books, saying this “made the reading more of a chore.” On the other hand, most other students had no such complaints, and the level of difficulty appears reasonable. The course was open to all students, with no prerequisites. ", "num_students": 39, "path": "/courses/26665/sections/001/reviews/1938-MARIE-GOTTSCHALK", "instructor": {"path": "/instructors/1938-MARIE-GOTTSCHALK", "first_name": "MARIE", "last_name": "GOTTSCHALK", "id": "1938-MARIE-GOTTSCHALK", "name": "MARIE GOTTSCHALK"}, "num_reviewers": 32, "id": "26665-001-1938-MARIE-GOTTSCHALK"}]}, "credits": null, "primary_alias": "PSCI-237", "path": "/courses/26665", "sections": {"path": "/courses/26665/sections", "values": [{"name": "THE AMERICAN PRESIDENCY", "sectionnum": "001", "primary_alias": "PSCI-237-001", "path": "/courses/26665/sections/001", "id": "26665-001", "aliases": ["PSCI-237-001"]}]}, "id": 26665, "aliases": ["PSCI-237"]}