[{"ratings": {"rAmountLearned": "1.88", "rDifficulty": "2.36", "rStimulateInterest": "2.19", "rRecommendMajor": "1.86", "rCourseQuality": "1.59", "rWorkRequired": "2.31", "rInstructorAccess": "2.88", "rReadingsValue": "2.63", "rRecommendNonMajor": "1.13", "rCommAbility": "2.00", "rInstructorQuality": "2.59"}, "section": {"name": "HISTORY LIT THEORY", "sectionnum": "401", "primary_alias": "COML-501-401", "path": "/courses/17162/sections/401", "id": "17162-401", "aliases": ["COML-501-401", "GRMN-534-401", "CLST-511-401", "ENGL-573-401", "SLAV-500-401", "ROML-512-401"]}, "comments": "This course is an introduction to literary and cultural theory and to some of the key questions that animate theoretical discussion among literary scholars today. These include questions about aesthetics and cultural value, about ideology and hegemony, about the patriarchal and colonial bases of Western culture, and about the status of the cultural object, the cultural critic, and cultural theory itself.&#8232;&#8232;\r\nStudents complained about the structure of the class and believed that more lecturing would have been helpful. Discussion was described as being “unfocused and digressive” and many felt that the over-utilization of student presentations was not the best way to study the dense subject matter. \r\n&#8232;&#8232;Students had mixed feelings regarding Professor Jarosinski, as several commented that he “seems to be incredibly intelligent, responsive and caring.” However, the large class size contributed to the consensus that Professor Jarosinski did not adequately control discussion and lessened the value of the course. In addition, students wished the Professor played a more central role in the class instead of relying so heavily on student presentations. &#8232;\r\n&#8232;Students did not recommend this class for fellow students and generally did not feel that they learned a great deal from the course.\r\n", "num_students": 24, "path": "/courses/17162/sections/401/reviews/3980-ERIC-JAROSINSKI", "instructor": {"path": "/instructors/3980-ERIC-JAROSINSKI", "first_name": "ERIC", "last_name": "JAROSINSKI", "id": "3980-ERIC-JAROSINSKI", "name": "ERIC JAROSINSKI"}, "num_reviewers": 17, "id": "17162-401-3980-ERIC-JAROSINSKI"}]