{"coursehistories": {"path": "/coursehistories/2763"}, "description": "Writing a \"program\" is easy. Developing a \"software product\", however, introduces numerous challenges that make it a much more difficult task. This course will look at how professional software engineers address those challenges, by investigating best practices from industry and emerging trends in software engineering research. Topics will focus on software maintenance issues, including: test case generation and test suite adequacy; code analysis verification and model checking; debugging and fault localization; refactoring and regression testing; and software design and quality. \n\n", "semester": "2011C", "name": "SOFTWARE ENGINEERING", "reviews": {"path": "/courses/24189/reviews", "values": [{"ratings": {"rAmountLearned": "2.81", "rDifficulty": "2.37", "rStimulateInterest": "3.34", "rRecommendMajor": "3.00", "rCourseQuality": "2.83", "rWorkRequired": "2.52", "rInstructorAccess": "3.55", "rReadingsValue": "2.77", "rRecommendNonMajor": "2.48", "rCommAbility": "3.51", "rInstructorQuality": "3.47"}, "section": {"name": "SOFTWARE ENGINEERING", "sectionnum": "001", "primary_alias": "CIS-573-001", "path": "/courses/24189/sections/001", "id": "24189-001", "aliases": ["CIS-573-001"]}, "comments": "Writing a \"program\" is easy. Developing a \"software product\", however,\r\nintroduces numerous challenges that make it a much more difficult task. This course\r\nlooks at how professional software engineers address those challenges, by investigating\r\nbest practices from industry and emerging trends in software engineering research.\r\nTopics focus on software maintenance issues, including: test case generation and test\r\nsuite adequacy; code analysis verification and model checking; debugging and fault\r\nlocalization; refactoring and regression testing; and software design and quality.\r\nMany students thought that the class was “relevant [to] work after graduation.”\r\nOne student noted that the course may be “one of the most useful courses in [terms of\r\nsearching] for jobs.” However, a good amount of other students felt that many of the\r\nsubjects taught were “not of any practical [value].” Specifically, they complained that the\r\nassignments involved too much theory, and did not contain much “programming\r\ncontent.” A student suggested that a final project would have been a good way to apply a\r\n“software development process” in the class.\r\nSeveral students praised Professor Murphy for his organization, saying that he\r\n“did a really good job of designing the [brand new] course.” One student who did not\r\nenjoy the course material remarked that Professor Murphy’s “teaching made it\r\ninteresting.”\r\nA few students thought that “excessive class time [was] spent copying notes”\r\ninstead of paying attention to the lectures. A majority of the class did not feel that the\r\nassignments were too much work, and some even found the course to be “too easy for\r\nCIS students.” Students who found the course to be practical on the job strongly\r\nrecommended it to students within the major.", "num_students": 107, "path": "/courses/24189/sections/001/reviews/5320-CHRISTIAN-MURPHY", "instructor": {"path": "/instructors/5320-CHRISTIAN-MURPHY", "first_name": "CHRISTIAN", "last_name": "MURPHY", "id": "5320-CHRISTIAN-MURPHY", "name": "CHRISTIAN MURPHY"}, "num_reviewers": 94, "id": "24189-001-5320-CHRISTIAN-MURPHY"}]}, "credits": null, "primary_alias": "CIS-573", "path": "/courses/24189", "sections": {"path": "/courses/24189/sections", "values": [{"name": "SOFTWARE ENGINEERING", "sectionnum": "001", "primary_alias": "CIS-573-001", "path": "/courses/24189/sections/001", "id": "24189-001", "aliases": ["CIS-573-001"]}]}, "id": 24189, "aliases": ["CIS-573"]}