[{"ratings": {"rAmountLearned": "2.66", "rDifficulty": "2.58", "rStimulateInterest": "2.00", "rRecommendMajor": "3.19", "rCourseQuality": "2.27", "rWorkRequired": "1.92", "rInstructorAccess": "2.35", "rReadingsValue": "1.72", "rRecommendNonMajor": "2.24", "rCommAbility": "2.26", "rInstructorQuality": "2.26"}, "section": {"name": "HEALTH CARE SYSTEMS", "sectionnum": "001", "primary_alias": "HCMG-101-001", "path": "/courses/24513/sections/001", "id": "24513-001", "aliases": ["HCMG-101-001"]}, "comments": "Health Care Management 101 is an introductory course that takes a policy and politics angle to health care's three persistent issues - access, cost and quality.  The roles of patients, physicians, hospitals, insurers, and pharmaceutical companies will be established.  The interaction between the government and these different groups will also be covered.  Current national health care policy initiatives and the interests of class members will steer the specific topics covered. The course aims to provide skills for critical and analytical thought about the U.S. health care system and the people in it.\r\n\r\nReviews for this course were mixed. Some students felt that the course offered a lot of “practical knowledge about politics and healthcare.” However, other students admitted that the material could have just as easily have been learned from a book. Several students even described the course as “boring.”\r\n\r\nA majority of the students felt that Professor Polsky did not stimulate enough interest in the course. A couple of students described Professor Polsky’s habit of reading his slides as uninteresting. Several students wrote, however, that Professor Polsky enriched the classroom experience through his choice of guest speakers. \r\n\r\nRegarding work, most students felt that the load was light. However, several students described the grading as “harsh,” while a couple of others described it as “difficult and unfair.” Nonetheless, a couple of students recommended the course to students with an interest in current healthcare policies.\r\n", "num_students": 93, "path": "/courses/24513/sections/001/reviews/2994-DANIEL-E--POLSKY", "instructor": {"path": "/instructors/2994-DANIEL-E--POLSKY", "first_name": "DANIEL E.", "last_name": "POLSKY", "id": "2994-DANIEL-E--POLSKY", "name": "DANIEL E. POLSKY"}, "num_reviewers": 91, "id": "24513-001-2994-DANIEL-E--POLSKY"}]