[{"ratings": {"rAmountLearned": "2.77", "rDifficulty": "2.60", "rStimulateInterest": "2.93", "rRecommendMajor": "3.52", "rCourseQuality": "2.73", "rWorkRequired": "2.69", "rInstructorAccess": "2.69", "rReadingsValue": "2.65", "rRecommendNonMajor": "2.51", "rCommAbility": "3.18", "rInstructorQuality": "3.10"}, "section": {"name": "ANCIENT ROME", "sectionnum": "401", "primary_alias": "ANCH-027-401", "path": "/courses/25574/sections/401", "id": "25574-401", "aliases": ["ANCH-027-401", "HIST-027-401"]}, "comments": "This course explores the Roman Empire from its creation to its legacies that remain today. The subject matter includes the social, economic, and political structure of the empire. The course will also discuss the conquest, warfare, administration, and law that made the empire possible and the military, cultural, and religious challenges that threatened it. The timeline of the course material stretches from the creation of the Roman Empire to the last three centuries BC. Focus is placed on the political structure of the Roman Empire and its transition from Republic to Principate. This course will also explore the creation of a single Roman culture through its forms of literature (such as satire), entertainment (such as gladiatorial arenas), and other aspects that contributed to the creation of a Roman social order. \r\n\r\nStudents found this course very informative. Many summed up the course as “wonderful,” “great course,” or “interesting and fun.” However, the material was very overwhelming to some students as the course covers “500 years of Roman history while still attempting to focus on themes and culture rather than events.” Therefore, many students found the course to contain a great deal of information in a short period of time, and was a “rigorous survey of Ancient Rome” as not as introductory as the course name suggests. \r\n\r\nProfessor Grey received mixed reviews from students. Many found the Powerpoint slides to be confusing out of context and also found the professor himself to be confusing at times. However, many students agreed that “Dr. Grey is an outstanding teacher” and cited his “wonderful” lectures and “enthusiasm for the material.” Students were similarly impressed by the Professor’s preparation for class and energy throughout the lecture. Although some commented that the lectures were “not helpful at all,” many students disagreed and found his lectures to be extremely entertaining and engaging, and said that the course was “pretty easy...[and Grey is] funny, comfortable, and a great storyteller.” \r\n\r\nAlthough many students took this course to fulfill the History and Tradition Sector (and a majority were freshman), many commented that the course should not be directed at non-majors due to the extensive course material and readings. The vast majority of students noted that the readings were quite extensive and the material covered was “too much for an introductory course.” Many students even questioned the importance of the readings because they did not understand their connection to the material presented during lecture. Some students even went so far as to state that the “course required an unrealistic amount of reading, some of which was not entirely necessary to do well in the class [but instead] hinder[ed] students’ ability to focus on subject matter.” However, overall students found Professor Grey’s tests and assignments “fair” and the expectations “reasonable and clearly stated.” Some students were displeased with their grades, as there is no curve. Some also found the “exam grading was a little bit arbitrary.” However, many students found that this course was “a great intro to Roman history.” In addition, students were pleased with what they learned and felt prepared for their exams.", "num_students": 154, "path": "/courses/25574/sections/401/reviews/2844-CAMPBELL-AINSWORTH-GREY", "instructor": {"path": "/instructors/2844-CAMPBELL-AINSWORTH-GREY", "first_name": "CAMPBELL AINSWORTH", "last_name": "GREY", "id": "2844-CAMPBELL-AINSWORTH-GREY", "name": "CAMPBELL AINSWORTH GREY"}, "num_reviewers": 140, "id": "25574-401-2844-CAMPBELL-AINSWORTH-GREY"}]