{"coursehistories": {"path": "/coursehistories/412"}, "description": "This course explores an aspect of the novel intensively, asking how novels work and what they do to us and for us. Specific course topics will vary from year to year. \n\nSee the English Department's website at www.english.upenn.edu for a description of the current offerings. \n\n", "semester": "2010C", "name": "TOPICS - THE NOVEL: DICKENS AND JOYCE", "reviews": {"path": "/courses/22991/reviews", "values": [{"ratings": {"rAmountLearned": "3.86", "rDifficulty": "3.32", "rStimulateInterest": "3.95", "rRecommendMajor": "4.00", "rCourseQuality": "3.83", "rWorkRequired": "3.36", "rInstructorAccess": "3.91", "rReadingsValue": "3.81", "rRecommendNonMajor": "2.41", "rCommAbility": "3.95", "rInstructorQuality": "4.00"}, "section": {"name": "TOPICS - THE NOVEL: DICKENS AND JOYCE", "sectionnum": "301", "primary_alias": "ENGL-260-301", "path": "/courses/22991/sections/301", "id": "22991-301", "aliases": ["ENGL-260-301"]}, "comments": "This seminar addresses Dickens and Joyce as two of the most influential comic novelists of the modern period. With some background reading in Cervantes and other precursors (such as Henry Fielding), the class looks at Dickens and Joyce as figures in a spectacular, even phantasmagoric, history of the urban novel that resists the more sober conventions of domestic or psychological realism. Students concentrate on Dickens's epic of 19th-century London, Our Mutual Friend, and Joyce's epic of 20th-century Dublin, Ulysses. Readings include a fairly substantial set of critical and historical essays chosen to elaborate the social contexts and interpretive possibilities associated with the two main novels. Written requirements include two essays and several short response papers.&#8232;&#8232;\r\nStudents really enjoyed the class and its material. The students especially emphasized the level of intellectual engagement in the class. One student wrote, “every single class, I come out of the classroom, brain literally hurting, filled with new thoughts and ideas.” Other students also expressed their enjoyment of the intellectual level of the course. Many students mentioned that they felt this was the best class they have taken at Penn.&#8232;&#8232;\r\nStudents heaped praised on Professor Etsy, describing him as “inspiring,” “phenomenal…and truly committed to his students' development as English students,” &#8232;“brilliant,” “fun,” “engaging,” “remarkable,” and “incredible.” Professor Etsy encouraged his students to perform well. One student even wrote, “I want to perform to the best of my abilities because of him.” The students also applauded Professor Etsy for his knowledge of the subject matter and for his ability to make the difficult reading easily understood.&#8232;&#8232;\r\nThe students acknowledged that this class was difficult, partially due to the readings. However, all of the students agreed that the course was “well worth the [time] investment” and “rewarding.” Despite its difficulty, students felt all of the work in the class is “worthwhile.”\r\n", "num_students": 24, "path": "/courses/22991/sections/301/reviews/4304-JOSHUA-ESTY", "instructor": {"path": "/instructors/4304-JOSHUA-ESTY", "first_name": "JOSHUA", "last_name": "ESTY", "id": "4304-JOSHUA-ESTY", "name": "JOSHUA ESTY"}, "num_reviewers": 23, "id": "22991-301-4304-JOSHUA-ESTY"}]}, "credits": null, "primary_alias": "ENGL-260", "path": "/courses/22991", "sections": {"path": "/courses/22991/sections", "values": [{"name": "TOPICS - THE NOVEL: DICKENS AND JOYCE", "sectionnum": "301", "primary_alias": "ENGL-260-301", "path": "/courses/22991/sections/301", "id": "22991-301", "aliases": ["ENGL-260-301"]}]}, "id": 22991, "aliases": ["ENGL-260"]}