{"coursehistories": {"path": "/coursehistories/4336"}, "description": "This course is designed to provide students with a practical understanding of private equity issues focusing on developing country environments. The underlying premise of the course is that private equity in developing country environments is a distinctly different asset class than in industrialized countries for a number of reasons that will be identified and analyzed by students, such as valuation, corporate governance standards and practices, contract enforcement and regulations, and exit alternatives. Students will assess these differences that heighten the risks for private equity investors in emerging markets and explore how they can be successfully mitigated. The course will be analytically rigorous and require a high level of weekly preparation and class participation. The case method of teaching will predominate, allowing students to gain a realistic understanding of the roles, responsibilities and analytical skills required of practitioners, and the tensions that arise between the various stakeholders, including government officials who formulate regulations and policies that affect PE investor behavior and performance. Cases will be based on actual transactions, highlighting the challenges and tasks performed at each stage of the investment cycle, such as structuring a new fund, originating investment \n\nconducting due diligence, monitoring and creating value in portfolio companies and exiting. \n\n", "semester": "2009A", "name": "PRIV. EQUITY EMERG. MAR", "reviews": {"path": "/courses/16100/reviews", "values": [{"ratings": {"rAmountLearned": "2.59", "rDifficulty": "1.82", "rStimulateInterest": "2.76", "rRecommendMajor": "2.82", "rCourseQuality": "2.78", "rWorkRequired": "1.94", "rInstructorAccess": "3.59", "rReadingsValue": "2.94", "rRecommendNonMajor": "2.06", "rCommAbility": "2.94", "rInstructorQuality": "3.28"}, "section": {"name": "PRIV. EQUITY EMERG. MAR", "sectionnum": "701", "primary_alias": "MGMT-809-701", "path": "/courses/16100/sections/701", "id": "16100-701", "aliases": ["MGMT-809-701"]}, "comments": "", "num_students": 28, "path": "/courses/16100/sections/701/reviews/215-STEPHEN-M-SAMMUT", "instructor": {"path": "/instructors/215-STEPHEN-M-SAMMUT", "first_name": "STEPHEN M", "last_name": "SAMMUT", "id": "215-STEPHEN-M-SAMMUT", "name": "STEPHEN M SAMMUT"}, "num_reviewers": 18, "id": "16100-701-215-STEPHEN-M-SAMMUT"}]}, "credits": null, "primary_alias": "MGMT-809", "path": "/courses/16100", "sections": {"path": "/courses/16100/sections", "values": [{"name": "PRIV. EQUITY EMERG. MAR", "sectionnum": "701", "primary_alias": "MGMT-809-701", "path": "/courses/16100/sections/701", "id": "16100-701", "aliases": ["MGMT-809-701"]}]}, "id": 16100, "aliases": ["MGMT-809"]}