{"coursehistories": {"path": "/coursehistories/220"}, "description": "Basic principles of protein characterization, enzyme kinetics and mechanism, membrane structure and function, metabolism and biochemistry of energy, and signal transduction. A problem-solving approach will be employed and emphasis will be placed on the application of quantitative methods to biochemical problems. Each of the five major sections of the course will be concluded with group discussions specifically directed at the solution of numerical problems and the interpretation of experimental results. In order to maximize the opportunities for students to think critically, analytically and creatively, most of the material covered in the course will be tested using take-home examinations. Students will have the option of attending sessions in which the recent original literature will be discussed. \n\n", "semester": "2011A", "name": "BIOCHEMISTRY", "reviews": {"path": "/courses/21355/reviews", "values": [{"ratings": {"rAmountLearned": "3.41", "rDifficulty": "3.55", "rStimulateInterest": "3.50", "rRecommendMajor": "3.42", "rCourseQuality": "3.30", "rWorkRequired": "3.16", "rInstructorAccess": "3.56", "rReadingsValue": "2.88", "rRecommendNonMajor": "1.61", "rCommAbility": "3.50", "rInstructorQuality": "3.57"}, "section": {"name": "BIOCHEMISTRY", "sectionnum": "001", "primary_alias": "BIOL-402-001", "path": "/courses/21355/sections/001", "id": "21355-001", "aliases": ["BIOL-402-001"]}, "comments": "Biochemistry introduces biology majors to basic principles of: protein characterization; enzyme kinetics and mechanisms; membrane structure and function; metabolism and biochemistry of energy; and signal transduction. Moreover, a problem-solving approach will be used, and emphasis will be placed on the application of quantitative methods to biochemical problems. Each of the five major sections of the course will be concluded with a group discussion specifically directed at solving numerical problems and interpreting experimental results. To maximize the opportunities for students to think critically, much of the material covered in the course will be tested in the form of take-home examinations. \r\n\r\nStudents overall greatly enjoyed the course describing it as “one of the most satisfying classes” at Penn. Another student thought “it was the best Biology course” he had ever taken. Many appreciated the fact that the course emphasized understanding of the material instead of memorization. One student summarized the course quite eloquently when he said that it really makes you “think.”\r\n\r\nProfessor Rea received stellar reviews from all of his students. Students described him as “caring,” “engaging,” and “passionate.” Students felt that Dr. Rea does a good job of clarifying complex concepts and introducing students to what is involved in biological research. Some students felt that in comparison to Dr. Rea, the other instructors and teaching assistants were sub-par.\r\n\r\nStudents in the class were upperclassmen and biology majors. Overall students felt that the course was extremely time-consuming and “challenging.” There are six tests in total: three in-class midterms and three take-home exams. Some were overwhelmed that in-class and take-home midterms were given out on the same days. Because it is an upper level biology course, students should expect to deal with a large amount of information and a heavy workload.\r\n", "num_students": 49, "path": "/courses/21355/sections/001/reviews/1802-PHILIP-ARTHUR-REA", "instructor": {"path": "/instructors/1802-PHILIP-ARTHUR-REA", "first_name": "PHILIP ARTHUR", "last_name": "REA", "id": "1802-PHILIP-ARTHUR-REA", "name": "PHILIP ARTHUR REA"}, "num_reviewers": 37, "id": "21355-001-1802-PHILIP-ARTHUR-REA"}]}, "credits": null, "primary_alias": "BIOL-402", "path": "/courses/21355", "sections": {"path": "/courses/21355/sections", "values": [{"name": "BIOCHEMISTRY", "sectionnum": "001", "primary_alias": "BIOL-402-001", "path": "/courses/21355/sections/001", "id": "21355-001", "aliases": ["BIOL-402-001"]}]}, "id": 21355, "aliases": ["BIOL-402"]}