[{"ratings": {"rAmountLearned": "3.03", "rDifficulty": "3.05", "rStimulateInterest": "2.38", "rRecommendMajor": "3.20", "rCourseQuality": "2.60", "rWorkRequired": "3.36", "rInstructorAccess": "2.16", "rReadingsValue": "3.00", "rRecommendNonMajor": "2.15", "rCommAbility": "2.93", "rInstructorQuality": "2.60"}, "section": {"name": "POL ECON OF DEVELOPMENT", "sectionnum": "001", "primary_alias": "PSCI-224-001", "path": "/courses/23672/sections/001", "id": "23672-001", "aliases": ["PSCI-224-001"]}, "comments": "This course examines the debate in development studies arising from recognition that economic models, theories, methods, and strategies abstracted from the specific experience of western societies and cultures do not have general applicability. A broader social science approach is adopted, one which emphasizes the need to understand the social structures and cultures of the developing countries, the capabilities of weak versus strong states, and the links with the international system that influence transformative processes to which industrializing economies are subjected. The readings offer an overview of the most influential theories of development and underdevelopment that structured debate from the 1960's through the 1990's,and focus on the elements of these approaches that advance understanding of development and stagnation in several key countries, including Brazil, Mexico, India and selected countries in East and Southeast Asia.\r\n\r\nOverall, students felt that the course material was “interesting” and “informative.” Despite their appreciation of the content, however, many felt that the presentation was “slightly chaotic” and “unstructured.”\r\n\r\nReactions to Professor Kapur were quite mixed. Some students called him “brilliant,” “engaging” and “very articulate,” while others felt that lectures could me “more stimulating.” Many thought that Professor Kapur’s expectations for the course were far too high, and that this produced a “discouraging learning environment.”\r\n\r\nMany students felt that the workload for this course was “unreasonable,” and that it was “simply impossible to keep up” with the assigned readings. One student wrote, “I have written more for this class than any other class I have taken at Penn.” Several, however, still proclaimed this course “one of the best at Penn,” and recommended it to anyone willing to take on the work.\r\n", "num_students": 49, "path": "/courses/23672/sections/001/reviews/4081-DEVESH-KAPUR", "instructor": {"path": "/instructors/4081-DEVESH-KAPUR", "first_name": "DEVESH", "last_name": "KAPUR", "id": "4081-DEVESH-KAPUR", "name": "DEVESH KAPUR"}, "num_reviewers": 46, "id": "23672-001-4081-DEVESH-KAPUR"}]