[{"ratings": {"rAmountLearned": "2.27", "rDifficulty": "1.64", "rStimulateInterest": "1.95", "rRecommendMajor": "2.91", "rCourseQuality": "2.38", "rWorkRequired": "1.64", "rInstructorAccess": "3.32", "rReadingsValue": "2.23", "rRecommendNonMajor": "2.50", "rCommAbility": "2.68", "rInstructorQuality": "2.52"}, "section": {"name": "SOCIAL PROB & PUB POLICY", "sectionnum": "301", "primary_alias": "SOCI-002-301", "path": "/courses/23777/sections/301", "id": "23777-301", "aliases": ["SOCI-002-301"]}, "comments": "This course approaches some of today's important social and political issues from a sociological vantage point. The course begins by asking where social problems come from and covers main sociological perspectives along the likes of Marx, Weber and Durkheim. The ideas of these theorists are discussed in relation to issues of inequality, social conflict and community. The course also looks at the social construction of social problems and the role of the media, social experts and social movements in this construction. Lastly, the course considers how social problems are addressed through government reforms, the risk of unanticipated consequences of these reforms, and the role of philanthropy and volunteerism. Over the entire semester the course examines a variety of social issues and social and social problems including poverty, immigration, crime, global warming, and education.\r\n\r\nOn average, students loved this course. One commented that it was “the best subject matter” they had covered in a class, another student reinforcing this by claiming this course was “one of the most interesting classes” they had taken at Penn. The material had real-world applications and was communicated clearly. \r\n\r\nStudents had glowing comments about Professor Jacobs. They found him to be friendly, engaging and helpful. Many cited his willingness to meet outside of class and discuss things as proof of his dedication to his students. One student said he was an “expert professor” who knew the subject matter well and was able to explain with clarity to all the students. The only complaint was his overtly liberal bias and the lack of energy within the class to get discussions underway. \r\n\r\nAlthough a few students found the reading to be a bit unnecessary, most found they learned a lot. The grading system was also found to be fair and the assignments interesting, as many of the papers could be tailored to subjects the students picked instead of preformed prompts. The students in this course all highly recommended it to majors, minors, or anyone interested in sociology. The subject material was relevant to everyday life, and many students found that the workload was reasonable.\r\n", "num_students": 28, "path": "/courses/23777/sections/301/reviews/1092-JERRY-A-JACOBS", "instructor": {"path": "/instructors/1092-JERRY-A-JACOBS", "first_name": "JERRY A", "last_name": "JACOBS", "id": "1092-JERRY-A-JACOBS", "name": "JERRY A JACOBS"}, "num_reviewers": 26, "id": "23777-301-1092-JERRY-A-JACOBS"}]