{"coursehistories": {"path": "/coursehistories/5402"}, "description": "How do qualitative social scientists study urban communities? What kinds of powerful tales can be told about urban lifestyles and social issues/conflicts in places like Philadelphia? This course will allow students to study various ethnographic treatments of urban communities in the United States, using films, articles, TV serials, and books as guides for the framing of their own independent research on the streets of Philadelphia. Students will also form production teams of two or three people, and these production teams will be responsible for (i) identifying and researching an important urban issue in contemporary Philadelphia and (ii) turning that research into a 15-30 minute radio documentary that will be broadcast on a local Philadelphia radio station, WURD 900AM. Mixing radio/audio journalism with ethnographic methods, will enhance their skills at archival and social research, participant- observation, interviewing techniques, sound editing, and production. This course is intended to be a rigorous and exciting opportunity for students to tell empirically grounded stories using the voices of their subjects and the sounds of the city. \n\nPotential texts include: Sidewalk (a book and documentary film my Mitchell my Mitchell Duneier), Righteous Dopefiend (a book and museum exhibit by Philippe Bourgois), and excerpts from other ethnographic work by Ana Ramos-Zayas, Elijah Anderson, Todd Wolfson, David Grazian, Setha Low, Ulf Hannerz, Leith Mullings, John Gwaltney, Dana-ain Davis, Carol Stack, Melissa Checker, Katherine S. Newman, and others. By Permission Only. \n\n", "semester": "2012A", "name": "Urban Ethnography: Documenting City Life", "reviews": {"path": "/courses/27208/reviews", "values": [{"ratings": {"rAmountLearned": "2.85", "rDifficulty": "2.70", "rStimulateInterest": "3.30", "rRecommendMajor": "3.20", "rCourseQuality": "2.77", "rWorkRequired": "3.30", "rInstructorAccess": "2.95", "rReadingsValue": "2.33", "rRecommendNonMajor": "2.80", "rCommAbility": "3.25", "rInstructorQuality": "3.41"}, "section": {"name": "Urban Ethnography: Documenting City Life", "sectionnum": "401", "primary_alias": "COMM-320-401", "path": "/courses/27208/sections/401", "id": "27208-401", "aliases": ["COMM-320-401", "URBS-321-401", "ANTH-320-401"]}, "comments": "This course asks how do qualitative social scientists study urban communities? What kinds of powerful tales can be told about urban lifestyles and social issues/conflicts in places like Philadelphia? This course will allow students to study various ethnographic treatments of urban communities in the United States, using films, articles, TV serials, and books as guides for the framing of their own independent research on the streets of Philadelphia. Students will also form production teams of two or three people, and these production teams will be responsible for (i) identifying and researching an important urban issue in contemporary Philadelphia and (ii) turning that research into a 15-30 minute radio documentary that will be broadcast on a local Philadelphia radio station, WURD 900AM. This course is intended to be a rigorous and exciting opportunity for students to tell empirically grounded stories using the voices of their subjects and the sounds of the city.\r\n\tStudents felt that this course was “a wonderful idea” but complained that it “desperately is in need of more extensive planning.” Many noted the uniqueness of the course, and were excited to produce a radio documentary. However, some felt that a lot was left “for finals week” and further emphasized the need for better planning in the course.\r\n\tOnly two comments were made about Professor Jackson, with one student referring to him as an “excellent instructor” and another calling him “an outstanding teacher and mentor.”\r\n\tStudents enjoyed the topic of the class, but many felt that better planning was needed. The workload was described as somewhat unrealistic, especially in the latter part of the class. Many did report feeling a sense of satisfaction upon completing the final radio documentary, and the professor and TAs were described as helpful.", "num_students": 22, "path": "/courses/27208/sections/401/reviews/3923-JOHN-L--JACKSON", "instructor": {"path": "/instructors/3923-JOHN-L--JACKSON", "first_name": "JOHN L.", "last_name": "JACKSON", "id": "3923-JOHN-L--JACKSON", "name": "JOHN L. JACKSON"}, "num_reviewers": 22, "id": "27208-401-3923-JOHN-L--JACKSON"}]}, "credits": null, "primary_alias": "COMM-320", "path": "/courses/27208", "sections": {"path": "/courses/27208/sections", "values": [{"name": "Urban Ethnography: Documenting City Life", "sectionnum": "401", "primary_alias": "COMM-320-401", "path": "/courses/27208/sections/401", "id": "27208-401", "aliases": ["COMM-320-401", "URBS-321-401", "ANTH-320-401"]}]}, "id": 27208, "aliases": ["COMM-320", "URBS-321", "ANTH-320"]}