[{"ratings": {"rAmountLearned": "2.72", "rDifficulty": "2.22", "rStimulateInterest": "2.72", "rRecommendMajor": "3.11", "rCourseQuality": "2.61", "rWorkRequired": "2.67", "rInstructorAccess": "2.24", "rReadingsValue": "1.94", "rRecommendNonMajor": "2.89", "rCommAbility": "3.00", "rInstructorQuality": "2.72"}, "section": {"name": "CLEAN WATER-GREEN CITIES: An ABCS approach to using water science to create a sustainable Phila", "sectionnum": "301", "primary_alias": "ENVS-410-301", "path": "/courses/21643/sections/301", "id": "21643-301", "aliases": ["ENVS-410-301"]}, "comments": "ENVS 410 \"Clean Water - Green Cities\" – An academically-based curriculum service learning approach to using water science and politics to create a sustainable Philadelphia. Students will be expected to conduct field investigations, review scientific data and creating indicator reports, working with stakeholders and presenting the results at an annual symposium. The course will define the current issues of the urban ecosystem and how people move toward managing this system in a sustainable manner. Students will gain an understanding of the dynamic, reciprocal relationship between practices throughout a watershed and its waterfront environments. Topics discussed will include: drinking water quality and protection, green infrastructure, urban impacts of climate change, watershed monitoring and reporting, talking to the public and advocacy groups about environmental issues, and creating implementation strategies for green communities.\r\n\r\nMany students loved this course and its relevance to the real world. They praised the community service project as it allowed students to pursue their own interests; however, several did question the reasonability of it as it was a huge time commitment. One student thought there could have been more guidance for the project, while another thought that lectures were “long and boring.”\r\n\r\nStudents loved Professor Neukrug and his genuine passion and knowledge about water. He had a lot of real world experience that students loved learning about. One of the main complaints, however, was that he was very busy and did not hand back a lot of graded material, preventing students from having any idea what their grades were.\r\n\r\nThe workload was somewhat demanding as it involved a community service project, though many students still praised the class.\r\n", "num_students": 21, "path": "/courses/21643/sections/301/reviews/5345-HOWARD-MARK-NEUKRUG", "instructor": {"path": "/instructors/5345-HOWARD-MARK-NEUKRUG", "first_name": "HOWARD MARK", "last_name": "NEUKRUG", "id": "5345-HOWARD-MARK-NEUKRUG", "name": "HOWARD MARK NEUKRUG"}, "num_reviewers": 18, "id": "21643-301-5345-HOWARD-MARK-NEUKRUG"}]