{"coursehistories": {"path": "/coursehistories/2309"}, "description": "Globalization seems the essence of modernity, but it is not a new phenomena. The world has already witnessed several eras of globalization, each of which transformed and changed the world in often similar but sometime unique fashions. This course will look at continuing trends towards globalization and consider its rich history and the contentious arguments that it has always provoked. Although the focus of the course will be on globalization during the 19th and 20th centuries, we will also consider earlier episodes of globalization, to fully appreciate its evolution and importance. \n\n", "semester": "2011A", "name": "HISTORY OF GLOBALIZATION", "reviews": {"path": "/courses/21851/reviews", "values": [{"ratings": {"rAmountLearned": "2.87", "rDifficulty": "2.00", "rStimulateInterest": "3.20", "rRecommendMajor": "3.53", "rCourseQuality": "2.89", "rWorkRequired": "2.40", "rInstructorAccess": "3.26", "rReadingsValue": "2.60", "rRecommendNonMajor": "3.03", "rCommAbility": "3.45", "rInstructorQuality": "3.18"}, "section": {"name": "HISTORY OF GLOBALIZATION", "sectionnum": "001", "primary_alias": "HIST-130-001", "path": "/courses/21851/sections/001", "id": "21851-001", "aliases": ["HIST-130-001"]}, "comments": "This course will look at continuing trends towards globalization and consider its rich history and the contentious arguments that it has always provoked. The course will focus on globalization during the 19th and 20th centuries, and will also cover earlier episodes of globalization, to fully appreciate its evolution and importance.&#8232;&#8232;&#8232;&#8232;The class focused on the globalization through the different eras and elaborated on the changes and transformation of globalization throughout history. The material was “very interesting”. &#8232;&#8232;&#8232;&#8232;Students described Professor Drew as “awesome” and “passionate”. He was a man with great knowledge and experience. Most students said they learned far more than what he covered in class. Professor Drew was able to give a great introduction to globalization. &#8232;&#8232;&#8232;&#8232;Most of the students thought the class was “rewarding” and “fun”. The class was very “laid-back” and Professor Drew was able to stimulate discussion. There were student presentations due for the class but there were overall positive comments for it. A small number of students thought there was too much reading. &#8232;&#8232;&#8232;This review is based on less than 8 student comments.", "num_students": 44, "path": "/courses/21851/sections/001/reviews/614-JERRY-DREW", "instructor": {"path": "/instructors/614-JERRY-DREW", "first_name": "JERRY", "last_name": "DREW", "id": "614-JERRY-DREW", "name": "JERRY DREW"}, "num_reviewers": 43, "id": "21851-001-614-JERRY-DREW"}]}, "credits": null, "primary_alias": "HIST-130", "path": "/courses/21851", "sections": {"path": "/courses/21851/sections", "values": [{"name": "HISTORY OF GLOBALIZATION", "sectionnum": "001", "primary_alias": "HIST-130-001", "path": "/courses/21851/sections/001", "id": "21851-001", "aliases": ["HIST-130-001"]}]}, "id": 21851, "aliases": ["HIST-130"]}