{"coursehistories": {"path": "/coursehistories/2725"}, "description": "Food satisfies human needs on many levels. Anth 248 explores the importance of food in human experience, starting with the nutritional and ecological aspects of food choice and going on to focus on to the social and ritual significance of foods and feasts. Particular attention will be paid to the way that archaeologists and biological anthropologists find out about food use in the past. Contemporary observations about the central significance of eating as a social activity will be linked to the development of cuisines, economies, and civilizations in ancient times. The course will use lectures, discussions, films, food tastings, and fieldwork to explore the course themes. An optional community service component will be outlined the first week of class. \n\n", "semester": "2008A", "name": "FOOD/FEAST ARCH OF TABLE", "reviews": {"path": "/courses/19751/reviews", "values": [{"ratings": {"rAmountLearned": "2.73", "rDifficulty": "2.50", "rStimulateInterest": "3.19", "rRecommendMajor": "3.38", "rCourseQuality": "3.08", "rWorkRequired": "2.65", "rInstructorAccess": "3.42", "rReadingsValue": "2.65", "rRecommendNonMajor": "2.42", "rCommAbility": "3.38", "rInstructorQuality": "3.42"}, "section": {"name": "FOOD/FEAST ARCH OF TABLE", "sectionnum": "001", "primary_alias": "ANTH-248-001", "path": "/courses/19751/sections/001", "id": "19751-001", "aliases": ["ANTH-248-001"]}, "comments": "Food is an integral component of human existence. Anthropology 248 examines the role that food has played in the development of ancient civilizations. Specifically, this course examines both nutritional and ecological reasons for choosing different types of food as well as the significance of rituals and social gatherings that revolve around food. This course also examines how archaeologists and biological anthropologists study the ancient roots of a culture’s eating habits and food choices. Cross-cultural analyses between the past and present will be used to explore the development of ancient economies, cuisines, and civilizations. Films, food tastings, and fieldwork, as well as traditional lectures and discussions, will be used to reinforce the themes explored in the course. \r\n\r\nOne student mentioned that “tasting food makes the course interactive” and “I really liked the films shown in class.” Another student exclaimed that “the course has been incredibly interesting and exposed me to material and ideas that I never would have encountered.”  A third student mentioned that they “would have liked a more structured syllabus…greater organization of the subject matter.”  \r\n\r\nWith regard to Professor Moore, one student stated that “she is the most energetic and involved instructor I have ever had! She takes an incredible amount of time to help each student.” Another student stated that “Dr. Moore is very enthusiastic about the material and does an excellent job getting students excited about it too.” Similarly, a third student added that the “energy level of [the] professor was always high.”\r\n\r\nOne student believed that “the exam format is not well designed to test the student’s knowledge learned from the class.” Similarly, another student added that “to improve the course, an added amount of structure would help…grading could be more transparent…without an answer key or explanation, it is frustrating to me as a student to be unable to isolate my problem.” A third student felt as though “the journal assignments should be worth more points because writing them takes a lot of time and effort.” Another student believed that it would be beneficial to “warn us [about] what to look for before we do a reading.”\r\n", "num_students": 30, "path": "/courses/19751/sections/001/reviews/1786-KATHERINE-MATTISON-MOORE", "instructor": {"path": "/instructors/1786-KATHERINE-MATTISON-MOORE", "first_name": "KATHERINE MATTISON", "last_name": "MOORE", "id": "1786-KATHERINE-MATTISON-MOORE", "name": "KATHERINE MATTISON MOORE"}, "num_reviewers": 26, "id": "19751-001-1786-KATHERINE-MATTISON-MOORE"}]}, "credits": null, "primary_alias": "ANTH-248", "path": "/courses/19751", "sections": {"path": "/courses/19751/sections", "values": [{"name": "FOOD/FEAST ARCH OF TABLE", "sectionnum": "001", "primary_alias": "ANTH-248-001", "path": "/courses/19751/sections/001", "id": "19751-001", "aliases": ["ANTH-248-001"]}]}, "id": 19751, "aliases": ["ANTH-248"]}