{"coursehistories": {"path": "/coursehistories/925"}, "description": "This course will provide an overview of major figures and themes of modern political thought. We will focus on themes and questions pertinent to political theory in the modern era, particularly focusing on the relationship of the individual to community, society, and state. Although the emergence of the individual as a central moral, political, and conceptual category arguably began in earlier eras, it is in the seventeenth century that it takes firm hold in defining the state, political institutions, moral thinking, and social relations. The centrality of \"the individual\" has created difficulties, even paradoxes, for community and social relations, and political theorists have struggled to reconicle those throughout the modern era. We will consider the political forms that emerged out of those struggles, as well as the changed and distinctly \"modern\" conceptualizations of political theory such as freedom, responsibilty, justice, rights and obligations, as central categories for organizing moral and political life. \n\n", "semester": "2006C", "name": "MODERN POLITICAL THOUGHT", "reviews": {"path": "/courses/9442/reviews", "values": [{"ratings": {"rAmountLearned": "3.69", "rDifficulty": "3.47", "rStimulateInterest": "3.29", "rRecommendMajor": "3.41", "rCourseQuality": "3.65", "rWorkRequired": "3.53", "rInstructorAccess": "3.71", "rReadingsValue": "3.47", "rRecommendNonMajor": "2.76", "rCommAbility": "3.76", "rInstructorQuality": "4.00"}, "section": {"name": "MODERN POLITICAL THOUGHT", "sectionnum": "601", "primary_alias": "PSCI-181-601", "path": "/courses/9442/sections/601", "id": "9442-601", "aliases": ["PSCI-181-601"]}, "comments": "Students almost unanimously proclaimed this class to be an extraordinary educational experience, with numerous students stating that if “you really want to learn the material, take this course.”  Evaluations consistently said Dr. Weintraub truly cares about the students’ progression in the course and that he gives lots of feedback on all assignments.  Students did caution that classes generally run anywhere from 10 to 30 minutes over their designated time slot, although some students used this point to illustrate how much Dr. Weintraub cares about the material and the students’ understanding of it.", "num_students": 18, "path": "/courses/9442/sections/601/reviews/3160-JEFF-A-WEINTRAUB", "instructor": {"path": "/instructors/3160-JEFF-A-WEINTRAUB", "first_name": "JEFF A", "last_name": "WEINTRAUB", "id": "3160-JEFF-A-WEINTRAUB", "name": "JEFF A WEINTRAUB"}, "num_reviewers": 17, "id": "9442-601-3160-JEFF-A-WEINTRAUB"}]}, "credits": null, "primary_alias": "PSCI-181", "path": "/courses/9442", "sections": {"path": "/courses/9442/sections", "values": [{"name": "MODERN POLITICAL THOUGHT", "sectionnum": "601", "primary_alias": "PSCI-181-601", "path": "/courses/9442/sections/601", "id": "9442-601", "aliases": ["PSCI-181-601"]}]}, "id": 9442, "aliases": ["PSCI-181"]}