[{"ratings": {"rAmountLearned": "2.92", "rDifficulty": "2.48", "rStimulateInterest": "3.31", "rRecommendMajor": "3.61", "rCourseQuality": "3.14", "rWorkRequired": "2.57", "rInstructorAccess": "3.19", "rReadingsValue": "2.72", "rRecommendNonMajor": "3.00", "rCommAbility": "3.54", "rInstructorQuality": "3.42"}, "section": {"name": "THE AMERICAN SOUTH", "sectionnum": "401", "primary_alias": "HIST-170-401", "path": "/courses/17502/sections/401", "id": "17502-401", "aliases": ["HIST-170-401", "AFRC-172-401"]}, "comments": "This course explores the history of the American South, from its formation and rise as a slave power in the Atlantic world in the seventeenth century, to the definitive defeat of the slaveholders' republic in the American Civil War. This course covers topics from the Atlantic slave trade; the emergence of slavery, the plantation system and the racial order associated with it; the development of African-American life under slavery; the particular relationship between masters and slaves in the antebellum period; the changing gender and class relations of southern society; the defense of slavery; and the unpredictable political road to secession. The course ends by focusing on the Confederate political project and its undoing in the course of the nation's bloodiest war.&#8232;\r\n\r\nOverall students enjoyed this “interesting” class that they said helped them gain a better understanding of slavery in America. “I have never been so interested in learning about history,” said one student. The class was very well received, but several students complained that there was too much reading assigned each week and especially felt that during weeks with midterms or papers, the reading should be cut back. &#8232;\r\n\r\nStudents raved about Professor McCurry saying she was “one of the most brilliant individuals I have ever met, and it was truly an honor to take this class.” They appreciated her in-depth knowledge of the subject matter and her helpfulness during office hours, but they did recommend that she work to make her PowerPoint slides more helpful. &#8232;\r\n\r\nThis course fulfills a cultural diversity requirement. It is recommended for anyone with an interest in American History. \r\n", "num_students": 77, "path": "/courses/17502/sections/401/reviews/2177-STEPHANIE-MCCURRY", "instructor": {"path": "/instructors/2177-STEPHANIE-MCCURRY", "first_name": "STEPHANIE", "last_name": "MCCURRY", "id": "2177-STEPHANIE-MCCURRY", "name": "STEPHANIE MCCURRY"}, "num_reviewers": 65, "id": "17502-401-2177-STEPHANIE-MCCURRY"}]