{"coursehistories": {"path": "/coursehistories/256"}, "description": "A basic laboratory course in which both the theoretical and practical aspects of a variety of organic reactions and multistep syntheses are emphasized. Modern chromatographic, instrumental, and spectroscopic techniques are applied to experimental organic chemistry. Course should be taken concurrently with CHEM 242 or in the semester immediately following. For safety reasons students will not be permitted to wear contact lenses in the laboratory. \n\nPLEASE NOTE THE FOLLOWING: For the Summer and LPS offering of CHEM 245, it is a 2-semester course. Part 1 is taken in the first term for 0.0 CU and then Part 2 is taken in the second term immediately following the first for 1.0 CU. \n\n", "semester": "2008A", "name": "LECTURE", "reviews": {"path": "/courses/19888/reviews", "values": [{"ratings": {"rAmountLearned": "3.14", "rDifficulty": "3.42", "rStimulateInterest": "2.88", "rRecommendMajor": "2.96", "rCourseQuality": "2.72", "rWorkRequired": "3.87", "rInstructorAccess": "3.34", "rReadingsValue": "3.05", "rRecommendNonMajor": "0.81", "rCommAbility": "3.26", "rInstructorQuality": "3.29"}, "section": {"name": "LECTURE", "sectionnum": "001", "primary_alias": "CHEM-245-001", "path": "/courses/19888/sections/001", "id": "19888-001", "aliases": ["CHEM-245-001"]}, "comments": "Experimental Organic Chemistry I is a basic laboratory course in which both the theoretical and practical aspects of a variety of organic reactions and multi-step syntheses are emphasized. The class applies modern chromatographic, instrumental, and spectroscopic techniques to experimental organic chemistry, according to the course description. The course should be taken concurrently with Chem 242, or in the semester immediately following.  An additional prerequisite for the course is Chem 241.  \r\n\r\nMany of the students in the course were upperclassmen, and most took it as part of the premed and major requirement. As for the TAs, most students felt that they were very helpful and knowledgeable.  Students were also pleased with Professor Mallory, describing her as “awesome,” and “excellent.”  As one student commented, “Dr. Mallory led a very interesting, educational lab course.”\r\n\r\nSome students found the course to be very work-intensive. Many complaints centered on the lab reports, which required what some thought an excessive amount of writing.  One student described them as “painful.”  However, students believed that they had learned a considerable amount from the lab experience.  The lab fee for the course was $300.\r\n", "num_students": 115, "path": "/courses/19888/sections/001/reviews/239-CLELIA-W-MALLORY", "instructor": {"path": "/instructors/239-CLELIA-W-MALLORY", "first_name": "CLELIA W", "last_name": "MALLORY", "id": "239-CLELIA-W-MALLORY", "name": "CLELIA W MALLORY"}, "num_reviewers": 112, "id": "19888-001-239-CLELIA-W-MALLORY"}]}, "credits": null, "primary_alias": "CHEM-245", "path": "/courses/19888", "sections": {"path": "/courses/19888/sections", "values": [{"name": "LECTURE", "sectionnum": "001", "primary_alias": "CHEM-245-001", "path": "/courses/19888/sections/001", "id": "19888-001", "aliases": ["CHEM-245-001"]}]}, "id": 19888, "aliases": ["CHEM-245"]}