[{"ratings": {"rAmountLearned": "2.36", "rDifficulty": "2.57", "rStimulateInterest": "2.07", "rRecommendMajor": "2.93", "rCourseQuality": "2.21", "rWorkRequired": "2.71", "rInstructorAccess": "3.79", "rReadingsValue": "1.86", "rRecommendNonMajor": "2.29", "rCommAbility": "2.50", "rInstructorQuality": "2.64"}, "section": {"name": "OBSERVATIONAL ASTRONOMY", "sectionnum": "001", "primary_alias": "ASTR-150-001", "path": "/courses/25646/sections/001", "id": "25646-001", "aliases": ["ASTR-150-001"]}, "comments": "This course covers reading star-maps, finding objects in the night sky, learning about astronomical phenomena as we observe them, telescope training, planets and stars, the nature of light, and signal processing. The class meets for an hour of lecture twice a week, plus a three hour evening lab in smaller groups. Attendance at one lab session per week is required by each student - multiple times are scheduled due to the uncertainty and unpredictability of weather conditions for observing. The course requires substantial out-of-class time dedication and commitment to sharing work in small groups. This is an observing-based astronomy course of non-science majors. This course fulfills the Physical World sector.\r\n\r\nStudents found this to be an interesting course with \"international appeal.\" One student claimed that the course \"changed the way I perceive the world around me.\" The lectures seemed to cover the \"big picture,\" whereas the laboratory component was more specific and involved quantitative calculations. One student reported that students should have been informed beforehand that this course is rather \"math and computer based.\"\r\n\r\nStudents liked Professor Aguirre, saying that he did a \"good job\" in tailoring this new class to the students.\r\n\r\nThis course is intended for non-science majors. This review is based on the four submitted student comments.\r\n", "num_students": 17, "path": "/courses/25646/sections/001/reviews/4249-JAMES-ERIK-AGUIRRE", "instructor": {"path": "/instructors/4249-JAMES-ERIK-AGUIRRE", "first_name": "JAMES ERIK", "last_name": "AGUIRRE", "id": "4249-JAMES-ERIK-AGUIRRE", "name": "JAMES ERIK AGUIRRE"}, "num_reviewers": 15, "id": "25646-001-4249-JAMES-ERIK-AGUIRRE"}]