[{"ratings": {"rAmountLearned": "1.46", "rDifficulty": "3.19", "rStimulateInterest": "1.41", "rRecommendMajor": "2.19", "rCourseQuality": "1.29", "rWorkRequired": "3.65", "rInstructorAccess": "1.68", "rReadingsValue": "1.55", "rRecommendNonMajor": "0.32", "rCommAbility": "1.24", "rInstructorQuality": "1.61"}, "section": {"name": "LECTURE", "sectionnum": "001", "primary_alias": "MEAM-347-001", "path": "/courses/17672/sections/001", "id": "17672-001", "aliases": ["MEAM-347-001"]}, "comments": "This is a junior level laboratory course. The course teaches the principles of design and measurement systems including basic electromechanical systems. It follows MEAM 302 and MEAM 321 including experiments in fluid mechanics, and vibration in the design of mechanical systems.\r\n\r\nThis course was very frustrating and confusing to students, both in terms of course material and logisitics. Though the course made an effort to “move the focus of design away from guess-and-check hacking and towards true engineering.” Some labs were “too one-dimensional to stimulate any real enthusiasm,” and students were frequently reprimanded for lacking components of their lab write-ups that they were never instructed to do.\r\n\r\nDr. Yim, though accessible and eager to help, often came off as condescending and indecisive to students. He also often changed his expectations for the lab assignments last-minute or even after the labs were completed. Lab sections were frequently unstaffed by professors or TAs, adding to students’ frustrations. The teaching staff (Dr. Yim and the TAs) were generally described as “disorganized.”\r\n\r\nThis course was not curved, which made periodic quizzes and ‘checkpoints’ especially frustrating to students, because they served primarily as penalties. The labs were not spread out properly, with several quick labs at the beginning of the semester and one very drawn out one for the last half of the semester. Students appreciated the opportunity for rewrites/regrades.\r\n", "num_students": 46, "path": "/courses/17672/sections/001/reviews/3053-MARK-YIM", "instructor": {"path": "/instructors/3053-MARK-YIM", "first_name": "MARK", "last_name": "YIM", "id": "3053-MARK-YIM", "name": "MARK YIM"}, "num_reviewers": 42, "id": "17672-001-3053-MARK-YIM"}]