{"coursehistories": {"path": "/coursehistories/1995"}, "description": "This course encourages students to analyze the problems of managing the total enterprise in the domestic and international setting. The focus is on the competitive strategy of the firm, examining issues central to its long- and short-term competitive position. Students act in the roles of key decision-makers or their advisors and solve problems related to the development or maintenance of the competitive advantage of the firm in a given market. The first module of the course develops an understanding of key strategic frameworks using theoretical readings and case-based discussions. Students will learn concepts and tools for analyzing the competitive environment, strategic position and firm-specific capabilities in order to understand the sources of a firm's competitive advantage. In addition, students will address corporate strategy issues such as the economic logic and administrative challenges associated with diversification choices about horizontal and vertical integration. The second module will be conducted as a multi-session, computer-based simulation in which students will have the opportunity to apply the concepts and tools from module 1 to make strategic decisions. \n\nThe goal of the course is for students to develop an analytical tool kit for understanding strategic issues and to enrich their appreciation for the thoughtprocesses essential to incisive strategic analysis. This course offers students the opportunity to develop a general management perspective by combining their knowledge of specific functional areas with an appreciation forthe requirements posed by the need to integrate all functions into a coherent whole. Students will develop skills in structuring and solving complex business problems. \n\n", "semester": "2009C", "name": "BUSINESS POLICY", "reviews": {"path": "/courses/17688/reviews", "values": [{"ratings": {"rAmountLearned": "2.92", "rDifficulty": "2.19", "rStimulateInterest": "3.31", "rRecommendMajor": "3.35", "rCourseQuality": "3.10", "rWorkRequired": "2.54", "rInstructorAccess": "3.65", "rReadingsValue": "2.81", "rRecommendNonMajor": "2.88", "rCommAbility": "3.38", "rInstructorQuality": "3.50"}, "section": {"name": "BUSINESS POLICY", "sectionnum": "001", "primary_alias": "MGMT-223-001", "path": "/courses/17688/sections/001", "id": "17688-001", "aliases": ["MGMT-223-001"]}, "comments": "", "num_students": 33, "path": "/courses/17688/sections/001/reviews/4884-OLIVIER-CHATAIN", "instructor": {"path": "/instructors/4884-OLIVIER-CHATAIN", "first_name": "OLIVIER", "last_name": "CHATAIN", "id": "4884-OLIVIER-CHATAIN", "name": "OLIVIER CHATAIN"}, "num_reviewers": 31, "id": "17688-001-4884-OLIVIER-CHATAIN"}]}, "credits": null, "primary_alias": "MGMT-223", "path": "/courses/17688", "sections": {"path": "/courses/17688/sections", "values": [{"name": "BUSINESS POLICY", "sectionnum": "001", "primary_alias": "MGMT-223-001", "path": "/courses/17688/sections/001", "id": "17688-001", "aliases": ["MGMT-223-001"]}]}, "id": 17688, "aliases": ["MGMT-223"]}