[{"ratings": {"rAmountLearned": "3.61", "rDifficulty": "3.05", "rStimulateInterest": "3.74", "rRecommendMajor": "3.85", "rCourseQuality": "3.63", "rWorkRequired": "2.56", "rInstructorAccess": "3.10", "rReadingsValue": "2.86", "rRecommendNonMajor": "3.47", "rCommAbility": "3.82", "rInstructorQuality": "3.80"}, "section": {"name": "VENT CAP & FNCE INNOVAT", "sectionnum": "001", "primary_alias": "FNCE-750-001", "path": "/courses/27447/sections/001", "id": "27447-001", "aliases": ["FNCE-750-001"]}, "comments": "", "num_students": 82, "path": "/courses/27447/sections/001/reviews/2764-DAVID-WESSELS", "instructor": {"path": "/instructors/2764-DAVID-WESSELS", "first_name": "DAVID", "last_name": "WESSELS", "id": "2764-DAVID-WESSELS", "name": "DAVID WESSELS"}, "num_reviewers": 77, "id": "27447-001-2764-DAVID-WESSELS"}, {"ratings": {"rAmountLearned": "3.36", "rDifficulty": "2.98", "rStimulateInterest": "3.67", "rRecommendMajor": "3.79", "rCourseQuality": "3.46", "rWorkRequired": "2.38", "rInstructorAccess": "3.13", "rReadingsValue": "2.84", "rRecommendNonMajor": "3.26", "rCommAbility": "3.67", "rInstructorQuality": "3.76"}, "section": {"name": "VENT CAP & FNCE INNOVAT", "sectionnum": "002", "primary_alias": "FNCE-750-002", "path": "/courses/27447/sections/002", "id": "27447-002", "aliases": ["FNCE-750-002"]}, "comments": "Venture Capital and the Finance of Innovation explores the finance of technological innovation, with a focus on the valuation tools useful in the venture capital industry. These tools include the \"venture capital method,\" comparables analysis, discounted cash flow analysis, contingent-claims analysis, and real options. \r\n\r\n\tOverall, students described this course as “excellent.” Multiple students claimed that this was the “best course” at Wharton. This was mainly due to the “interesting” course content and “great” presentation of material. Students reported that they learned a lot from this course, including “insightful perspective on valuation, derivatives, incentives and contracts in general.” While a few students commented that FNCE 750 was “too financed focused,” they admitted that the professor warned them of this on the first day of class. Additionally, multiple students said that the third section of the course was “difficult” and “rushed.” Nevertheless, students found this class extremely enjoyable. \r\n\r\n\tThe vast majority of students had nothing but high regards for Professor Wessels. Many said that he was “one of the best professors at Wharton.” They described him as “engaging,” “fantastic,” and “passionate.” Students appreciated his ability to “bring concepts together” and teach students “how companies are successful.” They praised his ability to communicate the course material in a “comprehensive way” and “stimulate” students interest. However, a few students commented that Professor Wessels rushed through some of the course material “too quickly,” which resulted in students “getting a little lost.” Nevertheless, most students found Professor Wessels “accessible outside the classroom,” and invested in his students.\r\n\r\n\tFNCE 750 comes highly recommended to “anyone interested in investing, venture capital, and entrepreneurship.” It was described as “one of the best classes as Wharton” due to the interesting material and professor. The primary audience for FNCE 750 is finance majors interested in careers in venture capital or in R&D-intensive companies in health care or information technology. Prerequisites include: FNCE 601 and FNCE 602 (FNCE 602 may be taken concurrently).\r\n", "num_students": 80, "path": "/courses/27447/sections/002/reviews/2764-DAVID-WESSELS", "instructor": {"path": "/instructors/2764-DAVID-WESSELS", "first_name": "DAVID", "last_name": "WESSELS", "id": "2764-DAVID-WESSELS", "name": "DAVID WESSELS"}, "num_reviewers": 76, "id": "27447-002-2764-DAVID-WESSELS"}, {"ratings": {"rAmountLearned": "3.42", "rDifficulty": "2.79", "rStimulateInterest": "3.84", "rRecommendMajor": "3.76", "rCourseQuality": "3.65", "rWorkRequired": "2.04", "rInstructorAccess": "3.52", "rReadingsValue": "3.08", "rRecommendNonMajor": "3.36", "rCommAbility": "3.84", "rInstructorQuality": "3.77"}, "section": {"name": "VENT CAP & FNCE INNOVAT", "sectionnum": "751", "primary_alias": "FNCE-750-751", "path": "/courses/27447/sections/751", "id": "27447-751", "aliases": ["FNCE-750-751"]}, "comments": "The focus of FNCE 750 is on buying (or acquiring controlling stakes in) firms. The main topics to be covered are mergers and friendly acquisitions, hostile takeovers and buyouts. Using case studies, the course surveys the drivers of success in the transactions. While issues regarding motive and strategy will be discussed, financial theory would be the main lens used to view these control acquiring transactions. This will allow students to (1) evaluate transactions through valuation approaches and (2) structure deals employing financial innovation as a response to legal framework and economic frictions.\r\n\r\nStudents commented that the Professor Wessels “has built a uniquely insightful curriculum around his insightful research. The course covers “all necessary fundamentals around venture financing.” A minority of students felt that the class was “rushed,” though many students wished that the course had lasted longer simply because the material was so “amazing.”\r\n\r\nStudents praised Professor Wessels, and many commented that he had “unparalleled teaching ability, energy, and humor.” Along with this sentiment, multiple students said Professor Wessels was “undoubtedly one of the best professors at the Wharton School.”\r\n\r\nOverall, students found this course to be “fantastic” and “fast-paced.” The final exam is 100% of the grade. FNCE 750 should be of interest to students interested in pursuing careers as private equity investors, advisors in investment banking and corporate managers that deal with these issues. This course assumes familiarity with valuation analysis. During the spring semester students are not permitted to take this course pass/fail. The course prerequisites include FNCE 611 or 612; FNCE 613; FNCE 726 or FNCE 728 may be taken concurrently.\r\n", "num_students": 51, "path": "/courses/27447/sections/751/reviews/2764-DAVID-WESSELS", "instructor": {"path": "/instructors/2764-DAVID-WESSELS", "first_name": "DAVID", "last_name": "WESSELS", "id": "2764-DAVID-WESSELS", "name": "DAVID WESSELS"}, "num_reviewers": 27, "id": "27447-751-2764-DAVID-WESSELS"}]