{"coursehistories": {"path": "/coursehistories/2769"}, "description": "Public space as a communicative arena. Historical aspects, varieties of public space, public space as a cultural signifier, how public space facilitates or hinders common life, public space as a component of democracy. \n\n", "semester": "2009A", "name": "PUBLIC SPACE,PUBLIC LIFE", "reviews": {"path": "/courses/15539/reviews", "values": [{"ratings": {"rAmountLearned": "2.52", "rDifficulty": "2.43", "rStimulateInterest": "2.14", "rRecommendMajor": "2.38", "rCourseQuality": "2.27", "rWorkRequired": "3.10", "rInstructorAccess": "2.52", "rReadingsValue": "2.19", "rRecommendNonMajor": "1.76", "rCommAbility": "2.52", "rInstructorQuality": "2.32"}, "section": {"name": "PUBLIC SPACE,PUBLIC LIFE", "sectionnum": "001", "primary_alias": "COMM-300-001", "path": "/courses/15539/sections/001", "id": "15539-001", "aliases": ["COMM-300-001"]}, "comments": "Public space is a comprehensive context for human interaction and communication at all scales – from great moments in history to subtle and routine daily events. It is the intersection of the individual life and the communal life, where societies express their character. Public space is the physical medium that we all share. It is a rich environment that gives relevance to our common understanding and to our memory of what takes place and what we say to each other - a physical reference for the action of life. This course will survey and discuss the scope of public space, with the objective of finding its definition\r\n\r\nOverall, students felt that the course was interesting and liked that it offered something different from the other communications courses. One student called it “an introduction to a new way of thinking” and another liked that it “crossed into many areas of study like art history and psychology” and “challenged you to think outside the box.” While most people saw the slightly different perspective as a benefit, some thought that it focused too much on urban studies instead of communication.\r\n\r\nProfessor Kelley was considered by some to be \"opinionated\" and spent too much of the lecture time talking rather than having class discussions. Other however felt he \"kept the class interesting\" and was very intelligent and thoughtful with “an excellent attitude and good goals for the class.”\r\n\r\nStudents felt that the amount of work was overwhelming at times and the journal was hard to keep up with. You need to watch movies, go downtown, do papers and keep a journal for the course.", "num_students": 23, "path": "/courses/15539/sections/001/reviews/2900-DANIEL-KELLEY", "instructor": {"path": "/instructors/2900-DANIEL-KELLEY", "first_name": "DANIEL", "last_name": "KELLEY", "id": "2900-DANIEL-KELLEY", "name": "DANIEL KELLEY"}, "num_reviewers": 22, "id": "15539-001-2900-DANIEL-KELLEY"}]}, "credits": null, "primary_alias": "COMM-300", "path": "/courses/15539", "sections": {"path": "/courses/15539/sections", "values": [{"name": "PUBLIC SPACE,PUBLIC LIFE", "sectionnum": "001", "primary_alias": "COMM-300-001", "path": "/courses/15539/sections/001", "id": "15539-001", "aliases": ["COMM-300-001"]}]}, "id": 15539, "aliases": ["COMM-300"]}