{"coursehistories": {"path": "/coursehistories/5077"}, "description": "This course provides an introduction to the quantitative methods used in characterizing and engineering biomolecular properties and cellular behavior, focusing primarily on receptor-mediated phenomena. The thermodynamics and kinetics of protein/ligand binding are covered, with an emphasis on experimental techniques for measuring molecular parameters such as equilibrium affinities, kinetic rate constants, and diffusion coefficients. Approaches for probing and altering these molecular properties of proteins are also described, including site-directed mutagenesis, directed evolution, rational design, and covalent modification. Equilibrium, kinetic, and transport models are used to elucidate the relationships between the aforementioned molecular parameters and cellular processes such as ligand/receptor binding and trafficking, cell adhesion and motility, signal transduction, and gene regulation. \n\n", "semester": "2011C", "name": "BIOMOLEC & CELLULAR ENG", "reviews": {"path": "/courses/24040/reviews", "values": [{"ratings": {"rAmountLearned": "3.26", "rDifficulty": "3.65", "rStimulateInterest": "2.91", "rRecommendMajor": "2.96", "rCourseQuality": "3.09", "rWorkRequired": "3.04", "rInstructorAccess": "3.13", "rReadingsValue": "2.70", "rRecommendNonMajor": "1.04", "rCommAbility": "3.30", "rInstructorQuality": "3.13"}, "section": {"name": "BIOMOLEC & CELLULAR ENG", "sectionnum": "401", "primary_alias": "BE-540-401", "path": "/courses/24040/sections/401", "id": "24040-401", "aliases": ["BE-540-401", "CBE-540-401"]}, "comments": "This course introduces the quantitative methods used in characterizing and\r\nengineering biomolecular properties and cellular behavior, focusing primarily on\r\nreceptor-mediated phenomena. The thermodynamics and kinetics of protein/ligand\r\nbinding are covered, with an emphasis on experimental techniques for measuring\r\nmolecular parameters such as equilibrium affinities, kinetic rate constants, and diffusion\r\ncoefficients. Approaches for probing and altering these molecular properties of proteins\r\nare also described, including site-directed mutagenesis, directed evolution, rational\r\ndesign, and covalent modification. Equilibrium, kinetic, and transport models are used to\r\nelucidate the relationships between the aforementioned molecular parameters and cellular\r\nprocesses such as ligand/receptor binding and trafficking, cell adhesion and motility,\r\nsignal transduction, and gene regulation.\r\nStudents felt that lectures went fast and you had to make an effort to keep with the\r\npace of the class. As a student puts it, “You learn a lot, but you are expected to pay close\r\nattention in lecture and work hard.” Students reported learning a lot of material in the\r\ncourse. A student reported, “The heavy emphasis on biomolecular interactions in the first\r\npart of the course provided an excellent foundation for the rest of the course.” Students\r\nalso enjoyed the “good integration of papers into what we were learning and connecting\r\nthe course from start to finish.” Another student comments about the pace of the course,\r\n“The course builds well, had a good number of problem sets and outside-of-class work\r\n(not too much/little) and fair exams.”\r\nSakar was commended on being a “very good professor.” Students enjoyed the\r\nformat of the class where you are “able to get student participation & have some\r\ndiscussion about the topics to help us understand them.” Students wished there were\r\nmore classes at Penn that taught as much as this class.\r\nThis class is meant for graduate students in Bioengineering. Advanced\r\nundergraduate students also could take it, but most stated it was very difficult and\r\nexperience in chemical engineering was basically necessary. Students felt that this class\r\nwas very difficult but rewarding. Students wished that more class time were dedicated to\r\nproblem solving, as the problem sets were very difficult on material that went beyond\r\nwhat was taught in class. Students thought the exams were tough but fair, “exams were\r\nkind of on long side, but questions themselves were fair.”\r\nThis review is based on the 7 student reviews that were submitted.", "num_students": 26, "path": "/courses/24040/sections/401/reviews/2871-CASIM-A--SARKAR", "instructor": {"path": "/instructors/2871-CASIM-A--SARKAR", "first_name": "CASIM A.", "last_name": "SARKAR", "id": "2871-CASIM-A--SARKAR", "name": "CASIM A. SARKAR"}, "num_reviewers": 24, "id": "24040-401-2871-CASIM-A--SARKAR"}]}, "credits": null, "primary_alias": "BE-540", "path": "/courses/24040", "sections": {"path": "/courses/24040/sections", "values": [{"name": "BIOMOLEC & CELLULAR ENG", "sectionnum": "401", "primary_alias": "BE-540-401", "path": "/courses/24040/sections/401", "id": "24040-401", "aliases": ["BE-540-401", "CBE-540-401"]}]}, "id": 24040, "aliases": ["BE-540", "CBE-540"]}