{"coursehistories": {"path": "/coursehistories/2199"}, "description": "This course is based upon the premise that popular culture is a legitimate object of study in today's universities, and that through the careful study of objects of Japanese popular culture such as anime (animated films), manga (comic books), films, short stories and popular music, each one of us will be able to write short histories of various aspects of contemporary Japan. In order to further our individual historiographical projects, we will learn some theoretical methods for studying and writing about the relation between our everyday lives, the processes of globalization, and the pleasure or displeasure that we derive from the objects of popular culture. Through the study of Japanese popular culture, we will learn to analyze critically some of the functions of these objects as sources of meaning, escape, and identity formation in our everyday lives. \n\nThe topics we will study include the fiction of Banana Yoshimoto, such anime and manga as Akira, Barefoot Gen, Grave of the Fireflies and Miyazaki's Nausicaa, popular music, TV dramas, and the Pop Art of Yoshitomo Nara. The Institute of Contemporary Art's exhibition, \"Yoshitomo Nara: Nothing Ever Happens\" will provide us with an excellent opportunity to consider Nara's challenging and often controversial work in the context of contemporary social issues in Japan. \n\nThe course will advantages and disadvantages, symmetries and asymmetries of the Korean business firms in the international business arena. Those to be discussed in the course with particular significance will include the issues of Asian values and business, Chaebols and the economy, and the relationship between government and business. \n\n", "semester": "2004A", "name": "JAPANESE POP CULTURE", "reviews": {"path": "/courses/6095/reviews", "values": [{"ratings": {"rAmountLearned": "2.78", "rDifficulty": "1.59", "rStimulateInterest": "3.00", "rRecommendMajor": "3.44", "rCourseQuality": "3.11", "rWorkRequired": "2.00", "rInstructorAccess": "3.59", "rReadingsValue": "3.04", "rRecommendNonMajor": "3.44", "rCommAbility": "3.26", "rInstructorQuality": "3.30"}, "section": {"name": "JAPANESE POP CULTURE", "sectionnum": "601", "primary_alias": "AMES-389-601", "path": "/courses/6095/sections/601", "id": "6095-601", "aliases": ["AMES-389-601", "SOCI-389-601"]}, "comments": "", "num_students": 32, "path": "/courses/6095/sections/601/reviews/2043-LEWIS-E-HARRINGTON", "instructor": {"path": "/instructors/2043-LEWIS-E-HARRINGTON", "first_name": "LEWIS E", "last_name": "HARRINGTON", "id": "2043-LEWIS-E-HARRINGTON", "name": "LEWIS E HARRINGTON"}, "num_reviewers": 27, "id": "6095-601-2043-LEWIS-E-HARRINGTON"}]}, "credits": null, "primary_alias": "AMES-389", "path": "/courses/6095", "sections": {"path": "/courses/6095/sections", "values": [{"name": "JAPANESE POP CULTURE", "sectionnum": "601", "primary_alias": "AMES-389-601", "path": "/courses/6095/sections/601", "id": "6095-601", "aliases": ["AMES-389-601", "SOCI-389-601"]}]}, "id": 6095, "aliases": ["AMES-389", "SOCI-389"]}