[{"ratings": {"rAmountLearned": "2.64", "rDifficulty": "2.72", "rStimulateInterest": "2.76", "rRecommendMajor": "3.00", "rCourseQuality": "2.69", "rWorkRequired": "2.24", "rInstructorAccess": "2.62", "rReadingsValue": "2.29", "rRecommendNonMajor": "1.46", "rCommAbility": "3.07", "rInstructorQuality": "2.90"}, "section": {"name": "FUNDAMENTALS OF BIOTECH", "sectionnum": "001", "primary_alias": "CBE-150-001", "path": "/courses/22748/sections/001", "id": "22748-001", "aliases": ["CBE-150-001"]}, "comments": "This course aims to define and explore biotechnology and examine ways in which chemical engineers can contribute to the field. The principles of cell biology, biochemistry, and molecular biology are summarized from an engineering perspective, and examples of biologically based molecular technologies and industrial biochemical processes are presented. Grades are determined from two midterm exams, one final exam, homework, and a term project.\r\n\r\nThis course was generally regarded as “very informative and useful for many engineers.” One student remarked that “this course gave me the confidence that I was in the correct major here at Penn (Chemical and Biomolecular Engineering).”\r\n\r\nStudents enjoyed attending lectures, mainly because of Professor Hammer. He was praised for being humorous and “portraying the information well in lecture,” and many also regarded him as “an excellent professor who makes the material easier to understand and asks thought-provoking questions.”\r\n\r\nOpinions about the difficulty of the problem sets ranged from “not very challenging” to “difficult because it seems like not a lot of what we go over in class is reflected in the problem sets.” Students generally found this to be a good foundation course for chemistry or chemical engineering. This course has no prerequisites and is recommended for students interested in biotechnology, especially CBE and BE majors and minors.\r\n", "num_students": 31, "path": "/courses/22748/sections/001/reviews/160-DANIEL-A--HAMMER", "instructor": {"path": "/instructors/160-DANIEL-A--HAMMER", "first_name": "DANIEL A.", "last_name": "HAMMER", "id": "160-DANIEL-A--HAMMER", "name": "DANIEL A. HAMMER"}, "num_reviewers": 30, "id": "22748-001-160-DANIEL-A--HAMMER"}]