{"coursehistories": {"path": "/coursehistories/2516"}, "description": "Theories of various industrial organizational structures and problems are developed, including monopoly, oligopoly, nonlinear pricing and price discrimination. These theories are used to model various industries, antitrust cases, and regulatory issues. \n\n", "semester": "2010C", "name": "INDUSTRIAL ORGANIZATION", "reviews": {"path": "/courses/22934/reviews", "values": [{"ratings": {"rAmountLearned": "2.04", "rDifficulty": "3.25", "rStimulateInterest": "1.58", "rRecommendMajor": "2.08", "rCourseQuality": "1.67", "rWorkRequired": "3.25", "rInstructorAccess": "2.83", "rReadingsValue": "1.67", "rRecommendNonMajor": "0.79", "rCommAbility": "1.75", "rInstructorQuality": "1.93"}, "section": {"name": "INDUSTRIAL ORGANIZATION", "sectionnum": "001", "primary_alias": "ECON-235-001", "path": "/courses/22934/sections/001", "id": "22934-001", "aliases": ["ECON-235-001"]}, "comments": "In this course, theories of various industrial organizational structures and problems are developed, including monopoly, oligopoly, nonlinear pricing and price discrimination. These theories are used to model various industries, antitrust cases, and regulatory issues.\r\n\r\nStudents described the course as “dry” and “boring”. The structure of the class, which consisted of the professor writing an equation on the board and solving it, was deemed unhelpful and “hard to understand”. Several students noted that part of the problem was that there was too much material that the course tried to cover and that it became “rushed” and “constrained.” \r\n\r\nStudents found Professor Tang to be flexible with office hours and very patient. However, many did not enjoy his teaching style. They wished he would explain and analyze equations more and that he was not so rushed in his lectures. Some found that he did not respond to emails in a timely manner. Some students also found the equations he wrote on the board to be “illegible.” \r\n\r\nMany students were not happy with the course. They found that the T.As and the professor had different approaches to problems, which led to confusion. One student remarked that since the homework took so long, advance notice would have been “appreciated.” One student complained that the “lack of a capable TA,” “recitations” and “exercise sessions” increased the difficulty of the class unnecessarily. \r\n\r\nThis course is recommended for Econ Majors. Its prerequisites include: ECON 101; MATH 104 and MATH 114 or MATH 115. ECON 103 is recommended. Credit cannot be received for both ECON 035 and 235. In addition, the LPS 200-level course, when offered, will not count for Economics Majors unless the student is officially registered as an LPS student.\r\n", "num_students": 30, "path": "/courses/22934/sections/001/reviews/4299-XUN-TANG", "instructor": {"path": "/instructors/4299-XUN-TANG", "first_name": "XUN", "last_name": "TANG", "id": "4299-XUN-TANG", "name": "XUN TANG"}, "num_reviewers": 28, "id": "22934-001-4299-XUN-TANG"}]}, "credits": null, "primary_alias": "ECON-235", "path": "/courses/22934", "sections": {"path": "/courses/22934/sections", "values": [{"name": "INDUSTRIAL ORGANIZATION", "sectionnum": "001", "primary_alias": "ECON-235-001", "path": "/courses/22934/sections/001", "id": "22934-001", "aliases": ["ECON-235-001"]}]}, "id": 22934, "aliases": ["ECON-235"]}