{"coursehistories": {"path": "/coursehistories/4222"}, "description": "This course introduces the major intellectual developments and problems within Japan's history. Special attention will be given to explaining why and how Japanese thinkers only selectively absorbed Chinese thinking during Japan's first \"opening\" to outside influence and then later tried again to be selective when engaged with the West. Japanese thinkers' differing way of understanding and utilizing Buddhism, Confucianism, Daoism, Christianity, and European philosophy will be considered. So too, however, will be what are usually taken to be \"native\" patterns of thought--viz. Shinto, The National Learning School, and what came to be called \"the Code of the Warrior.\" Surfacing at various points in this course will be questions that could be addressed to any nation or people and their intellectual history--viz. What does it mean for anyone to claim there might be \"indigenous\" modes of thought and appreciation? Can thought and philosophy get free of being suspect as ways for the expression of nationalism in its various forms? What are some of the practical consequences in and for a society, especially in our \"globalized\" world, when its intellectual trajectory differs from that of the \"West\" and important contemporary thinkers within wish to retain that divergence? Because of its double and deep interaction with two \"alien\" \n\nthought modes--that of China and that of the modern West--Japan provides an especially fine venue for the exploration of such topics. \n\n", "semester": "2008A", "name": "INTRO JAPANESE THOUGHT", "reviews": {"path": "/courses/19999/reviews", "values": [{"ratings": {"rAmountLearned": "2.55", "rDifficulty": "2.00", "rStimulateInterest": "2.40", "rRecommendMajor": "3.00", "rCourseQuality": "2.25", "rWorkRequired": "2.15", "rInstructorAccess": "3.45", "rReadingsValue": "2.85", "rRecommendNonMajor": "2.00", "rCommAbility": "2.25", "rInstructorQuality": "2.70"}, "section": {"name": "INTRO JAPANESE THOUGHT", "sectionnum": "401", "primary_alias": "EALC-160-401", "path": "/courses/19999/sections/401", "id": "19999-401", "aliases": ["EALC-160-401", "EALC-560-401"]}, "comments": "", "num_students": 24, "path": "/courses/19999/sections/401/reviews/2043-LEWIS-E-HARRINGTON", "instructor": {"path": "/instructors/2043-LEWIS-E-HARRINGTON", "first_name": "LEWIS E", "last_name": "HARRINGTON", "id": "2043-LEWIS-E-HARRINGTON", "name": "LEWIS E HARRINGTON"}, "num_reviewers": 23, "id": "19999-401-2043-LEWIS-E-HARRINGTON"}]}, "credits": null, "primary_alias": "EALC-160", "path": "/courses/19999", "sections": {"path": "/courses/19999/sections", "values": [{"name": "INTRO JAPANESE THOUGHT", "sectionnum": "401", "primary_alias": "EALC-160-401", "path": "/courses/19999/sections/401", "id": "19999-401", "aliases": ["EALC-160-401", "EALC-560-401"]}]}, "id": 19999, "aliases": ["EALC-160", "EALC-560"]}