[{"ratings": {"rAmountLearned": "2.89", "rDifficulty": "3.00", "rStimulateInterest": "1.85", "rRecommendMajor": "3.07", "rCourseQuality": "2.39", "rWorkRequired": "2.44", "rInstructorAccess": "2.96", "rReadingsValue": "2.19", "rRecommendNonMajor": "2.04", "rCommAbility": "2.41", "rInstructorQuality": "2.39"}, "section": {"name": "GLOBAL CLIMATE CHANGE", "sectionnum": "001", "primary_alias": "ENVS-204-001", "path": "/courses/24346/sections/001", "id": "24346-001", "aliases": ["ENVS-204-001"]}, "comments": "This course addresses the public perceptions and attitudes concerning the causes\r\nand importance of global. This course provides a sound theoretical understanding of\r\nglobal warming through an appreciation of the Earth's climate system and how and why\r\nthis has changed through time. The course describes progress in the understanding of the\r\nhuman and natural drivers of climate change, climate processes and attribution, and\r\nestimates of projected future climate change. The course also assesses scientific,\r\ntechnical and socio- economic information relevant for the understanding of climate\r\nchange, its potential impacts and options for adaptation and mitigation.\r\nThis course is interesting and relevant to today's issues. An excellent class that\r\nwill make any student extremely knowledgeable on the science of global climate change,\r\nnot to mention earth system dynamics.\r\nDr. Marinov was considered extremely knowledgeable, and in addition to the\r\ncourse material, taught students a little about the process of research and studying climate\r\nscience itself. This course was said to have a balance between covering a breadth of\r\ntopics and going into depth on individual topics.\r\nMany former students believe it is possible for a student without any relevant\r\nprior coursework to do well in this course; however this will require a lot of work in\r\nterms of understanding the readings and the materials covered. Students found the exams\r\nto be challenging due to the fact that the grading criteria were very strict, looking for very\r\nspecific answers to broad questions.\r\n*Based on 10 student reviews", "num_students": 30, "path": "/courses/24346/sections/001/reviews/4316-IRINA-MARINOV", "instructor": {"path": "/instructors/4316-IRINA-MARINOV", "first_name": "IRINA", "last_name": "MARINOV", "id": "4316-IRINA-MARINOV", "name": "IRINA MARINOV"}, "num_reviewers": 28, "id": "24346-001-4316-IRINA-MARINOV"}]