[{"ratings": {"rAmountLearned": "3.06", "rDifficulty": "2.19", "rStimulateInterest": "3.03", "rRecommendMajor": "3.48", "rCourseQuality": "3.11", "rWorkRequired": "2.29", "rInstructorAccess": "3.48", "rReadingsValue": "3.10", "rRecommendNonMajor": "2.77", "rCommAbility": "3.10", "rInstructorQuality": "3.42"}, "section": {"name": "HIST FOREIGN AID IN AFRC", "sectionnum": "401", "primary_alias": "HIST-372-401", "path": "/courses/27588/sections/401", "id": "27588-401", "aliases": ["HIST-372-401", "AFST-372-401"]}, "comments": "This course examined the history, politics, and significance of foreign aid to Africa since the late 19th century. While people do not typically think about the European colonial period in Africa in terms of 'foreign aid,' that era introduced ideas and institutions which formed the foundations for modern aid policies and practices. So students started there and moved forward into more contemporary times. In addition to examining the objectives behind foreign assistance and the intentions of donors and recipients, the course looked at some of the consequences (intended or unintended) of various forms of foreign aid to Africa over the past century. While not designed to be a comprehensive history of development theory, of African economics, or of international aid organizations, the course touched on all of these topics. Previous course work on Africa was strongly advised.\r\n\r\nStudents found the course interesting, but found the subject matter was never systematically resolved. Some students felt comfortable with this, calling it the sort of class that \"results in a lot more questions than answers\" but those questions promote discussion. One student found the course had \"less historical focus than expected\" and thought that \"more historical grounding would have enhanced the course.\" Other students wanted the class to be \"more structured,\" but one student said that, despite the \"scattered\" nature of class, caused by \"Dr. Cassanelli's many interests,\" \"class was always a delight.\"\r\n\r\nOverall, students found Professor Cassanelli \"interesting,\" \"stimulating,\" \"passionate,\" and \"knowledgeable.\"  One student praised his ability to be \"flexible and responsive, tailoring class to the interests of the students.\" Another student described his \"excitement\" for foreign aid in Africa as \"contagious.\"\r\n\r\nOne student particularly appreciated the readings, calling them \"very interesting,\" though the student wanted to learn more \"about successful cases of foreign aid.\" Other students expressed dismay over the grading; one student claimed that the \"assignments were not graded in a timely manner\" and another did not like Professor Cassanelli's system of grading, explaining that there was \"no feedback on grades—just scores without any explanation.\" Multiple students also praised the guest speakers brought in to the class.", "num_students": 42, "path": "/courses/27588/sections/401/reviews/658-LEE-V-CASSANELLI", "instructor": {"path": "/instructors/658-LEE-V-CASSANELLI", "first_name": "LEE V", "last_name": "CASSANELLI", "id": "658-LEE-V-CASSANELLI", "name": "LEE V CASSANELLI"}, "num_reviewers": 37, "id": "27588-401-658-LEE-V-CASSANELLI"}]