{"coursehistories": {"path": "/coursehistories/2807"}, "description": "Basic methods for analysis and design of feedback control in systems. Applications to practical systems. Methods presented include time response analysis, frequency response analysis, root locus, Nyquist and Bode plots, and the state-space approach. \n\n", "semester": "2011A", "name": "CONTROL OF SYSTEMS", "reviews": {"path": "/courses/21663/reviews", "values": [{"ratings": {"rAmountLearned": "2.53", "rDifficulty": "3.36", "rStimulateInterest": "2.70", "rRecommendMajor": "3.03", "rCourseQuality": "2.53", "rWorkRequired": "3.18", "rInstructorAccess": "3.25", "rReadingsValue": "2.16", "rRecommendNonMajor": "1.32", "rCommAbility": "2.62", "rInstructorQuality": "3.06"}, "section": {"name": "CONTROL OF SYSTEMS", "sectionnum": "401", "primary_alias": "ESE-406-401", "path": "/courses/21663/sections/401", "id": "21663-401", "aliases": ["ESE-406-401", "MEAM-513-401", "ESE-505-401"]}, "comments": "This class covers the basic methods for analysis and design of feedback control in systems. Applications to practical systems. Methods presented include time response analysis, frequency response analysis, root locus, Nyquist and Bode plots, and the state-space approach. It is also an overview of the communication process, frequency response of linear channels, random processes and power spectral densities, modulation and noise, baseband data transmission (pulse amplitude modulation, inter-symbol interference, and equalization, performance in noise, digital band-pass modulation (PSK, QAM, FSK), and elements of information theory. &#8232;&#8232;Students generally enjoyed the content of the class and felt that the knowledge gained was “applicable to practical situations.” One student felt that an effort was needed to “figure out how the concepts learned translated” to the field, and another felt that it was a good foundation for graduate courses. Systems engineering majors felt that the course was more relevant for electrical engineers and should not be a requirement for them. &#8232;&#8232;Students commended Professor Kothmann on his teaching, saying that he was “excellent at stimulating interest” and “takes pains to explain the practical meaning of every single equation.” He was also “very open to emails and questions.” However, some felt that his teaching style often caused them to “quickly get left behind.” &#8232;&#8232;Most students took the course as a requirement for Systems/Electrical Engineering. Due to cross-listing, however, some undergraduates found the material to be too advanced and some graduates felt it was “a bit on the slow side.”", "num_students": 142, "path": "/courses/21663/sections/401/reviews/3294-BRUCE-D--KOTHMANN", "instructor": {"path": "/instructors/3294-BRUCE-D--KOTHMANN", "first_name": "BRUCE D.", "last_name": "KOTHMANN", "id": "3294-BRUCE-D--KOTHMANN", "name": "BRUCE D. KOTHMANN"}, "num_reviewers": 127, "id": "21663-401-3294-BRUCE-D--KOTHMANN"}]}, "credits": null, "primary_alias": "ESE-406", "path": "/courses/21663", "sections": {"path": "/courses/21663/sections", "values": [{"name": "CONTROL OF SYSTEMS", "sectionnum": "401", "primary_alias": "ESE-406-401", "path": "/courses/21663/sections/401", "id": "21663-401", "aliases": ["ESE-406-401", "MEAM-513-401", "ESE-505-401"]}]}, "id": 21663, "aliases": ["ESE-406", "MEAM-513", "ESE-505"]}