[{"ratings": {"rAmountLearned": "3.18", "rDifficulty": "3.18", "rStimulateInterest": "2.54", "rRecommendMajor": "3.36", "rCourseQuality": "2.98", "rWorkRequired": "3.05", "rInstructorAccess": "3.72", "rReadingsValue": "3.05", "rRecommendNonMajor": "1.26", "rCommAbility": "3.38", "rInstructorQuality": "3.45"}, "section": {"name": "VIBRATION MECH SYSTEMS", "sectionnum": "001", "primary_alias": "MEAM-321-001", "path": "/courses/17671/sections/001", "id": "17671-001", "aliases": ["MEAM-321-001"]}, "comments": "This course teaches the fundamental concepts underlying the dynamics of vibrations for single-degree of freedom, multi-degree and infinite-degree of freedom mechanical systems. The course will focus on Newton's Force Methods, Virtual-Work Methods, and Lagrange's Variation Methods for analyzing problems in vibrations. Students will learn how to analyze transient, steady state and forced motion of single and multi-degree of freedom linear and non-linear systems.\r\n\r\nStudents felt that the course was “conceptually challenging and mathematically rigorous” but appreciated the material nonetheless. Students felt that the course finally made the mathematics covered in MATH 240 and 241 understandable and useful.\r\n\r\nStudents had highly favorable reviews of Professor Carchidi. They appreciated his willingness to cover older material, especially the math applications, and his highly thorough lectures and notes. One student remarked that “he is by far the most accessible professor I have had at Penn,” and others lauded his availability for questions via office hours and email.\r\n\r\nWhile the course was challenging, students felt it would have been far worse without the efforts of Professor Carchidi. Students felt the course was “satisfying” and a “pleasure.” \r\n", "num_students": 45, "path": "/courses/17671/sections/001/reviews/774-MICHAEL-A--CARCHIDI", "instructor": {"path": "/instructors/774-MICHAEL-A--CARCHIDI", "first_name": "MICHAEL A.", "last_name": "CARCHIDI", "id": "774-MICHAEL-A--CARCHIDI", "name": "MICHAEL A. CARCHIDI"}, "num_reviewers": 43, "id": "17671-001-774-MICHAEL-A--CARCHIDI"}]