[{"ratings": {"rAmountLearned": "2.25", "rDifficulty": "2.97", "rStimulateInterest": "1.26", "rRecommendMajor": "1.79", "rCourseQuality": "1.72", "rWorkRequired": "2.18", "rInstructorAccess": "2.29", "rReadingsValue": "1.97", "rRecommendNonMajor": "0.88", "rCommAbility": "1.18", "rInstructorQuality": "1.46"}, "section": {"name": "PERCEPTION", "sectionnum": "401", "primary_alias": "PSYC-111-401", "path": "/courses/23696/sections/401", "id": "23696-401", "aliases": ["PSYC-111-401", "VLST-211-401"]}, "comments": "This class seeks to explore how the individual acquires and is guided by knowledge about objects and events in their environment. Integral questions for the course include: Why do things sound, look, and feel the way they do? What do our senses tell us about reality? How can we measure our perceptual abilities, and what do our measurements tell us? Linking hypotheses: how do we relate what happens in the world to physiology in the brain and to our phenomenal perception?\r\n\r\nStudents found this course “challenging,” but the content to be interesting. It was said to lean heavily on physics and math, which students were not prepared for. Many students found this class to be “one of their worst.”\r\n\r\nProfessor Stocker is called “knowledgeable” and “accessible,” but his lectures are described as “unclear” and taken straight from the textbook. He is described as “uninterested” in teaching and “unable to communicate the subject matter.” Students relied heavily on the TAs, who they described as “brilliant” and “great.”\r\n\r\nThe perquisite for this course is PSYC001, but many students felt that there should be higher math and science prerequisites. Psychology majors found this class harder than did students with strong science backgrounds. Students did not feel adequately prepared for the exams and complained about a mandatory recitation that was not listed on PennInTouch, but which was necessary to attend to get a good grade in the course.\r\n", "num_students": 48, "path": "/courses/23696/sections/401/reviews/4966-ALAN-A--STOCKER", "instructor": {"path": "/instructors/4966-ALAN-A--STOCKER", "first_name": "ALAN A.", "last_name": "STOCKER", "id": "4966-ALAN-A--STOCKER", "name": "ALAN A. STOCKER"}, "num_reviewers": 41, "id": "23696-401-4966-ALAN-A--STOCKER"}]