[{"ratings": {"rAmountLearned": "2.83", "rDifficulty": "2.46", "rStimulateInterest": "2.00", "rRecommendMajor": "2.87", "rCourseQuality": "2.33", "rWorkRequired": "2.72", "rInstructorAccess": "2.85", "rReadingsValue": "2.85", "rRecommendNonMajor": "1.57", "rCommAbility": "2.09", "rInstructorQuality": "2.27"}, "section": {"name": "LAW AND ECONOMICS", "sectionnum": "001", "primary_alias": "ECON-234-001", "path": "/courses/15595/sections/001", "id": "15595-001", "aliases": ["ECON-234-001"]}, "comments": "This course will use basic microeconomic tools to understand how the law can promote economic efficiency. The class will discuss tort law, property law, intellectual property, and antitrust regulation with a distinction made between common law and legislative law.\r\nStudents felt that the “current and relevant” material made this an enlightening course. However, they found it “poorly planned,” focusing more on game theory than on law and economics; topics were “scattered” and sometimes even “completely unrelated” to law and economics. There were several guest lectures, which some found informative and “a nice change of pace,” but others commented that they wasted time, leaving students to learn the material on their own from an “intensely detailed and difficult text.” Assignments included multiple projects, quizzes, and midterms.\r\nStudents were split in opinion of Professor Shachmurove. A few students thought Dr. Shachmurove was “excellent at communicating subject matter,” “extremely capable,” and a man who “truly cares about his students.” He made the course “fun and interesting” and conveniently “always posted slides of his lectures online.” However, students also reported that he put too much text on each slide, making presentations “difficult to follow.” Additionally, he was occasionally “impatient and critical” of students’ questions. &#8232;&#8232;Students summed up the course as “difficult, but rewarding.” Students explained, “We had to learn everything on our own,” by studying for tests “often,” but only a “little at a time.” Despite mixed reviews, many students enjoyed the subject matter, calling it an “excellent component to my econ major” and “one of the most useful courses I have taken at Penn.”", "num_students": 60, "path": "/courses/15595/sections/001/reviews/339-YOCHANAN-SHACHMUROVE", "instructor": {"path": "/instructors/339-YOCHANAN-SHACHMUROVE", "first_name": "YOCHANAN", "last_name": "SHACHMUROVE", "id": "339-YOCHANAN-SHACHMUROVE", "name": "YOCHANAN SHACHMUROVE"}, "num_reviewers": 54, "id": "15595-001-339-YOCHANAN-SHACHMUROVE"}]