[{"ratings": {"rAmountLearned": "2.52", "rDifficulty": "2.60", "rStimulateInterest": "2.14", "rRecommendMajor": "3.05", "rCourseQuality": "2.53", "rWorkRequired": "1.89", "rInstructorAccess": "2.21", "rReadingsValue": "2.64", "rRecommendNonMajor": "1.71", "rCommAbility": "2.62", "rInstructorQuality": "2.68"}, "section": {"name": "INTERNATIONAL FINANCE", "sectionnum": "001", "primary_alias": "ECON-252-001", "path": "/courses/15597/sections/001", "id": "15597-001", "aliases": ["ECON-252-001"]}, "comments": "This course is concerned with how individuals make decisions in a world full of uncertainties, both normatively and descriptively. It is also designed to help build skills in understanding and analyzing a choice problem with uncertainty in a systematic fashion, as well as deepening the student’s understanding of the fundamental concept of a utility function, which plays a critical role in economic modeling. The course requires a substantial ability of abstract thinking. Homework is intended to be thought-provoking rather than skill-sharpening. Topics covered in the course usually include balance-of-payments adjustment, theories of exchange rate determination, the effects of exchange rate devaluation, macroeconomic policy under fixed and floating exchange rates, the Euro-dollar market, currency and balance of payments crises.\r\n\r\nStudents tended to find the concepts covered in this course “interesting,” but a few felt that there was a lack of cohesiveness in the course and experienced some confusion regarding how “the stuff from the beginning of [the] semester works with the stuff from the end.”\r\n\r\nMultiple students agreed that Professor Ethier had a “great sense of humor.” Many also wrote that he was “very bright” and “certainly knows what he’s talking about.” Some students, including those who found Professor Ethier to be quite knowledgeable, wrote that he went “over concepts very quickly.” Many found it necessary to read the textbook closely before class in order to keep up with the concepts covered in lecture.\r\n\r\nThis course did not require extensive work outside of class except for textbook readings. Some students complained that the quick pace of the class made it difficult to keep up and prepare for the final exam. One student wrote, “the tests are too easy” and others believed that the topics are not tested evenly. This course was recommended to majors but not to non-majors.", "num_students": 125, "path": "/courses/15597/sections/001/reviews/347-WILFRED-J-ETHIER", "instructor": {"path": "/instructors/347-WILFRED-J-ETHIER", "first_name": "WILFRED J", "last_name": "ETHIER", "id": "347-WILFRED-J-ETHIER", "name": "WILFRED J ETHIER"}, "num_reviewers": 115, "id": "15597-001-347-WILFRED-J-ETHIER"}]