[{"ratings": {"rAmountLearned": "2.81", "rDifficulty": "3.48", "rStimulateInterest": "2.33", "rRecommendMajor": "2.62", "rCourseQuality": "2.68", "rWorkRequired": "3.95", "rInstructorAccess": "2.24", "rReadingsValue": "1.84", "rRecommendNonMajor": "1.76", "rCommAbility": "2.48", "rInstructorQuality": "2.76"}, "section": {"name": "NUMERICAL MTHDS & MODLNG", "sectionnum": "001", "primary_alias": "ENM-502-001", "path": "/courses/21634/sections/001", "id": "21634-001", "aliases": ["ENM-502-001"]}, "comments": "This course introduces the fundamentals of Numerical Methods for a board engineering audience. The primary goal of the course is to provide a broad background in numerical methods. Most of the applications are MATLAB based. Topics include numerical linear algebra, solution of linear systems of equations, non-linear equations, integration of ordinary differential equations, and solution of partial differential equations. &#8232;&#8232;Students generally found that this course covered “really interesting concepts,” but stated that it emphasized the need for a strong linear algebra background. &#8232;&#8232;Students felt that Prof. Sinno “didn’t culture a learning environment in which students felt comfortable speaking their mind.” Some agreed that although he was effective at communicating the course concepts, he was “condescending” toward students who did not understand the material. In addition, several students felt that the TAs appeared to have “little interest in helping” the students. &#8232;&#8232;Student generally felt that their grades did not reflect their effort. According to many, assignments were time consuming and grading “lacked feedback.”", "num_students": 34, "path": "/courses/21634/sections/001/reviews/217-TALID-R--SINNO", "instructor": {"path": "/instructors/217-TALID-R--SINNO", "first_name": "TALID R.", "last_name": "SINNO", "id": "217-TALID-R--SINNO", "name": "TALID R. SINNO"}, "num_reviewers": 26, "id": "21634-001-217-TALID-R--SINNO"}]