{"coursehistories": {"path": "/coursehistories/5726"}, "description": "Spring 2013 Topic: Religion, State, and Society in East Asia. This course examines the relationship between religious institutions and the state in East Asia. Focusing on China and Japan, we will learn about the impact of religious ideas, practices, and organizations on social, political and economic processes and inspect the role of religion in the consolidation of individual, communal, and national identity. Adopting a comparative and transnational approach, we will examine the impact of Asian religious traditions: Confucianism, Daoism, Buddhism, and Shinto, as well as global religions such as Islam and Christianity, on the internal sociopolitical structure of the Chinese and Japanese states and their role in shaping power relations on the international level. \n\nThe class will follow a linear chronological line divided into three separate units. The first unit will cover the emergence of the dominant religious traditions and sociopolitical structures in premodern China and Japan. This unit will set the tone for our main discussion of the relationship between religion and the state in the modern and contemporary periods. The second unit begins with the impact of Christianity on the political cultures of East Asia and concludes with the fate of the empires of China and Japan in the early 20thcentury. The third and final unit will focus on the emergence of new religious movements in postwar Japan and the continuing discourse on state control over religion in the PRC and Taiwan. \n\nIn addition to covering material from the assigned chapters from the textbook and other secondary sources in greater depth, we will also dedicate our class sessions to close readings of primary historical sources, from imperial edicts and philosophical and religious essays to news interviews and documentary footage. No previous knowledge of Chinese or Japanese is necessary, and all readings will be available in English on the blackboard site in PDF form. \n\n", "semester": "2013A", "name": "Religion, State, and Society in East Asia", "reviews": {"path": "/courses/30958/reviews", "values": [{"ratings": {"rDifficulty": "1.75", "rStimulateInterest": "3.75", "rCourseQuality": "3.25", "rWorkRequired": "1.50", "rInstructorQuality": "3.50", "rCommAbility": "4.00", "rInstructorAccess": "4.00"}, "section": {"name": "Religion, State, and Society in East Asia", "sectionnum": "601", "primary_alias": "RELS-270-601", "path": "/courses/30958/sections/601", "id": "30958-601", "aliases": ["RELS-270-601", "EALC-038-601"]}, "comments": "", "num_students": 10, "path": "/courses/30958/sections/601/reviews/6396-ORI-TAVOR", "instructor": {"path": "/instructors/6396-ORI-TAVOR", "first_name": "ORI", "last_name": "TAVOR", "id": "6396-ORI-TAVOR", "name": "ORI TAVOR"}, "num_reviewers": 4, "id": "30958-601-6396-ORI-TAVOR"}]}, "credits": null, "primary_alias": "RELS-270", "path": "/courses/30958", "sections": {"path": "/courses/30958/sections", "values": [{"name": "Religion, State, and Society in East Asia", "sectionnum": "601", "primary_alias": "RELS-270-601", "path": "/courses/30958/sections/601", "id": "30958-601", "aliases": ["RELS-270-601", "EALC-038-601"]}]}, "id": 30958, "aliases": ["RELS-270", "EALC-038"]}