[{"ratings": {"rAmountLearned": "2.47", "rDifficulty": "2.67", "rStimulateInterest": "2.07", "rRecommendMajor": "2.27", "rCourseQuality": "2.13", "rWorkRequired": "3.07", "rInstructorAccess": "2.80", "rReadingsValue": "2.73", "rRecommendNonMajor": "2.27", "rCommAbility": "2.07", "rInstructorQuality": "2.20"}, "section": {"name": "THE RICH AND THE POOR", "sectionnum": "301", "primary_alias": "SOCI-041-301", "path": "/courses/23783/sections/301", "id": "23783-301", "aliases": ["SOCI-041-301"]}, "comments": "This course ranges in topics depending on the semester due to the fact that it is a freshman seminar. Topics in the past have covered Society and History, The 1960’s: Preludes and Postludes, Mistakes, Errors, Accidents & Disasters, Urban Analysis with Computers, Race and Public Policy, and Perspectives on Inequality, Homelessness and the Urban Crisis. For the past few semesters the course has focused on the rich and the poor. The course aims to answer questions such as “who is rich and who is poor?”, “how does wealth and income (or the lack thereof) affect all aspects of life, including health, marriage, child rearing and education?”, and “what is social class and how does it affect individuals in society?” This is done through the examination of both economic and cultural aspects of social class (such as tastes and lifestyles) across generations. Students are expected to write a six-page research paper on a topic of their choice in addition to the midterm and final exam. \r\n\r\nOverall, students enjoyed the small number of students in the class, reporting that the “intimate nature” of the class allowed each student the opportunity to participate in the discussion. There was some disagreement on class structure, some students saying that the class was “disorganized” while others would have liked less structured discussions. There was, however, consensus on the value of the readings and the assignments as students found them to enhance the learning of the course.\r\n\r\nStudents had overwhelmingly positive feedback about Professor Lareau. Many of them agreed that she was an “expert” in the field and her first-hand experience really improved her teaching ability and helped make her lectures more entertaining. They also agreed that she cared about her students and what they were getting out of the course though some were confused about due dates and content of assignments. \r\n\r\nThe majority of students that took this course were freshman, though many reported that they would recommend the course to a major or minor because the material is applicable to many courses, is interesting, and is “valuable for everyone”. Students should expect to spend time doing weekly readings and weekly exercises in addition to the large exams and paper.\r\n", "num_students": 14, "path": "/courses/23783/sections/301/reviews/4561-ANNETTE-LAREAU", "instructor": {"path": "/instructors/4561-ANNETTE-LAREAU", "first_name": "ANNETTE", "last_name": "LAREAU", "id": "4561-ANNETTE-LAREAU", "name": "ANNETTE LAREAU"}, "num_reviewers": 15, "id": "23783-301-4561-ANNETTE-LAREAU"}]