{"coursehistories": {"path": "/coursehistories/300"}, "description": "This course will explore the historical and contemporary role of the advertising industry in the U.S. media system. Readings will include social histories of advertising, economic examinations of advertising's role in society, and critical analysis of the ad industry's power over the media. \n\n", "semester": "2008A", "name": "ADVERTISING & SOCIETY", "reviews": {"path": "/courses/19973/reviews", "values": [{"ratings": {"rAmountLearned": "2.62", "rDifficulty": "2.67", "rStimulateInterest": "2.25", "rRecommendMajor": "2.97", "rCourseQuality": "2.36", "rWorkRequired": "2.58", "rInstructorAccess": "2.58", "rReadingsValue": "2.07", "rRecommendNonMajor": "1.89", "rCommAbility": "2.86", "rInstructorQuality": "2.71"}, "section": {"name": "ADVERTISING & SOCIETY", "sectionnum": "001", "primary_alias": "COMM-330-001", "path": "/courses/19973/sections/001", "id": "19973-001", "aliases": ["COMM-330-001"]}, "comments": "This course explores the historical and contemporary role of the advertising industry in the U.S. media system. Readings included social histories of advertising, economic examinations of advertising\\'s role in society, and critical analyses of the ad industry\\'s power over the media. The course relied on readings from multiple sources, but students especially enjoyed the “wonderful” primary textbook “Advertising and Culture: Theoretical Perspectives” by Mary Cross. \r\n\r\nStudents reported strong positive impressions of the class material. Most of them characterized it as relevant, easily understandable, yet edifying at the same time. “This course opened my eyes to much of the world of advertising,” one student wrote.  The course required extensive reading (some complained it was too much) for each class. Graded assignments for the course were two exams and one paper.\r\n\r\nIn general, students enjoyed coming to Professor Turow’s lectures, pointing out his “nerdy” in-class jokes, the fact that his lecture material was up-to-date, and his enthusiasm for the subject matter, as ample reason to come to class. \r\n\r\nStudents characterized the course as particularly worthwhile for anyone already interested in advertising, “otherwise, you may hate it.”  Freshmen may wish to consider taking lower-level Communications courses before taking this one: “As a freshman, I felt challenged in this course. The material was dense, seeing as this wasn’t an introductory course, but I still learned a lot and felt taking a prior Comm class would have helped me.”  Students strongly criticized Professor Turow’s tests. “I really enjoy the class, and understand the material,” one student wrote, “However, the exams seem to trick you, and test you on specific random sections rather than broad theories discussed in class.” Many students echoed this sentiment, using words like “harsh” and “unfair” to characterize the grading of the exams. Some students were also concerned about the standard lecture format, as well as the amount of reading required for the course.\r\n", "num_students": 114, "path": "/courses/19973/sections/001/reviews/287-JOSEPH-G--TUROW", "instructor": {"path": "/instructors/287-JOSEPH-G--TUROW", "first_name": "JOSEPH G.", "last_name": "TUROW", "id": "287-JOSEPH-G--TUROW", "name": "JOSEPH G. TUROW"}, "num_reviewers": 73, "id": "19973-001-287-JOSEPH-G--TUROW"}]}, "credits": null, "primary_alias": "COMM-330", "path": "/courses/19973", "sections": {"path": "/courses/19973/sections", "values": [{"name": "ADVERTISING & SOCIETY", "sectionnum": "001", "primary_alias": "COMM-330-001", "path": "/courses/19973/sections/001", "id": "19973-001", "aliases": ["COMM-330-001"]}]}, "id": 19973, "aliases": ["COMM-330"]}