{"coursehistories": {"path": "/coursehistories/2628"}, "description": "Soft matter describes materials that are neither pure crystalline solids with long range atomic order or pure liquids characterized by one simple viscosity. Many times soft materials display both solid and liquid like behavior depending on the timescale of the applied stress. Colloids, polymers, amphiphiles, liquid crystals, and biomacromolecules are types of soft matter. The focus of this course is on the characteristics common to soft materials namely their length scale, fragile binding energies or proximity to phase transitions, dynamics and propensity to self-assemble. \n\n", "semester": "2010C", "name": "SOFT MATERIALS", "reviews": {"path": "/courses/23472/reviews", "values": [{"ratings": {"rAmountLearned": "2.77", "rDifficulty": "2.87", "rStimulateInterest": "3.04", "rRecommendMajor": "3.35", "rCourseQuality": "2.88", "rWorkRequired": "2.65", "rInstructorAccess": "3.00", "rReadingsValue": "2.26", "rRecommendNonMajor": "1.74", "rCommAbility": "2.91", "rInstructorQuality": "2.88"}, "section": {"name": "SOFT MATERIALS", "sectionnum": "401", "primary_alias": "MSE-330-401", "path": "/courses/23472/sections/401", "id": "23472-401", "aliases": ["MSE-330-401", "BE-330-401"]}, "comments": "The focus of this course is on the characteristics common to soft materials namely their length scale, fragile binding energies or proximity to phase transitions, dynamics and propensity to self-assemble. Soft matter describes materials that are neither pure crystalline solids with long range atomic order or pure liquids characterized by one simple viscosity. Many times soft materials display both solid and liquid like behavior depending on the timescale of the applied stress. Colloids, polymers, amphiphiles, liquid crystals, and biomacromolecules are types of soft matter. \r\n\r\nStudents generally found the course to be interesting and commented that it “does a good job of providing enough information without getting bogged down in heavy derivations or integrals.”\r\n\r\nDr. Composto was a favorite among students; as one noted, “Dr. Composto is a great guy who genuinely cares about teaching and his students, and it truly shows in his lectures.”\r\n\r\nStudents reported that the homework assignments went much more in-depth than did the lectures and that they often did not follow the book. Students also stated that the professor followed the book very closely. \r\n\r\nThis review is based on the 4 student comments that were submitted.\r\n", "num_students": 30, "path": "/courses/23472/sections/401/reviews/836-RUSSELL-JOHN-COMPOSTO", "instructor": {"path": "/instructors/836-RUSSELL-JOHN-COMPOSTO", "first_name": "RUSSELL JOHN", "last_name": "COMPOSTO", "id": "836-RUSSELL-JOHN-COMPOSTO", "name": "RUSSELL JOHN COMPOSTO"}, "num_reviewers": 26, "id": "23472-401-836-RUSSELL-JOHN-COMPOSTO"}]}, "credits": null, "primary_alias": "MSE-330", "path": "/courses/23472", "sections": {"path": "/courses/23472/sections", "values": [{"name": "SOFT MATERIALS", "sectionnum": "401", "primary_alias": "MSE-330-401", "path": "/courses/23472/sections/401", "id": "23472-401", "aliases": ["MSE-330-401", "BE-330-401"]}]}, "id": 23472, "aliases": ["MSE-330", "BE-330"]}