{"coursehistories": {"path": "/coursehistories/4400"}, "description": "This course provides an introduction to real estate with a focus on investment and financing issues. Project evaluation, financing strategies, investment decision making and real estate capital markets are covered. No prior knowledge of the industry is required, but students are expected to rapidly acquire a working knowledge of real estate markets. Classes are conducted in a standard lecture format with discussion required. The course contains cases that help students evaluate the impact of more complex financing and capital markets tools used in real estate. There are case studies and two mid-terms, (depending on instructor). Cross-listed with FNCE 721. \n\n", "semester": "2012A", "name": "REAL ESTATE INVESTMENTS", "reviews": {"path": "/courses/28093/reviews", "values": [{"ratings": {"rAmountLearned": "2.96", "rDifficulty": "3.02", "rStimulateInterest": "2.59", "rRecommendMajor": "3.36", "rCourseQuality": "2.85", "rWorkRequired": "3.02", "rInstructorAccess": "3.02", "rReadingsValue": "2.40", "rRecommendNonMajor": "2.33", "rCommAbility": "2.98", "rInstructorQuality": "2.80"}, "section": {"name": "REAL ESTATE INVESTMENTS", "sectionnum": "405", "primary_alias": "REAL-721-405", "path": "/courses/28093/sections/405", "id": "28093-405", "aliases": ["REAL-721-405", "FNCE-721-405"]}, "comments": "REAL 721 provides an introduction to real estate with a focus on investment and financing issues. Project evaluation, financing strategies, investment decision making and real estate capital markets are covered. No prior knowledge of the industry is required, but students are expected to rapidly acquire a working knowledge of real estate markets. Classes are conducted in a standard lecture format with discussion required. The course contains cases that help students evaluate the impact of more complex financing and capital markets tools used in real estate. There are case studies and two mid-terms, (depending on instructor). REAL 721 is cross-listed with FNCE 721. \r\nStudents agreed that REAL 721 is a “great course” that provides a “good overview of real estate finance.” The class was a good blend of “theory and practical implementation.” One student mentioned he would have appreciated more in-depth “analysis” but still found the course “engaging.”\r\nProfessor Ferreira received overall positive reviews. Students mentioned that they “learned a lot from [Professor Ferreira’s] lectures.” Multiple students went on to compliment how Professor Ferreira kept student engaged. One student mentioned that Professor Ferreira “makes class fun” but would have appreciated more class participation.\r\nFrom the reviews, students would recommend this course to peers.", "num_students": 61, "path": "/courses/28093/sections/405/reviews/3169-FERNANDO-V--FERREIRA", "instructor": {"path": "/instructors/3169-FERNANDO-V--FERREIRA", "first_name": "FERNANDO V.", "last_name": "FERREIRA", "id": "3169-FERNANDO-V--FERREIRA", "name": "FERNANDO V. FERREIRA"}, "num_reviewers": 58, "id": "28093-405-3169-FERNANDO-V--FERREIRA"}, {"ratings": {"rAmountLearned": "2.84", "rDifficulty": "3.09", "rStimulateInterest": "2.19", "rRecommendMajor": "3.22", "rCourseQuality": "2.80", "rWorkRequired": "3.10", "rInstructorAccess": "3.43", "rReadingsValue": "2.43", "rRecommendNonMajor": "2.44", "rCommAbility": "2.63", "rInstructorQuality": "2.50"}, "section": {"name": "REAL ESTATE INVESTMENTS", "sectionnum": "406", "primary_alias": "REAL-721-406", "path": "/courses/28093/sections/406", "id": "28093-406", "aliases": ["REAL-721-406", "FNCE-721-406"]}, "comments": "REAL 721 provides an introduction to real estate with a focus on investment and financing issues. Project evaluation, financing strategies, investment decision making and real estate capital markets are covered. Classes are conducted in a standard lecture format with discussion required. The course contains cases that help students evaluate the impact of more complex financing and capital markets tools used in real estate. There are case studies and two midterms. \r\n\r\nWhile the focus of this course is commercial real estate, one student noted that the concepts “are nevertheless somewhat applicable” to residential real estate as well. Indeed, another student said that “the course is a great survey course for real estate.” Many students thought that the cases in lecture were “very helpful,” but a significant minority of students commented that the courses were too “vague” to be fully effective teaching tools.\r\n\r\nStudents commented that Professor Wong was “zealous” about the material, but lacked “practical experience,” which made it difficult for the professor to answer some student questions. Nevertheless, many students also remarked that Professor Wong was “reachable and helpful.” Multiple students also said that Professor Wong “does a good job of making sure the entire class was following the material” without significantly slowing the pace of the class.\r\n\r\nSome students commented that the cases were a “fair bit of work.” This course is cross-listed with FNCE 721, and the prerequisite for this course in FNCE 601. No prior knowledge of the industry is required, but students are expected to rapidly acquire a working knowledge of real estate markets.\r\n", "num_students": 49, "path": "/courses/28093/sections/406/reviews/4550-MAISY-WONG", "instructor": {"path": "/instructors/4550-MAISY-WONG", "first_name": "MAISY", "last_name": "WONG", "id": "4550-MAISY-WONG", "name": "MAISY WONG"}, "num_reviewers": 47, "id": "28093-406-4550-MAISY-WONG"}, {"ratings": {"rAmountLearned": "2.45", "rDifficulty": "2.05", "rStimulateInterest": "2.75", "rRecommendMajor": "2.59", "rCourseQuality": "2.43", "rWorkRequired": "2.15", "rInstructorAccess": "3.00", "rReadingsValue": "2.50", "rRecommendNonMajor": "2.40", "rCommAbility": "2.95", "rInstructorQuality": "2.65"}, "section": {"name": "REAL ESTATE INVESTMENTS", "sectionnum": "751", "primary_alias": "REAL-721-751", "path": "/courses/28093/sections/751", "id": "28093-751", "aliases": ["REAL-721-751", "FNCE-721-751"]}, "comments": "This course provides an introduction to real estate with a focus on investment and financing issues. Project evaluation, financing strategies, investment decision making and real estate capital markets are covered. No prior knowledge of the industry is required, but students are expected to rapidly acquire a working knowledge of real estate markets. Classes are conducted in a standard lecture format with discussion required. The course contains cases that help students evaluate the impact of more complex financing and capital markets tools used in real estate. There are case studies and two mid-terms, (depending on instructor). REAL721 is cross-listed with FNCE721.\r\nStudents found the class material interesting but felt like they could have covered more material, a consequence of the nature of the professor’s time management. Students enjoyed group discussions of “The Big Short” and other readings.\r\nStudents had mixed reviews of Professor Green. The majority of students believed that Professor Green spent too much time on “pro-forma (excel) setup” and “would have preferred hearing less from students and more from the professor.” A significant amount of time in class was spent reading cases or discussing homework. Professor Green presented the material “very well” and “replied promptly to any questions” inside and outside of class.\r\nThe grade for the course is largely dependent on two deliverables, which “required significant work.”\r\n", "num_students": 35, "path": "/courses/28093/sections/751/reviews/2822-RICHARD-GREEN", "instructor": {"path": "/instructors/2822-RICHARD-GREEN", "first_name": "RICHARD", "last_name": "GREEN", "id": "2822-RICHARD-GREEN", "name": "RICHARD GREEN"}, "num_reviewers": 23, "id": "28093-751-2822-RICHARD-GREEN"}]}, "credits": null, "primary_alias": "REAL-721", "path": "/courses/28093", "sections": {"path": "/courses/28093/sections", "values": [{"name": "REAL ESTATE INVESTMENTS", "sectionnum": "405", "primary_alias": "REAL-721-405", "path": "/courses/28093/sections/405", "id": "28093-405", "aliases": ["REAL-721-405", "FNCE-721-405"]}, {"name": "REAL ESTATE INVESTMENTS", "sectionnum": "406", "primary_alias": "REAL-721-406", "path": "/courses/28093/sections/406", "id": "28093-406", "aliases": ["REAL-721-406", "FNCE-721-406"]}, {"name": "REAL ESTATE INVESTMENTS", "sectionnum": "751", "primary_alias": "REAL-721-751", "path": "/courses/28093/sections/751", "id": "28093-751", "aliases": ["REAL-721-751", "FNCE-721-751"]}]}, "id": 28093, "aliases": ["REAL-721", "FNCE-721"]}