{"coursehistories": {"path": "/coursehistories/3907"}, "description": "This lecture course and a companion laboratory course (MEAM 147) build upon the concepts of Newtonian (classical) mechanics and their application to engineered systems. This course introduces students to mechanical principles that are the foundation of upper-level engineering courses including MEAM 210 and 211. The three major parts of this course are: I. Vector Mechanics; II. Statics and Structures; and III. Kinematics and Dynamics. Topics include: vector analysis, statics of rigid bodies, introduction to deformable bodies, friction, kinematics of motion, work and energy, and dynamics of particles. Case studies will be introduced, and the role of Newtonian mechanics in emerging applications including bio- and nano- technologies will be discussed. \n\n", "semester": "2010C", "name": "INTRO TO MECHANICS", "reviews": {"path": "/courses/23380/reviews", "values": [{"ratings": {"rAmountLearned": "2.49", "rDifficulty": "2.22", "rStimulateInterest": "1.39", "rRecommendMajor": "3.44", "rCourseQuality": "2.42", "rWorkRequired": "2.47", "rInstructorAccess": "2.71", "rReadingsValue": "2.41", "rRecommendNonMajor": "1.73", "rCommAbility": "2.42", "rInstructorQuality": "2.11"}, "section": {"name": "INTRO TO MECHANICS", "sectionnum": "001", "primary_alias": "MEAM-110-001", "path": "/courses/23380/sections/001", "id": "23380-001", "aliases": ["MEAM-110-001"]}, "comments": "\r\nMEAM 110 builds upon the concepts of Newtonian (classical) mechanics and their application to engineered systems. This course introduces students to mechanical principles that are the foundation of upper-level engineering courses. The course focuses on vector mechanics; statics and structures; and kinematics and dynamics. Topics include vector analysis, statics of rigid bodies, introduction to deformable bodies, friction, kinematics of motion, work and energy, as well as dynamics of particles. \r\n\r\nMany students described this class as “incredibly boring” and “repetitive.” Several students stated they knew much of the material from high school. Some students enjoyed using the clickers in class, but still found the class to be “slow” and “trivial.” \r\n\r\nProfessor Bassani was described as “clearly knowledgeable” and a “nice guy who cares if his students do well” but still “soporific.” Several students found that his “charisma was low.” \r\n\r\nMost students enjoyed this class as an introduction to MEAM material and as a way to meet others in the major.\r\n", "num_students": 60, "path": "/courses/23380/sections/001/reviews/458-JOHN-L-BASSANI", "instructor": {"path": "/instructors/458-JOHN-L-BASSANI", "first_name": "JOHN L", "last_name": "BASSANI", "id": "458-JOHN-L-BASSANI", "name": "JOHN L BASSANI"}, "num_reviewers": 57, "id": "23380-001-458-JOHN-L-BASSANI"}]}, "credits": null, "primary_alias": "MEAM-110", "path": "/courses/23380", "sections": {"path": "/courses/23380/sections", "values": [{"name": "INTRO TO MECHANICS", "sectionnum": "001", "primary_alias": "MEAM-110-001", "path": "/courses/23380/sections/001", "id": "23380-001", "aliases": ["MEAM-110-001"]}]}, "id": 23380, "aliases": ["MEAM-110"]}