[{"ratings": {"rAmountLearned": "2.47", "rDifficulty": "3.11", "rStimulateInterest": "1.24", "rRecommendMajor": "2.69", "rCourseQuality": "1.86", "rWorkRequired": "2.51", "rInstructorAccess": "2.08", "rReadingsValue": "2.47", "rRecommendNonMajor": "0.92", "rCommAbility": "1.71", "rInstructorQuality": "1.78"}, "section": {"name": "PHYSIOLOGY MOTIVATED BEH", "sectionnum": "401", "primary_alias": "PSYC-127-401", "path": "/courses/25031/sections/401", "id": "25031-401", "aliases": ["PSYC-127-401", "BIBB-227-401"]}, "comments": "Psychology 127 focused on evaluating the experiments that have sought to establish links between brain structure (the activity of specific brain circuits) and behavioral function (the control of particular motivated and emotional behaviors).  Students will be exposed to concepts from regulatory physiology, systems neuroscience, pharmacology, and endocrinology and read textbook as well as original source materials. The course focuses on the following behaviors: feeding, sex, fear, anxiety, the appetite for salt, and food aversion.  The course also considered the neurochemical control of responses with an eye towards evaluating the development of drug treatments for: obesity, anorexia/cachexia, vomiting, sexual dysfunction, anxiety disorders, and depression.\r\nOverall students were disappointed with this course. The readings were hard to understand and the course material was strongly biology-based. However, one student reported that the class was both “interesting” and “challenging.”\r\nStudents were generally displeased with Professor Grill. While they complimented his intelligence, they criticized his ability to properly communicate material and his lack of availability for students. However, a vast majority of students heaped praise on their TA. \r\nThis course is not recommended to non-majors. In fact, many students wished that there had been a prerequisite of Biology or Brain and Behavior because the course was so challenging without that biology background.\r\n", "num_students": 89, "path": "/courses/25031/sections/401/reviews/1021-HARVEY-J-GRILL", "instructor": {"path": "/instructors/1021-HARVEY-J-GRILL", "first_name": "HARVEY J", "last_name": "GRILL", "id": "1021-HARVEY-J-GRILL", "name": "HARVEY J GRILL"}, "num_reviewers": 74, "id": "25031-401-1021-HARVEY-J-GRILL"}]