[{"ratings": {"rAmountLearned": "2.91", "rDifficulty": "1.76", "rStimulateInterest": "3.56", "rRecommendMajor": "3.57", "rCourseQuality": "3.22", "rWorkRequired": "2.22", "rInstructorAccess": "3.35", "rReadingsValue": "2.17", "rRecommendNonMajor": "3.11", "rCommAbility": "3.17", "rInstructorQuality": "3.41"}, "section": {"name": "PRINCIPLES OF ADVERTISNG", "sectionnum": "002", "primary_alias": "MKTG-235-002", "path": "/courses/23443/sections/002", "id": "23443-002", "aliases": ["MKTG-235-002"]}, "comments": "The objectives of this course are to learn about evidence-based principles for developing and evaluating persuasive advertising campaigns. The course focuses on marketing management's use of advertising as a promotional variable, and advertising via all media - print, video, TV, Internet, etc. The course will concentrate on concepts and theories of advertising as they apply to the strategic decisions of an advertising or brand manager. Emphasis will be placed on product positioning, the communication process, and the measurement and evaluation of advertising effects. Further emphasis is placed on understanding the communication process and consumer behavior (psychology), the measurement and evaluation of advertising effects, and developing appropriate media plans. Students will work in groups to create their own campaign for a brand of their choice. MKTG 101 is a prerequisite. Students should not take both MKTG235 (full semester version) and MKTG224 (mini course version), since credit will not be given for both courses.\r\n\r\nStudents overall felt they learned a lot from this course. One student stated, “This has been my overall favorite Wharton class!” and another called it the “best marketing class I’ve taken.” Students agreed that they would recommend this course to Wharton and non-Wharton students alike, as the subject matter is interesting and fun. Students further agreed, however, that the course was often confusing because the lectures lacked organization. Students were overall enthusiastic about the course content, calling it “fun”. \r\n\r\nStudents overwhelmingly endorsed Professor Adams as an engaging, enthusiastic, and inspiring professor. Many students agreed that he is among the best lecturers and instructors they have had at Penn. One student commented that Professor Adams has a way of “really connecting with students”. Another student stated, “Professor Adams makes you want to learn.” Students agreed that Professor Adams is “phenomenal,” “passionate,” and “very animated,” and that his energy was “contagious”. However, students also agreed that he was “very disorganized,” and students found the “lack of structure in the class” to cause difficulty in studying. \r\n\r\nDue to the disorganization of the class, some students commented that they had “absolutely no idea” what grade they would receive. Students commented that reading for class was sometimes excessive and work expectations were “not realistic.” Students found the course challenging, in part due to the fast pace of the lectures. However, students were overall pleased with the course and felt that they had gained very much from Professor Adams, despite the amount of work. \r\n", "num_students": 59, "path": "/courses/23443/sections/002/reviews/829-ANTHONY-ADAMS", "instructor": {"path": "/instructors/829-ANTHONY-ADAMS", "first_name": "ANTHONY", "last_name": "ADAMS", "id": "829-ANTHONY-ADAMS", "name": "ANTHONY ADAMS"}, "num_reviewers": 59, "id": "23443-002-829-ANTHONY-ADAMS"}]