{"coursehistories": {"path": "/coursehistories/4654"}, "description": "In American society, power is distributed among diverse leaders in government, business, nonprofit organizations, and other sectors. Leadership is a radical concept that arose in modern democratic societies. Students in this course explore the concept's historical significance and popular usages; assess competing \"leadership theories,\" empirical as well as normative; examine assorted claims about leadership \"best practices\" in different U.S. sectors (government, business, nonprofit); and complete various leadership \"self-assessment\" and group exercises. \n\n", "semester": "2009C", "name": "Power in American Society: Leadership & Democracy", "reviews": {"path": "/courses/17950/reviews", "values": [{"ratings": {"rAmountLearned": "3.43", "rDifficulty": "2.27", "rStimulateInterest": "3.76", "rRecommendMajor": "3.62", "rCourseQuality": "3.41", "rWorkRequired": "3.02", "rInstructorAccess": "3.64", "rReadingsValue": "3.07", "rRecommendNonMajor": "3.38", "rCommAbility": "3.71", "rInstructorQuality": "3.77"}, "section": {"name": "Power in American Society: Leadership & Democracy", "sectionnum": "601", "primary_alias": "PSCI-132-601", "path": "/courses/17950/sections/601", "id": "17950-601", "aliases": ["PSCI-132-601"]}, "comments": "While this course evaluates how power is distributed among diverse leaders in government, business, nonprofit organizations, and other sectors, it also focuses on leadership on a personal level and encourages students to assess their own leadership skills in self-assessment tests. Students assess the concept of leadership’s historical significance and popular usages; assess competing \"leadership theories,\" empirical as well as normative; examine assorted claims about leadership \"best practices\" in different U.S. sectors (government, business, nonprofit). \r\n\r\nStudents really enjoyed this class as they found the lectures and readings to be “captivating” and “engaging”. Students really liked that the class forced “introspection,” claiming that they learned a lot about themselves. Many students claimed it was the best class they had every taken. One student explained, “while you may not learn ‘real world skills,’ I learned some far more valuable things about myself.”\r\n\r\nMost students were very impressed that Professor DiIulio made time for his students outside of class and found it useful to have him as a recitation instructor. One student said, “Dr. DiIulio was able to spark interest in subjects that would otherwise seem somewhat boring,” and another declared, “Unlike most famous or brilliant professors, he actually cares for his students, and will make the effort to ensure you get the most out of the course.”\r\n\r\nThere are no prerequisites for this class, and it is recommended for both majors and non-majors. Some found the workload to be challenging in terms of length of reading and writing assignments required, but overall, students really enjoyed the class. \r\n", "num_students": 54, "path": "/courses/17950/sections/601/reviews/994-JOHN-J--DIIULIO", "instructor": {"path": "/instructors/994-JOHN-J--DIIULIO", "first_name": "JOHN J.", "last_name": "DIIULIO", "id": "994-JOHN-J--DIIULIO", "name": "JOHN J. DIIULIO"}, "num_reviewers": 45, "id": "17950-601-994-JOHN-J--DIIULIO"}]}, "credits": null, "primary_alias": "PSCI-132", "path": "/courses/17950", "sections": {"path": "/courses/17950/sections", "values": [{"name": "Power in American Society: Leadership & Democracy", "sectionnum": "601", "primary_alias": "PSCI-132-601", "path": "/courses/17950/sections/601", "id": "17950-601", "aliases": ["PSCI-132-601"]}]}, "id": 17950, "aliases": ["PSCI-132"]}