{"coursehistories": {"path": "/coursehistories/2559"}, "description": "The course emphasizes a systems engineering approach to project management including the cycle costing and analysis, project scheduling, project organization and control, contract management, project monitoring and negotiations. In addition, the coure will also examine management issues in large infrastructure projects like non-recourse or limited recourse project financing. Examples from the logistics planning process and global software project management will be used to highlight the course topics. \n\n", "semester": "2009C", "name": "PROJECT MANAGEMENT", "reviews": {"path": "/courses/17320/reviews", "values": [{"ratings": {"rAmountLearned": "1.76", "rDifficulty": "1.77", "rStimulateInterest": "1.76", "rRecommendMajor": "2.02", "rCourseQuality": "1.87", "rWorkRequired": "2.43", "rInstructorAccess": "2.54", "rReadingsValue": "1.96", "rRecommendNonMajor": "1.63", "rCommAbility": "2.19", "rInstructorQuality": "2.31"}, "section": {"name": "PROJECT MANAGEMENT", "sectionnum": "401", "primary_alias": "ESE-444-401", "path": "/courses/17320/sections/401", "id": "17320-401", "aliases": ["ESE-444-401", "ESE-544-401"]}, "comments": "The course emphasizes a systems engineering approach to project management including cycle costing and analysis, project scheduling, project organization and control, contract management, project monitoring and negotiations. In addition, the course also examines management issues in large infrastructure projects like nonrecourse or limited recourse project financing.\r\n\r\nMost students felt that the course was lacking in content and what it did have was boring. Some students felt that they could have easily learned all of the content from reading a textbook instead of taking the course. Students did enjoy the appearance of guest lecturers.\r\n\r\nStudents felt that Professor Pourdehnad held unstructured lectures and “unclear and ambiguous assignments.” Impressions of the workload for the course were mixed. Some felt that the there was far too much work, while others felt it was an easy course with little gained. They were also disappointed with the feedback given for graded material. Students noted that the course was not “very relevant” for more tech oriented students. Some students felt that the course was suitable for Systems engineers. \r\n", "num_students": 70, "path": "/courses/17320/sections/401/reviews/2369-JAHANGIR-POURDEHNAD", "instructor": {"path": "/instructors/2369-JAHANGIR-POURDEHNAD", "first_name": "JAHANGIR", "last_name": "POURDEHNAD", "id": "2369-JAHANGIR-POURDEHNAD", "name": "JAHANGIR POURDEHNAD"}, "num_reviewers": 61, "id": "17320-401-2369-JAHANGIR-POURDEHNAD"}]}, "credits": null, "primary_alias": "ESE-444", "path": "/courses/17320", "sections": {"path": "/courses/17320/sections", "values": [{"name": "PROJECT MANAGEMENT", "sectionnum": "401", "primary_alias": "ESE-444-401", "path": "/courses/17320/sections/401", "id": "17320-401", "aliases": ["ESE-444-401", "ESE-544-401"]}]}, "id": 17320, "aliases": ["ESE-444", "ESE-544"]}