[{"ratings": {"rAmountLearned": "2.57", "rDifficulty": "2.40", "rStimulateInterest": "2.62", "rRecommendMajor": "3.19", "rCourseQuality": "2.53", "rWorkRequired": "2.47", "rInstructorAccess": "3.14", "rReadingsValue": "2.62", "rRecommendNonMajor": "1.74", "rCommAbility": "2.79", "rInstructorQuality": "2.96"}, "section": {"name": "STRUCTURAL BIOMATERIALS", "sectionnum": "001", "primary_alias": "MSE-220-001", "path": "/courses/19008/sections/001", "id": "19008-001", "aliases": ["MSE-220-001"]}, "comments": "MSE 220 is focused primarily on the connection of nanoscale structure of solids to their macroscopic mechanical properties through the introduction of a number of topics throughout the semester. Important topics include corrosion, material structures, phase diagrams, polymers, composites, and metal fatigue. Structural Materials is required for the course and tutorials available on CD and CETS computers provide preparation for class discussions.\r\n\r\nStudents found the content of the course to enjoyable and very interesting. Many noted that they “learned a lot” and one called it “one of my favorite after four years at Penn.” Quizzes were given at the beginning of every class, and for the most part, students praised this system for making them keep up with the material.\r\n\r\nOn the whole, students greatly enjoyed Professor Winey. Students found that she did a great job stimulating their interest and encouraging their success in the course. Some used words like “enthusiastic” and “magnificent” to describe her teaching abilities. The course was taught in a question-and-answer format much like a recitation, but students had mixed opinions on the system. Some said that it taught them the concepts well, but others explained that it was “poorly structured” and wished it were taught more like a lecture.\r\n\r\nKnowledge of chemistry (CHEM 101 or equivalent) and basic calculus is required to take this course. Students reported that the course required “a lot of work” and most of the course was self-taught.", "num_students": 55, "path": "/courses/19008/sections/001/reviews/842-KAREN-I--WINEY", "instructor": {"path": "/instructors/842-KAREN-I--WINEY", "first_name": "KAREN I.", "last_name": "WINEY", "id": "842-KAREN-I--WINEY", "name": "KAREN I. WINEY"}, "num_reviewers": 53, "id": "19008-001-842-KAREN-I--WINEY"}]