[{"ratings": {"rAmountLearned": "2.90", "rDifficulty": "3.00", "rStimulateInterest": "2.65", "rRecommendMajor": "3.50", "rCourseQuality": "2.62", "rWorkRequired": "3.75", "rInstructorAccess": "2.70", "rReadingsValue": "1.89", "rRecommendNonMajor": "0.30", "rCommAbility": "2.55", "rInstructorQuality": "2.86"}, "section": {"name": "LABORATORY", "sectionnum": "101", "primary_alias": "CBE-410-101", "path": "/courses/24097/sections/101", "id": "24097-101", "aliases": ["CBE-410-101"]}, "comments": "This course works with experimental studies in heat and mass transfer,\r\nseparations and chemical reactors to verify theoretical concepts and learn laboratory\r\ntechniques, as well as methods for analyzing and presenting data. Lastly, the course\r\nrequires students to report preparation and the presentation of an oral technical report.\r\nEven though this was mostly a laboratory class, equipment was in “very poor\r\ncondition,” to such a degree that “students often spend more time fixing the setups that\r\nactually obtaining and analyzing data.” One respondent pointed out that this may have\r\nbeen intentional to “gauge how well [students] adapt to problems as they arise,” but\r\nfailed to achieve even this objective, as the problems were associated with “basic\r\ninstruments.” The lab manual was also outdated and unhelpful.\r\nOne student praised the two TAs for being a “great benefit to the course” and\r\nmaking the “laboratory run smoothly.”\r\nAnother student thought that 8 hours of class time a week was too much, and that\r\n6 hours instead “would not likely change the quality of the students’ analysis or papers,\r\nbut would make the lab sessions significantly less trying.”\r\n*This course review was written based on the 8 student comments received.", "num_students": 24, "path": "/courses/24097/sections/101/reviews/1306-JOHN-C--CROCKER", "instructor": {"path": "/instructors/1306-JOHN-C--CROCKER", "first_name": "JOHN C.", "last_name": "CROCKER", "id": "1306-JOHN-C--CROCKER", "name": "JOHN C. CROCKER"}, "num_reviewers": 21, "id": "24097-101-1306-JOHN-C--CROCKER"}, {"ratings": {"rAmountLearned": "2.25", "rDifficulty": "2.94", "rStimulateInterest": "2.44", "rRecommendMajor": "3.06", "rCourseQuality": "2.23", "rWorkRequired": "3.81", "rInstructorAccess": "2.56", "rReadingsValue": "1.67", "rRecommendNonMajor": "0.75", "rCommAbility": "2.56", "rInstructorQuality": "2.55"}, "section": {"name": "LABORATORY", "sectionnum": "102", "primary_alias": "CBE-410-102", "path": "/courses/24097/sections/102", "id": "24097-102", "aliases": ["CBE-410-102"]}, "comments": "This course includes experimental studies in heat and mass transfer, separations\r\nand chemical reactors to verify theoretical concepts and learn laboratory techniques.\r\nMethods for analyzing and presenting data. Report preparation and the presentation of an\r\noral technical report.\r\nStudents complained about the bad quality of the lab equipment. One student\r\ncommented that the faulty equipment was a “significant detriment to the amount that [he]\r\nlearned.” Generally, students reflected that more time was spent on fixing equipment than\r\nactually collecting reliable data. However, they appreciated the problem solving and\r\ntroubleshooting skills gained from the lab.\r\nOverall, students felt that Professor Holleran was able to tie together previous\r\nCBE concepts with lab material. Many students commented that reports should be graded\r\nmore quickly to gain some feedback for the course.\r\nThe course load for this class was quite heavy. In addition to the long hours inside\r\nthe lab, a lot of time was needed to finish lab reports. This class is recommended to\r\nChemical and Biomolecular Engineering majors only.", "num_students": 24, "path": "/courses/24097/sections/102/reviews/3908-SEAN-HOLLERAN", "instructor": {"path": "/instructors/3908-SEAN-HOLLERAN", "first_name": "SEAN", "last_name": "HOLLERAN", "id": "3908-SEAN-HOLLERAN", "name": "SEAN HOLLERAN"}, "num_reviewers": 23, "id": "24097-102-3908-SEAN-HOLLERAN"}]