{"coursehistories": {"path": "/coursehistories/526"}, "description": "The oceans cover over 2/3 of the Earth's surface. This course introduces basic oceanographic concepts such as plate tectonics, marine sediments, physical and chemical properties of seawater, ocean circulation, air-sea interactions, waves, tides, nutrient cycles in the ocean, biology of the oceans, and environmental issues related to the marine environment. \n\n", "semester": "2012A", "name": "OCEANOGRAPHY: Oceanography: Oceans & Climate", "reviews": {"path": "/courses/27485/reviews", "values": [{"ratings": {"rAmountLearned": "2.17", "rDifficulty": "2.45", "rStimulateInterest": "2.03", "rRecommendMajor": "2.78", "rCourseQuality": "2.08", "rWorkRequired": "2.34", "rInstructorAccess": "2.04", "rReadingsValue": "1.90", "rRecommendNonMajor": "1.94", "rCommAbility": "2.49", "rInstructorQuality": "2.36"}, "section": {"name": "OCEANOGRAPHY: Oceanography: Oceans & Climate", "sectionnum": "001", "primary_alias": "GEOL-130-001", "path": "/courses/27485/sections/001", "id": "27485-001", "aliases": ["GEOL-130-001"]}, "comments": "This course introduces basic oceanographic concepts such as plate tectonics, marine sediments, physical and chemical properties of seawater, ocean circulation, air-sea interactions, waves, tides, nutrient cycles in the ocean, biology of the oceans and environmental issues related to the marine environment.\r\n\r\nThe course was very relevant to current events (i.e. climate change) and allowed students to gain a better understanding of the physical world. Students thought that the course did a good job of contextualizing the material. However, one student thought the course focused too much on climate change, and they would have preferred more of a focus on marine life. One student noted that the material at first was interesting, but then it seemed to drag on.\r\n\r\nOne student expressed that “Professor Horton is an expert in his field, and his passion for his work and the greater earth science field is unquestionable.” While some thought that Professor Horton was a “truly skilled lecturer,” with great PowerPoint slides, others thought the slides were “hit or miss.” He seldom invited audience interaction, including questions, making the class less useful and harder to stay focused. A large number of students found that Professor Horton was often times uninterested in the material and arrogant. Finally, one student wrote that “Professor Horton took himself and his class way too seriously.”\r\n\r\nThis course fulfills the Physical World sector.  The homework assigned in the class was quite fairly graded, and it was adequate to reinforce the material.  However, one student commented that the midterm's grading seemed arbitrary.   In addition, students thought the tests were overly specific and the class required constant studying. Since there were only 2 exams (a midterm and final), students thought they had to memorize too much material for each exam and would've preferred 3 exams. ", "num_students": 198, "path": "/courses/27485/sections/001/reviews/2987-BENJAMIN-P--HORTON", "instructor": {"path": "/instructors/2987-BENJAMIN-P--HORTON", "first_name": "BENJAMIN P.", "last_name": "HORTON", "id": "2987-BENJAMIN-P--HORTON", "name": "BENJAMIN P. HORTON"}, "num_reviewers": 189, "id": "27485-001-2987-BENJAMIN-P--HORTON"}]}, "credits": null, "primary_alias": "GEOL-130", "path": "/courses/27485", "sections": {"path": "/courses/27485/sections", "values": [{"name": "OCEANOGRAPHY: Oceanography: Oceans & Climate", "sectionnum": "001", "primary_alias": "GEOL-130-001", "path": "/courses/27485/sections/001", "id": "27485-001", "aliases": ["GEOL-130-001"]}]}, "id": 27485, "aliases": ["GEOL-130"]}