[{"ratings": {"rAmountLearned": "2.56", "rDifficulty": "2.75", "rStimulateInterest": "1.91", "rRecommendMajor": "2.75", "rCourseQuality": "2.16", "rWorkRequired": "2.53", "rInstructorAccess": "2.88", "rReadingsValue": "2.09", "rRecommendNonMajor": "1.53", "rCommAbility": "2.19", "rInstructorQuality": "2.26"}, "section": {"name": "DSG PRINCIPLE INFO SYST", "sectionnum": "001", "primary_alias": "CIS-330-001", "path": "/courses/27158/sections/001", "id": "27158-001", "aliases": ["CIS-330-001"]}, "comments": "Introduction to database management systems and principles of design.  The course covers the Entity-Relationship model as a modeling tool; the relational model: formal languages, the industry standard SQL, relational design theory, query optimization;  storing and querying XML data; recursive queries, views and data integration; overview of system level issues: physical data organization, indexing techniques, and transactions; and connecting databases to the Web.  Course work requires programming in several different query languages, several written homeworks and a team project.\r\n\r\nStudents found this class \"an interesting course that introduced them to topics in data management without going too in-depth.\" Students commented that the course did a good job on \"separating the theoretical and programming material.\" But some students came in expecting to learn certain topics; one student commented that \"Mongo DB, Ruby on Rails, and others were barely touched on if at all.\"\r\n\r\nStudents had generally no negative feelings towards Prof. Davidson. Many students felt that Prof. Davidson could adequately comment on course material as well as expand beyond the course.\r\n\r\n Overall, students felt that they learned a lot of interesting topics. There are four homework assignments, a midterm, a final, and a project.  Prerequisites for this course include CIS 121 and CIS 160.\r\n", "num_students": 48, "path": "/courses/27158/sections/001/reviews/1324-SUSAN-B-DAVIDSON", "instructor": {"path": "/instructors/1324-SUSAN-B-DAVIDSON", "first_name": "SUSAN B", "last_name": "DAVIDSON", "id": "1324-SUSAN-B-DAVIDSON", "name": "SUSAN B DAVIDSON"}, "num_reviewers": 40, "id": "27158-001-1324-SUSAN-B-DAVIDSON"}]