[{"ratings": {"rAmountLearned": "3.09", "rDifficulty": "2.79", "rStimulateInterest": "3.38", "rRecommendMajor": "3.60", "rCourseQuality": "3.20", "rWorkRequired": "3.18", "rInstructorAccess": "3.16", "rReadingsValue": "2.88", "rRecommendNonMajor": "2.98", "rCommAbility": "3.56", "rInstructorQuality": "3.48"}, "section": {"name": "THE AMERICAN SOUTH", "sectionnum": "401", "primary_alias": "HIST-170-401", "path": "/courses/23218/sections/401", "id": "23218-401", "aliases": ["HIST-170-401", "AFRC-172-401"]}, "comments": "This course focuses on Southern culture and history from 1607-1860, from Jamestown to secession. It traces the rise of slavery and plantation society, the growth of Southern sectionalism and its explosion into Civil War. A midterm, short paper (5-7 pages) and final are required.&#8232;&#8232;\r\n\r\nStudents really enjoyed the material of the course, describing it as “well-rounded.” Some students felt that the class emphasized the subject of slavery too much, and others felt that the quality of the material decreased as the course progressed. Other students felt upset about the “political bias” they perceived in the class. However, several students described the class as “the best class I have ever taken at Penn.”&#8232;&#8232;\r\n\r\nStudents really enjoyed Professor McCurry, calling her “extremely knowledgeable,” “very accessible,” and a “great lecturer.” Some students criticized her PowerPoint slides but enjoyed her “lucid and stimulating…arguments.” One student commended Professor McCurry’s ability to “make history come alive in her exciting lectures” and recommended that, “everyone should take a course with Professor McCurry before leaving Penn.” Other students described her as “amazing” and “magnificent” and applauded her knowledge of and passion for the subject matter, mentioning, “she is the most respected historian on this topic.”&#8232;\r\n\r\nSome students felt that the workload was too heavy for an introductory course, such as long reading assignments. Students also emphasized the fact that this course does require a certain amount of effort—it is “a lot of work” and is not “an easy A.” Other students expressed anger about what they perceived as an “A’s only for brilliance policy,” especially for an intro course. Students also emphasized that excellent critical writing was essential to succeed in this course.\r\n", "num_students": 98, "path": "/courses/23218/sections/401/reviews/2177-STEPHANIE-MCCURRY", "instructor": {"path": "/instructors/2177-STEPHANIE-MCCURRY", "first_name": "STEPHANIE", "last_name": "MCCURRY", "id": "2177-STEPHANIE-MCCURRY", "name": "STEPHANIE MCCURRY"}, "num_reviewers": 95, "id": "23218-401-2177-STEPHANIE-MCCURRY"}]