[{"ratings": {"rAmountLearned": "3.14", "rDifficulty": "2.32", "rStimulateInterest": "3.82", "rRecommendMajor": "3.78", "rCourseQuality": "3.40", "rWorkRequired": "2.45", "rInstructorAccess": "3.75", "rReadingsValue": "2.75", "rRecommendNonMajor": "3.37", "rCommAbility": "3.90", "rInstructorQuality": "3.83"}, "section": {"name": "SCIENCE TECHNOLGY & WAR", "sectionnum": "601", "primary_alias": "STSC-212-601", "path": "/courses/18133/sections/601", "id": "18133-601", "aliases": ["STSC-212-601", "HSOC-212-601"]}, "comments": "This course explores the relationship between technical knowledge and war from 1600 to the present. It emphasizes war in the 19th and 20th centuries, and the rise of “total war.” Topics include changing interpretations of the machine gun as inhumane or acceptable; the cult of the battleship; banned weaponry; submarines and masculinity; industrialized war and total war; trench warfare and mental breakdown; the atomic bomb and Cold War; chemical warfare in Vietnam; and \"television war\" in the 1990s. Readings include both primary and secondary sources. &#8232;&#8232;\r\nStudents said that this course was “informative” and “well-organized.” One student even said it was the “best class I’ve ever taken.” Another student enjoyed the course, but wished that it included more in-depth criticism of the material.&#8232;\r\n&#8232;Students had immense praise for Professor Hersch, saying that he is “knowledgeable,” “interesting,” and “very engaging.” Most of them raved about his enthusiasm and ability to stimulate student interest in the material, and thoroughly enjoyed listening to his lectures.&#8232;\r\n&#8232;This is an LPS course, and fulfills the Humanities and Social Science Sector. Students reported that Professor Hersch was “fair,” but many warn that there is a lot of assigned readings, as well as a significant number of assigned papers. However, most students commended Professor Hersch’s willingness to help with assignments. This course is recommended to majors and non-majors alike who are interested in learning more about American war history. \r\n", "num_students": 58, "path": "/courses/18133/sections/601/reviews/4581-MATTHEW-H--HERSCH", "instructor": {"path": "/instructors/4581-MATTHEW-H--HERSCH", "first_name": "MATTHEW H.", "last_name": "HERSCH", "id": "4581-MATTHEW-H--HERSCH", "name": "MATTHEW H. HERSCH"}, "num_reviewers": 54, "id": "18133-601-4581-MATTHEW-H--HERSCH"}]