[{"ratings": {"rAmountLearned": "2.65", "rDifficulty": "1.91", "rStimulateInterest": "2.30", "rRecommendMajor": "3.00", "rCourseQuality": "2.57", "rWorkRequired": "2.35", "rInstructorAccess": "2.70", "rReadingsValue": "3.00", "rRecommendNonMajor": "2.65", "rCommAbility": "2.61", "rInstructorQuality": "2.61"}, "section": {"name": "MADNESS & MADMEN", "sectionnum": "401", "primary_alias": "RUSS-197-401", "path": "/courses/28115/sections/401", "id": "28115-401", "aliases": ["RUSS-197-401", "COML-197-401"]}, "comments": "This course explores the theme of madness in Russian literature and arts from the medieval period through the October Revolution of 1917. The discussion will include formative masterpieces by Russian writers (Pushkin, Dostoevsky, Tolstoy, Chekhov, and Bulgakov), painters (Repin, Vrubel, Filonov), composers (Mussorgsky, Tchaikovsky, and Stravinsky), and film- directors (Protazanov, Eisenstein), as well as non-fictional documents such as Russian medical, judicial, political, and philosophical treatises and essays on madness.\r\n\r\nStudents reviewed this course enthusiastically.  Many students commended the “course structure” as well as the “deliberate choice of content.”  Students generally appreciated the format of the course, which was “participatory and informative.”  Some students preferred the work done individually to the time spent in class, while others found the discussions the more meaningful element of the course.\r\n\r\nParticipants found Professor Thorstensson “quite knowledgeable” and “eagerly engaged by her subject matter.”  Students found her “encouraging in class” and “approachable outside the classroom.”  She was occasionally described as “inconsistent” and “disorganized.” A few students expressed frustration at Professor Thorstensson’s “lack of a commanding presence,” but this was generally outweighed by her enthusiasm and ability as a professor.\r\n\r\nMost students found the workload of this course “fair,” but expressed some discontent with the memorization required for assessments.  Students were quite enthusiastic about the readings, describing them as “worthwhile.” One student noted that Professor Thorstensson “altered the syllabus too often during the semester.”  Both majors and non-majors alike noted their overall satisfaction with the course.", "num_students": 29, "path": "/courses/28115/sections/401/reviews/5527-VICTORIA-THORSTENSSON", "instructor": {"path": "/instructors/5527-VICTORIA-THORSTENSSON", "first_name": "VICTORIA", "last_name": "THORSTENSSON", "id": "5527-VICTORIA-THORSTENSSON", "name": "VICTORIA THORSTENSSON"}, "num_reviewers": 24, "id": "28115-401-5527-VICTORIA-THORSTENSSON"}]