{"coursehistories": {"path": "/coursehistories/3837"}, "description": "How do minds work? This course surveys a wide range of answers to this question from disciplines ranging from philosophy to neuroscience. The course devotes special attention to the use of simple computational and mathematical models. Topics include perception, learning, memory, decision making, emotion and consciousness. \n\n", "semester": "2009C", "name": "INTRO COGNITIVE SCIENCE", "reviews": {"path": "/courses/17125/reviews", "values": [{"ratings": {"rAmountLearned": "2.72", "rDifficulty": "2.60", "rStimulateInterest": "2.66", "rRecommendMajor": "3.38", "rCourseQuality": "2.84", "rWorkRequired": "2.65", "rInstructorAccess": "3.04", "rReadingsValue": "2.35", "rRecommendNonMajor": "2.43", "rCommAbility": "3.00", "rInstructorQuality": "3.06"}, "section": {"name": "INTRO COGNITIVE SCIENCE", "sectionnum": "401", "primary_alias": "CIS-140-401", "path": "/courses/17125/sections/401", "id": "17125-401", "aliases": ["CIS-140-401", "COGS-001-401", "LING-105-401", "PSYC-107-401", "PHIL-044-401", "PPE-140-401"]}, "comments": "The course introduces students to the problems and characteristic concepts of cognitive science, drawing on formal and empirical approaches from the disciplines of computer science, linguistics, neuroscience, philosophy, and psychology. Topics covered include perception, action, learning, language, knowledge representation, and inference. This course fulfills the “formal reasoning and analysis” requirement.\r\n\r\nStudents generally found the course to be “interesting” with the broad range of topics covered in different perspectives. However, they indicated the co-teaching from both professors caused the course to lack coherence. Some students called for the need of central text and more focus on key ideas. Despite its lack of clarity, one student commented that the review sessions helped organize and place the topics into context.\r\n\r\nProfessor Brainard was praised as “engaging” and “easy to listen to.” However, students pointed out that sometimes his slides have no writing, which could be confusing for materials not covered in class. \r\n\r\nReadings could be time consuming. Prerequisites include an introductory course in computer science, linguistics, neuroscience, philosophy, or PSYC 001. It is a requirement for major and minor in cognitive science and recommended for students pursuing a dual degree in computer and cognitive science. It is also recommended for non-majors who want to learn about an unfamiliar topic. \r\n", "num_students": 137, "path": "/courses/17125/sections/401/reviews/1282-DAVID-HOYT-BRAINARD", "instructor": {"path": "/instructors/1282-DAVID-HOYT-BRAINARD", "first_name": "DAVID HOYT", "last_name": "BRAINARD", "id": "1282-DAVID-HOYT-BRAINARD", "name": "DAVID HOYT BRAINARD"}, "num_reviewers": 126, "id": "17125-401-1282-DAVID-HOYT-BRAINARD"}, {"ratings": {"rAmountLearned": "2.72", "rDifficulty": "2.60", "rStimulateInterest": "3.06", "rRecommendMajor": "3.38", "rCourseQuality": "2.84", "rWorkRequired": "2.65", "rInstructorAccess": "3.02", "rReadingsValue": "2.35", "rRecommendNonMajor": "2.43", "rCommAbility": "3.03", "rInstructorQuality": "3.08"}, "section": {"name": "INTRO COGNITIVE SCIENCE", "sectionnum": "401", "primary_alias": "CIS-140-401", "path": "/courses/17125/sections/401", "id": "17125-401", "aliases": ["CIS-140-401", "COGS-001-401", "LING-105-401", "PSYC-107-401", "PHIL-044-401", "PPE-140-401"]}, "comments": "This course surveys a wide range of answers to this question from disciplines ranging from philosophy to neuroscience. The course devotes special attention to the use of simple computational and mathematical models. Topics include perception, learning, memory, decision making, emotion and consciousness.\r\n\r\nThis interdisciplinary course covers a \"broad spectrum of topics,\" and is considered thought-provoking and interesting. The class reportedly covered many concepts with an “appropriate level of detail” and was considered a great introduction to cognitive science. Students found this class somewhat disorganized and scattered, with no textbook and multiple professors and TAs. The course lacked \"synthesis\" and \"cohesiveness.\"\r\n\r\nProfessor Ungar is \"very good at explaining things,\" but sometimes \"speaks at lengths about one topic for too long.\" The class sometimes lost direction when one of the two professors accepted questions from the class, then went off on various tangents. Students did appreciate the high level of class involvement, which took place primarily in the form of experiments and class polls.\r\n\r\nHomework \"rarely involved reasoning of the concepts covered in class.\" Some students found the required readings irrelevant and unimportant to the content and flow of the course. Additionally, students occasionally had trouble with the math involved in the curriculum. \r\n", "num_students": 137, "path": "/courses/17125/sections/401/reviews/2085-LYLE-H-UNGAR", "instructor": {"path": "/instructors/2085-LYLE-H-UNGAR", "first_name": "LYLE H", "last_name": "UNGAR", "id": "2085-LYLE-H-UNGAR", "name": "LYLE H UNGAR"}, "num_reviewers": 126, "id": "17125-401-2085-LYLE-H-UNGAR"}]}, "credits": null, "primary_alias": "CIS-140", "path": "/courses/17125", "sections": {"path": "/courses/17125/sections", "values": [{"name": "INTRO COGNITIVE SCIENCE", "sectionnum": "401", "primary_alias": "CIS-140-401", "path": "/courses/17125/sections/401", "id": "17125-401", "aliases": ["CIS-140-401", "COGS-001-401", "LING-105-401", "PSYC-107-401", "PHIL-044-401", "PPE-140-401"]}]}, "id": 17125, "aliases": ["CIS-140", "COGS-001", "LING-105", "PSYC-107", "PHIL-044", "PPE-140"]}