{"coursehistories": {"path": "/coursehistories/700"}, "description": "This course allows Penn students to teach a series of hands-on activities to students in math classes at University City High School. The semester starts with an introduction to successful approaches for teaching math in urban high schools. The rest of the semester will be devoted to a series of weekly hands-on activities designed to teach fundamental aspects of geometry. The first class meeting of each week, Penn faculty teach Penn students the relevant mathematical background and techniques for a hands-on activity. During the second session of each week, Penn students will teach the hands-on activity to a small group of UCHS students. The Penn students will also have an opportunity to develop their own activity and to implement it with the UCHS students. \n\n", "semester": "2012A", "name": "COMMUNITY MATH TEACH PRO", "reviews": {"path": "/courses/27704/reviews", "values": [{"ratings": {"rAmountLearned": "1.57", "rDifficulty": "1.24", "rStimulateInterest": "1.95", "rRecommendMajor": "1.90", "rCourseQuality": "1.72", "rWorkRequired": "1.76", "rInstructorAccess": "2.43", "rReadingsValue": "1.86", "rRecommendNonMajor": "2.33", "rCommAbility": "2.38", "rInstructorQuality": "2.12"}, "section": {"name": "COMMUNITY MATH TEACH PRO", "sectionnum": "001", "primary_alias": "MATH-123-001", "path": "/courses/27704/sections/001", "id": "27704-001", "aliases": ["MATH-123-001"]}, "comments": "\tThis course allows Penn students to teach a series of hands-on activities to students in math classes at University City High School. The semester starts with an introduction to successful approaches for teaching math in urban high schools. The rest of the semester will be devoted to a series of weekly hands-on activities designed to teach fundamental aspects of geometry. During the first class meeting of each week, Penn faculty teach Penn students the relevant mathematical background and techniques for a hands-on activity. During the second session of each week, Penn students will teach the hands-on activity to a small group of UCHS students. The Penn students will also have an opportunity to develop their own activity and to implement it with the UCHS students.\r\n\r\n\tWhile students felt that this was a very important class for Penn to offer, many felt it was poorly organized and not the best use of time.  Students agreed that the course “needs some adjustment” especially since “class time was not used effectively.” On the other hand, students found the time spent at local high schools very rewarding, albeit still disorganized.  One student commented, “I had a great time with the students at the high school.  I loved engaging them and working with them weekly.”  That same student noted, though, that they did not meet with the students an adequate number of times.\r\n\r\n\tStudents did not feel that Professor Stovall was a very useful or involved professor.  Students noted, “The teacher barely showed up or taught.”  Additionally, students described Professor Stovall as “not effectively using Penn’s resources in the schools.”  All in all, students felt that “Dr. Stovall means well and has good intentions,” but the class needs to be “more coordinated.”\r\n\r\n\tStudents felt this course would be extremely easy for anyone at Penn.  One student stated, “If you are looking for an easy class to just go by, you should take it.   But this is not a class that will cover issues of education.”  This is an Academically Based Community Service course.  ", "num_students": 29, "path": "/courses/27704/sections/001/reviews/1556-IDRIS-STOVALL", "instructor": {"path": "/instructors/1556-IDRIS-STOVALL", "first_name": "IDRIS", "last_name": "STOVALL", "id": "1556-IDRIS-STOVALL", "name": "IDRIS STOVALL"}, "num_reviewers": 26, "id": "27704-001-1556-IDRIS-STOVALL"}]}, "credits": null, "primary_alias": "MATH-123", "path": "/courses/27704", "sections": {"path": "/courses/27704/sections", "values": [{"name": "COMMUNITY MATH TEACH PRO", "sectionnum": "001", "primary_alias": "MATH-123-001", "path": "/courses/27704/sections/001", "id": "27704-001", "aliases": ["MATH-123-001"]}]}, "id": 27704, "aliases": ["MATH-123"]}