{"coursehistories": {"path": "/coursehistories/442"}, "description": "This course offers a broad and practical introduction to the acquisition, storage, retrieval, maintenance, use, and presentation of digital cartographic data with both image and drawing based geographic information systems (GIS) for a variety of environmental science, planning, and management applications. Its major objectives are to provide the training necessary to make productive use of at least two well known software packages, and to establish the conceptual foundation on which to build further skills and knowledge in late practice. \n\n", "semester": "2011C", "name": "Modeling Geographic Objects", "reviews": {"path": "/courses/24354/reviews", "values": [{"ratings": {"rAmountLearned": "3.56", "rDifficulty": "3.32", "rStimulateInterest": "3.44", "rRecommendMajor": "3.88", "rCourseQuality": "3.56", "rWorkRequired": "3.60", "rInstructorAccess": "3.75", "rReadingsValue": "3.29", "rRecommendNonMajor": "2.72", "rCommAbility": "3.54", "rInstructorQuality": "3.56"}, "section": {"name": "Modeling Geographic Objects", "sectionnum": "660", "primary_alias": "ENVS-541-660", "path": "/courses/24354/sections/660", "id": "24354-660", "aliases": ["ENVS-541-660"]}, "comments": "This course offers a broad and practical introduction to the acquisition, storage,\r\nretrieval, maintenance, use, and presentation of digital cartographic data with both image\r\nand drawing based geographic information systems (GIS) for a variety of environmental\r\nscience, planning, and management applications. Its major objectives are to provide the\r\ntraining necessary to make productive use of at least two well known software packages,\r\nand to establish the conceptual foundation on which to build further skills and knowledge\r\nin late practice.\r\nStudents found this course to be informative and very interesting. No students\r\nreturned negative reviews with some saying it was the best class that they had taken at\r\nPenn.\r\nPeople applauded Dr. Tomblin’s teaching ability and stressed his ability answer\r\nquestions. Students also stressed the importance of TA’s and the importance of utilizing\r\noffice hours. Students felt that they were being engaged and that Dr. Tomblin truly cared\r\nabout their growth of knowledge and success in the course.\r\nThis class was described as difficult, but worth the amount of effort that was put\r\ninto it.", "num_students": 32, "path": "/courses/24354/sections/660/reviews/464-CHARLES-DANA-TOMLIN", "instructor": {"path": "/instructors/464-CHARLES-DANA-TOMLIN", "first_name": "CHARLES DANA", "last_name": "TOMLIN", "id": "464-CHARLES-DANA-TOMLIN", "name": "CHARLES DANA TOMLIN"}, "num_reviewers": 25, "id": "24354-660-464-CHARLES-DANA-TOMLIN"}]}, "credits": null, "primary_alias": "ENVS-541", "path": "/courses/24354", "sections": {"path": "/courses/24354/sections", "values": [{"name": "Modeling Geographic Objects", "sectionnum": "660", "primary_alias": "ENVS-541-660", "path": "/courses/24354/sections/660", "id": "24354-660", "aliases": ["ENVS-541-660"]}]}, "id": 24354, "aliases": ["ENVS-541"]}