{"coursehistories": {"path": "/coursehistories/2771"}, "description": "This course endeavors to explore the myriad uses of public opinion in leadership and decision making. In it, we will examine what public opinion research is, how it is conducted, and how it is subsequently utilized in a wide range of contexts, both public and private. We will use numerous actual case studies involving public opinion in political campaigns, constituency organizing, crisis management, and a variety of other contexts to provide an inside view of how opinion research is actually conducted and used. We will consider such questions as: How does an incumbent politician formulate strategy and successfully communicatemessage in the midst of a dirty his or hermessage in the midst of a dirty politics/decidedly anti-incumbent Senatorial campaign? What would you do if you were Governor and your roads and highways needed improvements, but the public opposed a new gas tax? If you were a CEO of a large company and you had safety concerns about some of your products, how would you balance your corporate image and reputation against the independence from government influence? \n\n", "semester": "2011C", "name": "PUBLC OPN LEADRSHP DECIS", "reviews": {"path": "/courses/24228/reviews", "values": [{"ratings": {"rAmountLearned": "3.44", "rDifficulty": "3.06", "rStimulateInterest": "3.61", "rRecommendMajor": "3.72", "rCourseQuality": "3.37", "rWorkRequired": "3.41", "rInstructorAccess": "2.61", "rReadingsValue": "2.94", "rRecommendNonMajor": "3.17", "rCommAbility": "3.33", "rInstructorQuality": "3.63"}, "section": {"name": "PUBLC OPN LEADRSHP DECIS", "sectionnum": "301", "primary_alias": "COMM-413-301", "path": "/courses/24228/sections/301", "id": "24228-301", "aliases": ["COMM-413-301"]}, "comments": "Communications 413 endeavors to explore the myriad uses of public opinion in leadership and decision-making. Students will examine what public opinion research is, how it is conducted, and how it is subsequently utilized in a wide range of contexts, both public and private. The course use numerous actual case studies involving public opinion in political campaigns, constituency organizing, crisis management, and a variety of other contexts to provide an inside view of how opinion research is actually conducted and used.  \r\n\r\nOverall, students were incredibly pleased with this course, describing it as \"absolutely amazing,\" \"so interesting,\" and \"always intriguing.\" Students reported learning much from the course and felt it offered \"real life skills\" and \"great preparation for the real world.\"\r\n\r\nStudents praised Professor Hart as \"great,\" \"enthusiastic,\" and \"incredibly knowledgeable.\"  Many students reported loving Professor's Hart's lectures. They thought he was great at conveying the course material.\r\n\r\nThis course is for majors only. Some students reported that the course was \"a lot of work,\" but many agreed that Professor Hart assigned \"excellent readings.\" One student pointed out that most of the coursework is assigned for the final weeks of the semester. In addition, the class did a group presentation, which one student described as \"very fun.\"  \r\n", "num_students": 20, "path": "/courses/24228/sections/301/reviews/1817-PETER-D--HART", "instructor": {"path": "/instructors/1817-PETER-D--HART", "first_name": "PETER D.", "last_name": "HART", "id": "1817-PETER-D--HART", "name": "PETER D. HART"}, "num_reviewers": 20, "id": "24228-301-1817-PETER-D--HART"}]}, "credits": null, "primary_alias": "COMM-413", "path": "/courses/24228", "sections": {"path": "/courses/24228/sections", "values": [{"name": "PUBLC OPN LEADRSHP DECIS", "sectionnum": "301", "primary_alias": "COMM-413-301", "path": "/courses/24228/sections/301", "id": "24228-301", "aliases": ["COMM-413-301"]}]}, "id": 24228, "aliases": ["COMM-413"]}