[{"ratings": {"rAmountLearned": "3.41", "rDifficulty": "2.62", "rStimulateInterest": "3.90", "rRecommendMajor": "3.77", "rCourseQuality": "3.53", "rWorkRequired": "2.93", "rInstructorAccess": "3.88", "rReadingsValue": "3.07", "rRecommendNonMajor": "2.57", "rCommAbility": "3.70", "rInstructorQuality": "3.88"}, "section": {"name": "PRINCIPLES I", "sectionnum": "001", "primary_alias": "PHYS-150-001", "path": "/courses/28005/sections/001", "id": "28005-001", "aliases": ["PHYS-150-001"]}, "comments": "This course teaches students about the classical laws of motion; interactions between particles; conservation laws and symmetry principles; particle and rigid body motion; gravitation and harmonic motion. \r\n\r\nStudents enjoyed this course and thought that it provided good practice to solidify their skills. Overall, the course increased their interest in further pursuing physics. Students liked Professor Johnson’s use of interesting demonstrations to drive home concepts learned in class; these demonstrations further helped students understand difficult topics. \r\n\r\nProfessor Johnson is a very enthusiastic professor. He knows how to convey the course material in a way that's relevant, and sometimes funny, to his students. He is always available and extremely willing to help and accommodate students in any way possible. He goes over every concept until he is sure every student has a clear understanding of the material. Many students said Professor Johnson was their best professor at Penn.  Student’s appreciated the effort he made throughout the semester. This effort was manifested in the timely return of assignments, particularly exams, which were turned back the next day after having been taken. \r\n\r\nThis course is recommended for science majors and engineering students.  This course fulfills the Physical World Sector requirement. . The corequisites for this course are  MATH 104 and PHYS 150 LAB.  Students with AP or Transfer Credit for PHYS 91 or PHYS 93 who complete PHYS 150 will thereby surrender the AP or Transfer Credit. This course requires a lot of work, with weekly homework and quizzes. ", "num_students": 77, "path": "/courses/28005/sections/001/reviews/5510-ROBERT-R-JOHNSON", "instructor": {"path": "/instructors/5510-ROBERT-R-JOHNSON", "first_name": "ROBERT R", "last_name": "JOHNSON", "id": "5510-ROBERT-R-JOHNSON", "name": "ROBERT R JOHNSON"}, "num_reviewers": 74, "id": "28005-001-5510-ROBERT-R-JOHNSON"}]