[{"ratings": {"rAmountLearned": "2.97", "rDifficulty": "2.84", "rStimulateInterest": "2.86", "rRecommendMajor": "3.27", "rCourseQuality": "2.90", "rWorkRequired": "2.68", "rInstructorAccess": "2.31", "rReadingsValue": "2.65", "rRecommendNonMajor": "2.05", "rCommAbility": "3.16", "rInstructorQuality": "3.19"}, "section": {"name": "HIST OF AMER LAW TO 1877", "sectionnum": "401", "primary_alias": "HIST-168-401", "path": "/courses/23217/sections/401", "id": "23217-401", "aliases": ["HIST-168-401", "AFRC-168-401"]}, "comments": "This course surveys the development of law in the United States until the year 1877. The emphasis is on the interaction between law and social forces. The course covers such subjects as the evolution of the legal profession, the transformation of English law during the American Revolution, the making and implementation of the Constitution, and issues concerning business and economic development, the law of slavery, the status of women, and civil liberties. &#8232;&#8232;\r\n\r\nMany students felt that the topic of American law was not for everyone, but that it provided an excellent framework for analyzing legal developments in America. They felt that Professor Berry's style of teaching kept the class exciting and engaging, and kept students “on the ball.” &#8232;\r\n\r\nWhile students thought that the course and Professor Berry were difficult, they thought that her use of the Socratic Method of lecturing, with cold-calling, was difficult but very rewarding. One student said that, “it was an honor sitting in the same room as someone who is not only teaching American law, but also helping to shape it.” While some students thought Professor Berry was very difficult, others appreciated the way that she forced them to think critically. Most students agree that Professor Berry made herself available for questions and concerns. \r\n\r\n&#8232;Some students complained that the book reviews that Professor Berry assigned did not seem relevant to the course. Many students commented on the difficulty of the course, though they generally thought that papers and exams were graded leniently. Students also thought that discipline is required in such a course because there is a lot of individual reading and analysis.\r\n", "num_students": 45, "path": "/courses/23217/sections/401/reviews/629-MARY-FRANCES-BERRY", "instructor": {"path": "/instructors/629-MARY-FRANCES-BERRY", "first_name": "MARY FRANCES", "last_name": "BERRY", "id": "629-MARY-FRANCES-BERRY", "name": "MARY FRANCES BERRY"}, "num_reviewers": 43, "id": "23217-401-629-MARY-FRANCES-BERRY"}]