[{"ratings": {"rAmountLearned": "2.77", "rDifficulty": "2.41", "rStimulateInterest": "2.85", "rRecommendMajor": "3.04", "rCourseQuality": "2.52", "rWorkRequired": "2.30", "rInstructorAccess": "2.81", "rReadingsValue": "3.00", "rRecommendNonMajor": "1.70", "rCommAbility": "2.70", "rInstructorQuality": "2.79"}, "section": {"name": "LABOR ECONOMICS", "sectionnum": "001", "primary_alias": "ECON-233-001", "path": "/courses/22932/sections/001", "id": "22932-001", "aliases": ["ECON-233-001"]}, "comments": "This course covers labor supply and labor demand, income distribution, labor market contracts and work incentives, human capital, labor market discrimination, job training and unemployment. Its prerequisites are ECON 101, MATH 104, and MATH 114 or MATH 115. ECON 103 is recommended. Credit cannot be received for both ECON 033 and 233. \r\n\r\nOverall, students reported that the class was “very well run and taught;” however, some students found the material to be “pretty boring.” The textbook was described as “excellent,” by one student, who claimed he had “never enjoyed reading a textbook so much.”\r\n\r\nStudents highly praised Professor Burdett, describing him as “a great professor” and “a very nice guy.” He was further described as “brilliant at conveying ideas and getting students motivated.” Students also appreciated his “fairly interesting dry humor” and his ability to make economics “a fun topic to study.”\r\n\r\nThis course was highly recommended by students; however, many complained about the grading system. Students reported that it seemed “arbitrary” because there were “very little markings of incorrect answers on assessments.” One student reported having to submit “an entire re-grade request form” due to correction errors. A grader was used to score exams rather than a TA or the professor, which students felt led to “frequent mistakes” in grading.\r\n", "num_students": 36, "path": "/courses/22932/sections/001/reviews/1365-KENNETH-BURDETT", "instructor": {"path": "/instructors/1365-KENNETH-BURDETT", "first_name": "KENNETH", "last_name": "BURDETT", "id": "1365-KENNETH-BURDETT", "name": "KENNETH BURDETT"}, "num_reviewers": 34, "id": "22932-001-1365-KENNETH-BURDETT"}]