[{"ratings": {"rAmountLearned": "2.69", "rDifficulty": "2.53", "rStimulateInterest": "3.16", "rRecommendMajor": "3.31", "rCourseQuality": "2.70", "rWorkRequired": "2.25", "rInstructorAccess": "2.69", "rReadingsValue": "2.50", "rRecommendNonMajor": "2.75", "rCommAbility": "3.06", "rInstructorQuality": "3.19"}, "section": {"name": "INTRO TO GEOLOGY", "sectionnum": "601", "primary_alias": "GEOL-100-601", "path": "/courses/15820/sections/601", "id": "15820-601", "aliases": ["GEOL-100-601"]}, "comments": "This class is an introduction to the processes and forces that form the surface and interior of the earth. Topics include climate change, the history of life, and natural resources. Field trips are part of the curriculum.\r\n\r\nStudents could not say enough about Professor Omar’s lively demeanor and ability to make geology thoroughly exciting. Not only did Professor Omar bring passion and energy to the class, he made sure that his students truly understood the material. One student raved that his ability “to make 3 hours fly by is astounding,” while another wrote, “Omar is the guy to teach this subject.” While almost every student seemed very pleased with the professor (“Omar is the true meaning of a teacher”), one reviewer was displeased by his “lack of professionalism and conciseness.”\r\n\r\nWhile students were generally happy with the course, one said that the course was “significantly more challenging than it should be” for an introductory course. One student voiced discontent with the multiple-choice format on exams.\r\n\r\nThis course fulfills the physical world sector requirement of the College. ", "num_students": 39, "path": "/courses/15820/sections/601/reviews/570-GOMAA-IBRAHIM-OMAR", "instructor": {"path": "/instructors/570-GOMAA-IBRAHIM-OMAR", "first_name": "GOMAA IBRAHIM", "last_name": "OMAR", "id": "570-GOMAA-IBRAHIM-OMAR", "name": "GOMAA IBRAHIM OMAR"}, "num_reviewers": 37, "id": "15820-601-570-GOMAA-IBRAHIM-OMAR"}]