{"coursehistories": {"path": "/coursehistories/250"}, "description": "Basic concepts and principles of chemistry and their applications in chemistry and closely-related fields. The first term emphasizes the understanding of chemical reactions through atomic and molecular structure. This is a university level course, treating the material in sufficient depth so that students can solve chemical problems and can understand the principles involved in their solution. It includes an introduction to condensed matter. This course is suitable for majors or non-majors and is recommended to satisfy either major or preprofessional requirements for general chemistry. This course is presented for students with high school chemistry and calculus. Students with a lesser background than this should take Chemistry 100. \n\n", "semester": "2010A", "name": "GENERAL CHEMISTRY I", "reviews": {"path": "/courses/25742/reviews", "values": [{"ratings": {"rAmountLearned": "2.36", "rDifficulty": "3.48", "rStimulateInterest": "1.47", "rRecommendMajor": "3.26", "rCourseQuality": "1.94", "rWorkRequired": "2.97", "rInstructorAccess": "2.60", "rReadingsValue": "2.39", "rRecommendNonMajor": "1.05", "rCommAbility": "1.80", "rInstructorQuality": "2.15"}, "section": {"name": "GENERAL CHEMISTRY I", "sectionnum": "001", "primary_alias": "CHEM-101-001", "path": "/courses/25742/sections/001", "id": "25742-001", "aliases": ["CHEM-101-001"]}, "comments": "CHEM101 is an introduction to the basic concepts and principles of chemistry and their applications in the chemical and other closely-related fields. It emphasizes the understanding of chemical reactions through atomic and molecular structure and includes an introduction to condensed matter. Students will learn to solve chemical problems and be able to understand the principles involved in their solution. This course is suitable for majors and non-majors and is recommended to satisfy either major or preprofessional requirements for general chemistry. It is presented for students with high school chemistry and calculus. Students with less background than this should take CHEM001.\r\n\r\nMost students found this course to be challenging and felt that the course covered a large amount of material. However, one student remarked that the course was beneficial, “a student can really learn a lot about chemistry.”\r\n\r\nAccording to many students, Professor Topp was incredibly accessible and “eager to help.” Most students were “amazed with how quickly he responded to emails and answered questions in great and satisfying detail.” Many students liked that Professor Topp was “always prepared for lectures” and was “efficient in his explanations.” However, some students explained that Professor Topp’s teaching techniques sometimes “failed to stimulate student interest,” thus, lectures could be “quite boring.” While many students found his “very detailed” PowerPoint slides to be helpful in that they “dealt with the detailed mechanism of the principles along with relevant sample calculations,” but some students found them “really hard to understand because they contained long sentences and few graphics.”\r\n\r\nMany students felt that if one did not already have a strong background in chemistry, one was “at a strong disadvantage in this course.” There were three midterms and a final and students appreciated that they were able to drop their lowest exam grade. The majority of students found the exams to be extremely difficult and believed them to be “written so that students wouldn’t finish.” Though some students felt that the exams were unrepresentative in that they were merely a test of how fast they could write, other students believed that if one was willing to really put in the time and effort, he or she would get a good grade.", "num_students": 131, "path": "/courses/25742/sections/001/reviews/1318-MICHAEL-RICHARD-TOPP", "instructor": {"path": "/instructors/1318-MICHAEL-RICHARD-TOPP", "first_name": "MICHAEL RICHARD", "last_name": "TOPP", "id": "1318-MICHAEL-RICHARD-TOPP", "name": "MICHAEL RICHARD TOPP"}, "num_reviewers": 118, "id": "25742-001-1318-MICHAEL-RICHARD-TOPP"}]}, "credits": null, "primary_alias": "CHEM-101", "path": "/courses/25742", "sections": {"path": "/courses/25742/sections", "values": [{"name": "GENERAL CHEMISTRY I", "sectionnum": "001", "primary_alias": "CHEM-101-001", "path": "/courses/25742/sections/001", "id": "25742-001", "aliases": ["CHEM-101-001"]}]}, "id": 25742, "aliases": ["CHEM-101"]}