{"coursehistories": {"path": "/coursehistories/4577"}, "description": "", "semester": "2009C", "name": "HEALTH CARE MANAGEMENT", "reviews": {"path": "/courses/17467/reviews", "values": [{"ratings": {"rAmountLearned": "3.07", "rDifficulty": "1.69", "rStimulateInterest": "3.44", "rRecommendMajor": "3.61", "rCourseQuality": "3.17", "rWorkRequired": "0.72", "rInstructorAccess": "3.31", "rReadingsValue": "2.70", "rRecommendNonMajor": "3.10", "rCommAbility": "3.53", "rInstructorQuality": "3.42"}, "section": {"name": "HEALTH CARE MANAGEMENT", "sectionnum": "001", "primary_alias": "HCMG-603-001", "path": "/courses/17467/sections/001", "id": "17467-001", "aliases": ["HCMG-603-001"]}, "comments": "HCMG 603 covers three of the largest sector in healthcare: hospitals, physicians, and insurers. Each lecture will provide an historical overview of how each sector developed and its current market structure (e.g., number of competitors, degree of consolidation, nature of competition, etc). The lectures provide the foundation needed to understand the center of the U.S. healthcare system and how it operates. This material is especially critical for healthcare majors who have no background in healthcare or the U.S. system.\r\n\r\nStudents expressed both concern and approval for the vast amount of material this course covered. One student commented on the “great deal of material in this course in order to prepare us for the core curriculum.” \r\n\r\nProfessor Burns, from the class as a whole, received both praise and constructive criticism. One student described him as “highly animated, extremely opinionated (which is great) and wonderful to listen to.” Some students, though, expressed concern that the class moved a bit too quickly and packed too much material into each lecture, reflected both by the excess number of slides and questions in class. The criticism was more common for the first lecture alone, but overall students seemed to appreciate Professor Burn’s expertise and enthusiasm.\r\n\r\nStudents felt that this class was very interesting for both healthcare management majors and non-healthcare management majors alike. The only concern was, as mentioned earlier, that the large amount of material and the speed at which it is covered may be a bit overwhelming. \r\n", "num_students": 159, "path": "/courses/17467/sections/001/reviews/3378-LAWTON-R-BURNS", "instructor": {"path": "/instructors/3378-LAWTON-R-BURNS", "first_name": "LAWTON R", "last_name": "BURNS", "id": "3378-LAWTON-R-BURNS", "name": "LAWTON R BURNS"}, "num_reviewers": 97, "id": "17467-001-3378-LAWTON-R-BURNS"}]}, "credits": null, "primary_alias": "HCMG-603", "path": "/courses/17467", "sections": {"path": "/courses/17467/sections", "values": [{"name": "HEALTH CARE MANAGEMENT", "sectionnum": "001", "primary_alias": "HCMG-603-001", "path": "/courses/17467/sections/001", "id": "17467-001", "aliases": ["HCMG-603-001"]}]}, "id": 17467, "aliases": ["HCMG-603"]}