[{"ratings": {"rAmountLearned": "2.96", "rDifficulty": "2.57", "rStimulateInterest": "3.16", "rRecommendMajor": "3.42", "rCourseQuality": "2.93", "rWorkRequired": "2.92", "rInstructorAccess": "3.36", "rReadingsValue": "2.84", "rRecommendNonMajor": "2.08", "rCommAbility": "3.28", "rInstructorQuality": "3.17"}, "section": {"name": "C++ PROG", "sectionnum": "001", "primary_alias": "CIS-190-001", "path": "/courses/24166/sections/001", "id": "24166-001", "aliases": ["CIS-190-001"]}, "comments": "This course provides an introduction to programming in C++ and is intended for\r\nstudents who already have some exposure to programming in another language such as\r\nJava, C++ provides the programmer with a greater level of control over machine\r\nresources and are commonly used in situations where low level access or performance are\r\nimportant. This course illuminates the issues associated with programming at this level\r\nand covers issues such as explicit memory management, pointers, the compilation\r\nprocess and debugging. The course involves several programming projects which provide\r\nstudents with the experience they need to program effectively in these languages. This\r\ncourse assumes programming experience equivalent to CIS 110, CIS 120 or ESE 112.\r\nStudents found this course to be an excellent introduction to C and C++ and\r\nreported “learning more than [they had] expected.” Many students wished that there was\r\nmore lecture time, due to the amount of material covered.\r\nStudents felt that the instructor planned out an excellent syllabus. Some\r\ncommented that the lecture and homework material did not match up, which made the\r\nassignments difficult for people with little C/C++ background.\r\nStudents mostly felt that there was too much work for a half credit class. They\r\nalso commented that homework should be graded more quickly.\r\nThis course review was written based on the 8 student comments received.", "num_students": 36, "path": "/courses/24166/sections/001/reviews/5727-ZACHARY-ZARROW", "instructor": {"path": "/instructors/5727-ZACHARY-ZARROW", "first_name": "ZACHARY", "last_name": "ZARROW", "id": "5727-ZACHARY-ZARROW", "name": "ZACHARY ZARROW"}, "num_reviewers": 32, "id": "24166-001-5727-ZACHARY-ZARROW"}]