[{"ratings": {"rAmountLearned": "3.40", "rDifficulty": "3.17", "rStimulateInterest": "3.29", "rRecommendMajor": "3.49", "rCourseQuality": "3.25", "rWorkRequired": "2.97", "rInstructorAccess": "2.69", "rReadingsValue": "3.17", "rRecommendNonMajor": "1.86", "rCommAbility": "3.46", "rInstructorQuality": "3.50"}, "section": {"name": "ECONOMETRIC FORECASTING", "sectionnum": "001", "primary_alias": "ECON-221-001", "path": "/courses/15591/sections/001", "id": "15591-001", "aliases": ["ECON-221-001"]}, "comments": "This course is designed as a sequel to Econ 6 (Introduction to Econometrics) and focuses on forecasting. Forecasting is important, as forecasts are constantly made in business, economics, government, &#64257;nance, and many other &#64257;elds and much depends on them. This course introduces students to econometric time-series models and methods that can be used to generate forecasts. EVIEWS is used for computer-based calculations. &#8232;&#8232;\r\n\r\nStudents praised this course, describing it as \\\"amazing\\\" and \\\"interesting,\\\" with some calling it one of their favorite classes taken at Penn. Unlike other Econ classes, students applauded this course for its practical applications. One senior even remarked that it was the \\\"best Econ course\\\" that he had ever taken.&#8232;\r\n\r\nStudents described Professor Diebold as \\\"really great\\\" and admired him for his ability to \\\"stimulate interest\\\" among the students. One student called him an \\\"invaluable\\\" asset to the ECON department, and another declared him to be \\\"one of the best\\\" economists at Penn.&#8232;&#8232;\r\n\r\nSeveral students noted that this course was difficult. Students bemoaned the \\\"arbitrary grading\\\" and \\\"tedious\\\" homework. Some also described the assignments as \\\"too long\\\" and repetitive.", "num_students": 40, "path": "/courses/15591/sections/001/reviews/343-FRANCIS-X--DIEBOLD", "instructor": {"path": "/instructors/343-FRANCIS-X--DIEBOLD", "first_name": "FRANCIS X.", "last_name": "DIEBOLD", "id": "343-FRANCIS-X--DIEBOLD", "name": "FRANCIS X. DIEBOLD"}, "num_reviewers": 38, "id": "15591-001-343-FRANCIS-X--DIEBOLD"}]