[{"ratings": {"rAmountLearned": "1.73", "rDifficulty": "2.73", "rStimulateInterest": "0.83", "rRecommendMajor": "2.35", "rCourseQuality": "1.29", "rWorkRequired": "2.25", "rInstructorAccess": "1.90", "rReadingsValue": "1.42", "rRecommendNonMajor": "0.88", "rCommAbility": "0.68", "rInstructorQuality": "0.95"}, "section": {"name": "INTERMED MICROECONOMICS", "sectionnum": "001", "primary_alias": "ECON-101-001", "path": "/courses/15586/sections/001", "id": "15586-001", "aliases": ["ECON-101-001"]}, "comments": "Theories of consumer behavior, demand, production, costs, the firm in various market contexts, factor employment, factor incomes, elementary general equilibrium, and welfare.\r\n\r\n&#8232;Most students were frustrated with the course and came out of it feeling as though they had a weak grasp on the material. Students felt that the book was useless as the professor barely utilized it. Students didn’t know what to expect from the class as there was no syllabus, no assigned readings and only three homework assignments. One student claimed that “the problems always seem very easy or very difficult, and there is no medium.”\r\n\r\n&#8232;&#8232;While one student said that “Professor Zax is a nice man and…is very knowledgeable about what he teaches,” an overwhelming majority of students strongly disagreed. Many students said that Professor Zax was one of the worst professors they had ever had. Students complained that he tested them on material they had never gone over, was unresponsive when they went to him for help, took pleasure in students’ poor performances and had disorganized lectures with various mistakes.\r\n\r\n&#8232;Economics 101 is a required course for the Economics major and is a prerequisite for all 200 level courses. It is strongly recommended that Econ 101 and 102 be taken immediately upon completion of Econ 1 and 2. Econ 101 is a prerequisite for Econ 102. Majors and prospective majors need to complete Math 104 prior to enrolling in Economics 101 or 102 and have completed or be concurrently enrolled in Math 114 (or 115).", "num_students": 48, "path": "/courses/15586/sections/001/reviews/4297-ORI-ZAX", "instructor": {"path": "/instructors/4297-ORI-ZAX", "first_name": "ORI", "last_name": "ZAX", "id": "4297-ORI-ZAX", "name": "ORI ZAX"}, "num_reviewers": 45, "id": "15586-001-4297-ORI-ZAX"}, {"ratings": {"rAmountLearned": "2.36", "rDifficulty": "2.93", "rStimulateInterest": "1.45", "rRecommendMajor": "3.13", "rCourseQuality": "1.88", "rWorkRequired": "2.54", "rInstructorAccess": "2.13", "rReadingsValue": "1.82", "rRecommendNonMajor": "1.25", "rCommAbility": "1.76", "rInstructorQuality": "1.93"}, "section": {"name": "INTERMED MICROECONOMICS", "sectionnum": "002", "primary_alias": "ECON-101-002", "path": "/courses/15586/sections/002", "id": "15586-002", "aliases": ["ECON-101-002"]}, "comments": "Theories of consumer behavior, demand, production, costs, the firm in various market contexts, factor employment, factor incomes, elementary general equilibrium, and welfare.\r\n\r\nStudents had mixed reviews about the course. Some felt the course was highly informative and that they had a solid grasp of the fundamentals of microeconomics when the semester was over. They felt that the course was more or less straightforward. Others, however, felt that the material was covered “too fast in class, quizzes didn’t match what was done in class, and student interest wasn’t stimulated in any real way.” Another student yearned to learn more about the real applications to the current economy.\r\n\r\n&#8232;Students felt that Professor Li genuinely cared about their feedback and tried to improve the course throughout the semester based on their comments. One student said, “Professor Li honestly cares for her students. She cares about what we think and tries her best to make sure that her students are learning.” Although some found that her teaching style could use some improvement, especially when explaining tricky mathematical problem sets, it is clear that these students were reassured by Professor Li’s desire to tailor her teaching to student needs. The multiple mid-semester evaluations that Professor Li gave out ensured that she would listen and improve the course while the students were still in it, not after the fact.\r\n\r\nEconomics 101 is a required course for the Economics major and is a prerequisite for all 200 level courses. It is strongly recommended that Econ 101 and 102 be taken immediately upon completion of Econ 1 and 2. Econ 101 is a prerequisite for Econ 102. Majors and prospective majors need to complete Math 104 prior to enrolling in Economics 101 or 102 and have completed or be concurrently enrolled in Math 114 (or 115).", "num_students": 65, "path": "/courses/15586/sections/002/reviews/2442-JING-LI", "instructor": {"path": "/instructors/2442-JING-LI", "first_name": "JING", "last_name": "LI", "id": "2442-JING-LI", "name": "JING LI"}, "num_reviewers": 62, "id": "15586-002-2442-JING-LI"}]