{"coursehistories": {"path": "/coursehistories/487"}, "description": "This course covers the finance of technological innovation, with a focus on the valuation tools useful in the venture capital industry. These tools include the \"venture capital method,\" comparables analysis, discounted cash flow analysis, Monte Carlo simulation, contingent-claims analysis, decision trees, and real options. The primary audience for this course is finance majors interested in careers in venture capital or in R&D-intensive companies in health care or information technology. \n\n", "semester": "2011C", "name": "VENT CAP & FNCE INNOVAT", "reviews": {"path": "/courses/24429/reviews", "values": [{"ratings": {"rAmountLearned": "3.60", "rDifficulty": "2.97", "rStimulateInterest": "3.89", "rRecommendMajor": "3.92", "rCourseQuality": "3.63", "rWorkRequired": "2.47", "rInstructorAccess": "3.20", "rReadingsValue": "2.75", "rRecommendNonMajor": "2.90", "rCommAbility": "3.89", "rInstructorQuality": "3.83"}, "section": {"name": "VENT CAP & FNCE INNOVAT", "sectionnum": "001", "primary_alias": "FNCE-250-001", "path": "/courses/24429/sections/001", "id": "24429-001", "aliases": ["FNCE-250-001"]}, "comments": "Finance 250 covers the finance of technological innovation, with a focus on the valuation tools useful in the venture capital industry. These tools include the “venture capital method,” comparable analysis, discounted cash flow analysis, Monte Carlo simulation, contingent-claims analysis, decision trees, and real options. \r\n\r\nStudents commented that the course material was a “great introduction to venture capital.” One student remarked that the “class is well designed and maximizes the value derived by each student” and it was clearly related to industries in the real world.\r\n\r\nStudents found Professor Wessels to be “an incredible professor” because they claimed he fostered a “great atmosphere” for the class and was good at communicating the material. Multiple students remarked that “Professor Wessels was “the best professor” they have ever had. Students also praised Professor Wessel’s use of real-life examples.\r\n\r\nOverall, students commented that FNCE250 was an “excellent class.”  The targeted demographic for this course is finance majors interested in careers in venture capital or in R&D-intensive companies in health care or information technology. Students should have a firm grasp of statistics, as well as strong problem solving and analytical thinking skills, before attempting FNCE 250. FNCE100 and FNCE101 are prerequisites.\r\n", "num_students": 85, "path": "/courses/24429/sections/001/reviews/2764-DAVID-WESSELS", "instructor": {"path": "/instructors/2764-DAVID-WESSELS", "first_name": "DAVID", "last_name": "WESSELS", "id": "2764-DAVID-WESSELS", "name": "DAVID WESSELS"}, "num_reviewers": 80, "id": "24429-001-2764-DAVID-WESSELS"}]}, "credits": null, "primary_alias": "FNCE-250", "path": "/courses/24429", "sections": {"path": "/courses/24429/sections", "values": [{"name": "VENT CAP & FNCE INNOVAT", "sectionnum": "001", "primary_alias": "FNCE-250-001", "path": "/courses/24429/sections/001", "id": "24429-001", "aliases": ["FNCE-250-001"]}]}, "id": 24429, "aliases": ["FNCE-250"]}