[{"ratings": {"rAmountLearned": "3.11", "rDifficulty": "2.53", "rStimulateInterest": "3.11", "rRecommendMajor": "3.47", "rCourseQuality": "3.29", "rWorkRequired": "2.68", "rInstructorAccess": "3.42", "rReadingsValue": "3.39", "rRecommendNonMajor": "2.32", "rCommAbility": "3.58", "rInstructorQuality": "3.48"}, "section": {"name": "BRITISH POETRY 1660-1914", "sectionnum": "301", "primary_alias": "ENGL-040-301", "path": "/courses/27285/sections/301", "id": "27285-301", "aliases": ["ENGL-040-301"]}, "comments": "This course provides students with a survey of British poetry and poetics from the Restoration to the Modern period, and usually includes writers ranging from Aphra Behn and Alexander Pope to Thomas Hardy.  The course may be offered in various \r\n\r\nforms, some covering less, and some more historical ground. Most will provide a sampling of eighteenth-century, Romantic, and Victorian poets.\r\n\r\n\tStudents had only positive things to say about this course, describing it as “absolutely fabulous.”  One student reported that taking the class resulted in “immense value added to [his/her] critical thinking, writing and reading skills.”  Another student reported that the class’s “group atmosphere made for great discussions” that were “very stimulating.”\r\n\r\n\tMost student comments centered around Professor Yang’s excellent teaching.  Professor Yang was described by students as “articulate and always very prepared,” demonstrating “an incredible passion about the material.”  Other students declared that “[Professor Yang’s] focus and knowledge are unparalleled,” and that she is “talented in her ability to communicate ideas to students in the clearest way imaginable.”\r\n\r\n\tA couple of students found that there was a lot of work “in terms of poetry sheets every week,” but that these “proved to be pretty helpful on papers and later assignments.”  One student reported that Professor Yang “often used visual Powerpoints” which was a rarity for an English class and thus “much appreciated.”  Additionally, Professor Yang was perceived as a “very fair grader.”  There is a final project for the course, which one student described as “incredibly collaborative and fun.  Finally, another student recommended that students “take this class early” as “it contains a lot of material and information that is foundational for the higher-level English seminars.”", "num_students": 24, "path": "/courses/27285/sections/301/reviews/3282-CHI-MING-YANG", "instructor": {"path": "/instructors/3282-CHI-MING-YANG", "first_name": "CHI-MING", "last_name": "YANG", "id": "3282-CHI-MING-YANG", "name": "CHI-MING YANG"}, "num_reviewers": 21, "id": "27285-301-3282-CHI-MING-YANG"}]