{"coursehistories": {"path": "/coursehistories/3890"}, "description": "This course concentrates on the economy of Europe in the Early Modern Period, 1450-1750. It was a time of great transition. Europe developed from an agriculturally-based to an industrially-based economy, with attendant changes in society and culture. From subsistence-level productivity, the European economy expanded to create great surfeits of goods, with attendant changes in consumption and expectation. Europe grew from a regional economic system to become part--some would say the heart--of a global economy, with attendant changes in worldview and identity. Economic intensification, expansion, globalization, and industrialization are our topics, therefore. Beginning with economic organizations and practices, we will consider how these changed over time and influenced society and culture. The course takes as its point of departure the experience of individual, working men and women: peasants and artisans, merchants and landlords, entrepeneurs and financiers. Yet, it argues outward: from the particular to the general, from the individual to the social, from the local to the global. It will suggest ways in which the economy influenced developments or changes that were not in themselves economic, shaped, and deflected economic life and practice. \n\n", "semester": "2010C", "name": "ECONOMIC HIST OF EURO I", "reviews": {"path": "/courses/23212/reviews", "values": [{"ratings": {"rAmountLearned": "2.75", "rDifficulty": "2.94", "rStimulateInterest": "2.63", "rRecommendMajor": "3.13", "rCourseQuality": "2.68", "rWorkRequired": "2.44", "rInstructorAccess": "2.94", "rReadingsValue": "1.81", "rRecommendNonMajor": "2.19", "rCommAbility": "3.25", "rInstructorQuality": "3.00"}, "section": {"name": "ECONOMIC HIST OF EURO I", "sectionnum": "001", "primary_alias": "HIST-123-001", "path": "/courses/23212/sections/001", "id": "23212-001", "aliases": ["HIST-123-001"]}, "comments": "This course concentrates on the economy of Europe in the Early Modern Period, 1450-1750, in which Europe developed from an agriculturally-based economy to an industrially-based economy, with attendant changes in society and culture. From a subsistence-level productivity, the European economy expanded to create great surfeits of good, with attendant changes in consumption and expectation. Europe grew from a regional economic system to become part—some would say the heart—of a global economy, with attendant changes in worldview and identity. \r\n\r\nMost students felt that although the course material was interesting, the course needed restructuring, as there was too much content that made lectures seem frantic and abstract. \r\n\r\nStudents found Professor Safley to be “one of the best lecturers” they have had, feeling that he knew how to engage and motivate students. Students thought that Professor Safley was willing to answer questions during and outside of class, although his lectures did not always integrate with the readings and could be disorganized.\r\n\r\nStudents found it difficult to master so much material and that the class required a lot of work. The class consists of two tests and two papers, and students found that Professor Safley did not grade leniently.", "num_students": 23, "path": "/courses/23212/sections/001/reviews/612-THOMAS-M--SAFLEY", "instructor": {"path": "/instructors/612-THOMAS-M--SAFLEY", "first_name": "THOMAS M.", "last_name": "SAFLEY", "id": "612-THOMAS-M--SAFLEY", "name": "THOMAS M. SAFLEY"}, "num_reviewers": 20, "id": "23212-001-612-THOMAS-M--SAFLEY"}]}, "credits": null, "primary_alias": "HIST-123", "path": "/courses/23212", "sections": {"path": "/courses/23212/sections", "values": [{"name": "ECONOMIC HIST OF EURO I", "sectionnum": "001", "primary_alias": "HIST-123-001", "path": "/courses/23212/sections/001", "id": "23212-001", "aliases": ["HIST-123-001"]}]}, "id": 23212, "aliases": ["HIST-123"]}