[{"ratings": {"rAmountLearned": "3.16", "rDifficulty": "2.85", "rStimulateInterest": "3.27", "rRecommendMajor": "3.66", "rCourseQuality": "3.07", "rWorkRequired": "2.78", "rInstructorAccess": "3.08", "rReadingsValue": "2.94", "rRecommendNonMajor": "2.69", "rCommAbility": "3.48", "rInstructorQuality": "3.47"}, "section": {"name": "INTERNATIONAL SECURITY", "sectionnum": "001", "primary_alias": "PSCI-151-001", "path": "/courses/22321/sections/001", "id": "22321-001", "aliases": ["PSCI-151-001"]}, "comments": "This lecture course introduces students to the subfield of international security or strategic studies. In order to grasp the usefulness of the theoretical ideas presented in readings and lectures, abstract concepts are linked with a study of the national security policies states have adopted in the decades following World War II. Topics include current debates about nuclear proliferation, terrorism, the Iraq war, Europe's changing international role, the rise of China, Asian \"flashpoints\" (Korea, the Taiwan Strait), and US security policy for the 21st century - considering some of the main strategic alternatives to the US as well as their implications for the types of forces deployed (the impact of the \"revolution in military affairs,\" the future of missile defense, and the economic burden to be shouldered).&#8232;&#8232;&#8232;&#8232;Many students felt that the course material was extremely interesting, although a few noted that it could be “repetitive”. One student summarized the class, saying “the first half of the class focused on the theoretical essentials of international security (e.g., deterrence) and the latter half on specific issues.”&#8232;&#8232;&#8232;&#8232;Most students raved about Professor Goldstein as an extremely intelligent, funny, and dedicated professor. One student commented: “His ability to convey his advanced ideas in a way that students understand and to simultaneously challenge us to think individually about the course's topics made his a wonderful asset as a teacher.” The one major complaint was that he was a quick lecturer, going through material at a rapid pace. &#8232;&#8232;&#8232;This course was described as reading heavy and many students commented on the tough grading.", "num_students": 202, "path": "/courses/22321/sections/001/reviews/996-AVERY-M--GOLDSTEIN", "instructor": {"path": "/instructors/996-AVERY-M--GOLDSTEIN", "first_name": "AVERY M.", "last_name": "GOLDSTEIN", "id": "996-AVERY-M--GOLDSTEIN", "name": "AVERY M. GOLDSTEIN"}, "num_reviewers": 189, "id": "22321-001-996-AVERY-M--GOLDSTEIN"}]