[{"ratings": {"rAmountLearned": "2.88", "rDifficulty": "3.09", "rStimulateInterest": "1.97", "rRecommendMajor": "3.22", "rCourseQuality": "2.22", "rWorkRequired": "2.69", "rInstructorAccess": "2.59", "rReadingsValue": "2.63", "rRecommendNonMajor": "2.03", "rCommAbility": "2.00", "rInstructorQuality": "2.06"}, "section": {"name": "GAME THEORY", "sectionnum": "001", "primary_alias": "ECON-212-001", "path": "/courses/22928/sections/001", "id": "22928-001", "aliases": ["ECON-212-001"]}, "comments": "This class is an introduction to game theory and its applications to economic analysis. The course provides a theoretical overview of modern game theory, emphasizing common themes in the analysis of strategic behavior in different social science contexts. The economic applications are drawn from different areas including trade, corporate strategy and public policy.\r\n\r\nOverall, students felt that the course material was “very interesting.”\r\n\r\nReactions to Professor Matthews, however, were mostly negative. One student felt that Professor Matthews “failed to stimulate many students' interest in the material,” while another felt he was “very dismissive” of students’ questions. Many expressed the concern that Professor Matthews “has trouble understanding what concepts may be difficult for students” and “blasts through huge amounts of content in minutes.”\r\n\r\nOne student felt that “homework assignments were much harder than the information presented in the chapters and lectures.” This review was based on the 6 student comments that were submitted.\r\n", "num_students": 37, "path": "/courses/22928/sections/001/reviews/342-STEVEN-A-MATTHEWS", "instructor": {"path": "/instructors/342-STEVEN-A-MATTHEWS", "first_name": "STEVEN A", "last_name": "MATTHEWS", "id": "342-STEVEN-A-MATTHEWS", "name": "STEVEN A MATTHEWS"}, "num_reviewers": 37, "id": "22928-001-342-STEVEN-A-MATTHEWS"}, {"ratings": {"rAmountLearned": "3.54", "rDifficulty": "3.15", "rStimulateInterest": "3.62", "rRecommendMajor": "3.77", "rCourseQuality": "3.20", "rWorkRequired": "2.62", "rInstructorAccess": "3.54", "rReadingsValue": "2.77", "rRecommendNonMajor": "2.54", "rCommAbility": "3.62", "rInstructorQuality": "3.33"}, "section": {"name": "GAME THEORY", "sectionnum": "301", "primary_alias": "ECON-212-301", "path": "/courses/22928/sections/301", "id": "22928-301", "aliases": ["ECON-212-301"]}, "comments": "This course gives an introduction to game theory and its applications to economic analysis. The course will provide a theoretical overview of modern game theory, emphasizing common themes in the analysis of strategic behavior in different social science contexts. The economic applications will be drawn from different areas including trade, corporate strategy and public policy.\r\n\r\nStudents reported learning a lot from the course, but also called it “challenging” and at times “dense.” Students liked how the course had real-life applications.\r\n\r\nProfessor Postlewaite is described as “amazing,” and “one of the best professors at Penn.” Students found him “helpful,” “patient,” and a “strong communicator.”\r\n\r\nThis course is a Benjamin Franklin Seminar and Departmental Honors Course. Permission is needed from the department and the prerequisites are Econ 101, Math 104 and Math 114 or Math 115. Students found the course load heavy and the course challenging. Students also faulted the course in that the exam problems were harder than those practiced in class.\r\n", "num_students": 15, "path": "/courses/22928/sections/301/reviews/3934-ANDREW-POSTLEWAITE", "instructor": {"path": "/instructors/3934-ANDREW-POSTLEWAITE", "first_name": "ANDREW", "last_name": "POSTLEWAITE", "id": "3934-ANDREW-POSTLEWAITE", "name": "ANDREW POSTLEWAITE"}, "num_reviewers": 15, "id": "22928-301-3934-ANDREW-POSTLEWAITE"}]