[{"ratings": {"rAmountLearned": "3.19", "rDifficulty": "2.94", "rStimulateInterest": "3.63", "rRecommendMajor": "3.75", "rCourseQuality": "3.25", "rWorkRequired": "2.88", "rInstructorAccess": "3.63", "rReadingsValue": "2.88", "rRecommendNonMajor": "1.44", "rCommAbility": "3.69", "rInstructorQuality": "3.75"}, "section": {"name": "MACRO-MODELING", "sectionnum": "001", "primary_alias": "ECON-244-001", "path": "/courses/22938/sections/001", "id": "22938-001", "aliases": ["ECON-244-001"]}, "comments": "This is an advanced undergraduate course in models of economic growth. Students will be introduced to the workhorse theoretical models that are used to understand growth by modern macroeconomic researchers and policy makers. This course addresses a variety of questions about the economic growth of countries and builds theoretical models that can be used to answer these questions. There will be a strong focus on emphasizing the microeconomic foundations of models, and using the language of mathematics to express the underlying assumptions and assess their implications for policy, and on comparing the predictions of our models with the data.\r\n\r\nStudents described this course as “one of the best at Penn” with “a great mix of theory and empirical applications.” Students found the concepts interesting and somewhat challenging.\r\n\r\nMany students called Professor Kaplan “one of the best economics teachers at Penn.” He is described as “passionate” and “enthusiastic about explaining the material.” Students found him “knowledgeable” and “accessible.” \r\n\r\nThe prerequisites for this course are: Econ 101, Econ 102, Math 104, and Math 114 or Math 115. Econ 103 is recommended. A strong background in math, econometrics, and statistics is highly recommended.\r\n", "num_students": 17, "path": "/courses/22938/sections/001/reviews/5609-GREG-KAPLAN", "instructor": {"path": "/instructors/5609-GREG-KAPLAN", "first_name": "GREG", "last_name": "KAPLAN", "id": "5609-GREG-KAPLAN", "name": "GREG KAPLAN"}, "num_reviewers": 16, "id": "22938-001-5609-GREG-KAPLAN"}]