[{"ratings": {"rAmountLearned": "3.25", "rDifficulty": "2.88", "rStimulateInterest": "3.00", "rRecommendMajor": "3.75", "rCourseQuality": "2.60", "rWorkRequired": "2.00", "rInstructorAccess": "2.88", "rReadingsValue": "2.25", "rRecommendNonMajor": "2.75", "rCommAbility": "2.50", "rInstructorQuality": "2.90"}, "section": {"name": "INTRO TO DECISION THEORY", "sectionnum": "601", "primary_alias": "PPE-110-601", "path": "/courses/26642/sections/601", "id": "26642-601", "aliases": ["PPE-110-601"]}, "comments": "This course provides an introduction to models of human decision making. One of the primary purposes of the course is to provide a set of basic tools that will help the student translate uncertainty into numbers. Rational choice under uncertainty is by far the most used theory of decision making, and its applications are widespread in economics, finance, political science, law, managerial decision making, the economics of health care, and artificial intelligence. The course will use examples from each of these fields (and also fun \"paradoxes\" such as the Monty Hall Puzzle) in providing an introduction to the basic foundations of decision making. This course will also look at the shortcomings of the rational choice theory, both from intuitive and empirical perspectives. No mathematical prerequisites are necessary beyond high school algebra and arithmetic.\r\n\r\nMany students agreed that this was a “great class” but found the subject matter challenging. Many students commented that they could be “better prepared” for class by receiving handouts before lectures. In the end, most students concurred that they “learned a lot” and the subject “gets you thinking.”\r\nStudents tended to think Professor Sen was a “brilliant professor,” making the theory very applicable and bringing fun stories to class.  Some complained that he went “pretty fast” through explanations and examples. Overall, the class felt Professor Sen did a “good job” in generating discussion.\r\n\r\nAlthough some students complained that homeworks were “lengthy” and “took a lot of time,” there were only 5 assignments during the semester. Students appreciated Professor Sen's honesty in telling students that he himself did not recommend the course if a student's sole objective is to fulfill requirements.  The course is highly recommended to students interested in game theory and comfortable with manipulating numbers in simple calculations.  The course is open to freshmen and fulfills the Formal Reasoning requirement. *This review is based on the 5 student comments that were submitted. ", "num_students": 11, "path": "/courses/26642/sections/601/reviews/3150-SUMANTRA-SEN", "instructor": {"path": "/instructors/3150-SUMANTRA-SEN", "first_name": "SUMANTRA", "last_name": "SEN", "id": "3150-SUMANTRA-SEN", "name": "SUMANTRA SEN"}, "num_reviewers": 10, "id": "26642-601-3150-SUMANTRA-SEN"}]