{"coursehistories": {"path": "/coursehistories/1301"}, "description": "This course will expand upon and refine the technical information learned in Introduction to Color Photography. While based in analog practice, all available technologies will be considered as viable components toward the creation of three larger bodies of works. Both documentary and still life approaches will be explored with an emphasis on solid conceptual research as our starting point. Projects are self-defined and negotiated with the instructor. The course is designed to treat color photography as both a technical and artistic medium. The final project will include a limited edition class portfolio. The examination of both historic and contemporary photography will supplement our visual explorations. The emphasis for this Advanced Color Photography course will shift throughout academic semesters. For example, the following descriptions adds specificity to this upper level photography course offering. \n\n\"Advanced Color Projects: Multiples and the Narrative\" will focus on the creation of photographic based works of art that use more than one image to explore issues of content, context, sequencing and the abstract narrative. This is a cross-platform, hybrid technologies class and while based on analog/film practice - both black and white and color - all digital processes are considered possible viable components toward the completion of three larger bodies of works. Both documentary and still life approaches will be explored with an emphasis on solid conceptual research as our starting point. Project content is self-defined and negotiated with the instructor. The course is designed to treat color photography as both a technical and artistic medium. The final pjroject will include a limited edition portfolio. The examination of both historic and contemporary photographs will supplement our visual explorations. Lab fee: $50.00 \n\n", "semester": "2006A", "name": "COLOR PHOTOGRAPHY II", "reviews": {"path": "/courses/7742/reviews", "values": [{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "3.00", "rStimulateInterest": "3.33", "rRecommendMajor": "3.50", "rCourseQuality": "3.00", "rWorkRequired": "3.33", "rInstructorAccess": "3.67", "rReadingsValue": "2.50", "rRecommendNonMajor": "2.67", "rCommAbility": "3.33", "rInstructorQuality": "3.83"}, "section": {"name": "COLOR PHOTOGRAPHY II", "sectionnum": "401", "primary_alias": "FNAR-287-401", "path": "/courses/7742/sections/401", "id": "7742-401", "aliases": ["FNAR-287-401", "FNAR-587-401"]}, "comments": "", "num_students": 7, "path": "/courses/7742/sections/401/reviews/502-KAREN-RODEWALD", "instructor": {"path": "/instructors/502-KAREN-RODEWALD", "first_name": "KAREN", "last_name": "RODEWALD", "id": "502-KAREN-RODEWALD", "name": "KAREN RODEWALD"}, "num_reviewers": 6, "id": "7742-401-502-KAREN-RODEWALD"}]}, "credits": null, "primary_alias": "FNAR-287", "path": "/courses/7742", "sections": {"path": "/courses/7742/sections", "values": [{"name": "COLOR PHOTOGRAPHY II", "sectionnum": "401", "primary_alias": "FNAR-287-401", "path": "/courses/7742/sections/401", "id": "7742-401", "aliases": ["FNAR-287-401", "FNAR-587-401"]}]}, "id": 7742, "aliases": ["FNAR-287", "FNAR-587"]}