[{"ratings": {"rAmountLearned": "2.85", "rDifficulty": "2.15", "rStimulateInterest": "3.01", "rRecommendMajor": "3.48", "rCourseQuality": "3.10", "rWorkRequired": "2.05", "rInstructorAccess": "3.03", "rReadingsValue": "2.81", "rRecommendNonMajor": "2.98", "rCommAbility": "3.14", "rInstructorQuality": "3.35"}, "section": {"name": "AMERICAN SOUTH 1861-PRES", "sectionnum": "001", "primary_alias": "HIST-171-001", "path": "/courses/20323/sections/001", "id": "20323-001", "aliases": ["HIST-171-001"]}, "comments": "This course traces the history of the American South from the end of Civil War to the present. It investigates Reconstruction, the New South, Populism, racial disfranchisement, the rise of Jim Crow, the politics of the One-Party South, the South in the Progressive era and its role in the New Deal and World War II, the Civil Rights Movement of the 1950s and 1960s, and the rise of the Republican South. While following the narrative of politics and economic development, it pays particular attention to race relations and takes a look at gender roles. In addition, it explores the Southern identity as reflected in popular culture and literature as well as in other corners of the public sphere. There are two lectures and a recitation section each week, as well as a mid-term and a final exam.\r\n\r\nMost students really enjoyed this course. They found it “interesting” and “highly informative” and “fun to be a part of.” A student felt the course was a “thoughtful and in depth look at the South.” However, one student noted that there was “very little history, and a lot of TV.” Some students enjoyed the multimedia supplements while others complained that “numerous videos were no substitute for what should have been thought provoking lectures” and that “the dramatic change in the last 30 years was largely ignored; the movement of industry, education and economics was largely overlooked.”\r\n\r\nStudents adored Professor Hackney. They complimented him saying that he was a “brilliant lecturer” and that he “does a great job of using quotes, movies, music, and anything else he can find to help portray the American south the best way he can.” One student’s quote in particular can sum up sentiments of Professor Hackney: “He is truly one of Penn’s best professors. It is rare to find someone with such a vast amount of knowledge combined with a willingness to know and help his students.”\r\n\r\nThis course fulfils the history and tradition sector requirement and a regional requirement for the history major. ", "num_students": 120, "path": "/courses/20323/sections/001/reviews/653-FRANCIS-SHELDON-HACKNEY", "instructor": {"path": "/instructors/653-FRANCIS-SHELDON-HACKNEY", "first_name": "FRANCIS SHELDON", "last_name": "HACKNEY", "id": "653-FRANCIS-SHELDON-HACKNEY", "name": "FRANCIS SHELDON HACKNEY"}, "num_reviewers": 84, "id": "20323-001-653-FRANCIS-SHELDON-HACKNEY"}]