[{"ratings": {"rAmountLearned": "2.69", "rDifficulty": "2.81", "rStimulateInterest": "2.28", "rRecommendMajor": "3.12", "rCourseQuality": "2.41", "rWorkRequired": "2.78", "rInstructorAccess": "2.50", "rReadingsValue": "2.90", "rRecommendNonMajor": "1.92", "rCommAbility": "2.71", "rInstructorQuality": "2.54"}, "section": {"name": "MODERN POLITICAL THOUGHT", "sectionnum": "001", "primary_alias": "PSCI-181-001", "path": "/courses/16351/sections/001", "id": "16351-001", "aliases": ["PSCI-181-001"]}, "comments": "This course will provide an overview of major figures and themes of modern political thought. Instead of providing a comprehensive survey (a smattering of all possible figures) the course will instead provide a more detailed study of 7 or 8 major figures in the modern canon from the 17th to 19th centuries, reading significant selections from several of their most important works. In the process, we will explore more general themes and questions pertinent to political theory in the modern era, particularly focusing on the relationship of the individual to community, society, and state. Although the emergence of the individual as a central moral, political, and conceptual category arguably began in earlier eras, it is in the seventeenth century that it takes firm hold in defining the state, political institutions, moral thinking, and social relations. The centrality of “the individual” has created difficulties, even paradoxes, for community and social relations, and political theorists have struggled to reconcile those throughout the modern era. We will consider the political forms that emerged out of those struggles, as well as the changed and distinctly “modern” conceptualizations of political theory concepts such as freedom, responsibility, justice, rights and obligation, as central categories for organizing moral and political life. &#8232;&#8232;\r\n\r\nMost students found the class interesting, engaging and informative. Many complained about the readings being too long, dense, and repetitive by the end of the semester. One student felt that lectures could have been more focused on what was important to take away from the philosophers. Another student was frustrated with the midterm paper topics, saying that they “were not presented in the best way possible. They were more conducive to lists than to a cohesive paper.”&#8232;&#8232;\r\n\r\nProfessor Hirschmann has been praised as a knowledgeable and engaging lecturer who commands the room with presence and is genuinely interested in the topic. She has been known to walk around the room during lecture and randomly call on students. While some felt that the assignments and lecture were stimulating, others felt Professor Hirschmann needed to work on organization. Some felt that their notes were sporadic and that they were lost during lecture. Students would have preferred that Professor Hirschmann outline where she was going with each lecture and the major points to take away from each author. One student commented that they only really had a grasp of the material after recitation.\r\n\r\nThis course is part of the core requirements for both the political science and PPE majors. It fulfills the History and Tradition sector requirement.", "num_students": 137, "path": "/courses/16351/sections/001/reviews/1678-NANCY-J--HIRSCHMANN", "instructor": {"path": "/instructors/1678-NANCY-J--HIRSCHMANN", "first_name": "NANCY J.", "last_name": "HIRSCHMANN", "id": "1678-NANCY-J--HIRSCHMANN", "name": "NANCY J. HIRSCHMANN"}, "num_reviewers": 133, "id": "16351-001-1678-NANCY-J--HIRSCHMANN"}]