[{"ratings": {"rAmountLearned": "2.40", "rDifficulty": "2.70", "rStimulateInterest": "2.10", "rRecommendMajor": "2.90", "rCourseQuality": "1.70", "rWorkRequired": "3.00", "rInstructorAccess": "2.90", "rReadingsValue": "2.20", "rRecommendNonMajor": "1.30", "rCommAbility": "2.40", "rInstructorQuality": "2.80"}, "section": {"name": "EXP METH IN MAT SCI", "sectionnum": "001", "primary_alias": "MSE-500-001", "path": "/courses/22111/sections/001", "id": "22111-001", "aliases": ["MSE-500-001"]}, "comments": "MSE 500, officially titled “Experimental Methods in Materials Science”, is a graduate level Materials Science and Engineering course. It is a laboratory course covering many of the experimental techniques used in materials science: optical and electron microscopy, mechanical testing, x-ray diffraction, electrical and optical measurements, superconducting and magnetic properties, and solid-state diffusion.&#8232;&#8232;Students generally found the course to be “excellent” and that they “got more out of it than expected.” Some students did express regret that the course was not taught like “other lab courses” where everything is done in one sitting, “rather than collect data and go back home and analyze it through the week.”&#8232;&#8232;Students generally enjoyed Professor Winey and felt that he gave “good introductions” to the labs they performed in class. They also enjoyed the LabView sessions that the professor held and felt that they learned a lot. Some students reported that “it seemed like the instructors didn’t know how much work was involved to answer the write-up questions.”&#8232;&#8232;This is a graduate level Materials Science and Engineering course that can be taken both by majors and non-majors. Majors enjoyed the course, though they had many suggestions about how to improve the structure of the course. One student reported that “as a non-major, this course has definitely made me aware of the techniques, but has left me thoroughly confused about where and when which technique would be useful.” No excessive course load was reported, although students tended to prefer that lab reports be written in class. &#8232;&#8232;This review is based on less than 8 student reviews that were submitted. ", "num_students": 12, "path": "/courses/22111/sections/001/reviews/842-KAREN-I--WINEY", "instructor": {"path": "/instructors/842-KAREN-I--WINEY", "first_name": "KAREN I.", "last_name": "WINEY", "id": "842-KAREN-I--WINEY", "name": "KAREN I. WINEY"}, "num_reviewers": 11, "id": "22111-001-842-KAREN-I--WINEY"}]