{"coursehistories": {"path": "/coursehistories/2511"}, "description": "The course focuses on elementary probability and inferential statistical techniques. The course begins with a survey of basic descriptive statistics and data sources and then covers elementary probability theory, sampling, estimation, hypothesis testing, correlation, and regression. The course focuses on practical issues involved in the substantive interpretation of economic data using the techniques of statistical inference. For this reason empirical case studies that apply the techniques to real-life data are stressed and discussed throughout the course, and students are required to perform several statistical analyses of their own. \n\n", "semester": "2011C", "name": "STAT FOR ECONOMISTS", "reviews": {"path": "/courses/24268/reviews", "values": [{"ratings": {"rAmountLearned": "2.19", "rDifficulty": "3.14", "rStimulateInterest": "1.09", "rRecommendMajor": "3.07", "rCourseQuality": "1.51", "rWorkRequired": "2.84", "rInstructorAccess": "2.62", "rReadingsValue": "1.91", "rRecommendNonMajor": "0.88", "rCommAbility": "1.72", "rInstructorQuality": "1.72"}, "section": {"name": "STAT FOR ECONOMISTS", "sectionnum": "001", "primary_alias": "ECON-103-001", "path": "/courses/24268/sections/001", "id": "24268-001", "aliases": ["ECON-103-001"]}, "comments": "Economics 103 focuses on elementary probability and inferential statistical techniques. It begins with a survey of basic descriptive statistics and data sources and then covers elementary probability theory, sampling, estimation, hypothesis testing, correlation, and regression. The course focuses on practical issues involved in the substantive interpretation of economic data using the techniques of statistical inference. For this reason empirical case studies that apply the techniques to real-life data are stressed and discussed throughout the course, and students are required to perform several statistical analyses of their own.\r\n\r\nOverall, students had mixed reviews about this “challenging” economics course. Some thought it was helpful in explaining certain economic concepts, but some also believed it did not teach them anything helpful related to economics, and what they did learn, students taught themselves. The class was noted as “well-structured,” but “one of the most difficult” economics classes offered, as the class used PowerPoints and old lecture notes to convey the material. In addition, students were frustrated with the difficulty of the tests relative to the problem sets.\r\n\r\nProfessor Tang received mixed reviews as well. While most students agreed that he was “very approachable and helpful in office hours,” they conceded that during class he seemed unfocused and did not explain concepts well, stating that while some questions seemed to be “no-brainers” some students struggled to keep up simply because of the teaching style. And while many students felt he was relatively clear in his explanations, his accent was “hard to keep up with at times.”\r\n\r\nStudents had trouble with the grading of this class. The final was worth 50% of the grade, while each midterm was only worth 15%. This course was recommended for Economics majors only.\r\n", "num_students": 87, "path": "/courses/24268/sections/001/reviews/4299-XUN-TANG", "instructor": {"path": "/instructors/4299-XUN-TANG", "first_name": "XUN", "last_name": "TANG", "id": "4299-XUN-TANG", "name": "XUN TANG"}, "num_reviewers": 72, "id": "24268-001-4299-XUN-TANG"}, {"ratings": {"rAmountLearned": "2.90", "rDifficulty": "2.60", "rStimulateInterest": "1.85", "rRecommendMajor": "3.55", "rCourseQuality": "2.50", "rWorkRequired": "2.25", "rInstructorAccess": "2.85", "rReadingsValue": "2.37", "rRecommendNonMajor": "1.60", "rCommAbility": "2.58", "rInstructorQuality": "2.57"}, "section": {"name": "STAT FOR ECONOMISTS", "sectionnum": "601", "primary_alias": "ECON-103-601", "path": "/courses/24268/sections/601", "id": "24268-601", "aliases": ["ECON-103-601"]}, "comments": "", "num_students": 32, "path": "/courses/24268/sections/601/reviews/5735-CAN-TIAN", "instructor": {"path": "/instructors/5735-CAN-TIAN", "first_name": "CAN", "last_name": "TIAN", "id": "5735-CAN-TIAN", "name": "CAN TIAN"}, "num_reviewers": 29, "id": "24268-601-5735-CAN-TIAN"}]}, "credits": null, "primary_alias": "ECON-103", "path": "/courses/24268", "sections": {"path": "/courses/24268/sections", "values": [{"name": "STAT FOR ECONOMISTS", "sectionnum": "001", "primary_alias": "ECON-103-001", "path": "/courses/24268/sections/001", "id": "24268-001", "aliases": ["ECON-103-001"]}, {"name": "STAT FOR ECONOMISTS", "sectionnum": "601", "primary_alias": "ECON-103-601", "path": "/courses/24268/sections/601", "id": "24268-601", "aliases": ["ECON-103-601"]}]}, "id": 24268, "aliases": ["ECON-103"]}