[{"ratings": {"rAmountLearned": "2.44", "rDifficulty": "2.67", "rStimulateInterest": "2.11", "rRecommendMajor": "3.33", "rCourseQuality": "2.50", "rWorkRequired": "2.22", "rInstructorAccess": "2.89", "rReadingsValue": "1.78", "rRecommendNonMajor": "1.44", "rCommAbility": "2.00", "rInstructorQuality": "2.40"}, "section": {"name": "INTRODUCTION TO COMPUTERS IN ARCHITECTURE", "sectionnum": "001", "primary_alias": "ARCH-440-001", "path": "/courses/21286/sections/001", "id": "21286-001", "aliases": ["ARCH-440-001"]}, "comments": "This course provides an introduction to computer graphic technology in the context of current architectural practice. The class uses the latest release of AutoCAD, the most widely-used architectural software that provides a good grounding for exploration of other programs. Topics covered in the course include: basic vector graphics; two-dimensional drawing and drafting; and basic three-dimensional modeling. The course is organized around a series of structured \r\nexercises that illustrate basic principles and enable students to develop greater facility with the software. There is also a field trip to the offices of Venturi, Scott Brand and Associates to see the use of computers in their practice. \r\n\r\nOne student commented that the course covered only \"standard tedious stuff,\" agreeing with some that more advanced topics could have been covered, especially had the class met more than once a week.\r\n\r\nMost of the students who commented agreed that Professor Kearney taught at a quick pace, and one student mentioned that his handouts didn’t correspond fully with the lectures, which generated many questions and confusion from the students. Some students felt that he only discussed the beginning steps of how to complete problems, and instead of having step by step discussions of how to continue on, students were \"left to [their] own devices.” \r\n\r\nDue to these issues, students found this course to have a wide range of difficulties. However, one student remarked that Professor Kearney was \"really nice and approachable” and readily available to answer questions. \r\n\r\n*This review was based on fewer than 8 comments\r\n", "num_students": 11, "path": "/courses/21286/sections/001/reviews/121-TIMOTHY-KEARNEY", "instructor": {"path": "/instructors/121-TIMOTHY-KEARNEY", "first_name": "TIMOTHY", "last_name": "KEARNEY", "id": "121-TIMOTHY-KEARNEY", "name": "TIMOTHY KEARNEY"}, "num_reviewers": 10, "id": "21286-001-121-TIMOTHY-KEARNEY"}]