[{"ratings": {"rAmountLearned": "2.69", "rDifficulty": "2.14", "rStimulateInterest": "2.27", "rRecommendMajor": "3.39", "rCourseQuality": "2.62", "rWorkRequired": "2.48", "rInstructorAccess": "2.87", "rReadingsValue": "2.62", "rRecommendNonMajor": "2.31", "rCommAbility": "2.67", "rInstructorQuality": "2.79"}, "section": {"name": "INTRO TO MED ANTHRO", "sectionnum": "401", "primary_alias": "ANTH-238-401", "path": "/courses/22626/sections/401", "id": "22626-401", "aliases": ["ANTH-238-401", "HSOC-238-401"]}, "comments": "Introduction to medical anthropology takes central concepts in anthropology—culture, adaptation, human variation, belief, political economy, the body—and applies them to human health and illness. Students explore key elements of healing systems including healing technologies and healer-patient relationships. Modern day applications for medical anthropology are stressed.\r\n\r\nStudents found the course content “interesting” and “engaging”. There were numerous guest speakers brought in to supplement the material, which students enjoyed. The readings were described as “intriguing”, but at times “dense”.\r\n\r\nProfessor Barg was described as “wonderful” and “always available to answer any questions”. However, students criticized her lectures, saying that these “weren’t particularly stimulating”, and “would be better if she didn’t read verbatim off the slides.”\r\n\r\nThis course is available to both freshmen and upperclassmen, and it fulfills the Humanities & Social Science Sector. Students commented that there was a lot of reading that seemed unnecessary. They also found that the final was too long to be completed in the time given. The course is highly recommended by many students.\r\n", "num_students": 104, "path": "/courses/22626/sections/401/reviews/115-FRANCES-K--BARG", "instructor": {"path": "/instructors/115-FRANCES-K--BARG", "first_name": "FRANCES K.", "last_name": "BARG", "id": "115-FRANCES-K--BARG", "name": "FRANCES K. BARG"}, "num_reviewers": 96, "id": "22626-401-115-FRANCES-K--BARG"}]