[{"ratings": {"rAmountLearned": "3.05", "rDifficulty": "2.53", "rStimulateInterest": "3.60", "rRecommendMajor": "3.68", "rCourseQuality": "3.32", "rWorkRequired": "2.81", "rInstructorAccess": "3.06", "rReadingsValue": "2.71", "rRecommendNonMajor": "3.26", "rCommAbility": "3.71", "rInstructorQuality": "3.63"}, "section": {"name": "AMERICA IN THE 1960S", "sectionnum": "401", "primary_alias": "HIST-373-401", "path": "/courses/27589/sections/401", "id": "27589-401", "aliases": ["HIST-373-401", "URBS-217-401"]}, "comments": "This course examines the political, cultural, and intellectual history of America between 1954 and 1974. It considers the civil rights movement, the New Frontier and Great Society, the Supreme Court and right politics, the rise of the New Right, the debate over Vietnam, student radicalism, sexual liberation movements, black power, the counterculture, the urban crisis, and white backlash. The course emphasizes the transformation of liberalism and the revitalization of conservatism, and the tensions between integration and separatism, between libertarianism and communitarianism that shaped the social movements of the sixties.\r\n\r\nStudents expressed immense satisfaction with this course.  Class members appreciated both the content as well as the manner in which it was presented.  A few students noted that the breadth of material occasionally made certain topics seem “rushed,” however, more students praised the “level of depth” of the lectures and readings, alike.  Students claimed that class meetings appeared “to fly by.”  \r\n\r\nProfessor Sugrue received tremendous praise as an “enthusiastic,” “engaging,” and “dynamic” professor.  Students valued his use of “humor and anecdotes” to enhance the concepts.  He was further described as “knowledgeable and passionate” about his subject matter.  Students regretted that the course was so large, which hindered their ability to develop personal relationships with Professor Sugrue, despite his availability and approachability.\r\n\r\nStudents found the workload “challenging, but worthwhile.”  Readings were “quite lengthy”, but were not considered too burdensome because they were “so interesting.”  Students expressed a bit of frustration that there were not frequent assessments – just a midterm and final.  However, students found the tests fair, so long as readings had been completed and class had been attended.  As the course is a higher-level course, many students were history majors, but a considerable number of non-majors took the course as well.  Both categories overwhelmingly recommended the course to others.\r\n", "num_students": 145, "path": "/courses/27589/sections/401/reviews/2779-THOMAS-J--SUGRUE", "instructor": {"path": "/instructors/2779-THOMAS-J--SUGRUE", "first_name": "THOMAS J.", "last_name": "SUGRUE", "id": "2779-THOMAS-J--SUGRUE", "name": "THOMAS J. SUGRUE"}, "num_reviewers": 126, "id": "27589-401-2779-THOMAS-J--SUGRUE"}]