[{"ratings": {"rAmountLearned": "3.06", "rDifficulty": "2.61", "rStimulateInterest": "3.32", "rRecommendMajor": "3.55", "rCourseQuality": "3.14", "rWorkRequired": "2.45", "rInstructorAccess": "3.17", "rReadingsValue": "2.42", "rRecommendNonMajor": "2.88", "rCommAbility": "3.09", "rInstructorQuality": "3.38"}, "section": {"name": "ARCHITECT AND HISTORY", "sectionnum": "001", "primary_alias": "ARTH-001-001", "path": "/courses/16966/sections/001", "id": "16966-001", "aliases": ["ARTH-001-001"]}, "comments": "This course introduces students to the interrelated fields of architecture, art history, and engineering and explores great architectural monuments from the ancient to the modern period, from India across the Mediterranean and Europe to the US. The focus will be on understanding these works in their structure and function, both as products of individual ingenuity and reflections of Zeitgeist. Questioning these monuments from a present-day perspective across the cultures will be an important ingredient, as will be podium discussions, guest lectures, excursions, and all kinds of visualizations, from digital walk-throughs to practical design exercises.&#8232;&#8232;\r\n\r\nStudents commented that they loved “learning about a subject that was previously completely foreign to [them].” A student felt that a “true academic experience was provided by the class and the professor.” Students also enjoyed the weekly excursions on campus or downtown. Students, however, expressed their discontent with the oral examination system, where the professor “read the questions aloud and forced students to answer at his pace.” &#8232;&#8232;\r\n\r\nAlthough Professor Haselberger could be “long-winded” at times, spending “fifteen minutes of each class on logistics,” students enjoyed that he “was truly passionate about the material and wanted to see his students do well.” One student stated that he actually appreciated that the professor had “very clear expectations.” According to many students, Professor Haselberger’s “enthusiasm for architecture is contagious.”&#8232;&#8232;\r\n\r\nStudents stated that art history or architecture students “may find the course a bit simplistic at times.” However, students agreed that it was a good introductory course for students interested in the subject. The course fulfills Sector IV, Humanities and Social Science, and it also satisfies History of Art 100-level course requirements.", "num_students": 86, "path": "/courses/16966/sections/001/reviews/127-LOTHAR-HASELBERGER", "instructor": {"path": "/instructors/127-LOTHAR-HASELBERGER", "first_name": "LOTHAR", "last_name": "HASELBERGER", "id": "127-LOTHAR-HASELBERGER", "name": "LOTHAR HASELBERGER"}, "num_reviewers": 78, "id": "16966-001-127-LOTHAR-HASELBERGER"}]