{"coursehistories": {"path": "/coursehistories/4553"}, "description": "This course will provide an introduction to computation and data analysis using MATLAB - an industry standard programming and visualization environment. The course will cover the fundamentals of computing including: variables, functions, flow control, iteration and recursion. These concepts will be illustrated through examples and assignments which show how computing is applied to various scientific and engineering problems. Examples will be drawn from the simulation of physical and chemical systems, the analysis of experimental data, Monte Carlo numerical experiments, image and audio processing, and control of sensors and actuators. This course does not assume any prior programming experience but will make use of basic concepts from calculus and Newtonian physics. \n\n", "semester": "2012A", "name": "INTRO SCIENTIFIC COMP", "reviews": {"path": "/courses/27243/reviews", "values": [{"ratings": {"rAmountLearned": "2.74", "rDifficulty": "3.15", "rStimulateInterest": "1.91", "rRecommendMajor": "2.83", "rCourseQuality": "2.19", "rWorkRequired": "3.23", "rInstructorAccess": "2.16", "rReadingsValue": "1.67", "rRecommendNonMajor": "1.43", "rCommAbility": "2.11", "rInstructorQuality": "2.09"}, "section": {"name": "INTRO SCIENTIFIC COMP", "sectionnum": "001", "primary_alias": "EAS-105-001", "path": "/courses/27243/sections/001", "id": "27243-001", "aliases": ["EAS-105-001"]}, "comments": "This course provides an introduction to computation and data analysis using MATLAB - an industry standard programming and visualization environment.  The course covers the fundamentals of computing including: variables, functions, flow control, iteration and recursion.  These concepts are illustrated through examples and assignments which show how computing is applied to various scientific and engineering problems.  Examples are drawn from the simulation of physical and chemical systems, the analysis of experimental data, Monte Carlo numerical experiments, image and audio processing, and control of sensors and actuators. This course does not assume any prior programming experience but makes use of basic concepts from calculus and Newtonian physics.\r\n\r\nA majority of students agreed that this course provided a good introduction to programming and Matlab, a “fundamental tool for engineers.” They felt that the course “challenged [them] to think,” and enjoyed seeing their programming skills develop “through the course.” Furthermore, one student was motivated to take CIS 120 and “possibly pursue a minor in CIS.” However, one students did not feel that the lectures covered applicable material, and another did not “feel confident that [he] could use Matlab [...] in the real world.”\r\n\r\nOne student praised Professor Taylor for “[stressing] the specific thinking that programming requires over the programming itself.” Many students sought out the TAs for help on assignments. While they were generally helpful, a good number of students thought that they were also arrogant. As the TAs did not attend class, they were “not able to answer questions appropriated based on the students’ level of knowledge.”\r\n\r\nHomework assignments required a fair amount of effort, but attending office hours were extremely helpful for reducing workload, turning a “15 hour assignment [...] into a 4 hour one.”\r\n", "num_students": 66, "path": "/courses/27243/sections/001/reviews/309-CAMILLO-JOSE-TAYLOR", "instructor": {"path": "/instructors/309-CAMILLO-JOSE-TAYLOR", "first_name": "CAMILLO JOSE", "last_name": "TAYLOR", "id": "309-CAMILLO-JOSE-TAYLOR", "name": "CAMILLO JOSE TAYLOR"}, "num_reviewers": 56, "id": "27243-001-309-CAMILLO-JOSE-TAYLOR"}]}, "credits": null, "primary_alias": "EAS-105", "path": "/courses/27243", "sections": {"path": "/courses/27243/sections", "values": [{"name": "INTRO SCIENTIFIC COMP", "sectionnum": "001", "primary_alias": "EAS-105-001", "path": "/courses/27243/sections/001", "id": "27243-001", "aliases": ["EAS-105-001"]}]}, "id": 27243, "aliases": ["EAS-105"]}