[{"ratings": {"rAmountLearned": "3.10", "rDifficulty": "2.71", "rStimulateInterest": "3.41", "rRecommendMajor": "3.76", "rCourseQuality": "3.51", "rWorkRequired": "2.37", "rInstructorAccess": "3.14", "rReadingsValue": "2.98", "rRecommendNonMajor": "3.06", "rCommAbility": "3.67", "rInstructorQuality": "3.71"}, "section": {"name": "EURO INT'L REL SINCE WWI", "sectionnum": "001", "primary_alias": "HIST-421-001", "path": "/courses/15923/sections/001", "id": "15923-001", "aliases": ["HIST-421-001"]}, "comments": "History of International Relations Since World War I examines European diplomacy since 1914 from a global perspective through analysis of three major events: World War I, World War II, and the Cold War. The course covers the origins, conduct, and aftermath of World War I and II, and the effects that the European Great Power rivalries had on world politics.\r\n\r\nStudents had virtually nothing negative to report on this “engaging” course and a professor who “truly brings the course concepts to life.” While students weren’t necessarily fans of each reading section, they noted that the lessons were “highly interesting” and “pertinent to today’s political society.”\r\nStudents lavished praise on Professor McDougall, calling him an “absolutely wonderful” instructor who “makes the material come alive with his lectures.” Students appreciated his storytelling skills along with his “organization of the course and detailed outlines,” which gave the lessons structure.\r\n\r\nFew of the students indicated any concerns regarding the course’s workload; one pointed out that the “amount of reading is expected” for a history class. A student acknowledged that “having a final exam be worth 50% of your grade” was challenging, but most ultimately showed little unease about the course’s grading.", "num_students": 59, "path": "/courses/15923/sections/001/reviews/604-WALTER-A-MCDOUGALL", "instructor": {"path": "/instructors/604-WALTER-A-MCDOUGALL", "first_name": "WALTER A", "last_name": "MCDOUGALL", "id": "604-WALTER-A-MCDOUGALL", "name": "WALTER A MCDOUGALL"}, "num_reviewers": 52, "id": "15923-001-604-WALTER-A-MCDOUGALL"}]