[{"ratings": {"rAmountLearned": "3.75", "rDifficulty": "2.25", "rStimulateInterest": "3.50", "rRecommendMajor": "4.00", "rCourseQuality": "3.50", "rWorkRequired": "3.25", "rInstructorAccess": "3.50", "rReadingsValue": "3.50", "rRecommendNonMajor": "2.75", "rCommAbility": "3.50", "rInstructorQuality": "3.50"}, "section": {"name": "ISSUES IN AMERICAN DEMOC", "sectionnum": "301", "primary_alias": "PSCI-010-301", "path": "/courses/26650/sections/301", "id": "26650-301", "aliases": ["PSCI-010-301"]}, "comments": "", "num_students": 4, "path": "/courses/26650/sections/301/reviews/989-HENRY-J-TEUNE", "instructor": {"path": "/instructors/989-HENRY-J-TEUNE", "first_name": "HENRY J", "last_name": "TEUNE", "id": "989-HENRY-J-TEUNE", "name": "HENRY J TEUNE"}, "num_reviewers": 4, "id": "26650-301-989-HENRY-J-TEUNE"}, {"ratings": {"rAmountLearned": "3.89", "rDifficulty": "2.78", "rStimulateInterest": "3.89", "rRecommendMajor": "4.00", "rCourseQuality": "3.78", "rWorkRequired": "2.78", "rInstructorAccess": "3.89", "rReadingsValue": "3.44", "rRecommendNonMajor": "3.67", "rCommAbility": "3.89", "rInstructorQuality": "4.00"}, "section": {"name": "BUS&POL/DEVEL COUNTRIES", "sectionnum": "302", "primary_alias": "PSCI-010-302", "path": "/courses/26650/sections/302", "id": "26650-302", "aliases": ["PSCI-010-302"]}, "comments": "The purpose of this freshman seminar is to understand the relationship between business and politics (or between state and capital) in developing countries, the factors which shape this relationship, and their consequences. The seminar analyzes the differences between markets and ownership, the mechanisms by which business and politics influence each other, and the implications for economic growth and equity. Finally, the class will examine the effects of globalization of markets on domestic politics in developing countries. The seminar readings draw upon both conceptual and historical material from a wide range of disciplines and geographical settings.\r\n\r\nStudents raved about this course. More than one student described it as “the best course I have ever taken at Penn.” Students universally agreed that the class was engaging, saying that it often led to vibrant discussion. The readings were generally regarded as relevant and interesting. Students reported that they gained a great deal of knowledge from the course, with one saying, “I have learned more than I thought possible from a seminar class.”\r\n\r\nStudents had even better things to say about Professor Kapur, describing him as a “dynamic teacher” with “seemingly endless knowledge.” He reportedly was kind and understanding, willing to offer feedback at any time, and “more of a friend than a professor.” More than one student said Professor Kapur was his/her favorite teacher thus far at Penn.\r\n\r\nA student reports that, “We had about 60-80 pages of reading but it was all relevant and made for amazing discussion in class.” Another student recommended the seminar to all freshmen, regardless of prospective major. The workload in the course appeared to be relatively light. The class is designed for freshmen and has no prerequisites. \r\n\r\n*This review is based on the 6 student comments that were submitted.", "num_students": 9, "path": "/courses/26650/sections/302/reviews/4081-DEVESH-KAPUR", "instructor": {"path": "/instructors/4081-DEVESH-KAPUR", "first_name": "DEVESH", "last_name": "KAPUR", "id": "4081-DEVESH-KAPUR", "name": "DEVESH KAPUR"}, "num_reviewers": 9, "id": "26650-302-4081-DEVESH-KAPUR"}]