{"coursehistories": {"path": "/coursehistories/3876"}, "description": "A rigorous semester-length academic and practical experience leading to an understanding of the oceans. The Sea Semester is composed of two intensive six-week components taken off-campus. The Shore Component is six weeks at Woods Hole, Massachusetts, with formal study in: Oceanography, Maritime Studies, and Nautical Science. This is followed by six weeks aboard a sailing research vessel, during which students conduct oceanographic research projects as part of the courses, Practical Oceanography I and II. \n\nMaritime Studies. A multidisciplinary study of the history, literature, and art of our maritime heritage, and the political and economic problems of contemporary maritime affairs. \n\nNautical Science. The technologies of operation at sea. Concepts of navigation, naval architecture, ship construction, marine engineering systems, and ship management are taught from their bases in physics, mathematics, and astronomy. \n\nPractical Oceanography I. Taken aboard SSV Westward or SSV Corwith Cramer. Theories and problems raised in the shore component are tested in the practice of oceanography at sea. Students are introduced to the tools and techniques of the practicing oceanographer. During two lectures daily and while standing watch, students learn the operation of basic oceanographic equipment, the methodologies involved in the collection, reduction, and analysis of oceanographic data, and the attendant operations of a sailing oceanographic research vessel. Practical Oceanography II. Taken aboard SSV Westward or SSV Corwith Cramer. Students assume increasing responsibility for conducting oceanographic research and the attendant operations of the vessel. The individual student is responsible directly to the chief scientist and the master of the vessel for the safe and orderly conduct of research activities and related operation of the vessel. Each student completes an individual oceanographic research project designed during the shore component. \n\n", "semester": "2007C", "name": "WOODS HOLE SEA SEMESTER: SEA-NAUTICAL SCIENCE", "reviews": {"path": "/courses/13196/reviews", "values": []}, "credits": null, "primary_alias": "ENVS-295", "path": "/courses/13196", "sections": {"path": "/courses/13196/sections", "values": [{"name": "WOODS HOLE SEA SEMESTER: SEA-NAUTICAL SCIENCE", "sectionnum": "002", "primary_alias": "ENVS-295-002", "path": "/courses/13196/sections/002", "id": "13196-002", "aliases": ["ENVS-295-002"]}, {"name": "WOODS HOLE SEA SEMESTER: SEA-OCEANOGRAPHY I", "sectionnum": "003", "primary_alias": "ENVS-295-003", "path": "/courses/13196/sections/003", "id": "13196-003", "aliases": ["ENVS-295-003"]}, {"name": "WOODS HOLE SEA SEMESTER: SEA-OCEANOGRAPHY II", "sectionnum": "004", "primary_alias": "ENVS-295-004", "path": "/courses/13196/sections/004", "id": "13196-004", "aliases": ["ENVS-295-004"]}]}, "id": 13196, "aliases": ["ENVS-295"]}