[{"ratings": {"rAmountLearned": "3.52", "rDifficulty": "2.93", "rStimulateInterest": "3.81", "rRecommendMajor": "3.81", "rCourseQuality": "3.74", "rWorkRequired": "2.85", "rInstructorAccess": "3.85", "rReadingsValue": "3.74", "rRecommendNonMajor": "3.00", "rCommAbility": "3.67", "rInstructorQuality": "3.88"}, "section": {"name": "IRISH LITERATURE", "sectionnum": "001", "primary_alias": "ENGL-058-001", "path": "/courses/25912/sections/001", "id": "25912-001", "aliases": ["ENGL-058-001"]}, "comments": "This course provides an introduction to modern Irish literature, focusing on the tension between Ireland's violent history and its heroic mythology. Readings span the genres of poetry, drama, fiction, and history, including works by Sommerville and Ross, Yeats, George Moore, Joyce, Synge, O'Casey, Beckett, Edna O'Brien, and Brian Friel. The course also involves a trip to see an Irish play in Philadelphia. Written requirements include weekly quizzes, a 10-12 page research paper, and two essay exams.\r\n\r\nMany students considered this course “one of the best courses” they’ve taken at Penn. Though the subjects matter was “difficult” and “complex,” it made for an “interesting and exciting” class. One of the only things students disliked was that there was “not enough time” to discuss everything they wanted to, although the “quality of in-class discussion [was] consistently high.”. For many students, this course “broadened their perspectives” and made them “genuinely interested in Irish literature.”\r\n\r\nProfessor Esty received rave reviews from every student. He was described as “engaging,” “passionate,” and “fantastic.” It is a large seminar, but Professor Esty “managed to make it feel warm and personal.” Many students agree that Professor Esty is “an extremely informed, intelligent instructor” and “is one of the best professors they have ever had.” He was also “very accessible and available” outside of class. Overall, Professor Esty received wonderful commentary on his “passion about the subject matter,” making “it enjoyable to go to class.”\r\n\r\nThis class focused on some of “the most difficult Irish literature,” and was challenging in terms of the amount and level of work. The average course load is about “30 or more poems” per assignment, but it was “completely manageable as far as amount.” Some students thought the “readings were far too heavy” and the course was “a bit too fast paced.” The weekly quizzes and tests were considered “challenging but fair,” but “about speed and regurgitating what we had discussed in class.” This course was considered great both for those who are interested in Irish literature and those who might be new to it.", "num_students": 29, "path": "/courses/25912/sections/001/reviews/4304-JOSHUA-ESTY", "instructor": {"path": "/instructors/4304-JOSHUA-ESTY", "first_name": "JOSHUA", "last_name": "ESTY", "id": "4304-JOSHUA-ESTY", "name": "JOSHUA ESTY"}, "num_reviewers": 27, "id": "25912-001-4304-JOSHUA-ESTY"}]