[{"ratings": {"rAmountLearned": "2.95", "rDifficulty": "2.18", "rStimulateInterest": "2.91", "rRecommendMajor": "3.48", "rCourseQuality": "3.15", "rWorkRequired": "1.95", "rInstructorAccess": "2.73", "rReadingsValue": "2.82", "rRecommendNonMajor": "3.36", "rCommAbility": "3.14", "rInstructorQuality": "3.30"}, "section": {"name": "LAW & SOCIETY", "sectionnum": "601", "primary_alias": "SOCI-135-601", "path": "/courses/22432/sections/601", "id": "22432-601", "aliases": ["SOCI-135-601"]}, "comments": "Students in this course are introduced to the major theoretical concepts concerning law and society and significant controversial societal issues that deal with law and the legal systems both domestically and internationally. Class discussions will focus on issues involving civil liberties, the organization of courts, legislatures, the legal profession and administrative agencies. Although the focus will be on law in the United States, law and society in other countries of Africa, Asia, Europe and Latin America will be covered in a comparative context. &#8232;&#8232;Students generally found the material taught in class as \"very interesting and relevant\" with the exception of a couple of students. &#8232;&#8232;Students really enjoyed having Dr. Fetni as a professor. One student said, \"Dr. Fetni is a wonderful, kind, caring and fun teacher who is always accessible to students, and makes the classroom learning environment a comfortable place for everyone.\" Another commended his teaching skills by saying, \"He takes examples from real life and applies it to the class so it makes it easier to understand concepts.\"&#8232;&#8232;The bulk of the work in the class was assigned readings. Students found these \"readings and assignments useful and interesting.\" The class is three hours long, so students should come prepared to engage in conversation and equipped with information from the readings. This class is recommended by the department for sophomores, juniors, and seniors.", "num_students": 29, "path": "/courses/22432/sections/601/reviews/1011-HOCINE-FETNI", "instructor": {"path": "/instructors/1011-HOCINE-FETNI", "first_name": "HOCINE", "last_name": "FETNI", "id": "1011-HOCINE-FETNI", "name": "HOCINE FETNI"}, "num_reviewers": 29, "id": "22432-601-1011-HOCINE-FETNI"}]