[{"ratings": {"rAmountLearned": "2.40", "rDifficulty": "3.61", "rStimulateInterest": "1.92", "rRecommendMajor": "3.18", "rCourseQuality": "2.03", "rWorkRequired": "3.35", "rInstructorAccess": "2.05", "rReadingsValue": "1.44", "rRecommendNonMajor": "1.08", "rCommAbility": "2.10", "rInstructorQuality": "2.17"}, "section": {"name": "INTERMED MICROECONOMICS", "sectionnum": "001", "primary_alias": "ECON-101-001", "path": "/courses/21552/sections/001", "id": "21552-001", "aliases": ["ECON-101-001"]}, "comments": "Intermediate Microeconomics covers theories of consumer behavior, demand, production, costs, the firm in various market contexts, factor employment, factor incomes, elementary general equilibrium, and welfare.&#8232;&#8232;&#8232;&#8232;All students seemed to describe the course material as “challenging” or “difficult,” but while many “thoroughly enjoyed” the course and “valued” the material, many others found it too difficult and demanding to understand or learn from. The lectures dealt almost entirely with the conceptual and theoretical, and students practiced numerical examples and problem solving on their weekly problem sets. Students felt that this particular course covered more material than other Econ 101 classes.&#8232;&#8232;&#8232;&#8232;While students found Professor Mailath to be very “knowledgeable” and a “gifted” economist, many found his teaching style inappropriate for the undergraduate level. Overall, students thought Professor Mailath moved too quickly during lecture and found his purely theoretical teaching style difficult to translate to problem sets and exam questions. Students consistently found him unwilling to grant their requests to provide any numerical examples during lecture, but a few students reported that he was very helpful during office hours. Professor Malaith also provided annotated lecture slides online that one student reported finding very useful. A significant number of students commented that they felt too intimidated to ask questions in class. Professor Malaith does not follow the textbook and tended to skip from one chapter to another.&#8232;&#8232;&#8232;&#8232;Prerequisites for this course are ECON 001 and 002, MATH 104 and either MATH 114 or MATH 115. Students found this course extremely challenging. This course is required for economics majors, and most students who took this class did so to fulfill their major requirement. Students were assigned “long,” “complex,” and “very difficult” weekly problem sets, which they reported took about ten hours to complete. Exams were also described as “challenging” and “difficult,” with the class average usually around 50%. However, one student noted that Professor Mailath was generous with the curve. Even the more seasoned economics students who commented that they enjoyed the class described it as “very hard.", "num_students": 116, "path": "/courses/21552/sections/001/reviews/1362-GEORGE-J-MAILATH", "instructor": {"path": "/instructors/1362-GEORGE-J-MAILATH", "first_name": "GEORGE J", "last_name": "MAILATH", "id": "1362-GEORGE-J-MAILATH", "name": "GEORGE J MAILATH"}, "num_reviewers": 103, "id": "21552-001-1362-GEORGE-J-MAILATH"}]