{"coursehistories": {"path": "/coursehistories/896"}, "description": "Electric and magnetic fields; Coulomb's, Ampere's, and Faraday's laws; Maxwell's equations; emission, propagation, and absorption of electromagnetic radiation; interference, reflection, refraction, scattering, and diffraction phenomena. \n\n", "semester": "2011C", "name": "PRINCIPLES II", "reviews": {"path": "/courses/24978/reviews", "values": [{"ratings": {"rAmountLearned": "3.38", "rDifficulty": "2.97", "rStimulateInterest": "3.74", "rRecommendMajor": "3.82", "rCourseQuality": "3.43", "rWorkRequired": "2.97", "rInstructorAccess": "3.97", "rReadingsValue": "3.06", "rRecommendNonMajor": "2.59", "rCommAbility": "3.68", "rInstructorQuality": "3.81"}, "section": {"name": "PRINCIPLES II", "sectionnum": "001", "primary_alias": "PHYS-151-001", "path": "/courses/24978/sections/001", "id": "24978-001", "aliases": ["PHYS-151-001"]}, "comments": "This course covers electric and magnetic fields; Coulomb's, Ampere's, and\r\nFaraday's laws; Maxwell's equations; emission, propagation, and absorption of\r\nelectromagnetic radiation; and interference, reflection, refraction, scattering, and\r\ndiffraction phenomena.\r\nStudents really enjoyed this course, but noted that this was primarily a reflection of\r\nthe exceptional teaching rather than the specific course material. Nonetheless, students\r\nreported learning a lot and found the physics labs to be meaningful.\r\nStudents unanimously loved Professor Johnson, consistently describing him as\r\n“amazing,” “phenomenal,” and the “best professor” they have ever had. Students could\r\nnot say enough good about him in every area of teaching, including his “engaging” and\r\nfunny lecture style, availability to students for extra help, fair grading, clear and concise\r\ncommunication of the material, and assignment of relevant homework. Students noted\r\nthat he “really cares about his students;” he wants them to understand and succeed; and\r\nhe is “open to questions and fun.” He had a great ability to interact with his students on a\r\npersonal level and regularly asked for feedback on his course. Several students also\r\nnoted that he “make[s] physics relevant” and “clarif[ies] concepts by conveying intuition\r\nrather than implying them from math equations.” He uses multimedia, demonstrations,\r\nand actively encourages participation during lectures. Professor Johnson posts his class\r\nnotes online, which was an “excellent study aid.”\r\nThis course fulfills the Physical World Sector Requirement. Prerequisites for this\r\ncourse are PHYS 150 or PHYS 170, and corequisites are MATH 114 and PHYS 151\r\nLAB. Exams were described as “challenging yet fair,” and students felt well prepared for\r\nthem. Weekly quizzes were also given, and students found that this helped them “stay on\r\ntop of the work.” Students recommended this course to anyone considering taking\r\nintroductory physics, whether they be a physics major or a non-major taking this course\r\nfor a pre-health requirement.", "num_students": 41, "path": "/courses/24978/sections/001/reviews/5510-ROBERT-R-JOHNSON", "instructor": {"path": "/instructors/5510-ROBERT-R-JOHNSON", "first_name": "ROBERT R", "last_name": "JOHNSON", "id": "5510-ROBERT-R-JOHNSON", "name": "ROBERT R JOHNSON"}, "num_reviewers": 38, "id": "24978-001-5510-ROBERT-R-JOHNSON"}]}, "credits": null, "primary_alias": "PHYS-151", "path": "/courses/24978", "sections": {"path": "/courses/24978/sections", "values": [{"name": "PRINCIPLES II", "sectionnum": "001", "primary_alias": "PHYS-151-001", "path": "/courses/24978/sections/001", "id": "24978-001", "aliases": ["PHYS-151-001"]}]}, "id": 24978, "aliases": ["PHYS-151"]}