[{"ratings": {"rAmountLearned": "3.39", "rDifficulty": "2.39", "rStimulateInterest": "2.61", "rRecommendMajor": "3.30", "rCourseQuality": "3.29", "rWorkRequired": "2.30", "rInstructorAccess": "3.78", "rReadingsValue": "3.27", "rRecommendNonMajor": "2.83", "rCommAbility": "2.83", "rInstructorQuality": "3.17"}, "section": {"name": "APPLIED ECONOMETRICS I", "sectionnum": "001", "primary_alias": "STAT-520-001", "path": "/courses/25167/sections/001", "id": "25167-001", "aliases": ["STAT-520-001"]}, "comments": "Statistics 520 is a graduate course in applied econometrics. Topics include multiple linear regression, the bootstrap, quantile regression, instrumental variables, maximum likelihood and probit regression.\r\n\r\nStudents found the flow of the class helpful, in that the class started with a review of linear models and then progressed to “more modern treatments.” Students also remarked that “the applied nature of the assignments made the material more accessible and understandable,” even though the material is “difficult” in itself. Students thought the class was “well-organized.”\r\n\r\nStudents commented that Professor Small “did a good job covering the important concepts.” Students remarked that Professor Small was “extremely helpful,” “kind,” and very willing to meet outside of class with students who still had questions.\r\n\r\nOverall, students said STAT 520 was a “very helpful, useful course,” especially for graduate students. The grades in this course were based on homework assignments and projects. There was no final exam. Math 114 is a prerequisite for this course. This course is open to both undergraduate and graduate students, and is, according one student, “a must-have course for non-majors interested in econometrics.”\r\nOverall, students praised the class. Some described the course as “excellent” and one commented that they “learned a lot about econometrics theory in this course.” However, one student did comment that they were “hoping the course was going to be more applied than it actually was.” \r\n\r\nStudents had only good things to say about Professor Small. Students said he was “approachable” and “willing to help other students.” One student commented that he “is very willing to meet with students during office hours and makes time outside of office hours as well.” \r\n\r\n*This review is based on 9 student comments\r\n", "num_students": 31, "path": "/courses/25167/sections/001/reviews/2366-DYLAN-S--SMALL", "instructor": {"path": "/instructors/2366-DYLAN-S--SMALL", "first_name": "DYLAN S.", "last_name": "SMALL", "id": "2366-DYLAN-S--SMALL", "name": "DYLAN S. SMALL"}, "num_reviewers": 23, "id": "25167-001-2366-DYLAN-S--SMALL"}]