{"coursehistories": {"path": "/coursehistories/825"}, "description": "Principles of clinical pharmacology are applied to the nursing care of pediatric patients. Prescribing and monitoring procedures for the drug regimens used to treat pediatric patients are reviewed. Problems inherent in misuse of commonly used drugs are also considered. \n\n", "semester": "2012A", "name": "ADVANCED PEDIATRIC PHARMACOLOGY AND THERAPEUTICS IN NURSING", "reviews": {"path": "/courses/27902/reviews", "values": [{"ratings": {"rAmountLearned": "1.75", "rDifficulty": "2.92", "rTAQuality": "2.29", "rStimulateInterest": "0.72", "rRecommendMajor": "1.72", "rCourseQuality": "1.28", "rWorkRequired": "2.27", "rInstructorAccess": "0.41", "rReadingsValue": "1.58", "rRecommendNonMajor": "0.59", "rCommAbility": "0.79", "rInstructorQuality": "0.74"}, "section": {"name": "ADVANCED PEDIATRIC PHARMACOLOGY AND THERAPEUTICS IN NURSING", "sectionnum": "001", "primary_alias": "NURS-560-001", "path": "/courses/27902/sections/001", "id": "27902-001", "aliases": ["NURS-560-001"]}, "comments": "Principles of clinical pharmacology are applied to the nursing care of pediatric patients.  Prescribing and monitoring procedures for the drug regimens used to treat pediatric patients are reviewed.  Problems inherent in misuse of commonly used drugs are also considered.\r\nThe vast majority of students felt that this class overlooked them and was geared more towards pharmacists.  They did not feel that the content was “applicable to [their] future profession at all.”  Many students suggested that the topics should be reorganized and that the subject matter should focus more on outpatient rather than inpatient issues.  Some of the guest professors (ones who were not pharmacists) sparked more interest amongst the students.\r\nDr. Boullata was criticized for not handing work back quickly enough and for approving exam questions, which were composed by guest lecturers.  He was absent frequently and lethargic in his email responses.\r\nExams in this class were difficult to do well on because the questions seemed alien to many students.  Prerequisite: NURS 684.\r\n", "num_students": 46, "path": "/courses/27902/sections/001/reviews/3123-JOSEPH-I--BOULLATA", "instructor": {"path": "/instructors/3123-JOSEPH-I--BOULLATA", "first_name": "JOSEPH I.", "last_name": "BOULLATA", "id": "3123-JOSEPH-I--BOULLATA", "name": "JOSEPH I. BOULLATA"}, "num_reviewers": 40, "id": "27902-001-3123-JOSEPH-I--BOULLATA"}, {"ratings": {"rAmountLearned": "1.75", "rDifficulty": "2.92", "rTAQuality": "2.29", "rStimulateInterest": "1.03", "rRecommendMajor": "1.72", "rCourseQuality": "1.28", "rWorkRequired": "2.27", "rInstructorAccess": "1.21", "rReadingsValue": "1.58", "rRecommendNonMajor": "0.59", "rCommAbility": "1.13", "rInstructorQuality": "1.26"}, "section": {"name": "ADVANCED PEDIATRIC PHARMACOLOGY AND THERAPEUTICS IN NURSING", "sectionnum": "001", "primary_alias": "NURS-560-001", "path": "/courses/27902/sections/001", "id": "27902-001", "aliases": ["NURS-560-001"]}, "comments": "Principles of clinical pharmacology are applied to the nursing care of pediatric patients. Prescribing and monitoring procedures for the drug regimens used to treat pediatric patients are reviewed. Problems inherent in misuse of commonly used drugs are also considered.\r\n\tStudent opinions on the relativity of the course content were mixed. While some students felt “good information” was covered over the duration of the course, the majority believed the material was not presented in a manner that facilitated learning. In particular, the material was geared towards pharmacists rather than nurses. Students described the course as “disappointing” and “disorganized” and felt that they were “poorly prepared” to write prescriptions in outpatient setting following completion of the course. The general consensus was that the material was not relevant to an outpatient or primary care setting. \r\n\tThe course was split between a main professor and a variety of guest lecturers.   Students tended to appreciate many of the guest lecturers, describing them as having done a “wonderful job.” However, in many cases guest lecturers assumed students knew less or had less experience and thus lectured on known material. Furthermore, many speakers were critical care pharmacists and thus their knowledge base was not adequately applicable to the enrolled primary care pediatric students. Students were frustrated with how the course professor, Dr. Puzanian, taught the material and organized the course.  Overall students considered the faculty commitment to this course as “unacceptable.”\r\n\tThe workload of this course is minimal, as the course’s grades stem only from graded exams. Students also commented that many classes were excused early, there were few assigned readings, and no assigned textbook. However, the tests themselves were viewed as difficult because the test questions were inconsistent with material covered in class. To enroll in this course, students must fulfill the prerequisite of NURS 684. \r\n", "num_students": 46, "path": "/courses/27902/sections/001/reviews/5239-HOURY-W-PUZANIAN", "instructor": {"path": "/instructors/5239-HOURY-W-PUZANIAN", "first_name": "HOURY W", "last_name": "PUZANIAN", "id": "5239-HOURY-W-PUZANIAN", "name": "HOURY W PUZANIAN"}, "num_reviewers": 40, "id": "27902-001-5239-HOURY-W-PUZANIAN"}]}, "credits": null, "primary_alias": "NURS-560", "path": "/courses/27902", "sections": {"path": "/courses/27902/sections", "values": [{"name": "ADVANCED PEDIATRIC PHARMACOLOGY AND THERAPEUTICS IN NURSING", "sectionnum": "001", "primary_alias": "NURS-560-001", "path": "/courses/27902/sections/001", "id": "27902-001", "aliases": ["NURS-560-001"]}]}, "id": 27902, "aliases": ["NURS-560"]}