[{"ratings": {"rAmountLearned": "1.37", "rDifficulty": "2.33", "rStimulateInterest": "0.98", "rRecommendMajor": "1.36", "rCourseQuality": "1.32", "rWorkRequired": "2.09", "rInstructorAccess": "1.53", "rReadingsValue": "1.40", "rRecommendNonMajor": "0.40", "rCommAbility": "1.73", "rInstructorQuality": "1.45"}, "section": {"name": "INTRODUCTION TO RESEARCH METHODS & DESIGNS", "sectionnum": "001", "primary_alias": "NURS-637-001", "path": "/courses/23555/sections/001", "id": "23555-001", "aliases": ["NURS-637-001"]}, "comments": "This course examines relationships among nursing theory, research, and practice. An emphasis is placed on research competencies for advanced practice nurses (APNs), including understanding nursing research methods and strategies in order to evaluate research results for applicability to practice and to design projects for evaluating outcomes of practice. The course requires an understanding of statistical techniques and builds on the required undergraduate statistics course. Students evaluate published nursing research studies for scientific merit and clinical feasibility, with a focus on evidence-based practice.\r\n\r\nStudents generally considered the course material to be useful but remarked that much of it was \"self-taught from the textbook.\" Some students also found that they had already learned the material from previous undergraduate courses.\r\n\r\nMany students considered Dr. Tulman's lectures \"dry,\" but most enjoyed the guest lecturers. Many students commented on Dr. Tulman's harsh grading policy and \"disorganized\" presentation of material. Several students also expressed dissatisfaction with Dr. Tulman's strict attendance policy.\r\n\r\nIn general, students were not pleased with the structure of the course and also found that the exams were not accurate indicators of knowledge. The pre-requisite is NURS 230 or equivalent. In addition, students must have completed a semester of junior level clinicals.", "num_students": 69, "path": "/courses/23555/sections/001/reviews/875-LORRAINE-J-TULMAN", "instructor": {"path": "/instructors/875-LORRAINE-J-TULMAN", "first_name": "LORRAINE J", "last_name": "TULMAN", "id": "875-LORRAINE-J-TULMAN", "name": "LORRAINE J TULMAN"}, "num_reviewers": 65, "id": "23555-001-875-LORRAINE-J-TULMAN"}]