[{"ratings": {"rAmountLearned": "3.19", "rDifficulty": "3.12", "rStimulateInterest": "3.07", "rRecommendMajor": "3.40", "rCourseQuality": "3.13", "rWorkRequired": "3.28", "rInstructorAccess": "2.72", "rReadingsValue": "2.49", "rRecommendNonMajor": "2.12", "rCommAbility": "3.16", "rInstructorQuality": "3.22"}, "section": {"name": "IMMUNOBIOLOGY", "sectionnum": "601", "primary_alias": "BIOL-404-601", "path": "/courses/17036/sections/601", "id": "17036-601", "aliases": ["BIOL-404-601"]}, "comments": "Immunobiology covers the development of the fields of microbiology, pathology, and immunobiology, and examines immune phenomena such as pathogen immunity, immune diseases, autoimmunity and hypersensitivity. It requires BIOL202 and BIOL221 as prerequisites. This section is offered through the College of Liberal and Professional Studies.\r\n\r\nOf the twenty-two comments submitted by students, fifteen gave positive reviews, while two gave negative reviews. Many students said the course was “worthwhile” and taught them a lot, and one even said it was “the best one I have taken at Penn.” Negative reviews, however, reported that learning was too “basic,” covering one chapter in two months. A common theme in reviews was the use of online group discussions outside of class – some liked it, some wanted less of it, and a few hated it. In general, students liked the problem-solving dynamics and in-class discussions, although one reviewer suggested adding problem sets and practice problems to further students’ understanding of the material.\r\n\r\nIn general, students rated Professor Cancro very highly as “a wonderful lecturer” who presented the material “almost like a story that keeps you involved.” Students also commented that he really gets the point across, and he encourages students to “think in an outside-of-the-proverbial-box type of fashion.” However, a few reviewers gave words of caution. One student noted “his tendency to put people on the spot,” and another reviewer wrote scathingly that the instructor “makes fun of people he calls on.” There was one complaint that Professor Cancro spent too much time regaling the class with stories from his personal experiences, instead of teaching immunobiology.\r\n\r\nMany biology majors and some post-baccalaureate pre-med students took this class. Students who did comment on course difficulty said that it was a lot of work and concepts were “quite difficult.” In addition to a research paper, there were exams and required postings to an online discussion board.", "num_students": 67, "path": "/courses/17036/sections/601/reviews/202-MICHAEL-P-CANCRO", "instructor": {"path": "/instructors/202-MICHAEL-P-CANCRO", "first_name": "MICHAEL P", "last_name": "CANCRO", "id": "202-MICHAEL-P-CANCRO", "name": "MICHAEL P CANCRO"}, "num_reviewers": 48, "id": "17036-601-202-MICHAEL-P-CANCRO"}]