{"coursehistories": {"path": "/coursehistories/2054"}, "description": "For Spring 2012 - If Risk Analy & Env Mgmt is closed after the pre-registration period, please e-mail Kyle Dix at kyledix@wharton.upenn.edu to be added to the wait list for the class. Please be sure to include your Name, Student ID #, what section you are interested in (OPIM, BPUB, or ESE) and list what class level you are in. We will do our best to accomodate as many students as possible on the wait list. \n\n", "semester": "2012A", "name": "RISK ANALY & ENV MGMT", "reviews": {"path": "/courses/27958/reviews", "values": [{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "2.47", "rStimulateInterest": "3.04", "rRecommendMajor": "2.93", "rCourseQuality": "2.78", "rWorkRequired": "2.49", "rInstructorAccess": "3.20", "rReadingsValue": "2.84", "rRecommendNonMajor": "2.67", "rCommAbility": "3.13", "rInstructorQuality": "3.02"}, "section": {"name": "RISK ANALY & ENV MGMT", "sectionnum": "401", "primary_alias": "OPIM-261-401", "path": "/courses/27958/sections/401", "id": "27958-401", "aliases": ["OPIM-261-401", "ESE-567-401", "BPUB-961-401", "BPUB-761-401", "OPIM-761-401", "BPUB-261-401"]}, "comments": "Operations and Information Management 261 is designed to introduce students to the complexities of making decisions about threats to human health and the environment when people’s perceptions of risks and their decision-making processes differ from expert views. Recognizing the limitations of individuals in processing information the course explores the role of techniques such as decision analysis, cost- benefit analysis, risk assessment and risk perception in structuring risk- management decisions. The class also examines policy tools such as risk communication, incentive systems, third party inspection, insurance and regulation in different problem contexts. The problem contexts for studying the interactions between analysis, perceptions, and communication will include risk-induced stigmatization of products (e.g. alar, British beef), places (e.g. Love Canal), and technologies (e.g. nuclear power); the siting of noxious facilities, radon, managing catastrophic risks including those from terrorism. A course project will enable students to apply the concepts discussed in the course to a concrete problem. Cross-listed with OPIM 761, BPUB 261, 761, 961, & ESE 567.\r\n\r\nOverall, this course was described as “awesome,” “interesting,” and “useful.” Students said this course encouraged much student participation and “balanced the environmental aspects with business applications” well. Relevant projects were required for this course, and many students spoke highly of the final project and the role playing exercises. Some students felt the required readings were tangent to course materials but interesting. A few students also hoped there were more TA office hours and review sessions for this course.\r\n\r\nThe majority of students had nothing but high regards for Professor Kunreuther. Specifically, Students said Professor Kunreuther was kind and cared much about the students. Many students liked the passion that Professor Kunreuther had for the subject. Students also said that Professor Kunreuther “obviously put a lot time and thought into the course,” and he was able to deliver the course material in an organized way that “help[ed] students learn best.” Many students also praised Professor Kunreuther’s ability to encourage and facilitate discussions in class.\r\n\r\nStudents appreciated that the final exam was a few weeks before the end of the semester. There are no prerequisites of this course.\r\n", "num_students": 52, "path": "/courses/27958/sections/401/reviews/1657-HOWARD-KUNREUTHER", "instructor": {"path": "/instructors/1657-HOWARD-KUNREUTHER", "first_name": "HOWARD", "last_name": "KUNREUTHER", "id": "1657-HOWARD-KUNREUTHER", "name": "HOWARD KUNREUTHER"}, "num_reviewers": 51, "id": "27958-401-1657-HOWARD-KUNREUTHER"}]}, "credits": null, "primary_alias": "OPIM-261", "path": "/courses/27958", "sections": {"path": "/courses/27958/sections", "values": [{"name": "RISK ANALY & ENV MGMT", "sectionnum": "401", "primary_alias": "OPIM-261-401", "path": "/courses/27958/sections/401", "id": "27958-401", "aliases": ["OPIM-261-401", "ESE-567-401", "BPUB-961-401", "BPUB-761-401", "OPIM-761-401", "BPUB-261-401"]}]}, "id": 27958, "aliases": ["OPIM-261", "ESE-567", "BPUB-961", "BPUB-761", "OPIM-761", "BPUB-261"]}