[{"ratings": {"rAmountLearned": "2.98", "rDifficulty": "2.31", "rStimulateInterest": "3.26", "rRecommendMajor": "3.34", "rCourseQuality": "3.17", "rWorkRequired": "2.64", "rInstructorAccess": "3.44", "rReadingsValue": "3.33", "rRecommendNonMajor": "2.95", "rCommAbility": "3.63", "rInstructorQuality": "3.44"}, "section": {"name": "STUDY OF A PERIOD: THE TWENTIETH CENTURY", "sectionnum": "001", "primary_alias": "ENGL-104-001", "path": "/courses/15626/sections/001", "id": "15626-001", "aliases": ["ENGL-104-001"]}, "comments": "This is an introduction to literary study through a survey of works from a specific historical period. Some versions begin with traditional stories or poems, including a sampling of works in translation. Others focus exclusively on modern and contemporary American short fiction or poetry.\r\n\r\nStudents commented that although the assigned books were all American classics that one “hadn’t necessarily ever read,” the books focused more on minority feminist literature. The “insiders and outsiders” theme Professor Park used was subtle and “interesting,” yet at the same time too “trite” and “narrow”. Some students felt that some analyses of the material were forced due to the limiting theme.\r\nStudents described Professor Park as “excellent at communicating,” stating that she was “sincerely committed in making the material interesting to her students.”According to the students, Professor Park “loves to teach and wants others to learn.”\r\nThe course was described as “pretty difficult” and “time-consuming” for students who did not possess a strong reading foundation before taking the course. However, students who took the course as a general requirement stated that the class was “not too fast, but not boring.” Because the course is graded more on content and ideas rather than writing skills, it was generally recommended for those students who “don’t have much background in English but (were) still looking for a challenge.”", "num_students": 80, "path": "/courses/15626/sections/001/reviews/2122-JOSEPHINE-NOCK-HEE-PARK", "instructor": {"path": "/instructors/2122-JOSEPHINE-NOCK-HEE-PARK", "first_name": "JOSEPHINE NOCK-HEE", "last_name": "PARK", "id": "2122-JOSEPHINE-NOCK-HEE-PARK", "name": "JOSEPHINE NOCK-HEE PARK"}, "num_reviewers": 74, "id": "15626-001-2122-JOSEPHINE-NOCK-HEE-PARK"}]