[{"ratings": {"rAmountLearned": "2.31", "rDifficulty": "1.68", "rStimulateInterest": "3.11", "rRecommendMajor": "3.03", "rCourseQuality": "2.45", "rWorkRequired": "1.44", "rInstructorAccess": "2.63", "rReadingsValue": "1.73", "rRecommendNonMajor": "2.52", "rCommAbility": "3.01", "rInstructorQuality": "3.04"}, "section": {"name": "INTRO ARCHAEOLOGY", "sectionnum": "001", "primary_alias": "ANTH-001-001", "path": "/courses/19730/sections/001", "id": "19730-001", "aliases": ["ANTH-001-001"]}, "comments": "Introduction to Archaeology is an entry-level course that introduces students to the history, concepts, and methods of anthropological study of ancient peoples. The course uses archaeological illustrations to indicate the relationships of archaeological interpretations with cultural and physical anthropology. It also fulfils a history and tradition sector. \r\n\r\nWhile some students raved about the course, many complained that the lectures were unclear and lacked structure. One student said, “the class is good as a study of Paleolithic archaeology, but bad as an intro to archaeology. It was not what I was expecting and that was disappointing.” However, not everyone felt similarly. A different student commented, “I have learned a great deal about archaeological fieldwork and the struggles archaeologists face through this course. It was very worthwhile.” Students criticized the lack of readings during the second half of the course, saying that it made learning more difficult. Overall, the reviews were mixed; some called the class “the best I’ve taken at Penn” while others claimed it was “the worst.”\r\n\r\nWhile not everyone liked the course, most agreed that Professor Dibble was “a great teacher” who was an “enthralling and entertaining lecturer” despite the fact that his teaching style was unorganized.\r\n\r\nIntroduction to Archaeology is a requirement for all Anthropology majors. Students mentioned that it was not too difficult to make a good grade, but more than one said that the grading often seemed unfair. ", "num_students": 160, "path": "/courses/19730/sections/001/reviews/85-HAROLD-LEWIS-DIBBLE", "instructor": {"path": "/instructors/85-HAROLD-LEWIS-DIBBLE", "first_name": "HAROLD LEWIS", "last_name": "DIBBLE", "id": "85-HAROLD-LEWIS-DIBBLE", "name": "HAROLD LEWIS DIBBLE"}, "num_reviewers": 110, "id": "19730-001-85-HAROLD-LEWIS-DIBBLE"}]