{"coursehistories": {"path": "/coursehistories/2753"}, "description": "This course will provide students with an introduction to analysis of processes used in the chemical and pharmaceutical industries. Emphasis will be placed on the development of flow sheets and material balances for chemical processes. Students wil also be introduced to modern process simulation software. \n\n", "semester": "2009A", "name": "INTRO TO CHEMICAL ENG", "reviews": {"path": "/courses/15438/reviews", "values": [{"ratings": {"rAmountLearned": "3.04", "rDifficulty": "2.92", "rStimulateInterest": "2.55", "rRecommendMajor": "3.82", "rCourseQuality": "2.75", "rWorkRequired": "3.51", "rInstructorAccess": "2.96", "rReadingsValue": "2.36", "rRecommendNonMajor": "1.08", "rCommAbility": "3.22", "rInstructorQuality": "3.06"}, "section": {"name": "INTRO TO CHEMICAL ENG", "sectionnum": "001", "primary_alias": "CBE-160-001", "path": "/courses/15438/sections/001", "id": "15438-001", "aliases": ["CBE-160-001"]}, "comments": "This course will provide students with an introduction to analysis of processes used in the chemical and pharmaceutical industries. Emphasis will be placed on the development of flow sheets and material balances for chemical processes. Students will also be introduced to modern process simulation software.\r\nStudents found the class “interesting” and “useful” in helping to learn chemical engineering concepts such as material balances. Most felt that they had learned a considerable amount.\r\n\r\nStudents found Professor Holleran to be an “effective” lecturer whose teaching ability “exceeded” their expectations. Although some students found the course to be repetitive and at times dull, students generally agreed that the course paralleled the readings and that Professor Holleran was accessible to answer questions.\r\n\r\nThis class was comprised predominantly of freshman chemical engineering majors. While students found the course to be “challenging” and “a lot of work,” students generally felt that the course was fair and worth the work. One student felt the difficulty of homeworks and quizzes did not replicate the difficulty of exams. This course was highly recommended for majors.", "num_students": 58, "path": "/courses/15438/sections/001/reviews/3908-SEAN-HOLLERAN", "instructor": {"path": "/instructors/3908-SEAN-HOLLERAN", "first_name": "SEAN", "last_name": "HOLLERAN", "id": "3908-SEAN-HOLLERAN", "name": "SEAN HOLLERAN"}, "num_reviewers": 56, "id": "15438-001-3908-SEAN-HOLLERAN"}]}, "credits": null, "primary_alias": "CBE-160", "path": "/courses/15438", "sections": {"path": "/courses/15438/sections", "values": [{"name": "INTRO TO CHEMICAL ENG", "sectionnum": "001", "primary_alias": "CBE-160-001", "path": "/courses/15438/sections/001", "id": "15438-001", "aliases": ["CBE-160-001"]}]}, "id": 15438, "aliases": ["CBE-160"]}