{"coursehistories": {"path": "/coursehistories/1340"}, "description": "Is the world evolving toward a global civil society, and perhaps toward global government? The course explores this question across the 20th century, focusing on the origins and evolution of transnational organizations and movements. We will analyze a variety of actors above and below the level of the nation-state, from the League of Nations to Amnesty International. At the same time we will pay careful attention to the many countervailing forces that have resisted the process of globalization: various forms of nationalism, local ethnic and religious movements in places as far-flung as Central Africa and Northern Ireland, and struggles over territories and border control from Arizona to Kashmir. We will look at the long history of contention between these opposing trajectories, exploring such topics as Wilsonianism and its reception in Europe and beyond, transnational human rights norms, the environmentalist movement, institutions designed to deal with global threats such as the World Health Organization or the International Atomic Energy Agency, European integration, political Islam, and the War on Terror. \n\n", "semester": "2008A", "name": "EURO EMPIRES,1830-1947", "reviews": {"path": "/courses/20318/reviews", "values": [{"ratings": {"rAmountLearned": "3.06", "rDifficulty": "2.72", "rStimulateInterest": "2.89", "rRecommendMajor": "3.33", "rCourseQuality": "2.89", "rWorkRequired": "2.67", "rInstructorAccess": "2.81", "rReadingsValue": "2.56", "rRecommendNonMajor": "2.44", "rCommAbility": "3.12", "rInstructorQuality": "3.33"}, "section": {"name": "EURO EMPIRES,1830-1947", "sectionnum": "001", "primary_alias": "HIST-137-001", "path": "/courses/20318/sections/001", "id": "20318-001", "aliases": ["HIST-137-001"]}, "comments": "This course explores the motivation that let to the \\'scramble for empire\\' in the mid-to-late nineteenth century; the reason why a handful of relatively small European nation-states subdued much of the rest of the world with apparent ease; and why their empires melted away so quickly after 1945. Some case studies considered are the experience of the British in India and South East Asia, the French in North and West Africa, and the Belgians in the Congo. Readings analyze the political, economic, military, and cultural implications of empire from the points of view of the colonized as well as the colonizers.\r\n\r\nStudents thoroughly enjoyed this class. However, they were divided in their opinions of the readings and the structure of the course. Some students felt that the readings were “a nice balance of primary and secondary sources” and that they were “interesting.” King Leopold’s Ghost was a favorite. Meanwhile other students were frustrated with the reading. One student desired readings with more “relevant facts” and another wanted a “blanket text that touches or covers class examples.” Another student complained that the readings were “dense and not as comprehensive as lecture.” As for the structure of the class, some students enjoyed the balance between lecture and discussion. One student wanted more discussion while another complained that “lecture one day and discussion the other was inefficient. More lecture time was needed to have better discussion.” One student said discussions were “good though tough to comprehend,” and said that it was “a very difficult course but enjoyable.”\r\n\r\nAll of the students loved Professor Allport. They felt he was an “excellent teacher” who really “helped students out” and that he gave really “great, interesting lectures.” \r\n\r\nThis course fulfills a regional requirement for the history major.", "num_students": 21, "path": "/courses/20318/sections/001/reviews/3564-ALAN-ALLPORT", "instructor": {"path": "/instructors/3564-ALAN-ALLPORT", "first_name": "ALAN", "last_name": "ALLPORT", "id": "3564-ALAN-ALLPORT", "name": "ALAN ALLPORT"}, "num_reviewers": 18, "id": "20318-001-3564-ALAN-ALLPORT"}]}, "credits": null, "primary_alias": "HIST-137", "path": "/courses/20318", "sections": {"path": "/courses/20318/sections", "values": [{"name": "EURO EMPIRES,1830-1947", "sectionnum": "001", "primary_alias": "HIST-137-001", "path": "/courses/20318/sections/001", "id": "20318-001", "aliases": ["HIST-137-001"]}]}, "id": 20318, "aliases": ["HIST-137"]}