{"coursehistories": {"path": "/coursehistories/185"}, "description": "Introduction to the integration of biomedical engineering in clinical medicine through lectures and a preceptorship with clinical faculty. This course is for BE majors ONLY, with preference given to BSE students. \n\n", "semester": "2010A", "name": "PRECEPTORSHIP IN CLIN BE", "reviews": {"path": "/courses/25656/reviews", "values": [{"ratings": {"rAmountLearned": "2.59", "rDifficulty": "1.78", "rStimulateInterest": "2.59", "rRecommendMajor": "3.35", "rCourseQuality": "2.75", "rWorkRequired": "2.46", "rInstructorAccess": "2.39", "rReadingsValue": "2.02", "rRecommendNonMajor": "2.24", "rCommAbility": "2.59", "rInstructorQuality": "2.41"}, "section": {"name": "PRECEPTORSHIP IN CLIN BE", "sectionnum": "001", "primary_alias": "BE-400-001", "path": "/courses/25656/sections/001", "id": "25656-001", "aliases": ["BE-400-001"]}, "comments": "This course introduces students to real-life problems in medicine through lectures and a clinical preceptorship, which is an intensive experience under the direction of a faculty member. In this preceptorship, students spend about 10 to 15 hours per week in the clinic for 10 weeks. During this time, they can watch procedures, sit in on case discussions, talk with medical residents, follow clinicians, and work on a clinical research project.\r\n\r\nThere were many guest lecturers for this course, in which students found some “fantastic” while others “miserable,” even “insulting” in attitude. Several students indicated that the paper assignments were open-ended and unclear, and did not add much to the learning experience. The students’ experiences of the course was highly dependent on who their preceptors were. Some students found their preceptorships a rewarding learning experience. Others found their preceptors frustrating, hard to communicate, or had little desire to work with students. As one student put it, it is “completely luck of the draw in terms of getting a fun preceptor experience or a nightmare.”\r\n\r\nMany students commented that Professor Eckman and the TAs could be more helpful and courteous in the email, especially regarding grading concerns. In fact, more than one student described Professor Eckman as “condescending.”\r\n\r\nThis course is not required for BE majors, but few students recommend it for a valuable clinical experience. Students mentioned difficulty in scheduling g with their preceptors and the large amount of outside class time. Many students indicated the grading was \"arbitrary\", \"harsh\", and \"inconsistent\". ", "num_students": 64, "path": "/courses/25656/sections/001/reviews/2870-DAVID-M--ECKMANN", "instructor": {"path": "/instructors/2870-DAVID-M--ECKMANN", "first_name": "DAVID M.", "last_name": "ECKMANN", "id": "2870-DAVID-M--ECKMANN", "name": "DAVID M. ECKMANN"}, "num_reviewers": 63, "id": "25656-001-2870-DAVID-M--ECKMANN"}]}, "credits": null, "primary_alias": "BE-400", "path": "/courses/25656", "sections": {"path": "/courses/25656/sections", "values": [{"name": "PRECEPTORSHIP IN CLIN BE", "sectionnum": "001", "primary_alias": "BE-400-001", "path": "/courses/25656/sections/001", "id": "25656-001", "aliases": ["BE-400-001"]}]}, "id": 25656, "aliases": ["BE-400"]}