{"coursehistories": {"path": "/coursehistories/5178"}, "description": "This course explores historical and ethnographic approaches to the diverse forms of nations and nationalism in the world. Course dicussions will begin by examining how capitalism contributed to the formation of a nationalist bourgeois class and how this \"historical\" class took a key role in creating the concepts of nation, national territory and unified national market. We will investigate how people and local communities reacted to the changes caused by these spreading ideas. By reading about the various forms and ideas of nation and nationalism, students can understand how the unique conditions of a specific locale have affected their formation, sometimes with destructive consequences, examining cases both from \"the West\" and \"the rest\". In the case of the West we will firstly look into the constructive role of bourgeois class during the French Revolution and how they created the ideal form of a nation, which has clearly divided national territories, a national language and a national education system, army, and most of all, a unified national market. Later we will discuss how the image of the ideal nation has been transferred to other places and transformed according to the specific local situations. \n\nFor these cases, we will analyze the fledgling democracy of the new colony of Great Britain (the U.S.), the primordial nationalism of Japan and Korea (both North and South), the emerging patriotic nationalism of China, the process of national building in the Southeast Asian countries such as Singapore, Malaysia and Indonesia, the militant/jingoistic nationalism of the post-socialist countries such as Russia, and so on. \n\n", "semester": "2012C", "name": "NATIONS,NATNLSM&POLITICS: Nations, Nationalism & Politics", "reviews": {"path": "/courses/28533/reviews", "values": [{"ratings": {"rDifficulty": "2.25", "rStimulateInterest": "2.50", "rCourseQuality": "2.00", "rWorkRequired": "3.00", "rInstructorQuality": "2.25", "rCommAbility": "3.00", "rInstructorAccess": "2.75"}, "section": {"name": "NATIONS,NATNLSM&POLITICS: Nations, Nationalism & Politics", "sectionnum": "301", "primary_alias": "ANTH-420-301", "path": "/courses/28533/sections/301", "id": "28533-301", "aliases": ["ANTH-420-301"]}, "comments": "", "num_students": 4, "path": "/courses/28533/sections/301/reviews/4238-JAESOK-KIM", "instructor": {"path": "/instructors/4238-JAESOK-KIM", "first_name": "JAESOK", "last_name": "KIM", "id": "4238-JAESOK-KIM", "name": "JAESOK KIM"}, "num_reviewers": 4, "id": "28533-301-4238-JAESOK-KIM"}]}, "credits": null, "primary_alias": "ANTH-420", "path": "/courses/28533", "sections": {"path": "/courses/28533/sections", "values": [{"name": "NATIONS,NATNLSM&POLITICS: Nations, Nationalism & Politics", "sectionnum": "301", "primary_alias": "ANTH-420-301", "path": "/courses/28533/sections/301", "id": "28533-301", "aliases": ["ANTH-420-301"]}]}, "id": 28533, "aliases": ["ANTH-420"]}