[{"ratings": {"rAmountLearned": "1.98", "rDifficulty": "2.17", "rStimulateInterest": "2.44", "rRecommendMajor": "2.46", "rCourseQuality": "2.12", "rWorkRequired": "2.79", "rInstructorAccess": "3.02", "rReadingsValue": "1.81", "rRecommendNonMajor": "2.13", "rCommAbility": "2.13", "rInstructorQuality": "2.39"}, "section": {"name": "ENTREPRENEURSHIP", "sectionnum": "001", "primary_alias": "MGMT-230-001", "path": "/courses/16074/sections/001", "id": "16074-001", "aliases": ["MGMT-230-001"]}, "comments": "This course integrates the material introduced in core business classes and applies it to the design and evaluation of new ventures. The purpose of this course is to explore the many dimensions of new venture creation and growth and to foster innovation and new business formations in independent and corporate settings. In this course, students get hands-on experience designing a comprehensive business development plan with teammates and further their understanding of venture initiation from a theoretical perspective.\r\n\r\nMost Students found the course \\\"fun,\\\" \\\"interesting,\\\" and \\\"practical.\\\" One student said that it was \\\"one of the most useful courses at Penn\\\" that taught him how to think like an entrepreneur. Students also liked the assigned readings, which they found valuable and relevant. However, some students thought that the structure of the course and regular quizzes could be improved to reinforce concepts learned in class.\r\n\r\nMany students described Professor Gelburd as \\\"energetic,\\\" \\\"dynamic,\\\" and \\\"enthusiastic\\\" and wrote that he always \\\"keeps the class fresh.\\\" Professor Gelburd shared his passion for entrepreneurship that made students \\\"excited for the prospect of being an entrepreneur.\\\"\r\n\r\nStudents must have attained Junior standing at Wharton and completed core courses prior to taking this course. The team project based on developing a business plan makes up most of the grade, and many students felt that, without milestone checkups, students mostly left it to the last minute. Some students commented that the quizzes tested specific details. While several students would have preferred to take another course instead, others felt that they learned a lot and found the experience rewarding.", "num_students": 59, "path": "/courses/16074/sections/001/reviews/3064-LAWRENCE-GELBURD", "instructor": {"path": "/instructors/3064-LAWRENCE-GELBURD", "first_name": "LAWRENCE", "last_name": "GELBURD", "id": "3064-LAWRENCE-GELBURD", "name": "LAWRENCE GELBURD"}, "num_reviewers": 52, "id": "16074-001-3064-LAWRENCE-GELBURD"}]