[{"ratings": {"rAmountLearned": "3.14", "rDifficulty": "2.12", "rStimulateInterest": "3.74", "rRecommendMajor": "3.66", "rCourseQuality": "3.32", "rWorkRequired": "2.34", "rInstructorAccess": "3.94", "rReadingsValue": "3.14", "rRecommendNonMajor": "3.43", "rCommAbility": "3.43", "rInstructorQuality": "3.69"}, "section": {"name": "SOCIAL IMPACT & RESP: Social Impact & Responsibility: Foundations", "sectionnum": "001", "primary_alias": "LGST-230-001", "path": "/courses/26291/sections/001", "id": "26291-001", "aliases": ["LGST-230-001"]}, "comments": "LGST230 considers the following questions: What role can business play in helping to meet global societal needs, whether it involves protecting the environment, improving health, or eradicating poverty? Is there any responsibility on the part of business to help meet those needs? In many cases, business can help to address important societal challenges profitably. Consider the success of for-profit microfinance institutions in providing credit to individuals who otherwise would not be served by regular banks. In other cases, it seems there are limits to the potential for business enterprises and business thinking to address societal needs. In these cases, if business enterprises are to help address societal needs, their form and mission may need to be modified. \r\n\r\nStudent feedback for this course was positive overall. Many enjoyed the “engaging discussions” but some felt it was “too heavily discussion based.” Some wished that the class had been smaller given the emphasis on discussion.\r\n\r\nProfessor Hsieh was well-liked by his students. One commented that “Prof. Hsieh is probably one of the best discussion facilitators I've had at Penn.” Another felt that “Professor Hsieh is one of the nicest, most accessible professors I have encountered while at Penn.” Another commented that “Professor Hsieh was wonderful both at offering additional help and soliciting feedback on the course and making adjustments as necessary.”\r\n\r\nCourse requirements include class participation, a midterm exam, and two papers. Students noted that Professor Hsieh modified the reading list based on class direction and student feedback which was appreciated for the most part.", "num_students": 39, "path": "/courses/26291/sections/001/reviews/716-NIEN-HE-HSIEH", "instructor": {"path": "/instructors/716-NIEN-HE-HSIEH", "first_name": "NIEN-HE", "last_name": "HSIEH", "id": "716-NIEN-HE-HSIEH", "name": "NIEN-HE HSIEH"}, "num_reviewers": 37, "id": "26291-001-716-NIEN-HE-HSIEH"}]