{"coursehistories": {"path": "/coursehistories/5368"}, "description": "The 1965 Immigration and Naturalization Act led to the emergence of a new religious landscape in the United States. These developments have generated uncertainty, fear and conflict as well as opportunities for developing greater understanding and forming new solidarities. They have also sparked what some refer to as an \"interfaith movement,\" initiatives seeking to bridge divides between faith communities and build on common visions of the social good in collaborative service and social change efforts. This public anthropology course will be co-taught by Professor Kathy Hall, Associate Chaplain Steve Kocher, and Associate Director of the Greenfield Intercultural Center, Fatimah Muhammad. It will explore interfaith movements in the public sphere through a combination of academic study and practical experience. We will consider anthropological theories and debates surrounding issues of modernity, the cultural politics of difference, and issues of secularism and religion in the public sphere and apply these theories to an examination of the history of interfaith efforts and case studies of recent initiatives. Students will participate in service alongside Philadelphia area faith based organizations and in an intensive spring break service project. Students of all religious and non-religious backgrounds will have the to engage one another and gain \n\ngreater understanding of different faith traditions, experiences, and beliefs. The course will prepare students for leadership in facilitating dialogue around interfaith issues and coordinating interfaith community-building and service projects on campus and in their future careers. \n\n", "semester": "2012A", "name": "INTERFAITH ACTION", "reviews": {"path": "/courses/26961/reviews", "values": [{"ratings": {"rAmountLearned": "3.93", "rDifficulty": "1.79", "rStimulateInterest": "3.86", "rRecommendMajor": "3.57", "rCourseQuality": "4.00", "rWorkRequired": "2.21", "rInstructorAccess": "3.86", "rReadingsValue": "3.36", "rRecommendNonMajor": "4.00", "rCommAbility": "3.79", "rInstructorQuality": "3.87"}, "section": {"name": "INTERFAITH ACTION", "sectionnum": "401", "primary_alias": "ANTH-483-401", "path": "/courses/26961/sections/401", "id": "26961-401", "aliases": ["ANTH-483-401", "URBS-483-401"]}, "comments": "", "num_students": 15, "path": "/courses/26961/sections/401/reviews/6036-KATHLEEN-D--HALL", "instructor": {"path": "/instructors/6036-KATHLEEN-D--HALL", "first_name": "KATHLEEN D.", "last_name": "HALL", "id": "6036-KATHLEEN-D--HALL", "name": "KATHLEEN D. HALL"}, "num_reviewers": 15, "id": "26961-401-6036-KATHLEEN-D--HALL"}]}, "credits": null, "primary_alias": "ANTH-483", "path": "/courses/26961", "sections": {"path": "/courses/26961/sections", "values": [{"name": "INTERFAITH ACTION", "sectionnum": "401", "primary_alias": "ANTH-483-401", "path": "/courses/26961/sections/401", "id": "26961-401", "aliases": ["ANTH-483-401", "URBS-483-401"]}]}, "id": 26961, "aliases": ["ANTH-483", "URBS-483"]}