{"coursehistories": {"path": "/coursehistories/1409"}, "description": "The course will focus on the various approaches to make nanostructures including nanotubes, wires, quantum dots, patterned devices. The lab component of the course includes synthesis of nanoparticles and tubes, sintering and mass transport, colloidal stabilization and hybrid tunneling devices and nanolithography. For each case fundamental concepts are presented, lab results are discussed and compared to prevailing theories. Measurement tools utilized are chemical synthesis, chemical vapor deposition, e-ray diffraction, electron microscopy, atomic force microscopy, and electronic transport probes. \n\n", "semester": "2012A", "name": "FAB & CHAR NANO DEVICES", "reviews": {"path": "/courses/27827/reviews", "values": [{"ratings": {"rAmountLearned": "2.85", "rDifficulty": "1.90", "rStimulateInterest": "2.77", "rRecommendMajor": "2.90", "rCourseQuality": "2.73", "rWorkRequired": "2.42", "rInstructorAccess": "2.84", "rReadingsValue": "2.71", "rRecommendNonMajor": "2.26", "rCommAbility": "2.79", "rInstructorQuality": "2.80"}, "section": {"name": "FAB & CHAR NANO DEVICES", "sectionnum": "001", "primary_alias": "MSE-565-001", "path": "/courses/27827/sections/001", "id": "27827-001", "aliases": ["MSE-565-001"]}, "comments": "The course focuses on the various approaches to make nanostructures including nanotubes, wires, quantum dots, patterned devices. The lab component of the course includes synthesis of nanoparticles and tubes, sintering and mass transport, colloidal stabilization and hybrid tunneling devices and nanolithography. For each case fundamental concepts are presented, lab results are discussed and compared to prevailing theories. Measurement tools utilized are chemical synthesis, chemical vapor deposition, e-ray diffraction, electron microscopy, atomic force microscopy, and electronic transport probes.\r\n\r\nStudents found this course interesting for it included many aspects of materials processing and \"hands-on knowledge.\" This course is a lab course, so students noted taking time to learn how to use the machinery and to do the analysis.\r\n\r\nStudents found Professor Bonnell to be a good professor, having expressed no negative attitudes about her.\r\nThe class was comprised of both undergraduate and graduate students. Student's did not have too much difficulty completing the lab reports and problems sets but did note that they did take time to complete. In the end they still found \"the concepts were interesting.\" Pre-requisites include MSE 360 or permission of the instructor.\r\n\r\nThis review is based on the eight student comments that were submitted.\r\n", "num_students": 41, "path": "/courses/27827/sections/001/reviews/230-DAWN-A-BONNELL", "instructor": {"path": "/instructors/230-DAWN-A-BONNELL", "first_name": "DAWN A", "last_name": "BONNELL", "id": "230-DAWN-A-BONNELL", "name": "DAWN A BONNELL"}, "num_reviewers": 40, "id": "27827-001-230-DAWN-A-BONNELL"}]}, "credits": null, "primary_alias": "MSE-565", "path": "/courses/27827", "sections": {"path": "/courses/27827/sections", "values": [{"name": "FAB & CHAR NANO DEVICES", "sectionnum": "001", "primary_alias": "MSE-565-001", "path": "/courses/27827/sections/001", "id": "27827-001", "aliases": ["MSE-565-001"]}]}, "id": 27827, "aliases": ["MSE-565"]}