[{"ratings": {"rAmountLearned": "2.49", "rDifficulty": "2.11", "rStimulateInterest": "3.08", "rRecommendMajor": "3.03", "rCourseQuality": "2.62", "rWorkRequired": "1.19", "rInstructorAccess": "3.00", "rReadingsValue": "2.08", "rRecommendNonMajor": "2.88", "rCommAbility": "3.21", "rInstructorQuality": "3.19"}, "section": {"name": "PHIL OF SPACE & TIME", "sectionnum": "401", "primary_alias": "PHIL-026-401", "path": "/courses/17895/sections/401", "id": "17895-401", "aliases": ["PHIL-026-401", "STSC-026-401"]}, "comments": "This course studies the historical introduction to the philosophy of space and time from ancient Greek conceptions to modern scientific theories. Lectures focus on Zeno's paradoxes of space, time and motion, on Democritus' atomistic concept of empty space and Aristotle's topos, and on the development of cosmology from Aristotle-Ptolemy to Copernicus, Tycho, Brahe, and Kepler. Students will also study the development of a new worldview in the XVI-XVIII centuries; Descartes, Galilei and Newton. Some lectures will be devoted to the crisis of the mechanical worldview and the origin of the modern science: theory of relativity, quantum mechanics and relativistic cosmology. \r\nMost students liked the course moderately, using words like “good” and “great.” They learned the history of many scientific accomplishments, but some would have preferred more focus on the philosophical implications, rather than just the history. Thus, some thought it was “poorly named and organized,” with “haphazard lectures.” They also thought the pace “could be sped up slightly.” Assigned books were “very explanatory and fairly easy to get through quickly.” Students’ knowledge was tested by two exams. &#8232;&#8232;\r\nStudents adored Professor Domotor for being “knowledgeable,” “funny,” and “accessible.” He is “gifted at explaining very difficult concepts,” which was able to engage students through his “amazing ability to communicate the subject matter” and also by explaining concepts in a manner that is “not only revealing and insightful but also humorous.” Students called him “passionate” and “brilliant” and his knowledge “unbounded.” He was very willing to answer questions and clarify material for students. Professor Domotor stimulated student interest and made class “very enjoyable.” &#8232;&#8232;\r\nAlthough students praised the course content and the instructor, the two exams received nothing but negative reviews and dampened the enjoyment they got out of the course. Exams were extremely difficult, because they are much too long, such that “no one ever finishes or writes intelligently.” They felt “caught off guard” but the limited time (only one hour) and “specific” questions. They felt that the exams resulted in “so little correlation” between one’s grade and one’s actual knowledge of the material. Some thought that this made the class “not as easy” as they’d anticipated. Still, most felt that, in spite of the difficult exams, the course was “well worth the effort in the end” and highly recommend it: “Do not miss out on this class.”\r\n", "num_students": 111, "path": "/courses/17895/sections/401/reviews/954-ZOLTAN-DOMOTOR", "instructor": {"path": "/instructors/954-ZOLTAN-DOMOTOR", "first_name": "ZOLTAN", "last_name": "DOMOTOR", "id": "954-ZOLTAN-DOMOTOR", "name": "ZOLTAN DOMOTOR"}, "num_reviewers": 98, "id": "17895-401-954-ZOLTAN-DOMOTOR"}]