[{"ratings": {"rAmountLearned": "3.50", "rDifficulty": "3.88", "rStimulateInterest": "3.00", "rRecommendMajor": "2.88", "rCourseQuality": "3.00", "rWorkRequired": "3.75", "rInstructorAccess": "3.75", "rReadingsValue": "3.13", "rRecommendNonMajor": "2.63", "rCommAbility": "3.25", "rInstructorQuality": "3.22"}, "section": {"name": "INTRODUCTORY CHEM I", "sectionnum": "910", "primary_alias": "CHEM-001-910", "path": "/courses/28303/sections/910", "id": "28303-910", "aliases": ["CHEM-001-910"]}, "comments": "This course covers basic concepts and principles of chemistry and their applications in chemistry and closely-related fields.  The first term emphasizes the understanding of chemical reactions through atomic and molecular structure.  This is a university level course, treating the material in sufficient depth so that students can solve chemical problems and can understand the principles involved in their solution.  It includes an introduction to condensed matter. This course is suitable for majors or non-majors and is recommended to satisfy either major or pre-professional requirements for general chemistry.  This course is presented for students with high school chemistry and calculus. Students with a lesser background than this should take Chemistry 100.\r\n\r\n\tOverall, students found this course to be “very challenging.” Lectures were found to be “dry” and “not helpful at times.” Several students remarked that the course required teaching oneself from the book. Many students remarked that the course was regarded as “generally fair.” One student summed up the course material as “complicated and interesting.”\r\n\r\n\tProfessor Pietrovito was generally thought to be very knowledgeable on the subject. Several students described Professor Pietrovito as “always available” and “open with offering help.” Many students praised his notes for the class, which were called “helpful” and “clear.” Several students described Professor Pietrovito’s lectures as “dry,” “sometimes confusing,” and “difficult to learn from,” while others described Professor Pietrovito as “extremely dedicated,” “very thorough,” and an “excellent lecturer.”\r\n\r\nStudents in this course generally viewed the material as manageable, with many students remarking that they taught themselves the material. One student classified the exams as “incredibly hard, “ while another pointed out the spread of students’ levels of proficiency in the class, noting that it sometimes made the course seem “unfair.”  This course satisfies the Physical World Sector.", "num_students": 17, "path": "/courses/28303/sections/910/reviews/226-ANTHONY-J-PIETROVITO", "instructor": {"path": "/instructors/226-ANTHONY-J-PIETROVITO", "first_name": "ANTHONY J", "last_name": "PIETROVITO", "id": "226-ANTHONY-J-PIETROVITO", "name": "ANTHONY J PIETROVITO"}, "num_reviewers": 9, "id": "28303-910-226-ANTHONY-J-PIETROVITO"}]