{"coursehistories": {"path": "/coursehistories/787"}, "description": "A survey of representative symphonies by such composers as Haydn, Mozart, Beethoven, Schubert, Berlioz, Schumann, Brahms, Tchaikowsky, and Mahler. Historical developments will be considered, along with the effects upon symphonic literature of such major sociological changes as the emergence of the public concert hall. But the emphasis will be on the music itself--particularly on the ways we can sharpen our abilities to engage and comprehend the composers' musical rhetoric. \n\n", "semester": "2010C", "name": "SYMPHONY", "reviews": {"path": "/courses/23489/reviews", "values": [{"ratings": {"rAmountLearned": "3.18", "rDifficulty": "2.43", "rStimulateInterest": "2.89", "rRecommendMajor": "3.50", "rCourseQuality": "3.13", "rWorkRequired": "1.89", "rInstructorAccess": "3.68", "rReadingsValue": "2.64", "rRecommendNonMajor": "2.71", "rCommAbility": "3.57", "rInstructorQuality": "3.45"}, "section": {"name": "SYMPHONY", "sectionnum": "001", "primary_alias": "MUSC-040-001", "path": "/courses/23489/sections/001", "id": "23489-001", "aliases": ["MUSC-040-001"]}, "comments": "History of Symphony is a survey of representative symphonies by such composers as Haydn, Mozart, Beethoven, Schubert, Berlioz, Schumann, Brahms, Tchaikowsky, and Mahler. Historical developments are considered, along with the effects upon symphonic literature of such major sociological changes as the emergence of the public concert hall. But the emphasis is on the music itself - particularly on the ways individuals can sharpen their abilities to engage and comprehend the composers' musical rhetoric. &#8232;&#8232;\r\n\r\nStudents felt this class is “a must for any music major and lover of symphonies and classical music,” but also commended that it taught students who “have never looked at a sheet of music recognize the different parts of symphony forms, composer characteristics, melodies, harmonies, variations, and more.” Some felt it “could have used a little more uninterrupted listening” but understood this was in part due to the time-constraint a class poses. While they observed that, “it is a lot more difficult than one would think,” overall, they agreed that this is “a wonderful course.” &#8232;\r\n\r\nStudents unanimously agreed that Professor Bernstein is a “phenomenal professor and lecturer.” They credit his eloquence and enthusiasm to 20+ years of experience, and note that his is “quite revered by his students.” One student commented on the “complicated words, phrasing, and information” Professor Bernstein incorporated into classes. However, students have observed that “he's always willing to talk about any problems you might have and he's pretty flexible,” but suggest that he “give people powerpoints that he uses in class [as] it would really help students learn the material.” Students found it easy “to see his passion whenever he talks.” &#8232;&#8232;\r\n\r\nThis class consists of a significant amount of “listening to short clips of symphonies as opposed to entire works,” and develops the student’s ability to recognize different components of the symphony. This course is open to all students, whether in a Music major or not.\r\n", "num_students": 34, "path": "/courses/23489/sections/001/reviews/1632-LAWRENCE-F-BERNSTEIN", "instructor": {"path": "/instructors/1632-LAWRENCE-F-BERNSTEIN", "first_name": "LAWRENCE F", "last_name": "BERNSTEIN", "id": "1632-LAWRENCE-F-BERNSTEIN", "name": "LAWRENCE F BERNSTEIN"}, "num_reviewers": 32, "id": "23489-001-1632-LAWRENCE-F-BERNSTEIN"}]}, "credits": null, "primary_alias": "MUSC-040", "path": "/courses/23489", "sections": {"path": "/courses/23489/sections", "values": [{"name": "SYMPHONY", "sectionnum": "001", "primary_alias": "MUSC-040-001", "path": "/courses/23489/sections/001", "id": "23489-001", "aliases": ["MUSC-040-001"]}]}, "id": 23489, "aliases": ["MUSC-040"]}