{"coursehistories": {"path": "/coursehistories/256"}, "description": "A basic laboratory course in which both the theoretical and practical aspects of a variety of organic reactions and multistep syntheses are emphasized. Modern chromatographic, instrumental, and spectroscopic techniques are applied to experimental organic chemistry. Course should be taken concurrently with CHEM 242 or in the semester immediately following. For safety reasons students will not be permitted to wear contact lenses in the laboratory. \n\nPLEASE NOTE THE FOLLOWING: For the Summer and LPS offering of CHEM 245, it is a 2-semester course. Part 1 is taken in the first term for 0.0 CU and then Part 2 is taken in the second term immediately following the first for 1.0 CU. \n\n", "semester": "2011C", "name": "EXPERIMTL ORGAN CHEM I", "reviews": {"path": "/courses/24116/reviews", "values": [{"ratings": {"rAmountLearned": "2.81", "rDifficulty": "3.45", "rStimulateInterest": "2.81", "rRecommendMajor": "3.03", "rCourseQuality": "2.51", "rWorkRequired": "3.93", "rInstructorAccess": "3.19", "rReadingsValue": "2.83", "rRecommendNonMajor": "0.52", "rCommAbility": "3.31", "rInstructorQuality": "3.21"}, "section": {"name": "EXPERIMTL ORGAN CHEM I", "sectionnum": "001", "primary_alias": "CHEM-245-001", "path": "/courses/24116/sections/001", "id": "24116-001", "aliases": ["CHEM-245-001"]}, "comments": "Part 1 of a basic laboratory course in which both the theoretical and practical\r\naspects of a variety of organic reactions and multistep syntheses are emphasized. Modern\r\nchromatographic, instrumental, and spectroscopic techniques are applied to experimental\r\norganic chemistry.\r\nStudents seemed to really enjoy the class even though they felt it was quite\r\nchallenging and time consuming. Many appreciated the “applications of theoretical\r\norganic chemistry” during lab time. A number of students felt the class was “valuable” in\r\nthat it taught basic laboratory procedure and provided more insight about the reactions\r\ncovered Chemistry 242.\r\nProfessor Mallory received stellar reviews from her students. Students described\r\nher as “friendly and helpful” as well as a “warm presence” in lab. Many appreciated how\r\nthorough she was in explaining reactions and procedures. The only complaint from\r\nstudents was that Professor Mallory was unwilling to provide hints in regards to what\r\nexams would cover.\r\nThe class is primarily composed of biology and chemistry majors as well as prehealth\r\nstudents. The class does require a great deal of work. One student mentioned it\r\ndemanded “30 hours” of work per week. Grading for the class is quite stringent as only\r\n30% are allowed an A. In addition to lab time, students should expect to put in a\r\nsignificant amount of work both preparing for labs and writing post-lab reports.", "num_students": 135, "path": "/courses/24116/sections/001/reviews/239-CLELIA-W-MALLORY", "instructor": {"path": "/instructors/239-CLELIA-W-MALLORY", "first_name": "CLELIA W", "last_name": "MALLORY", "id": "239-CLELIA-W-MALLORY", "name": "CLELIA W MALLORY"}, "num_reviewers": 129, "id": "24116-001-239-CLELIA-W-MALLORY"}]}, "credits": null, "primary_alias": "CHEM-245", "path": "/courses/24116", "sections": {"path": "/courses/24116/sections", "values": [{"name": "EXPERIMTL ORGAN CHEM I", "sectionnum": "001", "primary_alias": "CHEM-245-001", "path": "/courses/24116/sections/001", "id": "24116-001", "aliases": ["CHEM-245-001"]}]}, "id": 24116, "aliases": ["CHEM-245"]}