{"coursehistories": {"path": "/coursehistories/3835"}, "description": "A fast-paced introduction to the fundamental concepts of programming and software design. This course assumes some previous programming experience, at the level of a high school computer science class or CIS110. (If you got at least 4 in the AP Computer Science A or AB exam, you will do great.) No specific programming language background is assumed: basic experience with any language (for instance Java, C, C++, VB, Python, Perl, or Scheme) is fine. If you have never programmed before, you should take CIS 110 first. \n\n", "semester": "2010C", "name": "PROG LANG & TECH I", "reviews": {"path": "/courses/22819/reviews", "values": [{"ratings": {"rAmountLearned": "2.95", "rDifficulty": "2.94", "rStimulateInterest": "2.29", "rRecommendMajor": "3.60", "rCourseQuality": "2.38", "rWorkRequired": "3.41", "rInstructorAccess": "2.38", "rReadingsValue": "2.25", "rRecommendNonMajor": "1.59", "rCommAbility": "2.50", "rInstructorQuality": "2.55"}, "section": {"name": "PROG LANG & TECH I", "sectionnum": "001", "primary_alias": "CIS-120-001", "path": "/courses/22819/sections/001", "id": "22819-001", "aliases": ["CIS-120-001"]}, "comments": "CIS 120 introduced “the fundamental concepts of programming and software design” using java and python. The course has been described by students as “a good refresher course” that teaches both “theory and practice” and also introduces GUIs, more complicated data structures and Pythonic programming, but “doesn't teach many high-level aspects of programming.” The course has been restructured, and the new curriculum focuses on OCaml and Java, with more emphasis on design.\r\n\r\nThere were varied opinions about this course. A number of people felt that it was a good class.  Several reported learning a lot of “directly useful” material enjoying the course overall. While some students thought that the course had an “excellent structure,” the majority felt that that it needed drastic restructuring. Some students felt that the material was “relevant and interesting” and that it “did a good job of explaining concepts.”  However, others found it to be “tough” and “disappointing,” and they reported having to rely on their high school programming experience to get through it. On that note, those without previous programming experience struggled a great deal in this course. Students who had previously taken CIS 110 wished that “there had been a transition course.” However, those who took AP Computer Science AB felt that they should have been allowed to place out of this course.\r\n\r\nThere were also conflicting opinions about the lectures. While some students thought that they were “fairly interesting,” others felt that they were “dull” and “hard to digest.” Material covered in lectures “rarely corresponded to material on exams and in projects.” The labs were “no more useful” because there was no incentive to do anything in lab since the students “rarely coded” and lab assignments weren’t collected. One student reported that the homework assignments were “more useful than the lectures in terms of teaching the material.” Another stated that they “started off with ‘training wheels’ and become more open-ended as the course progressed.” Many students regarded the lectures as extremely “challenging” and “time consuming.” Most agreed that they were “disconnected” from the assignments and that the syntax needed to complete them was not taught before they were due. The biggest and almost unanimous complaint was that homework constituted only 20% of the grade but comprised 80% of the work for the course. Students reported that the exams required them to hand write code, which many found “unintuitive and counterproductive.” As a result, there was “a disconnect between what students can do (showed by their homework) and what they get on a timed test.”\r\n\r\nProfessor Marcus was described as “decent,” “entertaining,” and “a leader in his field.” While some students thought that he was approachable, they also felt that he was rarely helpful. Also, while some students reported that the professor explained the concepts and the material well, others felt that he went off on “random tangents” and “lost his train of thought” very frequently during lecture.  Others noted that Professor Marcus didn’t appear to be familiar with his own slides. \r\n\r\nOverall, the course received average ratings from students. While it is required for CIS majors, it was not recommended to those who need not take it. However, some students recommended it to math and physics majors, and others recommended it to “people who enjoy critical thinking.”\r\n", "num_students": 82, "path": "/courses/22819/sections/001/reviews/1345-MITCHELL-PHILIP-MARCUS", "instructor": {"path": "/instructors/1345-MITCHELL-PHILIP-MARCUS", "first_name": "MITCHELL PHILIP", "last_name": "MARCUS", "id": "1345-MITCHELL-PHILIP-MARCUS", "name": "MITCHELL PHILIP MARCUS"}, "num_reviewers": 77, "id": "22819-001-1345-MITCHELL-PHILIP-MARCUS"}, {"ratings": {"rAmountLearned": "3.60", "rDifficulty": "3.53", "rStimulateInterest": "3.00", "rRecommendMajor": "3.87", "rCourseQuality": "3.12", "rWorkRequired": "3.60", "rInstructorAccess": "3.47", "rReadingsValue": "2.75", "rRecommendNonMajor": "2.27", "rCommAbility": "3.33", "rInstructorQuality": "3.35"}, "section": {"name": "PROG LANG & TECH I", "sectionnum": "002", "primary_alias": "CIS-120-002", "path": "/courses/22819/sections/002", "id": "22819-002", "aliases": ["CIS-120-002"]}, "comments": "", "num_students": 21, "path": "/courses/22819/sections/002/reviews/1321-BENJAMIN-C--PIERCE", "instructor": {"path": "/instructors/1321-BENJAMIN-C--PIERCE", "first_name": "BENJAMIN C.", "last_name": "PIERCE", "id": "1321-BENJAMIN-C--PIERCE", "name": "BENJAMIN C. PIERCE"}, "num_reviewers": 18, "id": "22819-002-1321-BENJAMIN-C--PIERCE"}, {"ratings": {"rAmountLearned": "3.60", "rDifficulty": "3.53", "rStimulateInterest": "3.07", "rRecommendMajor": "3.87", "rCourseQuality": "3.12", "rWorkRequired": "3.60", "rInstructorAccess": "3.53", "rReadingsValue": "2.75", "rRecommendNonMajor": "2.27", "rCommAbility": "3.33", "rInstructorQuality": "3.47"}, "section": {"name": "PROG LANG & TECH I", "sectionnum": "002", "primary_alias": "CIS-120-002", "path": "/courses/22819/sections/002", "id": "22819-002", "aliases": ["CIS-120-002"]}, "comments": "", "num_students": 21, "path": "/courses/22819/sections/002/reviews/1357-STEPHAN-A--ZDANCEWIC", "instructor": {"path": "/instructors/1357-STEPHAN-A--ZDANCEWIC", "first_name": "STEPHAN A.", "last_name": "ZDANCEWIC", "id": "1357-STEPHAN-A--ZDANCEWIC", "name": "STEPHAN A. ZDANCEWIC"}, "num_reviewers": 18, "id": "22819-002-1357-STEPHAN-A--ZDANCEWIC"}]}, "credits": null, "primary_alias": "CIS-120", "path": "/courses/22819", "sections": {"path": "/courses/22819/sections", "values": [{"name": "PROG LANG & TECH I", "sectionnum": "001", "primary_alias": "CIS-120-001", "path": "/courses/22819/sections/001", "id": "22819-001", "aliases": ["CIS-120-001"]}, {"name": "PROG LANG & TECH I", "sectionnum": "002", "primary_alias": "CIS-120-002", "path": "/courses/22819/sections/002", "id": "22819-002", "aliases": ["CIS-120-002"]}]}, "id": 22819, "aliases": ["CIS-120"]}