{"coursehistories": {"path": "/coursehistories/220"}, "description": "Basic principles of protein characterization, enzyme kinetics and mechanism, membrane structure and function, metabolism and biochemistry of energy, and signal transduction. A problem-solving approach will be employed and emphasis will be placed on the application of quantitative methods to biochemical problems. Each of the five major sections of the course will be concluded with group discussions specifically directed at the solution of numerical problems and the interpretation of experimental results. In order to maximize the opportunities for students to think critically, analytically and creatively, most of the material covered in the course will be tested using take-home examinations. Students will have the option of attending sessions in which the recent original literature will be discussed. \n\n", "semester": "2011C", "name": "BIOCHEMISTRY", "reviews": {"path": "/courses/24070/reviews", "values": [{"ratings": {"rAmountLearned": "2.81", "rDifficulty": "3.29", "rStimulateInterest": "2.67", "rRecommendMajor": "3.25", "rCourseQuality": "2.86", "rWorkRequired": "3.00", "rInstructorAccess": "3.52", "rReadingsValue": "2.40", "rRecommendNonMajor": "1.57", "rCommAbility": "2.75", "rInstructorQuality": "3.05"}, "section": {"name": "BIOCHEMISTRY", "sectionnum": "601", "primary_alias": "BIOL-402-601", "path": "/courses/24070/sections/601", "id": "24070-601", "aliases": ["BIOL-402-601"]}, "comments": "BIOL402 covers basic principles of protein characterization, enzyme kinetics and\r\nmechanism, membrane structure and function, metabolism and biochemistry of energy,\r\nand signal transduction. The course applies a problem-solving approach and emphasizes\r\napplication of quantitative methods to biochemical problems. Each of the five major\r\nsections of the course are concluded with group discussions specifically directed at the\r\nsolution of numerical problems and the interpretation of experimental results. To\r\nmaximize opportunities for critical, analytical, and creative thinking, a majority of the\r\nmaterial is tested in the form of take-home examinations. Sessions during which\r\ndiscussions of original literature take place are optional.\r\nStudents generally felt they learned a lot from the course. The class expects\r\nstudents to take three in-class exams, two take-home tests, and write a three thousandword\r\njournal paper. Thus, the majority of the learning experience comes from these\r\nevaluations. One student especially appreciated that the “take home exams put a unique,\r\nclinical perspective on the class,” which was helpful for students planning to pursue a\r\nmedical degree.\r\nProfessor Sanders received mostly positive reviews. One student said that he “is\r\nan amazing teacher who goes out of his way to help the students.” Another liked that he\r\nwas “genuinely enthusiastic” and extremely “understanding.” Other students felt that he\r\ncould be “boring” at times, mostly because the course covered a great deal of material. In\r\ngeneral, Professor Sanders appeared to be readily available to answer questions and\r\nwilling to discuss topics that move beyond the scope of the class.\r\nBecause this is specifically the LPS section, the class was composed of part-time\r\nor pre-medical students. Students found the class quite rigorous with the large number of\r\ndifficult and lengthy exams.", "num_students": 26, "path": "/courses/24070/sections/601/reviews/5712-CARSTEN-SANDERS", "instructor": {"path": "/instructors/5712-CARSTEN-SANDERS", "first_name": "CARSTEN", "last_name": "SANDERS", "id": "5712-CARSTEN-SANDERS", "name": "CARSTEN SANDERS"}, "num_reviewers": 22, "id": "24070-601-5712-CARSTEN-SANDERS"}]}, "credits": null, "primary_alias": "BIOL-402", "path": "/courses/24070", "sections": {"path": "/courses/24070/sections", "values": [{"name": "BIOCHEMISTRY", "sectionnum": "601", "primary_alias": "BIOL-402-601", "path": "/courses/24070/sections/601", "id": "24070-601", "aliases": ["BIOL-402-601"]}]}, "id": 24070, "aliases": ["BIOL-402"]}