[{"ratings": {"rAmountLearned": "1.79", "rDifficulty": "1.57", "rStimulateInterest": "2.25", "rRecommendMajor": "2.39", "rCourseQuality": "2.00", "rWorkRequired": "2.25", "rInstructorAccess": "3.46", "rReadingsValue": "1.57", "rRecommendNonMajor": "1.29", "rCommAbility": "2.89", "rInstructorQuality": "2.71"}, "section": {"name": "ETH/SOC/PRO RES FOR ENG", "sectionnum": "401", "primary_alias": "BE-303-401", "path": "/courses/21315/sections/401", "id": "21315-401", "aliases": ["BE-303-401", "EAS-303-401"]}, "comments": "BE 303, Ethics, Social and Professional Responsibility for Engineers, provides an overview of the ethical and professional responsibilities of engineers, as engineering professionals, as members of engineering organizations, and as participants in medical or scientific research. The course makes extensive use of student group presentations and role-playing in the analysis of cases based on real-world problems with ethical dimensions. The case studies vary from year to year, but are chosen to reflect the full range of engineering fields and disciplines including areas of Bioengineering and Biomedical research.&#8232;&#8232;Although many students did not find the class as intriguing as they had hoped, some commented that they “learned important skills about presentation and group work that aren't explored in many engineering classes.” Many felt that the core of the class, the ethics of engineering, was not really delved into, and because of this, students felt unsatisfied at the end of the semester. &#8232;&#8232;The reaction to Professor Shih was a mixture; half the students described him as “approachable” and “accessible,” while the other half characterized him as “detached” and not fully interested in the material, which they felt negatively affected the class’s attitude. However, they also pointed out that “his attitude was understandable,” as the material itself just was not very interesting. &#8232;&#8232;Students generally thought that a classroom setting would have been more beneficial than the lecture setting in which the course was taught.", "num_students": 36, "path": "/courses/21315/sections/401/reviews/5289-ANDREW-J--SHIH", "instructor": {"path": "/instructors/5289-ANDREW-J--SHIH", "first_name": "ANDREW J.", "last_name": "SHIH", "id": "5289-ANDREW-J--SHIH", "name": "ANDREW J. SHIH"}, "num_reviewers": 35, "id": "21315-401-5289-ANDREW-J--SHIH"}]