[{"ratings": {"rAmountLearned": "2.71", "rDifficulty": "2.77", "rStimulateInterest": "2.40", "rRecommendMajor": "2.96", "rCourseQuality": "2.48", "rWorkRequired": "2.19", "rInstructorAccess": "2.75", "rReadingsValue": "2.10", "rRecommendNonMajor": "1.81", "rCommAbility": "3.04", "rInstructorQuality": "3.01"}, "section": {"name": "LINEAR ALGEBRA", "sectionnum": "001", "primary_alias": "MATH-312-001", "path": "/courses/20460/sections/001", "id": "20460-001", "aliases": ["MATH-312-001"]}, "comments": "This Linear Algebra course counts towards the Math minor, but not the major and has a prerequisite of Math 240.  The class picks up where 240 left off with matrices, Gaussian eliminations, vectors and linear transformations, orthogonality, determinants, and Eigenvalues and Eigenvectors.\r\n\r\nThe textbook for this course is Linear Algebra and its Applications, 4th edition, by Gilbert Strang.  Students rated the textbook as only fair; several complained that the text was not comprehensive enough for the course.\r\n\r\nAttendance for the class was taken each day by means of an attendance quiz, which did not count towards the students’ grades.  The grade for the course was determined by 2 midterm exams, one final exam, and weekly homeworks.  There was no recitation for this course.\r\n\r\nThe class was highly recommended for minors, though not so much for students outside the minor.  Several students found the material to be “complex” and “tough,” but felt that Professor Clee excelled at presenting complex ideas in a way that students could understand.  The only complaint about the professor’s teaching style was that the material after the 1st midterm seemed “disjointed” and “did not flow.” \r\n\r\nOverall, however, students described Clee as a “great professor” and highly recommended him for future classes.  As one student commented, “Professor Clee […] not only makes complex material very clear and understandable, he makes math truly interesting.”", "num_students": 106, "path": "/courses/20460/sections/001/reviews/743-WILLIAM-A-CLEE", "instructor": {"path": "/instructors/743-WILLIAM-A-CLEE", "first_name": "WILLIAM A", "last_name": "CLEE", "id": "743-WILLIAM-A-CLEE", "name": "WILLIAM A CLEE"}, "num_reviewers": 82, "id": "20460-001-743-WILLIAM-A-CLEE"}]