[{"ratings": {"rAmountLearned": "2.32", "rDifficulty": "2.32", "rStimulateInterest": "1.74", "rRecommendMajor": "2.58", "rCourseQuality": "2.25", "rWorkRequired": "2.84", "rInstructorAccess": "3.11", "rReadingsValue": "2.21", "rRecommendNonMajor": "1.89", "rCommAbility": "2.22", "rInstructorQuality": "2.50"}, "section": {"name": "GLOBALIZATION & THE CITY", "sectionnum": "401", "primary_alias": "URBS-457-401", "path": "/courses/23891/sections/401", "id": "23891-401", "aliases": ["URBS-457-401", "SOCI-435-401"]}, "comments": "This seminar title varies depending on which term it is being offered. The title in the summer term is \"Globalization and the Welfare State.\" During the academic year, the title is \"Globalization and the City.\" The themes of the course include comparative and theoretical dimensions, history of cities, and public policy/government. \r\n\r\nStudents had mixed feelings about this course. One student said that it was “at once interesting, frustrating, and annoying.” Some found it to be “interesting,” while others were still not sure what the course was about. Several students mentioned that the course and its readings seemed to be “very biased against neoliberalism” and were annoyed that potentially interesting topics of debate were watered down to “is neoliberalism good or bad.”\r\n\r\nProfessor Hill was described as “knowledgeable” and “excited to teach.” However, several students were annoyed at his choice to have students present most of the material.\r\n\r\nThe course mainly consisted of student presentations and class blogs, about which several students voiced complaints. There was “a lot of reading, perhaps too much.” Some material seemed “unnecessary” and “time consuming” but was found to be helpful when it came to writing the paper. \r\n", "num_students": 20, "path": "/courses/23891/sections/401/reviews/4136-MATTHEW-JAMES-HILL", "instructor": {"path": "/instructors/4136-MATTHEW-JAMES-HILL", "first_name": "MATTHEW JAMES", "last_name": "HILL", "id": "4136-MATTHEW-JAMES-HILL", "name": "MATTHEW JAMES HILL"}, "num_reviewers": 20, "id": "23891-401-4136-MATTHEW-JAMES-HILL"}]