{"coursehistories": {"path": "/coursehistories/3879"}, "description": "\"Environmental imaginaries\" names the contending discourses that order society around processes of development and change. Behind public controversies over development, its subject, objects, and technologies, are an array of collectively wrought fictions that relate people to their material surroundings. We will be especially attentive to solipsistic cartesian fictions that enable the persistent separation of culture from environment. How are these fictions produced, enacted, and materialized in such diverse sites as Appalachian strip mines and Sea World, nature walks and prmit hearing?What kind of environmental imaginary sustains the notion that \"wisdon sits in places\"? How are alternative ways of knowing and being cojured through naming practices, narratives, and other speech genres, as well as yardscapes, protest rallies and other forms of public display? We will traverse the border between humanities and social sciences. How is Bakhtin's law of placement essential for urban planners? Why is Bateson's notion of the thinking system vial for environmental writers? Moving from theories of world making, multiple realities, and aesthetic ecologies through ethnographic literature on culture and environment, and into your own experience, \n\nobsevation, and written reflections, this seminar will explore the production of environmental imaginaries acress a range of modern genres and practices. At stake is nothing less than place, identity, and the nature of human being. \n\n", "semester": "2009C", "name": "ENVRMENTAL IMAGINARIES", "reviews": {"path": "/courses/17395/reviews", "values": [{"ratings": {"rAmountLearned": "3.20", "rDifficulty": "3.20", "rStimulateInterest": "3.20", "rRecommendMajor": "2.80", "rCourseQuality": "3.00", "rWorkRequired": "3.20", "rInstructorAccess": "3.60", "rReadingsValue": "3.00", "rRecommendNonMajor": "3.00", "rCommAbility": "2.80", "rInstructorQuality": "3.00"}, "section": {"name": "ENVRMENTAL IMAGINARIES", "sectionnum": "640", "primary_alias": "FOLK-575-640", "path": "/courses/17395/sections/640", "id": "17395-640", "aliases": ["FOLK-575-640", "ENVS-575-640", "ENGL-584-640"]}, "comments": "", "num_students": 7, "path": "/courses/17395/sections/640/reviews/1441-MARY-T--HUFFORD", "instructor": {"path": "/instructors/1441-MARY-T--HUFFORD", "first_name": "MARY T.", "last_name": "HUFFORD", "id": "1441-MARY-T--HUFFORD", "name": "MARY T. HUFFORD"}, "num_reviewers": 5, "id": "17395-640-1441-MARY-T--HUFFORD"}]}, "credits": null, "primary_alias": "FOLK-575", "path": "/courses/17395", "sections": {"path": "/courses/17395/sections", "values": [{"name": "ENVRMENTAL IMAGINARIES", "sectionnum": "640", "primary_alias": "FOLK-575-640", "path": "/courses/17395/sections/640", "id": "17395-640", "aliases": ["FOLK-575-640", "ENVS-575-640", "ENGL-584-640"]}]}, "id": 17395, "aliases": ["FOLK-575", "ENVS-575", "ENGL-584"]}