{"coursehistories": {"path": "/coursehistories/4197"}, "description": "This course focuses on the challenges encountered in building Internet and web systems: scalability, interoperability (of data and code), security and fault tolerance, consistency models, and location of resources, services, and data. We will examine how XML standards enable information exchange; how web services support cross-platform interoperability (and what their limitations are); how to build high-performance application servers; how \"cloud computing\" services work; how to perform Akamai-like content distribution; and how to provide transaction support in distributed environments. We will study techniques for locating machines, resources, and data (including directory systems, information retrieval indexing, ranking, and web search); and we will investigate how different architectures support scalability (and the issues they face). We will also examine ideas that have been proposed for tomorrow's Web, and we will see some of the challenges, research directions, and potential pitfalls. An important goal of the course is not simply to discuss issues and solutions, but to provide hands-on experience with a substantial implementation project. \n\nThis semester's project will be a peer-to-peer implementation of a Googe-style search engine, including distributed, scalable crawling; indexing with ranking; and even PageRank. As a side-effect of the material of this course you will learn about some aspects of large-scale software development assimilating large APIs. \n\n", "semester": "2010A", "name": "INTERNET & WEB SYSTEMS", "reviews": {"path": "/courses/25808/reviews", "values": [{"ratings": {"rAmountLearned": "3.52", "rDifficulty": "3.39", "rStimulateInterest": "3.27", "rRecommendMajor": "3.58", "rCourseQuality": "3.36", "rWorkRequired": "3.88", "rInstructorAccess": "3.52", "rReadingsValue": "3.00", "rRecommendNonMajor": "1.73", "rCommAbility": "3.58", "rInstructorQuality": "3.58"}, "section": {"name": "INTERNET & WEB SYSTEMS", "sectionnum": "401", "primary_alias": "CIS-455-401", "path": "/courses/25808/sections/401", "id": "25808-401", "aliases": ["CIS-455-401", "CIS-555-401"]}, "comments": "", "num_students": 39, "path": "/courses/25808/sections/401/reviews/2073-ZACHARY-G--IVES", "instructor": {"path": "/instructors/2073-ZACHARY-G--IVES", "first_name": "ZACHARY G.", "last_name": "IVES", "id": "2073-ZACHARY-G--IVES", "name": "ZACHARY G. IVES"}, "num_reviewers": 36, "id": "25808-401-2073-ZACHARY-G--IVES"}]}, "credits": null, "primary_alias": "CIS-455", "path": "/courses/25808", "sections": {"path": "/courses/25808/sections", "values": [{"name": "INTERNET & WEB SYSTEMS", "sectionnum": "401", "primary_alias": "CIS-455-401", "path": "/courses/25808/sections/401", "id": "25808-401", "aliases": ["CIS-455-401", "CIS-555-401"]}]}, "id": 25808, "aliases": ["CIS-455", "CIS-555"]}