{"coursehistories": {"path": "/coursehistories/2306"}, "description": "The course will consider the creation of a distinctive European civilization from the economic, political, and cultural revolution of the late tenth and eleventh centuries to the beginning of the extension of European power into the non-European world around the turn of the sixteenth century. the course will consider change and continuity on both large and small scales, emphasizing such themes as power and order, the complexities of a pre-industrial economy, the formation of ethnic identities, and the worlds of formal thought and learning as well as those of the imagination and the arts. The course will also consider relations between Europe and the Islamic and Byzantine worlds as well as the role of northern and eastern Europe. A substantial part of the required reading will be original source materials in translation. \n\n", "semester": "2011A", "name": "WORLD OF THE MIDDLE AGES", "reviews": {"path": "/courses/21843/reviews", "values": [{"ratings": {"rAmountLearned": "2.60", "rDifficulty": "2.47", "rStimulateInterest": "2.13", "rRecommendMajor": "2.43", "rCourseQuality": "2.24", "rWorkRequired": "3.00", "rInstructorAccess": "2.57", "rReadingsValue": "2.47", "rRecommendNonMajor": "1.80", "rCommAbility": "2.73", "rInstructorQuality": "2.94"}, "section": {"name": "WORLD OF THE MIDDLE AGES", "sectionnum": "001", "primary_alias": "HIST-031-001", "path": "/courses/21843/sections/001", "id": "21843-001", "aliases": ["HIST-031-001"]}, "comments": "This course covers the creation of a distinctive European civilization from the economic, political, and cultural revolution of the late tenth and eleventh centuries to the beginning of the extension of European power into the non-European world around the turn of the sixteenth century. The course looks at change and continuity on both large and small scales, emphasizing such themes as power and order, the complexities of a pre-industrial economy, the formation of ethnic identities, and the worlds of formal thought and learning as well as those of the imagination and the arts.&#8232;&#8232;A substantial part of the required reading is original source materials in translation. Some students commented that the focus on original source materials caused the coursework to be very challenging. Most students found the course interesting and informative.&#8232;&#8232;Professor Goldberg received positive reviews. Most students wrote that they enjoyed her accessibility and “genuine passion” for her subject.&#8232;&#8232;The course consists of weekly quizzes or writing assignments, two exams, and a paper. There are no prerequisites listed for the course. This course may be used to fulfill the History and Tradition Sector requirement.", "num_students": 22, "path": "/courses/21843/sections/001/reviews/3322-JESSICA-GOLDBERG", "instructor": {"path": "/instructors/3322-JESSICA-GOLDBERG", "first_name": "JESSICA", "last_name": "GOLDBERG", "id": "3322-JESSICA-GOLDBERG", "name": "JESSICA GOLDBERG"}, "num_reviewers": 17, "id": "21843-001-3322-JESSICA-GOLDBERG"}]}, "credits": null, "primary_alias": "HIST-031", "path": "/courses/21843", "sections": {"path": "/courses/21843/sections", "values": [{"name": "WORLD OF THE MIDDLE AGES", "sectionnum": "001", "primary_alias": "HIST-031-001", "path": "/courses/21843/sections/001", "id": "21843-001", "aliases": ["HIST-031-001"]}]}, "id": 21843, "aliases": ["HIST-031"]}