[{"ratings": {"rAmountLearned": "2.38", "rDifficulty": "2.17", "rStimulateInterest": "2.23", "rRecommendMajor": "3.08", "rCourseQuality": "2.54", "rWorkRequired": "2.46", "rInstructorAccess": "3.31", "rReadingsValue": "2.54", "rRecommendNonMajor": "2.31", "rCommAbility": "2.46", "rInstructorQuality": "2.77"}, "section": {"name": "SOCIAL IMPACT OF MKTG", "sectionnum": "001", "primary_alias": "MKTG-233-001", "path": "/courses/26416/sections/001", "id": "26416-001", "aliases": ["MKTG-233-001"]}, "comments": "\r\nThis course explores the ways in which the marketing actions of firms can have an impact on society, positive or negative. Of particular interest are the actions that are central to the main products and services delivered by the firm, such as the development of products and brands, pricing, advertising, and distribution. The course is structured around four problem areas: impact on health and well-being (physical and mental), impact on the environment, impact on culture (including innovation and creativity), and impact on poverty and economic development. \r\n\r\nMost students enjoyed this course and thought it provided “really interesting concepts.” Students also said that discussions were engaging and “stimulated thinking and reexamining of the criteria for which we look at impacts of business and marketing actions in society.” Some thought that lectures could offer “more robust frameworks for guiding our evaluation of social impact.” \r\n\r\nGenerally students thought Professor Hutchinson did a “great job in shaping the course material around the cases, readings, and external speakers, all of which were relevant and added to the amount learned.” Some felt though that the professor made it “very obvious that she believed there is a ‘right’ answer.” \r\n\r\nThe course meets twice a week. Typically, one session is lecture and/or a case, and one session is an in-class event, such as a guest speaker, student presentations, or simulation game. The main deliverables for the course are two position papers and a final short essay evaluating the social impact of companies or products in a specific industry. Students enjoyed the position papers and presentations in this course because it gave them the opportunity to collaborate with other members of the class. Some mentioned that it covers a lot of material for a half-credit course.", "num_students": 17, "path": "/courses/26416/sections/001/reviews/828-JOHN-W-HUTCHINSON", "instructor": {"path": "/instructors/828-JOHN-W-HUTCHINSON", "first_name": "JOHN W", "last_name": "HUTCHINSON", "id": "828-JOHN-W-HUTCHINSON", "name": "JOHN W HUTCHINSON"}, "num_reviewers": 13, "id": "26416-001-828-JOHN-W-HUTCHINSON"}]