{"coursehistories": {"path": "/coursehistories/4636"}, "description": "Millions of people of all ages live with chronic illness(es). A diagnosis of a chronic illness is a life-changing event, causing disruption and a sense of loss for many. Common early responses are stress, anxiety, depression, fear, and anger. Over time, with support and experience with the illness, many adjust. But, others report persistent feelings of loss due to physical, emotional, spiritual/existential, social, occupational, and/or financial influences of chronic illness. Those who adjust the best typically find a way to return a sense of normalcy to their lives. Loved ones and caregivers are equally affected by chronic illness and much has been written in recent years about caregiver burden. However, some individuals (caregivers and patients) report positive responses to illness, including a deepened purpose for living and a reordering of life priorities. \n\nThe focus of this course is on individual responses to chronic illness- the person diagnosed and his/her loved ones. This course is intended to complement N818, which focuses on families and dyads dealing with chronic illness. In this course we will explore the major theoretical perspectives that underlie this field. The literature describing common responses of both those diagnosed and their loved ones as well as the social and cultural context that helps explain the responses of individuals facing chronic illness will be examined. Methods used to study chronic illness will be explored in depth. \n\n", "semester": "2011C", "name": "RESPONSE TO CHRONIC ILLNESS: THEORY AND RESEARCH", "reviews": {"path": "/courses/24928/reviews", "values": [{"ratings": {"rAmountLearned": "3.50", "rDifficulty": "3.00", "rStimulateInterest": "4.00", "rRecommendMajor": "3.50", "rCourseQuality": "3.67", "rWorkRequired": "3.00", "rInstructorAccess": "4.00", "rReadingsValue": "4.00", "rRecommendNonMajor": "2.00", "rCommAbility": "4.00", "rInstructorQuality": "4.00"}, "section": {"name": "RESPONSE TO CHRONIC ILLNESS: THEORY AND RESEARCH", "sectionnum": "301", "primary_alias": "NURS-828-301", "path": "/courses/24928/sections/301", "id": "24928-301", "aliases": ["NURS-828-301"]}, "comments": "", "num_students": 3, "path": "/courses/24928/sections/301/reviews/1902-BARBARA-J--RIEGEL", "instructor": {"path": "/instructors/1902-BARBARA-J--RIEGEL", "first_name": "BARBARA J.", "last_name": "RIEGEL", "id": "1902-BARBARA-J--RIEGEL", "name": "BARBARA J. RIEGEL"}, "num_reviewers": 3, "id": "24928-301-1902-BARBARA-J--RIEGEL"}]}, "credits": null, "primary_alias": "NURS-828", "path": "/courses/24928", "sections": {"path": "/courses/24928/sections", "values": [{"name": "RESPONSE TO CHRONIC ILLNESS: THEORY AND RESEARCH", "sectionnum": "301", "primary_alias": "NURS-828-301", "path": "/courses/24928/sections/301", "id": "24928-301", "aliases": ["NURS-828-301"]}]}, "id": 24928, "aliases": ["NURS-828"]}