{"coursehistories": {"path": "/coursehistories/1831"}, "description": "The course focuses on the natural history of different wetland types including climate, geology, and,hydrology factors that influence wetland development Associated soil, vegetation, and wildlife characteristics and key ecological processes will be covered as well. Lectures will be supplemented with weekend wetland types, ranging from tidal salt marshes to non-tidal marshes, swamps, and glacial bogs in order to provide field experience in wetland identification, characterization, and functional assessment. Outside speakers will discuss issues in wetland seed bank ecology, federal regulation, and mitigation. Students will present a short paper on the ecology of a wetland animal and a longer term paper on a selected wetland topic. Readings from the text, assorted journal papers, government technical documents, and book excerpts will provide a broad overview of the multifaceted field of wetland study. \n\n", "semester": "2011C", "name": "WETLANDS", "reviews": {"path": "/courses/24352/reviews", "values": [{"ratings": {"rAmountLearned": "2.69", "rDifficulty": "2.08", "rStimulateInterest": "3.38", "rRecommendMajor": "3.46", "rCourseQuality": "2.54", "rWorkRequired": "2.46", "rInstructorAccess": "3.77", "rReadingsValue": "2.77", "rRecommendNonMajor": "2.77", "rCommAbility": "3.31", "rInstructorQuality": "3.38"}, "section": {"name": "WETLANDS", "sectionnum": "660", "primary_alias": "ENVS-507-660", "path": "/courses/24352/sections/660", "id": "24352-660", "aliases": ["ENVS-507-660"]}, "comments": "The course focuses on the natural history of different wetland types including\r\nclimate, geology, and, hydrology factors that influence wetland development. Associated\r\nsoil, vegetation, and wildlife characteristics and key ecological processes are covered as\r\nwell. Lectures are supplemented with weekend wetland types, ranging from tidal salt\r\nmarshes to non-tidal marshes, swamps, and glacial bogs in order to provide field\r\nexperience in wetland identification, characterization, and functional assessment. Outside\r\nspeakers discuss issues in wetland seed bank ecology, federal regulation, and mitigation.\r\nStudents present a short paper on the ecology of a wetland animal and a longer term\r\npaper on a selected wetland topic. Readings from the text, assorted journal papers,\r\ngovernment technical documents, and book excerpts provide a broad overview of the\r\nmultifaceted field of wetland study.\r\nMany students reported that this was a “superb course.” In particular, students\r\nnoted that the “field trips were amazing.” Students found they were able to “witness\r\nfirsthand the conceptual underpinnings of the course,” which greatly helped their\r\nlearning. Some students wished there was a greater “focus on technical wetland\r\nelements” instead of the amount of time spent on student presentations, which was\r\n“somewhat excessive.”\r\nStudents overwhelmingly referred to Professor Willig as an “excellent instructor.”\r\nOne student described her as “a very engaged and engaging teacher… [with] unrivaled\r\nenthusiasm and impressive knowledge of the subject matter she teaches.” One student\r\nalso noted she was “very supportive.”\r\nSome students complained that information in the assigned readings “was rarely\r\nbrought up in class” and that the books were “not necessarily needed.”", "num_students": 16, "path": "/courses/24352/sections/660/reviews/572-SARAH-A--WILLIG", "instructor": {"path": "/instructors/572-SARAH-A--WILLIG", "first_name": "SARAH A.", "last_name": "WILLIG", "id": "572-SARAH-A--WILLIG", "name": "SARAH A. WILLIG"}, "num_reviewers": 13, "id": "24352-660-572-SARAH-A--WILLIG"}]}, "credits": null, "primary_alias": "ENVS-507", "path": "/courses/24352", "sections": {"path": "/courses/24352/sections", "values": [{"name": "WETLANDS", "sectionnum": "660", "primary_alias": "ENVS-507-660", "path": "/courses/24352/sections/660", "id": "24352-660", "aliases": ["ENVS-507-660"]}]}, "id": 24352, "aliases": ["ENVS-507"]}