[{"ratings": {"rAmountLearned": "2.64", "rDifficulty": "3.31", "rStimulateInterest": "2.87", "rRecommendMajor": "3.04", "rCourseQuality": "2.57", "rWorkRequired": "3.34", "rInstructorAccess": "2.39", "rReadingsValue": "2.48", "rRecommendNonMajor": "1.51", "rCommAbility": "2.67", "rInstructorQuality": "2.85"}, "section": {"name": "INVESTMENT MANAGEMENT", "sectionnum": "001", "primary_alias": "FNCE-205-001", "path": "/courses/26060/sections/001", "id": "26060-001", "aliases": ["FNCE-205-001"]}, "comments": "FNCE205 is designed to acquaint the student with the concepts of portfolio analysis in the general area of institutional investment management. The course discusses principles for managing financial assets. These principles apply, for example, to managing corporate pension funds, bank-administered trusts, and other institutional funds. Students will learn how to establish appropriate investment objectives, develop optimal portfolio strategies, estimate risk-return tradeoffs, and evaluate investment performance. Many of the latest quantitative approaches are discussed. The prerequisites are FNCE100, FNCE101, STAT101 and STAT102.\r\n\r\nStudents found the course to be very interesting, but “heavy on financial theory.” They stressed that the course provides an excellent and very important base on theoretical knowledge, but little real world application. There is also a heavy emphasis on statistics work.\r\n\r\nMany students had praise for Professor Geczy as an “incredibly smart” teacher. He is very approachable and happy to answer questions in an “articulate matter [sic].” One student explained that Professor Geczy \"is a great lecturer and is able to explain complicated/abstract material in a way that is easy to follow.” However, a main complaint was the Professor's frequent absence from class. The Professor had to reschedule lecture four to five times throughout the semester. \r\n\r\nThe course has homework assignments which have been called “challenging,” while the exams were “usual fare” at Penn.", "num_students": 56, "path": "/courses/26060/sections/001/reviews/516-CHRISTOPHER-C--GECZY", "instructor": {"path": "/instructors/516-CHRISTOPHER-C--GECZY", "first_name": "CHRISTOPHER C.", "last_name": "GECZY", "id": "516-CHRISTOPHER-C--GECZY", "name": "CHRISTOPHER C. GECZY"}, "num_reviewers": 55, "id": "26060-001-516-CHRISTOPHER-C--GECZY"}]