{"coursehistories": {"path": "/coursehistories/870"}, "description": "The explosion of scientific knowledge in early modern Europe cast doubt not only on the medieval worldview but also on its assumption of a theological guarantee for the possibility of human knowledge. Thus modern philosophers had to begin the project of establishing standards and foundations for human knowledge without a divine guarantee. The Reformation and the growth of secular states in the sixteenth and seventeenth centuries presented a similar challenge for modern moral and political philosophy, which thus faced the challenge of establishing norms for human conduct and their foundation without divine commands. We shall examine how the leading philosophers of modern times confronted these challenges, focusing primarily on the challenge for modern theories of knowledge but also considering at least some of the parallel developments in modern moral philosophy. Readings will include selections from Descartes, Leibniz, Locke, Berkeley, Hume, Kant, and in the nineteenth century, the great American philosopher Charles Sanders Peirce. \n\nWritten work will include several short papers and a final examination. Attendance at both lectures and discussion sections will be required, and participation in both can also count towards final grades. \n\n", "semester": "2010A", "name": "HISTORY OF MODERN PHILOS", "reviews": {"path": "/courses/26595/reviews", "values": [{"ratings": {"rAmountLearned": "2.85", "rDifficulty": "2.53", "rStimulateInterest": "2.96", "rRecommendMajor": "3.47", "rCourseQuality": "2.76", "rWorkRequired": "2.69", "rInstructorAccess": "2.75", "rReadingsValue": "2.75", "rRecommendNonMajor": "2.40", "rCommAbility": "3.35", "rInstructorQuality": "3.26"}, "section": {"name": "HISTORY OF MODERN PHILOS", "sectionnum": "001", "primary_alias": "PHIL-004-001", "path": "/courses/26595/sections/001", "id": "26595-001", "aliases": ["PHIL-004-001"]}, "comments": "In this course, students read and analyze some of the centrally important works of seventeenth-and eighteenth-century philosophy, including writings from Descartes, Locke, Hume, and Kant. The course focuses on metaphysics (the fundamental nature of reality) and epistemology (theory of knowledge). The aim of the course is to focus on a few seminal texts in the history of modern philosophy especially appropriate to the themes noted above, not to provide a broad survey of philosophy.\r\n\r\nStudents who took this course generally reported learning a great deal. Many complimented the course material as “rather interesting,” “excellent,” and “a good introduction to philosophical inquiry.” However, a common complaint was that there was “too much material packed into each lecture” and students also found the recitation “largely-useless.” A few students complained that the essay questions for the course were graded “based on whether or not you adhered to a strictly bland summary of the works” rather than “analysis or argument using the material as a subject.” While the readings were “difficult” and “tough;” as one student put it, “it's a lot of work, but you gain a lot from it.”\r\n\r\nProfessor Detlefsen has earned her students' stamp of approval. Not only does one student think she is “the bomb,” but also claims she is “the coolest person around and an awesome philosopher.” Her pupils especially extoll her lecturing prowess. They report that though there are weekly readings, “the professor is so good that attending lectures is enough to do the work.” On top of that, Professor Detlefsen “explains philosophy in a way that is accessible novices.”\r\n\r\nMany students found that there was “too much material packed into each lecture” and that Professor Detlefsen often had to “brush aside people’s questions in order to get through the material.” In addition, some students thought that “the essay questions were poorly written” which was “made it difficult to achieve a good grade.” Overall, however, students found that “the work load [was] light” and that “attending lecture is enough to do the work.” Though some thought the readings were “difficult,” others thought they were “clear” and “helpful.” This course fulfills the requirement for the History and Tradition Sector.", "num_students": 73, "path": "/courses/26595/sections/001/reviews/945-KAREN-E--DETLEFSEN", "instructor": {"path": "/instructors/945-KAREN-E--DETLEFSEN", "first_name": "KAREN E.", "last_name": "DETLEFSEN", "id": "945-KAREN-E--DETLEFSEN", "name": "KAREN E. DETLEFSEN"}, "num_reviewers": 64, "id": "26595-001-945-KAREN-E--DETLEFSEN"}]}, "credits": null, "primary_alias": "PHIL-004", "path": "/courses/26595", "sections": {"path": "/courses/26595/sections", "values": [{"name": "HISTORY OF MODERN PHILOS", "sectionnum": "001", "primary_alias": "PHIL-004-001", "path": "/courses/26595/sections/001", "id": "26595-001", "aliases": ["PHIL-004-001"]}]}, "id": 26595, "aliases": ["PHIL-004"]}