{"coursehistories": {"path": "/coursehistories/248"}, "description": "Continuation of CHEM 053. \n\n", "semester": "2009C", "name": "GEN CHEM LAB II", "reviews": {"path": "/courses/17071/reviews", "values": [{"ratings": {"rAmountLearned": "1.66", "rDifficulty": "2.56", "rStimulateInterest": "1.16", "rRecommendMajor": "2.69", "rCourseQuality": "1.37", "rWorkRequired": "3.16", "rInstructorAccess": "1.98", "rReadingsValue": "1.27", "rRecommendNonMajor": "0.56", "rCommAbility": "1.55", "rInstructorQuality": "1.51"}, "section": {"name": "GEN CHEM LAB II", "sectionnum": "001", "primary_alias": "CHEM-054-001", "path": "/courses/17071/sections/001", "id": "17071-001", "aliases": ["CHEM-054-001"]}, "comments": "This course is a continuation of CHEM053, covering aspects of qualitative and quantitative analysis, determination of chemical and physical properties, and chemical synthesis. Chemistry 102 is a co-requisite.\r\n\r\nMany students complained that they learned little from this course, oftentimes claiming that it was “very frustrating” because it lacked structure and direction. Professor Maeyer attempted to do things differently, although many students felt the course needed a lot of work and improvement. Students are expected to maintain a lab notebook and turn in lab reports on a regular basis. Many students said they felt lab reports weren’t valuable, but required a lot of “unnecessary fluff” to fill in the required sections. Others added that lab reports required “unreasonable amounts of time,” and were often at least 10 pages long. Overall, one student felt that the course was “pointless.”\r\n\r\nThe great majority of students said that Professor Maeyer was “highly disorganized,” which made it hard to figure out when assignments were due. She also frequently posted material on Blackboard very late so that students often felt hurried in completing their assignments. A few students commented that Professor Maeyer was hardly available for help and didn’t respond to emails. However, others commented that she was “very willing to help students,” and a couple students felt that she was well-meaning in her efforts to reformat the course.\r\n\r\nMany students reported discontentment with content on exams and grading of lab reports. Many complained that tests didn’t reflect what was taught in lab, lectures, the manual, or material found on blackboard. Some students claimed grading was too subjective and that it was “clear that not even the TAs knew how to grade the lab reports fairly.”", "num_students": 76, "path": "/courses/17071/sections/001/reviews/4760-JENINE-MAEYER", "instructor": {"path": "/instructors/4760-JENINE-MAEYER", "first_name": "JENINE", "last_name": "MAEYER", "id": "4760-JENINE-MAEYER", "name": "JENINE MAEYER"}, "num_reviewers": 73, "id": "17071-001-4760-JENINE-MAEYER"}]}, "credits": null, "primary_alias": "CHEM-054", "path": "/courses/17071", "sections": {"path": "/courses/17071/sections", "values": [{"name": "GEN CHEM LAB II", "sectionnum": "001", "primary_alias": "CHEM-054-001", "path": "/courses/17071/sections/001", "id": "17071-001", "aliases": ["CHEM-054-001"]}]}, "id": 17071, "aliases": ["CHEM-054"]}