[{"ratings": {"rAmountLearned": "3.35", "rDifficulty": "2.83", "rStimulateInterest": "2.77", "rRecommendMajor": "3.66", "rCourseQuality": "3.15", "rWorkRequired": "2.57", "rInstructorAccess": "2.74", "rReadingsValue": "2.36", "rRecommendNonMajor": "2.58", "rCommAbility": "3.32", "rInstructorQuality": "3.12"}, "section": {"name": "FUNDING INVESTMENTS", "sectionnum": "001", "primary_alias": "FNCE-238-001", "path": "/courses/17376/sections/001", "id": "17376-001", "aliases": ["FNCE-238-001"]}, "comments": "Finance 238 examines the available corporate securities that firms can use to finance investment. The course focuses on: (1) the design of these securities (Why do bonds have embedded options? What is the role of preferred stock?); (2) the issuing process for these securities (What do investment banks do? Is the underwriting process important for the cost of capital?); (3) the pricing of these securities (How are credit risk in bonds and loans priced?) The securities covered include corporate and junk bonds, bank loans, common and preferred equity, commercial paper, securitization, as well as some recent innovations. Other topics include: the role of embedded options in corporate bonds; the role of bank and loan covenants; the function of bond rating agencies; exchange offers; prepackaged bankruptcies; bankruptcy in Chapter 11; workouts; debtor-in-possession financing; and pricing credit risk. The course is designed to be complementary to Advanced Corporate Finance and Fixed Income Securities.\r\n\r\nStudent opinion of this course was overwhelmingly positive. Several students expressed that they enjoyed learning various new topics that had not been covered in most other finance classes. Many believed that the information presented was highly relevant, interesting, and practical. According to one student, this course “should be a Wharton requirement,” since the material “covers all the stuff that students out of a business school ought to know.” “This has been my favorite finance course at Penn thus far,” commented another student.\r\n\r\nPraise for Professor Musto was also considerable. Many found his teaching style agreeable, noting that he provided a variety of outside resources, was “very approachable,” and “communicated the subject matter in a manner that was immediately very clear to all students.” Students repeatedly mentioned Professor Musto’s broad knowledge of the course material as a strong positive of the class experience.\r\n\r\nStudents generally found the course load, required preparation, and exams manageable and fair. One student stated, “I thought there was the proper amount of work between the homework, cases, and readings. The exams required you to think rather than just regurgitate facts, but were not impossible, either.” \r\n", "num_students": 68, "path": "/courses/17376/sections/001/reviews/520-DAVID-K--MUSTO", "instructor": {"path": "/instructors/520-DAVID-K--MUSTO", "first_name": "DAVID K.", "last_name": "MUSTO", "id": "520-DAVID-K--MUSTO", "name": "DAVID K. MUSTO"}, "num_reviewers": 63, "id": "17376-001-520-DAVID-K--MUSTO"}]