{"coursehistories": {"path": "/coursehistories/4574"}, "description": "\"God is dead.\" This famous, all too famous death sentence, issued by the 19th-century German philosopher Friedrich Nietzsche, also signaled the genesis of a radical challenge to traditional notions of morality, cultural life, and the structure of society as a whole. In this course we will examine both the \"modernity\" of Nietzsche's thought and the ways in which his ideas have helped to define the very concept of Modernity (and, arguably, Postmodernity) itself. In exploring the origin and evolution of Nietzsche's key concepts, we will trace the ways in which his work has been variously revered or refuted, championed or co-opted, for more than a century. We will survey his broad influence on everything from philosophy and literature to music and art, theater and psychology, history and cultural theory, politics and popular culture. Further, we will ask how his ideas continue to challenge us today, though perhaps in unexpected ways. As we will see, Nietzsche wanted to teach us \"how to philosophize with a hammer.\" \n\n", "semester": "2009C", "name": "Nietzsche's Modernity and the Death of God", "reviews": {"path": "/courses/17453/reviews", "values": [{"ratings": {"rAmountLearned": "3.09", "rDifficulty": "2.23", "rStimulateInterest": "2.73", "rRecommendMajor": "3.23", "rCourseQuality": "2.68", "rWorkRequired": "2.41", "rInstructorAccess": "3.23", "rReadingsValue": "3.71", "rRecommendNonMajor": "2.91", "rCommAbility": "2.73", "rInstructorQuality": "3.18"}, "section": {"name": "Nietzsche's Modernity and the Death of God", "sectionnum": "401", "primary_alias": "GRMN-248-401", "path": "/courses/17453/sections/401", "id": "17453-401", "aliases": ["GRMN-248-401", "PHIL-067-401", "RELS-238-401", "COML-268-401"]}, "comments": "“God is dead.” This famous, all too famous death sentence, issued by the 19th-century German philosopher Friedrich Nietzsche, also signaled the genesis of a radical challenge to traditional notions of morality, cultural life, and the structure of society as a whole. In this course we will examine both the “modernity” of Nietzsche’s thought and the ways in which his ideas have helped to define the very concept of Modernity (and, arguably, Postmodernity) itself. In exploring the origin and evolution of Nietzsche’s key concepts, we will trace the ways in which his work has been variously revered or refuted, championed or co-opted, for more than a century. This class will survey his broad influence on everything from philosophy and literature to music and art, theater and psychology, history and cultural theory, politics and popular culture. Further, the course will ask how his ideas continue to challenge us today, though perhaps in unexpected ways. As we will see, Nietzsche wanted to teach us “how to philosophize with a hammer.” This will be the task throughout the course as students take his work into hand as a potentially powerful tool for thought. Ultimately, the course will ask not only if it can still deliver formidable blows, but how we might wield it most skillfully, guided by a spirit of challenge, sedulous reading, and critical precision. Readings will draw on the work of several key cultural and historical figures, including Rainer Maria Rilke, Hermann Hesse, and Thomas Mann; Sigmund Freud and Carl Jung; Jean-Paul Sartre, Hannah Arendt, and Martin Heidegger; Adolf Hitler and Benito Mussolini; Jacques Derrida and Michel Foucault; Richard Nixon and Jerry Seinfeld.&#8232;&#8232;\r\n\r\nStudents commented that this was a great course and that they learned a lot from it. One student said that this was a good introduction course in Nietzsche, and another mentioned that the readings and materials were fascinating. Many of the students also said that the course would have benefited if there had been more lecturing and less discussion.&#8232;&#8232;\r\n\r\nStudents said that Professor Jarosinski was very knowledgeable on the subject of the course, a good lecturer, personable, enthusiastic, and flexible. One student also said that Professor Jarosinski was agreeable. However, several students said that he was disorganized with his lectures and would sometimes let discussions get off topic in tangents.\r\n\r\nStudents seemed to agree that the readings were interesting but some felt that the discussions were a bit “slow” and students often got caught up in tangential discussions.  \r\n", "num_students": 25, "path": "/courses/17453/sections/401/reviews/3980-ERIC-JAROSINSKI", "instructor": {"path": "/instructors/3980-ERIC-JAROSINSKI", "first_name": "ERIC", "last_name": "JAROSINSKI", "id": "3980-ERIC-JAROSINSKI", "name": "ERIC JAROSINSKI"}, "num_reviewers": 22, "id": "17453-401-3980-ERIC-JAROSINSKI"}]}, "credits": null, "primary_alias": "GRMN-248", "path": "/courses/17453", "sections": {"path": "/courses/17453/sections", "values": [{"name": "Nietzsche's Modernity and the Death of God", "sectionnum": "401", "primary_alias": "GRMN-248-401", "path": "/courses/17453/sections/401", "id": "17453-401", "aliases": ["GRMN-248-401", "PHIL-067-401", "RELS-238-401", "COML-268-401"]}]}, "id": 17453, "aliases": ["GRMN-248", "PHIL-067", "RELS-238", "COML-268"]}