[{"ratings": {"rAmountLearned": "2.93", "rDifficulty": "3.01", "rStimulateInterest": "2.43", "rRecommendMajor": "3.68", "rCourseQuality": "2.55", "rWorkRequired": "3.51", "rInstructorAccess": "2.62", "rReadingsValue": "2.27", "rRecommendNonMajor": "2.01", "rCommAbility": "2.60", "rInstructorQuality": "2.75"}, "section": {"name": "PROG LANG & TECH I", "sectionnum": "001", "primary_alias": "CIS-120-001", "path": "/courses/25793/sections/001", "id": "25793-001", "aliases": ["CIS-120-001"]}, "comments": "This class introduces “the fundamental concepts of programming and software design” using java and python. Topics includes top-down program design, testing and debugging, interactive programming, iteration, recursion, data structures, and inheritance.\r\n\r\nStudents felt that the class was a good combination of “theory and practice,” with a few explicitly commenting that the use of java made the content feel more applicable. However, students were polarized towards the disconnect between lectures and the homework – some enjoyed spending time outside class learning more applied material for their homework, while others disliked bridging the gap outside of class.\r\n\r\nProfessor Marcus was described as “very entertaining” but also difficult to follow in class occasionally. Some students found lectures “hard to digest” because Professor Marcus sometimes had trouble remembering the correspondence between items on his lectures slides and the topics of discussion.\r\n\r\nHomework was often described as a “disproportionately high percentage of work” that did not receive enough weight in the final grade. On the other hand, exams counted for a large portion of the final grade, yet students felt that being tested on writing code with paper and pencil did not capture well their understanding of the material. The course recommends that students have at least a high-school level background in computer programming, but does not require familiarity with java or python specifically. ", "num_students": 107, "path": "/courses/25793/sections/001/reviews/1345-MITCHELL-PHILIP-MARCUS", "instructor": {"path": "/instructors/1345-MITCHELL-PHILIP-MARCUS", "first_name": "MITCHELL PHILIP", "last_name": "MARCUS", "id": "1345-MITCHELL-PHILIP-MARCUS", "name": "MITCHELL PHILIP MARCUS"}, "num_reviewers": 103, "id": "25793-001-1345-MITCHELL-PHILIP-MARCUS"}]