[{"ratings": {"rAmountLearned": "3.11", "rDifficulty": "2.29", "rStimulateInterest": "3.74", "rRecommendMajor": "3.70", "rCourseQuality": "3.53", "rWorkRequired": "1.93", "rInstructorAccess": "3.11", "rReadingsValue": "2.75", "rRecommendNonMajor": "3.59", "rCommAbility": "3.61", "rInstructorQuality": "3.63"}, "section": {"name": "SPORTS LAW", "sectionnum": "001", "primary_alias": "LGST-228-001", "path": "/courses/24649/sections/001", "id": "24649-001", "aliases": ["LGST-228-001"]}, "comments": "Legal Studies 228 focuses on the areas of association, contract, constitutional, labor, antitrust, and agency law as they apply to the sports industry.  This course exposes the student to many of the legal issues facing those in sport organizations.  Special attention is given to the regulation of professional and amateur athletics, agency law, antitrust law, the organizational structure of sports leagues and associations, labor-management relations, and Title IX. The development of effective communication skills will be emphasized through class presentations and written assignments, leadership and interpersonal communications will be developed through small group projects and meetings, and critical thinking and problem solving skills will be fostered through the careful study of numerous cases.\r\n\r\nStudents said the course was “awesome” and “great for those who don’t know much about major league sports.”  Many found it extremely interesting, engaging, and unique.  Students liked that the concepts discussed in class were relevant to current events. One student named the course “one of the most interesting classes” offered at Penn.\r\n\r\nStudents found Professor Brandt very “willing to address any concerns.”  Most called him an “outstanding professor.”  He does a good job “stimulating student interest about the laws and policies relating to professional sports” and he also has “real experience in the sports industry.”\r\n\r\nThe class required one large paper that made up the whole grade, rather than several short papers. The amount of reading “was large, with six reading assignments of approximately 100 pages per assignment,” but another student mentioned that the readings were not required.  Many of the lectures were student led. The course “does assume students know a good deal about the sports leagues prior to taking the class, but it’s very possible to take it and enjoy it without this background.”\r\n", "num_students": 56, "path": "/courses/24649/sections/001/reviews/4401-ANDREW-D--BRANDT", "instructor": {"path": "/instructors/4401-ANDREW-D--BRANDT", "first_name": "ANDREW D.", "last_name": "BRANDT", "id": "4401-ANDREW-D--BRANDT", "name": "ANDREW D. BRANDT"}, "num_reviewers": 51, "id": "24649-001-4401-ANDREW-D--BRANDT"}]