{"coursehistories": {"path": "/coursehistories/2145"}, "description": "An applied graduate level course in multiple regression and analysis of variance for students who have completed an undergraduate course in basic statistical methods. Emphasis is on practical methods of data analysis and their interpretation. Covers model building, general linear hypothesis, residual analysis, leverage and influence, one-way anova, two-way anova, factorial anova. Primarily for doctoral students in the managerial, behavioral, social and health sciences. \n\n", "semester": "2011C", "name": "APPLIED REG & ANALY VAR", "reviews": {"path": "/courses/25165/reviews", "values": [{"ratings": {"rAmountLearned": "3.04", "rDifficulty": "2.15", "rStimulateInterest": "3.15", "rRecommendMajor": "3.14", "rCourseQuality": "3.09", "rWorkRequired": "1.75", "rInstructorAccess": "3.35", "rReadingsValue": "2.35", "rRecommendNonMajor": "3.06", "rCommAbility": "3.46", "rInstructorQuality": "3.40"}, "section": {"name": "APPLIED REG & ANALY VAR", "sectionnum": "401", "primary_alias": "STAT-500-401", "path": "/courses/25165/sections/401", "id": "25165-401", "aliases": ["STAT-500-401", "PSYC-611-401", "BSTA-550-401"]}, "comments": "Statistics 500 focuses on two unrelated topics: loglinear and logit models for discrete data and nonparametric methods for nonnormal data, with emphasis on practical methods of data analysis and their interpretation. \r\n\r\nMost students found this class to be “helpful” and claimed that it “covered a lot of useful material.”  Students suggested that this class would be particularly “helpful to the researchers who have some experiences with statistics knowledge.”\r\n\r\nProfessor Rosenbaum received many compliments from students and was called “engaging and entertaining.” Students were especially impressed with Professor Rosenbaum’s ability to “communicate complex material in such a way that the emphasis is on applied statistics, but enough background is given to aid comprehension.”\r\n\r\nThis class is an applied graduate level course for students who have completed an undergraduate course in basic statistical methods. This course is primarily for doctoral students in the managerial, behavioral, social, and health sciences. Before taking the class, the permission of instructor is recommended. Students found the workload in this class to be “appropriate.”\r\n", "num_students": 61, "path": "/courses/25165/sections/401/reviews/1164-PAUL-R--ROSENBAUM", "instructor": {"path": "/instructors/1164-PAUL-R--ROSENBAUM", "first_name": "PAUL R.", "last_name": "ROSENBAUM", "id": "1164-PAUL-R--ROSENBAUM", "name": "PAUL R. ROSENBAUM"}, "num_reviewers": 58, "id": "25165-401-1164-PAUL-R--ROSENBAUM"}]}, "credits": null, "primary_alias": "STAT-500", "path": "/courses/25165", "sections": {"path": "/courses/25165/sections", "values": [{"name": "APPLIED REG & ANALY VAR", "sectionnum": "401", "primary_alias": "STAT-500-401", "path": "/courses/25165/sections/401", "id": "25165-401", "aliases": ["STAT-500-401", "PSYC-611-401", "BSTA-550-401"]}]}, "id": 25165, "aliases": ["STAT-500", "PSYC-611", "BSTA-550"]}