{"coursehistories": {"path": "/coursehistories/4605"}, "description": "This course serves as a basic introduction to the Mechanics of continuous media, and it will prepare the student for more advanced courses in solid and fluid mechanics. The topics to be covered include: Tensor algebra and calculus, Lagrangian and Eulerian kinematics, Cauchy and Piola-Kirchhoff stresses, General principles: conservation of mass, conservation of linear and angular momentum, energy and the first law of thermodynamics, entropy and the second law of thermodynamics; constitutive theory, ideal fluids, Newtonian and non-Newtonian fluids, finite elasticity, linear elasticity, materials with microstructure. \n\n", "semester": "2010C", "name": "CONTINUUM MECHANICS", "reviews": {"path": "/courses/23394/reviews", "values": [{"ratings": {"rAmountLearned": "2.07", "rDifficulty": "4.00", "rStimulateInterest": "1.86", "rRecommendMajor": "2.43", "rCourseQuality": "1.73", "rWorkRequired": "3.71", "rInstructorAccess": "2.46", "rReadingsValue": "1.77", "rRecommendNonMajor": "0.64", "rCommAbility": "1.93", "rInstructorQuality": "2.47"}, "section": {"name": "CONTINUUM MECHANICS", "sectionnum": "001", "primary_alias": "MEAM-530-001", "path": "/courses/23394/sections/001", "id": "23394-001", "aliases": ["MEAM-530-001"]}, "comments": "This course serves as a basic introduction to the Mechanics of continuous media, and it prepares the student for more advanced courses in solid and fluid mechanics. Pre-requisites for the course are Multivariable Calculus, Linear Algebra, and Partial Differential Equations.\r\n\r\nStudents generally felt that the material taught in the course “had the potential to be both interesting and extremely useful,” yet, most students reported struggling with it. Several claimed to have put a tremendous amount of effort into the course but performed dismally on the midterms, which they felt reflected that the course was taught poorly. “The material was presented in a way that lost the big picture,” reported one student. Students also tended to agree that “extensive reading outside class” was required to understand the material, but this was difficult because “the assigned readings [were] from three different books, with three different conventions.” Many students felt that the course “lacked any application of concepts to real problems,” both in lectures and in assignments. Most students felt that exams were very long for the amount of time allowed and that grading appeared to be disproportionate given that homework accounted for a small percentage of the final grade.\r\n\r\nStudents generally felt that Dr. Ponte-Castaneda’s ability to communicate the subject matter and stimulate student interest was poor.  Overall, students gave the professor average ratings.\r\n\r\nMany students felt that the course was extremely difficult, but one did mention that the difficulty pushed them to “become more mature students.” This course was rated as one of the most difficult at Penn.  It was not recommended to non-majors and was hardly recommended to majors.\r\n", "num_students": 17, "path": "/courses/23394/sections/001/reviews/1571-PEDRO-PONTE-CASTANEDA", "instructor": {"path": "/instructors/1571-PEDRO-PONTE-CASTANEDA", "first_name": "PEDRO", "last_name": "PONTE-CASTANEDA", "id": "1571-PEDRO-PONTE-CASTANEDA", "name": "PEDRO PONTE-CASTANEDA"}, "num_reviewers": 15, "id": "23394-001-1571-PEDRO-PONTE-CASTANEDA"}]}, "credits": null, "primary_alias": "MEAM-530", "path": "/courses/23394", "sections": {"path": "/courses/23394/sections", "values": [{"name": "CONTINUUM MECHANICS", "sectionnum": "001", "primary_alias": "MEAM-530-001", "path": "/courses/23394/sections/001", "id": "23394-001", "aliases": ["MEAM-530-001"]}]}, "id": 23394, "aliases": ["MEAM-530"]}