[{"ratings": {"rAmountLearned": "3.30", "rDifficulty": "2.40", "rStimulateInterest": "3.75", "rRecommendMajor": "3.77", "rCourseQuality": "3.34", "rWorkRequired": "2.53", "rInstructorAccess": "3.38", "rReadingsValue": "2.81", "rRecommendNonMajor": "3.43", "rCommAbility": "3.69", "rInstructorQuality": "3.70"}, "section": {"name": "INTRO BUDDHISM", "sectionnum": "401", "primary_alias": "RELS-173-401", "path": "/courses/28103/sections/401", "id": "28103-401", "aliases": ["RELS-173-401", "SAST-142-401", "EALC-015-401"]}, "comments": "This course seeks to introduce students to the diversity of doctrines held and practices performed by Buddhists in Asia.  By focusing on how specific beliefs and practices are tied to particular locations and particular times, students are able to explore in detail the religious institutions, artistic, architectural, and musical traditions, textual production and legal and doctrinal developments of Buddhism over time and within its socio-historical context.  Religion is never divorced from its place and its time. Furthermore, by geographically and historically grounding the study of these religions students are able to examine how their individual ethic, cosmological and soteriological systems effect local history, economics, politics, and material culture.  The course concentrates first on the person of the Budda, his many biographies and how he has been followed and worshipped in a variety of ways from Lhasa, Tibet to Phrae, Thailand.  From there the course touches on the foundational teachings of the Buddha with an eye to how they have evolved and transformed over time.  Finally, the course focuses on the practice of Buddhist ritual, magic and ethics in monasteries and among aly communities in Asia and even in the West.  This section confronts the way Buddhists have thought of issues such as \"Just-War,\" Women's Rights and Abortion. While no one quarter course could provide a detailed presentation of the beliefs and practices of Buddhism, the course allows students to look closely at certain aspects of these religions by focusing on how they are practiced in places like Nara, Japan or Vientianne, Laos.\r\n\r\n\tStudents generally loved this class, with many calling it “one of [their] favorite classes at Penn.” Many found the subject matter “extremely engaging and intellectually challenging,” and called the course “one of a kind.” Though some didn’t like how lectures were “largely unstructured,” most students “thoroughly enjoyed every lecture” and actively looked forward to coming to class.\r\n\r\n\tMuch of this stemmed from the teaching style of Professor McDaniel, who was called “outstanding” by his students. They loved his ability to “communicate the material in an effective, thought-provoking and entertaining manner,” and found him “incredibly engaging.” Many noted how he “took an interest in his students personally” and was “incredibly approachable.” Students appreciated how he was “very receptive to student inquiry” and loved his ability to relate the course topics to students’ lives, with more than one student calling him “one of Penn’s best by far.”\r\n\r\n\tStudents found assignments in this course to be “challenging without being overwhelming.” Many appreciated Professor McDaniel’s help in getting through tough portions of the course, and the interesting subject matter made the workload easier to handle. Though some felt the grading was “way too tough for an elective like this,” most appreciated the course’s impact, with one student saying “I regularly think about what I’ve learned in this class more than any other I’ve taken at Penn.” Overall, students highly recommended this course to other students at all levels.\r\n", "num_students": 58, "path": "/courses/28103/sections/401/reviews/4968-JUSTIN-THOMAS-MCDANIEL", "instructor": {"path": "/instructors/4968-JUSTIN-THOMAS-MCDANIEL", "first_name": "JUSTIN THOMAS", "last_name": "MCDANIEL", "id": "4968-JUSTIN-THOMAS-MCDANIEL", "name": "JUSTIN THOMAS MCDANIEL"}, "num_reviewers": 58, "id": "28103-401-4968-JUSTIN-THOMAS-MCDANIEL"}]