[{"ratings": {"rAmountLearned": "3.15", "rDifficulty": "2.90", "rStimulateInterest": "3.10", "rRecommendMajor": "3.45", "rCourseQuality": "3.12", "rWorkRequired": "2.45", "rInstructorAccess": "3.30", "rReadingsValue": "3.05", "rRecommendNonMajor": "2.35", "rCommAbility": "2.95", "rInstructorQuality": "3.12"}, "section": {"name": "GENETIC ANALYSIS", "sectionnum": "401", "primary_alias": "BIOL-540-401", "path": "/courses/21369/sections/401", "id": "21369-401", "aliases": ["BIOL-540-401", "CAMB-541-401"]}, "comments": "This class considers the logic and methodology of genetic analysis in plants and animals. This lecture course focuses on the use of mutations to study gene function and higher order biological processes, methods for reporting and manipulating gene expression, and analysis of the genetic basis of natural variation.\r\n\r\nThe course allowed “students to learn a lot about genetic analysis,” as well as “how to read and analyze journal articles.” Some students found the material to be repetitive of earlier genetics courses.\r\n\r\nStudents heaped praise upon Professor Poethig, citing his “passion for the material” and his “skillful lecturing.” Several students called Professor Poethig one of “the best lecturers at Penn.” Class time was “organized” and “relaxing and fun” to a certain degree.\r\n\r\nStudents felt the readings were informative, but one student felt that after the mid-term there was “no accountability with regards to the readings assigned.” Students enjoyed the final paper, calling it “instructive” and helpful with learning the material. This course has a prerequisite of BIOL221.\r\n\r\n*8 respondents\r\n", "num_students": 31, "path": "/courses/21369/sections/401/reviews/208-RICHARD-SCOTT-POETHIG", "instructor": {"path": "/instructors/208-RICHARD-SCOTT-POETHIG", "first_name": "RICHARD SCOTT", "last_name": "POETHIG", "id": "208-RICHARD-SCOTT-POETHIG", "name": "RICHARD SCOTT POETHIG"}, "num_reviewers": 26, "id": "21369-401-208-RICHARD-SCOTT-POETHIG"}]