{"coursehistories": {"path": "/coursehistories/3848"}, "description": "This course covers core subject matter common to the fields of robotics, character animation and embodied intelligent agents. The intent of the course is to provide the student with a solid technical foundation for developing, animating and controlling articulated systems used in interactive computer game virtual reality simulations and high-end animation applications. The course balances theory with practice by \"looking under the hood\" of current animation systems and authoring tools and exams the technologies and techniques used from both a computer science and engineering perspective. Topics covered include: geometric coordinate systems and transformations; quaternions; parametric curves and surfaces; forward and inverse kinematics; dynamic systems and control; computer simulation; keyframe, motion capture and procedural animation; behavior-based animation and control; facial animation; smart characters and intelligent agents. \n\n", "semester": "2011C", "name": "COMPUTER ANIMATION", "reviews": {"path": "/courses/24176/reviews", "values": [{"ratings": {"rAmountLearned": "3.15", "rDifficulty": "3.23", "rStimulateInterest": "2.69", "rRecommendMajor": "3.42", "rCourseQuality": "3.00", "rWorkRequired": "3.08", "rInstructorAccess": "3.31", "rReadingsValue": "2.88", "rRecommendNonMajor": "1.77", "rCommAbility": "2.96", "rInstructorQuality": "3.23"}, "section": {"name": "COMPUTER ANIMATION", "sectionnum": "401", "primary_alias": "CIS-462-401", "path": "/courses/24176/sections/401", "id": "24176-401", "aliases": ["CIS-462-401", "CIS-562-401"]}, "comments": "This course covers core subject matter common to the fields of robotics, character\r\nanimation and embodied intelligent agents. The intent of the course is to provide the\r\nstudent with a solid technical foundation for developing, animating and controlling\r\narticulated systems used in interactive computer game virtual reality simulations and\r\nhigh-end animation applications. The course balances theory with practice by \"looking\r\nunder the hood\" of current animation systems and authoring tools. It examines the\r\ntechnologies and techniques used from both a computer science and engineering\r\nperspective. Topics covered include: geometric coordinate systems and transformations;\r\nquaternions; parametric curves and surfaces; forward and inverse kinematics; dynamic\r\nsystems and control; computer simulation; keyframe, motion capture and procedural\r\nanimation; behavior-based animation and control; facial animation; smart characters and\r\nintelligent agents.\r\nThis course focused “on the math and physics foundations of computer\r\nanimation,” with math-intensive lectures and “difficult programming exercises.” Students\r\ngenerally appreciated the content of the course, finding it to be “very challenging,” but\r\nthat they had “really learned a lot of useful knowledge.” A few respondents found that\r\ngoing through example problems in class “to be the most helpful,” and would have liked\r\nto have more of them covered.\r\nOne respondent praised Professor Lane for being “very nice and efficient,” while\r\nanother thanked him and his TAs for teaching many useful subjects in the course.\r\nProfessor Lane assigned a large amount of papers weekly for reading, and one\r\nstudent felt that they were excessive. Although the homework was noted to be difficult,\r\ngenerally students did not find the amount excessive. One student recommended it “to\r\neveryone who will be involved with computer graphics in any capacity.”", "num_students": 40, "path": "/courses/24176/sections/401/reviews/310-STEPHEN-LANE", "instructor": {"path": "/instructors/310-STEPHEN-LANE", "first_name": "STEPHEN", "last_name": "LANE", "id": "310-STEPHEN-LANE", "name": "STEPHEN LANE"}, "num_reviewers": 31, "id": "24176-401-310-STEPHEN-LANE"}]}, "credits": null, "primary_alias": "CIS-462", "path": "/courses/24176", "sections": {"path": "/courses/24176/sections", "values": [{"name": "COMPUTER ANIMATION", "sectionnum": "401", "primary_alias": "CIS-462-401", "path": "/courses/24176/sections/401", "id": "24176-401", "aliases": ["CIS-462-401", "CIS-562-401"]}]}, "id": 24176, "aliases": ["CIS-462", "CIS-562"]}