[{"ratings": {"rAmountLearned": "2.64", "rDifficulty": "2.06", "rStimulateInterest": "2.01", "rRecommendMajor": "3.37", "rCourseQuality": "2.40", "rWorkRequired": "1.92", "rInstructorAccess": "2.53", "rReadingsValue": "2.18", "rRecommendNonMajor": "1.75", "rCommAbility": "2.64", "rInstructorQuality": "2.48"}, "section": {"name": "COMMUNICATION BEHAVIOR", "sectionnum": "001", "primary_alias": "COMM-125-001", "path": "/courses/19965/sections/001", "id": "19965-001", "aliases": ["COMM-125-001"]}, "comments": "Introduction to Communication Behavior is an intro level course that fulfills a requirement for admission to the communications major. It can also be counted as a society sector requirement for the College. The course focuses on social science studies relating to the processes and effects of mass communication. Students review research on the ways media affects knowledge, perceptions of social reality, aggressive behavior, and political behavior. \r\n\r\nWhile this survey course lacks the depth some students hoped for, almost all felt it was an important course for communication majors to take. \r\n\r\nProfessor Chomsky was praised as a “stimulating,” “knowledgeable,” and “dedicated” teacher, who was always willing to help.  Several students commented that Professor Chomsky was too repetitive and difficult to follow as he often went on tangents.  Almost all students complained that the instructor did not use slides or Powerpoint presentations, which made the lecture material more difficult to process. \r\n\r\nStudents mentioned that it was not too difficult to make a good grade if they attended lectures regularly and did the reading, especially since “there are no trick questions on the tests.”  This course is a requirement for all Communication majors.\r\n", "num_students": 152, "path": "/courses/19965/sections/001/reviews/5140-DANIEL-CHOMSKY", "instructor": {"path": "/instructors/5140-DANIEL-CHOMSKY", "first_name": "DANIEL", "last_name": "CHOMSKY", "id": "5140-DANIEL-CHOMSKY", "name": "DANIEL CHOMSKY"}, "num_reviewers": 85, "id": "19965-001-5140-DANIEL-CHOMSKY"}]