[{"ratings": {"rAmountLearned": "2.04", "rDifficulty": "2.85", "rStimulateInterest": "1.59", "rRecommendMajor": "2.54", "rCourseQuality": "1.82", "rWorkRequired": "1.93", "rInstructorAccess": "1.33", "rReadingsValue": "2.00", "rRecommendNonMajor": "1.48", "rCommAbility": "2.00", "rInstructorQuality": "2.04"}, "section": {"name": "EVIDENCED BASED CRIME AND JUSTICE POLICY", "sectionnum": "001", "primary_alias": "CRIM-150-001", "path": "/courses/27221/sections/001", "id": "27221-001", "aliases": ["CRIM-150-001"]}, "comments": "Statistical techniques and quantitative reasoning are essential tools for properly examining crime and justice policy.  Using case studies of highly controversial issues, appropriate statistical techniques and sound quantitative reasoning are addressed.  Case studies can include the death penalty, racial profiling, human trafficking, DNA identification, sentencing guidelines, drug testing, war crimes, ballistic analyses from the JFK assassination, and others.  The statistical procedures discussed overlap significantly with those covered in an introductory statistics course. Criminology 150 has been approved for the quantitative data analysis requirement (QDA).\r\nStudents felt the material for this class could be very interesting if you have a background and interesting in statistics, but for those that are taking it as a requirement, it could be “very boring.” The structure of the class was remarked upon as being unhelpful, with the entire grade based on four papers which student aren’t given much time to write. It was noted that the class was read almost word-for-word off the slides, leading to a rather “uninspiring” experience.\r\nA vast majority of students credited the lack of appeal of this class toward Professor Berk, who they said was very “knowledgeable” but “very unwilling to help his students.” He didn’t hold office hours and could be very “blunt” when asked questions or giving criticism. He was often described as “unresponsive and unprofessional” outside of class, although he is very good at explaining the concepts during class.\r\nThis is a required course for criminology majors, and students suggested that this course would be difficult for non-majors. They also suggested that students should have taken STAT 111 before taking this course, although it is not a prerequisite.    ", "num_students": 29, "path": "/courses/27221/sections/001/reviews/3928-RICHARD-A--BERK", "instructor": {"path": "/instructors/3928-RICHARD-A--BERK", "first_name": "RICHARD A.", "last_name": "BERK", "id": "3928-RICHARD-A--BERK", "name": "RICHARD A. BERK"}, "num_reviewers": 28, "id": "27221-001-3928-RICHARD-A--BERK"}]