{"coursehistories": {"path": "/coursehistories/5436"}, "description": "What do late 19th- and early 20th-century robber barons have in common with Roman emperors and Renaissance popes? Why did Thomas Jefferson keep a plantation even though he was a terrible farmer? How has the concept of life in the countryside been articulated across the centuries? This seminar course will focus the idea of villeggiature (villa life) and the ideology associated with countryside gardens and plantations. In the literature on villa gardens across the centuries, from ancient Rome to the 20th century, there emerges a recurrent opposition between the country seen as an occasion for self- improvement versus it being an opportunity for self-indulgence, the representation of social status, and at times the dsiplay of opulence and political power. The first instance, which has its roots in the Stoic understanding of agricultural labor as a means of purification and moral gratification, is traceable to the times of the early argicultural writers, Cato and Varro, and re-emerges in the class culture of early Renaissance Florence and the pre-Palladian villa culture of the Veneto to end with its latest occurrence at the time of Jefferson and the so-called gentleman farmers in colonial America. \n\nThe second instance, whose earliest example in the West dates to the time of Imperial Rome, surfaces in Augustan England, and finds its apotheosis with the great mansions buildt by American industrialists at the turn of the 20th century. As the course examines the circularity of villa ideology across the centuries, other themes will emerge that address the relationship between urban and rural life, between building and natural envioronment and between social, cultural, economic and political forces and landscape design. These themes will be explored through the study of selectedvillas and through the reading of sources drawn from villa literature (among which architectural and agricultural treaties, epistolary exhanges and novels). The course may be taken in lieu of LARP 540 in fulfillment of the requirements for the Minor in Landscape Studies. \n\n", "semester": "2012A", "name": "TOPICS HISTORY & THEORY: VILLA GARDENS & VILLA LIFE: CULTURAL AND SOCIAL TRANSFORMATIONS", "reviews": {"path": "/courses/27653/reviews", "values": [{"ratings": {"rAmountLearned": "3.33", "rDifficulty": "2.67", "rStimulateInterest": "3.33", "rRecommendMajor": "3.00", "rCourseQuality": "3.00", "rWorkRequired": "3.33", "rInstructorAccess": "3.67", "rReadingsValue": "4.00", "rRecommendNonMajor": "3.00", "rCommAbility": "3.67", "rInstructorQuality": "3.20"}, "section": {"name": "TOPICS HISTORY & THEORY: VILLA GARDENS & VILLA LIFE: CULTURAL AND SOCIAL TRANSFORMATIONS", "sectionnum": "401", "primary_alias": "LARP-370-401", "path": "/courses/27653/sections/401", "id": "27653-401", "aliases": ["LARP-370-401", "LARP-770-401", "ITAL-371-401"]}, "comments": "", "num_students": 6, "path": "/courses/27653/sections/401/reviews/6118-RAFFAELLA-FABIANI-GIANNETTO", "instructor": {"path": "/instructors/6118-RAFFAELLA-FABIANI-GIANNETTO", "first_name": "RAFFAELLA", "last_name": "FABIANI GIANNETTO", "id": "6118-RAFFAELLA-FABIANI-GIANNETTO", "name": "RAFFAELLA FABIANI GIANNETTO"}, "num_reviewers": 5, "id": "27653-401-6118-RAFFAELLA-FABIANI-GIANNETTO"}]}, "credits": null, "primary_alias": "LARP-370", "path": "/courses/27653", "sections": {"path": "/courses/27653/sections", "values": [{"name": "TOPICS HISTORY & THEORY: VILLA GARDENS & VILLA LIFE: CULTURAL AND SOCIAL TRANSFORMATIONS", "sectionnum": "401", "primary_alias": "LARP-370-401", "path": "/courses/27653/sections/401", "id": "27653-401", "aliases": ["LARP-370-401", "LARP-770-401", "ITAL-371-401"]}]}, "id": 27653, "aliases": ["LARP-370", "LARP-770", "ITAL-371"]}