[{"ratings": {"rAmountLearned": "2.95", "rDifficulty": "2.53", "rStimulateInterest": "2.26", "rRecommendMajor": "3.58", "rCourseQuality": "3.11", "rWorkRequired": "2.63", "rInstructorAccess": "3.53", "rReadingsValue": "3.21", "rRecommendNonMajor": "2.26", "rCommAbility": "3.42", "rInstructorQuality": "3.16"}, "section": {"name": "STOCH SYS ANALYSIS SIMUL", "sectionnum": "001", "primary_alias": "ESE-303-001", "path": "/courses/18634/sections/001", "id": "18634-001", "aliases": ["ESE-303-001"]}, "comments": "ESE 303 is a study in discrete-events simulation with applications in queuing systems (like elevator operation), inventory systems, and Monte Carlo systems. The course covers the Poisson process, empirical distributions, and measurements of performances of different systems. A large portion of the course is also devoted to the properties and generation of random and pseudo-random numbers. The required textbook is called Discrete-Event System Simulation and Professor Carchidi also posted class notes on Blackboard.\r\n\r\nOverall, students were very happy with the content covered in the course. Many found it very enjoyable and useful, calling lectures “thorough” and “organized.” However, some students called for greater use of examples in lectures and class notes to better explain some of the concepts.\r\n\r\nStudents praised Professor Carchidi and his teaching abilities. Although his lectures were not extremely stimulating, almost all students indicated that he expressed great interest in their performance. He held extensive office hours and was very accessible to all students. His notes were also very extensive and helpful.\r\n\r\nThis course is designed for undergraduates and ESE 301 or an equivalent probability and statistics course is listed as a prerequisite. Students found the workload fairly high but manageable. The homework assignments did a good job emphasizing the concepts explained in class.", "num_students": 32, "path": "/courses/18634/sections/001/reviews/774-MICHAEL-A--CARCHIDI", "instructor": {"path": "/instructors/774-MICHAEL-A--CARCHIDI", "first_name": "MICHAEL A.", "last_name": "CARCHIDI", "id": "774-MICHAEL-A--CARCHIDI", "name": "MICHAEL A. CARCHIDI"}, "num_reviewers": 19, "id": "18634-001-774-MICHAEL-A--CARCHIDI"}]