{"coursehistories": {"path": "/coursehistories/1386"}, "description": "Everyone seems to think that language and thought are somehow intimately related. But what, exactly, is the relationship? For some people, language and thought are identical, so that pre-linguistic creatures are completely incapable of thought. This course examines language as an instrument to send and receive information. In part I, we will start with a computational approach to the problem of how an information agent would extract and use information from language. That is, we will take language to be an encoding of a mental content. The course considers some of the classic position papers on artificial intelligence and then moves on to develop a compositional account of computing meanings based on categorial grammar. We will, in addition, discuss some of the leading ideas in the theory of artificial neural nets and concept formation, particularly prototype theory. \n\nIn part II, we will focus on compositional theories of meaning; we will pay particular attention to categorial grammar, developing a strictly compositional theory of the encoding. In this section, we will develop some ideas from dynamic semantics and pragmatic theories of presupposition and implicature. In part III, we will explore reasons for supposing that meaning is largely social and not purely a question of mental content. This will lead us to a critical consideration of linguistic relativity, the idea that language can influence thought. \n\n", "semester": "2004A", "name": "LANGUAGE AND INFORMATION", "reviews": {"path": "/courses/6772/reviews", "values": [{"ratings": {"rAmountLearned": "2.70", "rDifficulty": "1.70", "rStimulateInterest": "3.20", "rRecommendMajor": "3.70", "rCourseQuality": "2.90", "rWorkRequired": "1.10", "rInstructorAccess": "3.40", "rReadingsValue": "2.60", "rRecommendNonMajor": "1.80", "rCommAbility": "3.40", "rInstructorQuality": "3.60"}, "section": {"name": "LANGUAGE AND INFORMATION", "sectionnum": "301", "primary_alias": "LING-252-301", "path": "/courses/6772/sections/301", "id": "6772-301", "aliases": ["LING-252-301"]}, "comments": "", "num_students": 13, "path": "/courses/6772/sections/301/reviews/723-ROBIN-L--CLARK", "instructor": {"path": "/instructors/723-ROBIN-L--CLARK", "first_name": "ROBIN L.", "last_name": "CLARK", "id": "723-ROBIN-L--CLARK", "name": "ROBIN L. CLARK"}, "num_reviewers": 10, "id": "6772-301-723-ROBIN-L--CLARK"}]}, "credits": null, "primary_alias": "LING-252", "path": "/courses/6772", "sections": {"path": "/courses/6772/sections", "values": [{"name": "LANGUAGE AND INFORMATION", "sectionnum": "301", "primary_alias": "LING-252-301", "path": "/courses/6772/sections/301", "id": "6772-301", "aliases": ["LING-252-301"]}]}, "id": 6772, "aliases": ["LING-252"]}