{"coursehistories": {"path": "/coursehistories/3291"}, "description": "This course will provide a comprehensive survey of modern medical imaging modalities with an emphasis on the emerging field of molecular imaging. The basic principles of X-ray, computed tomography, nuclear imaging, magnetic resonance imaging, and optical tomography will be reviewed. The emphasis of the course, however, will focus on the concept of contrast media and targeted molecular imaging. Topics to be covered include the chemistry and mechanisms of various contrast agents, approaches to identifying molecular markers of disease, ligand screening strategies, and the basic principles of toxicology and pharmacology relevant to imaging agents. \n\n", "semester": "2011C", "name": "MOLECULAR IMAGING", "reviews": {"path": "/courses/24033/reviews", "values": [{"ratings": {"rAmountLearned": "2.56", "rDifficulty": "2.73", "rStimulateInterest": "2.43", "rRecommendMajor": "3.04", "rCourseQuality": "2.51", "rWorkRequired": "2.52", "rInstructorAccess": "2.88", "rReadingsValue": "2.53", "rRecommendNonMajor": "1.76", "rCommAbility": "2.83", "rInstructorQuality": "2.66"}, "section": {"name": "MOLECULAR IMAGING", "sectionnum": "401", "primary_alias": "BE-483-401", "path": "/courses/24033/sections/401", "id": "24033-401", "aliases": ["BE-483-401", "BE-583-401"]}, "comments": "This course provides a comprehensive survey of modern medical imaging\r\nmodalities with an emphasis on the emerging field of molecular imaging. The basic\r\nprinciples of X-ray, computed tomography, nuclear imaging, magnetic resonance\r\nimaging, and optical tomography are reviewed. The emphasis of the course, however,\r\nfocuses on the concept of contrast media and targeted molecular imaging. Topics\r\ncovered include the chemistry and mechanisms of various contrast agents, approaches to\r\nidentifying molecular markers of disease, ligand screening strategies, and the basic\r\nprinciples of toxicology and pharmacology relevant to imaging agents.\r\nStudents overall thought this class was interesting, difficult, and rewarding.\r\nStudents enjoyed how this course combined bioengineering and medicine. As one\r\nstudent put it, “This course provided a very good introduction to the different medical\r\nimaging modalities. The course is split into four different modules about four major\r\nmedical imaging technologies, each covered a homework assignment and an exam. The\r\nmajority of students reported learning a great deal from this course as long as you worked\r\nhard and paid attention in lecture.\r\nDr. Tsourkas organizes the course around a series of guest lecturers who explain\r\neach individual radiological modality covered in the course. Students enjoyed most guest\r\nlecturers but were occasionally discouraged by poor English ability or poor presentation\r\nstyle on the guest lecturers’ part. Students said the material taught in this class was\r\nhighly theoretical and that they would have appreciated demonstrations of the technology\r\ntaught in the class. Dr. Tsourkas teaches his material primarily with PowerPoints that\r\nalmost serve as the textbook that students need to reference for the class. Students\r\ncomplained about the blanks in Dr. Tsourkas PowerPoints, which were intended to\r\nencourage students to come to class, but instead took up students time and concentration\r\nwith the fast pace of the course and the difficulty typing all the necessary comments in\r\nthe blanks especially the frequent dense mathematics. Students recommended printing\r\nthe PowerPoints to make it easier to fill in the blanks and pay attention in class.\r\nAlthough Dr. Tsourkas mostly read off PowerPoints, students commended his knowledge\r\nof the material, “He is able to add a substantial amount of content to each lecture simply\r\nbecause of his vast knowledge of the subject matter.” Students complained about the\r\nlack of clear office hours, with no set office hours in the beginning of the semester and\r\nsometimes weeks with only an hour of office hours.\r\nThis class is intended for seniors and graduate students in the bioengineering\r\ndepartment. The major difference about taking this course at the graduate level was that\r\nstudent presentations were required from the graduate students. Students found this\r\ncourse to be challenging but rewarding. Students enjoyed the consistency with four HW\r\nassignments and four exams on four major different imaging techniques. Students\r\nreported taking four challenging exams during this course, where there was “Almost too\r\nmuch emphasis on memorization and not enough on understanding major concepts.” The\r\nhomework was reported as “tough but fair.”", "num_students": 63, "path": "/courses/24033/sections/401/reviews/2869-ANDREW-TSOURKAS", "instructor": {"path": "/instructors/2869-ANDREW-TSOURKAS", "first_name": "ANDREW", "last_name": "TSOURKAS", "id": "2869-ANDREW-TSOURKAS", "name": "ANDREW TSOURKAS"}, "num_reviewers": 61, "id": "24033-401-2869-ANDREW-TSOURKAS"}]}, "credits": null, "primary_alias": "BE-483", "path": "/courses/24033", "sections": {"path": "/courses/24033/sections", "values": [{"name": "MOLECULAR IMAGING", "sectionnum": "401", "primary_alias": "BE-483-401", "path": "/courses/24033/sections/401", "id": "24033-401", "aliases": ["BE-483-401", "BE-583-401"]}]}, "id": 24033, "aliases": ["BE-483", "BE-583"]}