{"coursehistories": {"path": "/coursehistories/5075"}, "description": "The term Sustainability loosely organizes a diverse mix of issues relating to the science, politics, and business of how humans can endure on Earth. Sustainability is about carrying capacity: making resource decisions without compromising the ability of future generations to make their own resource decisions. Sustainability thus requires an understanding of the systems whose carrying capacities matter for human endurance; three prominent and interconnected systems are the environment, the economy, and society. Sustainability also requires an understanding of the decision-making that operates on these resource systems and affects their carrying capacities. In sum, the study of Sustainability requires an introduct ion to environmental science, energy production, human settlements, economic development, social justice, policy development, and international relations. This course will provide that introduction though a weekly lecture series drawing on scholars from across the university and a small group project that addresses a real problem confronting an institution in Philadelphia. SEE POSTED SYLLABUS FOR INFORMATION ABOUT RECITATION SECTIONS. \n\n", "semester": "2010C", "name": "SUSTAINABILITY IN ACTION", "reviews": {"path": "/courses/22647/reviews", "values": [{"ratings": {"rAmountLearned": "2.73", "rDifficulty": "1.96", "rStimulateInterest": "3.25", "rRecommendMajor": "3.10", "rCourseQuality": "2.87", "rWorkRequired": "2.39", "rInstructorAccess": "2.85", "rReadingsValue": "2.49", "rRecommendNonMajor": "2.91", "rCommAbility": "3.13", "rInstructorQuality": "3.17"}, "section": {"name": "SUSTAINABILITY IN ACTION", "sectionnum": "401", "primary_alias": "ARCH-255-401", "path": "/courses/22647/sections/401", "id": "22647-401", "aliases": ["ARCH-255-401", "ARCH-755-401", "ENVS-255-401", "URBS-225-401"]}, "comments": "The term “Sustainability” loosely organizes a diverse mix of issues relating to the science, politics, and business of how humans can endure on Earth. Sustainability is about carrying capacity: making resource decisions without compromising the ability of future generations to make their own resource decisions. Sustainability thus requires an understanding of the systems whose carrying capacities matter for human endurance; three prominent and interconnected systems are the environment, the economy, and society. Sustainability also requires an understanding of the decision-making that operates on these resource systems and affects their carrying capacities. In sum, the study of Sustainability requires an introduction to environmental science, energy production, human settlements, economic development, social justice, policy development, and international relations. This course provides that introduction though a weekly lecture series drawing on scholars from across the university and a small group project that addresses a real problem confronting an institution in Philadelphia.&#8232;\r\nMany students felt that they learned a lot from this “interesting,” “unique,” and “incredible” course. Another student praised that the course, “offers SAS students the rare opportunity to work on a team or in a group, and therefore adds an additional element to the appeal of this course.” A lot of students felt that the readings were at times excessive and only “vaguely” related to lectures. Many students enjoyed the guest-lecture format of the course. One student noted that the variety of lecturers “provided a wide breadth of knowledge.” However, several students felt that the course brushed upon many topics but did not go into depth on anything in particular. One student mentioned that, “this class felt more like a forum than an academic class.” Some students felt that the class and the recitations were lacking in structure. One student said that, “the course itself was a bit disorganized, there was very little cohesiveness between what was taught in each week's lectures and the projects that were being done in our recitations.” Students praised the variety of guest lecturers that spoke at this class. The guests were described as “quality” speakers. One student noted, “Professor Hughes is great, but I particularly liked the style of the course, in that we had a new speaker and subject matter every week.” Another student noted that the guest speaker set-up was, “very intriguing and worked out very well.” However, other students felt like, “some lecturers didn't seem to have a great grasp of what the class was all about and where the class stood,” and wished that there had been more discussion on the differences in opinions between guest speakers. &#8232;&#8232;The course is open to Undergraduates and Graduates. However, one Graduate student felt, “that it was only good for undergraduate students such as freshman or sophomore who needs basic background about sustainability,” because of the broadness of the course. Students agreed that there was a lot of assigned reading for this course, but as one student mentioned, Professor Hughes, “gave suggestions on what to focus on in the readings.” Several students mentioned that they felt, “there was simply not enough material,” for the 15-20 page paper required at the end of the course.\r\n", "num_students": 83, "path": "/courses/22647/sections/401/reviews/1008-MARK-ALAN-HUGHES", "instructor": {"path": "/instructors/1008-MARK-ALAN-HUGHES", "first_name": "MARK ALAN", "last_name": "HUGHES", "id": "1008-MARK-ALAN-HUGHES", "name": "MARK ALAN HUGHES"}, "num_reviewers": 77, "id": "22647-401-1008-MARK-ALAN-HUGHES"}, {"ratings": {"rAmountLearned": "2.73", "rDifficulty": "1.96", "rStimulateInterest": "1.89", "rRecommendMajor": "3.10", "rCourseQuality": "2.87", "rWorkRequired": "2.39", "rInstructorAccess": "2.02", "rReadingsValue": "2.49", "rRecommendNonMajor": "2.91", "rCommAbility": "1.93", "rInstructorQuality": "2.06"}, "section": {"name": "SUSTAINABILITY IN ACTION", "sectionnum": "401", "primary_alias": "ARCH-255-401", "path": "/courses/22647/sections/401", "id": "22647-401", "aliases": ["ARCH-255-401", "ARCH-755-401", "ENVS-255-401", "URBS-225-401"]}, "comments": "", "num_students": 83, "path": "/courses/22647/sections/401/reviews/5583-LESLIE-A-BILLHYMER", "instructor": {"path": "/instructors/5583-LESLIE-A-BILLHYMER", "first_name": "LESLIE A", "last_name": "BILLHYMER", "id": "5583-LESLIE-A-BILLHYMER", "name": "LESLIE A BILLHYMER"}, "num_reviewers": 77, "id": "22647-401-5583-LESLIE-A-BILLHYMER"}]}, "credits": null, "primary_alias": "ARCH-255", "path": "/courses/22647", "sections": {"path": "/courses/22647/sections", "values": [{"name": "SUSTAINABILITY IN ACTION", "sectionnum": "401", "primary_alias": "ARCH-255-401", "path": "/courses/22647/sections/401", "id": "22647-401", "aliases": ["ARCH-255-401", "ARCH-755-401", "ENVS-255-401", "URBS-225-401"]}]}, "id": 22647, "aliases": ["ARCH-255", "ARCH-755", "ENVS-255", "URBS-225"]}