[{"ratings": {"rAmountLearned": "3.23", "rDifficulty": "2.00", "rStimulateInterest": "3.35", "rRecommendMajor": "3.77", "rCourseQuality": "3.48", "rWorkRequired": "2.48", "rInstructorAccess": "3.65", "rReadingsValue": "3.58", "rRecommendNonMajor": "3.44", "rCommAbility": "3.69", "rInstructorQuality": "3.78"}, "section": {"name": "AFRICAN-AMERICAN LIT", "sectionnum": "401", "primary_alias": "ENGL-081-401", "path": "/courses/15619/sections/401", "id": "15619-401", "aliases": ["ENGL-081-401", "CINE-081-401", "AFRC-081-401"]}, "comments": "An introduction to African-American literature, this course covers a wide spectrum of moments, methodologies, and ideological postures, from Reconstruction and the Harlem Renaissance to the Civil Rights Movement. Most versions of this course begin in the 19th century but others concentrate only on the modern period.\r\nStudents commented that the class was “very educational,” using a structure that was “perfect for the material being covered.” Students appreciated the relaxed atmosphere of the class, and thought the readings, themes, and insights discussed in the class were appropriate and interesting. However, some commented that the group presentations that the class required were not very useful because they were “somewhat uninteresting and never insightful.”\r\nProfessor Tillet was described as “incredible and knowledgeable.” Students appreciated her approach to the subject matter, and thought that she used readings effectively to convey the themes of the course. Students commented that she presented the information in an appealing way that left students intrigued. Professor Tillet was further described as being “interesting, energetic, well-spoken, and very willing to discuss issues outside of class.”\r\nThe course was not rated as too difficult for students enjoyed the relaxed pace. This course was recommended for majors and non-majors alike because of its interesting themes and approaches. Students who took this class as an elective found that the curriculum generated interest for them in becoming either an English or Africana Studies major.", "num_students": 28, "path": "/courses/15619/sections/401/reviews/2463-SALAMISHAH-TILLET", "instructor": {"path": "/instructors/2463-SALAMISHAH-TILLET", "first_name": "SALAMISHAH", "last_name": "TILLET", "id": "2463-SALAMISHAH-TILLET", "name": "SALAMISHAH TILLET"}, "num_reviewers": 28, "id": "15619-401-2463-SALAMISHAH-TILLET"}]