{"coursehistories": {"path": "/coursehistories/3359"}, "description": "An introduction not only to representations of the law and legal processes in literary texts, but also to the theories of reading, representation, and interpretation that form the foundation of both legal and literary analysis. \n\nSee the English Department's website at www.english.upenn.edu for a description of the current offerings. \n\n", "semester": "2012A", "name": "LITERATURE AND LAW", "reviews": {"path": "/courses/27291/reviews", "values": [{"ratings": {"rAmountLearned": "2.70", "rDifficulty": "2.20", "rStimulateInterest": "2.70", "rRecommendMajor": "3.20", "rCourseQuality": "2.86", "rWorkRequired": "2.55", "rInstructorAccess": "3.37", "rReadingsValue": "3.00", "rRecommendNonMajor": "2.65", "rCommAbility": "3.20", "rInstructorQuality": "3.14"}, "section": {"name": "LITERATURE AND LAW", "sectionnum": "001", "primary_alias": "ENGL-066-001", "path": "/courses/27291/sections/001", "id": "27291-001", "aliases": ["ENGL-066-001"]}, "comments": "This course explored some of the intersections between literature and law. Both shape language worlds that seek to represent, interpret, and criticize the flesh-and-blood world of human interaction.  Both rely on storytelling, inherited forms, and styles of voice. Yet despite their similarities, law and literature quite often confront each other with suspicion. Laws have banned books, exiled writers, and chided literary intellectuals for social irresponsibility. Literary works, for their part, often find ambiguity where the law finds certainty, and point to coercion and inequity where the law asserts fairness. This course examines the enduring fascination that law and justice have held for literary writers at the same time we investigate the narrative dimensions of the law. Readings consisted of plays, stories, and novels as well as some case law. Possible works included Sophocles’s Antigone, Shakespeare’s Merchant of Venice, Melville’s Billy Budd, Twain’s Pudd’nhead Wilson, Chesnutt’s Marrow of Tradition, Glaspell’s “A Jury of Her Peers,” Kafka’s The Trial, and stories from Angela Carter’s Bloody Chambers.  Students were required to write two papers and two exams.\r\n\r\nStudents especially enjoyed some of the class activities, such as mock trials and discussions. However, some class members expressed desire for a \"more engaged seminar\" because \"a select group of individuals\" dominated the class discussion. Students found the analysis of literature and law \"enriching,\" and one student specifically described the class as \"very well taught.\"\r\n\r\nClass members praised Professor Bentley for her \"enthusiasm,\" which one student called \"contagious.\" Another student called Professor Bentley \"extremely talented\" and \"one of my favorite lecturers at Penn.\" The professor \"made the subject matter very interesting\" by \"communicating her passion\" to the students.\r\n\r\nStudents \"enjoyed all of the required readings,\" most of which came from law journal articles and literature, rather than a blending of the two. Some students wanted more historical context in the class. Many of the class members were non-majors, who still enjoyed the course.", "num_students": 25, "path": "/courses/27291/sections/001/reviews/1402-NANCY-A--BENTLEY", "instructor": {"path": "/instructors/1402-NANCY-A--BENTLEY", "first_name": "NANCY A.", "last_name": "BENTLEY", "id": "1402-NANCY-A--BENTLEY", "name": "NANCY A. BENTLEY"}, "num_reviewers": 22, "id": "27291-001-1402-NANCY-A--BENTLEY"}]}, "credits": null, "primary_alias": "ENGL-066", "path": "/courses/27291", "sections": {"path": "/courses/27291/sections", "values": [{"name": "LITERATURE AND LAW", "sectionnum": "001", "primary_alias": "ENGL-066-001", "path": "/courses/27291/sections/001", "id": "27291-001", "aliases": ["ENGL-066-001"]}]}, "id": 27291, "aliases": ["ENGL-066"]}