[{"ratings": {"rAmountLearned": "2.56", "rDifficulty": "1.98", "rStimulateInterest": "2.63", "rRecommendMajor": "3.42", "rCourseQuality": "2.56", "rWorkRequired": "2.52", "rInstructorAccess": "2.51", "rReadingsValue": "2.41", "rRecommendNonMajor": "2.44", "rCommAbility": "2.60", "rInstructorQuality": "2.57"}, "section": {"name": "HEALTH & SOCIETIES", "sectionnum": "001", "primary_alias": "HSOC-010-001", "path": "/courses/15926/sections/001", "id": "15926-001", "aliases": ["HSOC-010-001"]}, "comments": "This course is an introduction to the vocabulary, skills, and concepts basic to sociocultural studies of health and disease. While recognizing the importance of the biomedical model, particularly to Western civilization, the course asks students to explore other approaches and healing traditions. It does so by exploring how policy analysts, medical care providers, and scholars from a variety of disciplines including anthropology, history and sociology have crafted responses to such real world problems as malnutrition, epidemic disease, and the inequitable distribution of health resources.&#8232;\r\nStudents found the course “choppy” and said it was “difficult to understand the overarching goal” due to a large number of guest lecturers. Overall students were interested in the material, but as one put it, “With some more structuring and more clear cut goals and intentions, I think students would be less frustrated with the course.”\r\n\r\nWhen Professor Beam did lecture, students said that his “knowledge and personal experience in the subject matter enriched his lecture portions.” But many students were dismayed that the class seemed one-sided, saying “Dr. Bream was highly biased in everything from his political to medical views, and the course reflected this entirely.”\r\n\r\nThis course is a good introduction to those who are considering the Health and Societies major. Students said that the assignments (one student described them as “major research assignments every two weeks”) readings, and culminating final project were very time consuming, but mentioned that Professor Beam was flexible with coursework.", "num_students": 153, "path": "/courses/15926/sections/001/reviews/4377-KENT-D-W--BREAM", "instructor": {"path": "/instructors/4377-KENT-D-W--BREAM", "first_name": "KENT D.W.", "last_name": "BREAM", "id": "4377-KENT-D-W--BREAM", "name": "KENT D.W. BREAM"}, "num_reviewers": 147, "id": "15926-001-4377-KENT-D-W--BREAM"}]