[{"ratings": {"rAmountLearned": "2.99", "rDifficulty": "2.70", "rStimulateInterest": "3.45", "rRecommendMajor": "3.72", "rCourseQuality": "3.24", "rWorkRequired": "3.00", "rInstructorAccess": "2.59", "rReadingsValue": "2.82", "rRecommendNonMajor": "2.97", "rCommAbility": "3.67", "rInstructorQuality": "3.53"}, "section": {"name": "AMERICAN SOUTH 1861-PRES", "sectionnum": "001", "primary_alias": "HIST-171-001", "path": "/courses/27569/sections/001", "id": "27569-001", "aliases": ["HIST-171-001"]}, "comments": "This course traces the history of the American South from the end of the Civil War to the present. It investigates Reconstruction, the New South, Populism, racial disfranchisement and the rise of Jim Crow, the politics of the One-Party-South, the South in the Progressive era and its role in the New Deal and World War II, the Civil Rights Movement of the 1950s and 1960s, and the rise of the Republican South. While following the narrative of politics and economic development, the course pays particular attention to race relations and is more than casually interested in gender roles. In addition, it takes frequent peeks at the evolving Southern identity as reflected in popular culture and literature as well as in other corners of the public sphere. \r\n\r\nOverall, students found this course to be extremely interesting and informative, and it provided many students a fresh perspective on US History far beyond what they had learned in high school Advanced Placement courses. Many students even said it was one of the best courses they have taken at Penn to date. The one complaint regarding course material, voiced by several students, was that they watched too many videos during class time, which some felt was a “waste” given how interesting the course material was. \r\n\r\nProfessor Hahn received rave reviews from his students, who described Professor Hahn as an incredible lecturer and an “absolute master of history.” Several students commented that Professor Hahn’s lectures were so clear and engaging that they never wanted to miss a class. In addition, one student complimented Professor Hahn on, “always [having] relevant conclusions and [tying] historical events to modern situations with ease.” All in all, students were grateful for the opportunity to take a course from Professor Hahn. \r\n\r\nOne of the only, yet frequently repeated, criticisms of the course was that there was a very copious, and in one student’s words even “impossible,” amount of reading. This was especially surprising for some students given that it is an introductory course. That said, many students expressed that the assessments were not excessive and were generally graded fairly. A few non-history majors said they would recommend this course to other non-majors; in the words of one of these students, “I am not a ‘history person’ but nonetheless found this course incredibly interesting.” One student warned, however, that history majors might prefer a course that is more detailed and has less pop history appeal than this course. ", "num_students": 116, "path": "/courses/27569/sections/001/reviews/2506-STEVEN-HAHN", "instructor": {"path": "/instructors/2506-STEVEN-HAHN", "first_name": "STEVEN", "last_name": "HAHN", "id": "2506-STEVEN-HAHN", "name": "STEVEN HAHN"}, "num_reviewers": 102, "id": "27569-001-2506-STEVEN-HAHN"}]