{"coursehistories": {"path": "/coursehistories/1836"}, "description": "This animation course fuses hands-on studio drawing, modeling, and cinematic processes with digital tools. Real world techniques such as stop-motion, claymation, hand-drawn and multi-plane animation will be practiced in the studio. Other techniques, such as keyframe animation, editing and blue-screen composition compositing will be practiced in the digital labs. Both production teams and individuals will create short mixed-media animations in form, material and time. \n\n", "semester": "2012A", "name": "MIXED MEDIA ANIMATION", "reviews": {"path": "/courses/27415/reviews", "values": [{"ratings": {"rAmountLearned": "2.44", "rDifficulty": "3.20", "rTAQuality": "2.60", "rStimulateInterest": "2.60", "rRecommendMajor": "2.70", "rCourseQuality": "2.40", "rWorkRequired": "3.50", "rInstructorAccess": "2.60", "rReadingsValue": "2.50", "rRecommendNonMajor": "1.40", "rCommAbility": "2.70", "rInstructorQuality": "2.60"}, "section": {"name": "MIXED MEDIA ANIMATION", "sectionnum": "401", "primary_alias": "FNAR-289-401", "path": "/courses/27415/sections/401", "id": "27415-401", "aliases": ["FNAR-289-401", "CINE-289-401", "FNAR-589-401"]}, "comments": "This animation course fuses hands-on studio drawing, modeling, and cinematic processes with digital tools.  Real world techniques such as stop-motion, claymation, hand-drawn and multi-plane animation are practiced in the studio.  Other techniques, such as keyframe animation, editing and blue-screen composition compositing are practiced in the digital labs.  Both production teams and individuals create short mixed-media animations in form, material and time. \r\n\r\n\tStudent reviews for this class were mixed, with some citing it as a “really interesting course” that allowed them to gain “a new appreciation for the amount of work animators put into their productions,” and others lamenting that class involved “3 hour weekly, boring critiques,” with too much time “just spent watching music clips.”  Students expressed that the course felt “a little too free” and “lacking substantial guidance,” but at least one student said that “that’s also what [made] the class fun.”\r\n\r\n\tThere were not enough qualitative comments about the Professor to review.\r\n\r\n\tThe assignments were regarded as “good introductions to many styles of animation,” but it was commonly expressed that “projects [took] an immense amount of time to complete.”  Students further reported that “grading [was] harsh” and that “effort should have been taken more into consideration” in the grading process.  Still, one student reported that he would “certainly recommend this course to the more art-oriented student.”  This review was based on eight student comments.", "num_students": 12, "path": "/courses/27415/sections/401/reviews/4326-LELAND-E-BURKE", "instructor": {"path": "/instructors/4326-LELAND-E-BURKE", "first_name": "LELAND E", "last_name": "BURKE", "id": "4326-LELAND-E-BURKE", "name": "LELAND E BURKE"}, "num_reviewers": 10, "id": "27415-401-4326-LELAND-E-BURKE"}, {"ratings": {"rAmountLearned": "2.44", "rDifficulty": "3.20", "rTAQuality": "2.60", "rStimulateInterest": "2.90", "rRecommendMajor": "2.70", "rCourseQuality": "2.40", "rWorkRequired": "3.50", "rInstructorAccess": "3.50", "rReadingsValue": "2.50", "rRecommendNonMajor": "1.40", "rCommAbility": "3.20", "rInstructorQuality": "3.10"}, "section": {"name": "MIXED MEDIA ANIMATION", "sectionnum": "401", "primary_alias": "FNAR-289-401", "path": "/courses/27415/sections/401", "id": "27415-401", "aliases": ["FNAR-289-401", "CINE-289-401", "FNAR-589-401"]}, "comments": "This animation course fuses hands-on studio drawing, modeling, and cinematic processes with digital tools.  Real world techniques such as stop-motion, claymation, hand-drawn and multi-plane animation are practiced in the studio.  Other techniques, such as keyframe animation, editing and blue-screen composition compositing are practiced in the digital labs.  Both production teams and individuals create short mixed-media animations in form, material and time. The prerequisites for this course are FNAR123 and FNAR264. \r\n\r\nThis course received mixed reviews. Some students thought it was a great, interesting course in which they learned a lot. One student elaborated that the course, “offers great experience and skills for doing any time-based art.” However, other students expressed that they were generally dissatisfied with the content of the course and the way in which it was presented. In particular, one student explained that, “class time was just spent watching music clips, or sitting in 3 hour weekly, boring critiques.” \r\n\r\nThere were not many comments on the instructor in this course.  One student felt the instruction was “awesome,” while another felt that although Professor Hagerty was “sometimes amusing to watch,” Professor Hagerty’s comments were less than constructive.  A few students mentioned that the grading was generally harsh on assignments. \r\n\r\nStudents also expressed that contrary to some of their initial impressions that the course would be a “fun, chill class,” there was actually a lot of work, and time-consuming work at that. One reviewer claimed, “Projects take an immense amount of time to complete to any degree.” Given the amount of time that must be put into assignments, another student said the course should be recommended only to the more art-oriented student who has a genuine interest in the topic. ", "num_students": 12, "path": "/courses/27415/sections/401/reviews/4803-ERINN-E-HAGERTY", "instructor": {"path": "/instructors/4803-ERINN-E-HAGERTY", "first_name": "ERINN E", "last_name": "HAGERTY", "id": "4803-ERINN-E-HAGERTY", "name": "ERINN E HAGERTY"}, "num_reviewers": 10, "id": "27415-401-4803-ERINN-E-HAGERTY"}]}, "credits": null, "primary_alias": "FNAR-289", "path": "/courses/27415", "sections": {"path": "/courses/27415/sections", "values": [{"name": "MIXED MEDIA ANIMATION", "sectionnum": "401", "primary_alias": "FNAR-289-401", "path": "/courses/27415/sections/401", "id": "27415-401", "aliases": ["FNAR-289-401", "CINE-289-401", "FNAR-589-401"]}]}, "id": 27415, "aliases": ["FNAR-289", "CINE-289", "FNAR-589"]}