{"coursehistories": {"path": "/coursehistories/1262"}, "description": "\"Contemporary Politics, Policy and Journalism\" is a course on the modern media and its impact on government and politics. It primarily covers the post-Watergate/post-Vietnam era of journalism, the past quarter century. We will focus each week on specific topics and areas of post-Watergate journalism as enumerated below. In weeks we do not have guest lecturers, the first half of class will concern the assigned readings and the second half of class will talk about current press coverage of national events over the prior week. In addition to assigned readings, students are required to stay informed about major national news stories and to follow coverage of them in the national media outlets. An important objective of this course is to afford students the opportunity to interact and discuss the intersection of the press, politics and public policy with some of the leading practitioners in the field, people who work in the \"media environment\" created by the national press. \n\n", "semester": "2009A", "name": "CONTMP POL,POLICY,JOURN", "reviews": {"path": "/courses/15544/reviews", "values": [{"ratings": {"rAmountLearned": "3.15", "rDifficulty": "1.96", "rStimulateInterest": "3.69", "rRecommendMajor": "3.77", "rCourseQuality": "3.52", "rWorkRequired": "2.15", "rInstructorAccess": "2.85", "rReadingsValue": "2.85", "rRecommendNonMajor": "3.27", "rCommAbility": "3.69", "rInstructorQuality": "3.56"}, "section": {"name": "CONTMP POL,POLICY,JOURN", "sectionnum": "301", "primary_alias": "COMM-323-301", "path": "/courses/15544/sections/301", "id": "15544-301", "aliases": ["COMM-323-301"]}, "comments": "This course focuses on the modern media and its impact on government and politics. It primarily covers the post-Watergate/post-Vietnam era of journalism, the past quarter century. It focuses each week on specific topics and areas of post-Watergate journalism. In weeks when there are not guest lecturers, the first half of class concerns the assigned readings and the second half of class talks about current press coverage of national events over the prior week. In addition to assigned readings, students are required to stay informed about major national news stories and to follow coverage of them in the national media outlets. An important objective of this course is to afford students the opportunity to interact and discuss the intersection of the press, politics and public policy with some of the leading practitioners in the field, people who work in the \\\"media environment\\\" created by the national press.\r\n\r\nStudents found the class “absolutely wonderful.” The numerous “terrific guest speakers” helped to flesh out the topics of the class. Many students spoke highly of the trip to Washington with its accompanying speakers and experiences. A number of students called the course the “best,” or “one of the best,” they have taken at Penn.\r\n\r\nProfessor Hunt was universally loved by his students. One student called him “one of the kindest and smartest [professors] I have had the privilege of having” at Penn. Another student praised him for not only building a relationship between him and the students but between the students themselves. The only complaint, articulated by one student, was that he might have provided more guidance on the final paper topic.\r\n\r\nThe difficulty and amount of work required by this course was relatively low. It was strongly recommended to both majors and non-majors.", "num_students": 27, "path": "/courses/15544/sections/301/reviews/295-ALBERT-HUNT", "instructor": {"path": "/instructors/295-ALBERT-HUNT", "first_name": "ALBERT", "last_name": "HUNT", "id": "295-ALBERT-HUNT", "name": "ALBERT HUNT"}, "num_reviewers": 27, "id": "15544-301-295-ALBERT-HUNT"}]}, "credits": null, "primary_alias": "COMM-323", "path": "/courses/15544", "sections": {"path": "/courses/15544/sections", "values": [{"name": "CONTMP POL,POLICY,JOURN", "sectionnum": "301", "primary_alias": "COMM-323-301", "path": "/courses/15544/sections/301", "id": "15544-301", "aliases": ["COMM-323-301"]}]}, "id": 15544, "aliases": ["COMM-323"]}