{"coursehistories": {"path": "/coursehistories/4029"}, "description": "A focused academic and practical experience offered by Sea Education Association, Inc. for university students interested in understanding the sea and maritime matters. The Sea Semester is composed of two intensive six-week components taken off campus. The Shore Component-six weeks at Woods Hole, Massachusetts, with formal study in: Introduction to Oceanography. A survey of the characteristics and processes of the global ocean. Oceanographic concepts are introduced and developed from their bases in biology, physics, chemistry, and geology. \n\nIntroduction to Maritime Studies. An interdisciplinary consideration of man's relationship with his marine environment. Included are the political, economic, social, and cultural results of man's use of the sea for scientific research, food, fuel, minerals, energy-efficient transportation, and recreation-taught within the context of maritime history, law, literature, and art. \n\nIntroduction to Nautical Science. The technologies of operation at sea. Concepts of navigation, naval architecture, ship construction, marine engineering systems, and ship management are taught from their bases in physics and astronomy. The Sea Component-six weeks at sea aboard the oceanographic research vessel R/V Westward with formal study in: Oceanographis Laboratory I. The practice of oceanography at sea. Introduction to the oceanic environment, including its biological, physical, chemical, and geological aspects. Instruction given in operation of oceanographic devices for sampling and measurement. Practices in data reduction and analysis and problem solving related to the surrounding ocean environment. \n\nOceanographic Laboratory II. Introduction to technical and psychological problems of operation and existence in the ocean environment. Practice in navigation, seamanship, marine engineering, and shipboard operations. \n\n", "semester": "2007A", "name": "MARITIME SCI/TECHN", "reviews": {"path": "/courses/14328/reviews", "values": []}, "credits": null, "primary_alias": "EAS-300", "path": "/courses/14328", "sections": {"path": "/courses/14328/sections", "values": [{"name": "MARITIME SCI/TECHN", "sectionnum": "001", "primary_alias": "EAS-300-001", "path": "/courses/14328/sections/001", "id": "14328-001", "aliases": ["EAS-300-001"]}, {"name": "MARITIME SCI/TECHN", "sectionnum": "002", "primary_alias": "EAS-300-002", "path": "/courses/14328/sections/002", "id": "14328-002", "aliases": ["EAS-300-002"]}, {"name": "MARITIME SCI/TECHN", "sectionnum": "003", "primary_alias": "EAS-300-003", "path": "/courses/14328/sections/003", "id": "14328-003", "aliases": ["EAS-300-003"]}, {"name": "MARITIME SCI/TECHN", "sectionnum": "004", "primary_alias": "EAS-300-004", "path": "/courses/14328/sections/004", "id": "14328-004", "aliases": ["EAS-300-004"]}]}, "id": 14328, "aliases": ["EAS-300"]}