{"coursehistories": {"path": "/coursehistories/4560"}, "description": "One of the toughest challenges for any journalist is to master the art of the profile-writing. In this new course, students will read and critique some of teh classic profile articles of the past 40 years, and, most importantly, write profile articles of their own. Writing about people is often very rewarding, but rarely easy. In this course, students will debate the questions that have plagued and energized journalists for generations: How do you persuade somebody that he or she is a worthy topic for a profile? How do you ask sensitive questions? If the person is a celebrity, how do you avoid being manipulated into writing a \"puff piece\"? Do you tape the interviews or just take notes? How do you structure a profile in order to keep the reader's attention? Is it even possible to capture the essence of a person on the written page? Are you a friend to the profile subject--or a manipulator? A journalist at The New Yorker recently said that a writer's relationship with the profile subject is \"a kind of love affair.\" On the other hand, a famous author once said that a profile writer is typically \"gaining their trust and betraying without remorse.\" Which is closer to the truth? \n\nStudents, in addition to writing their own profiles, will kick around these questions while reading some of the best contemporary profile writers, including Susan Orlean, Gay Talese, David Remnick, Mark Bowden, and Judy Bachrach. The instructor will also offer several of his own. \n\nSee English Department website at www.english.upenn.edu for a description of current offerings. \n\n", "semester": "2011A", "name": "THE ART OF THE PROFILE", "reviews": {"path": "/courses/21606/reviews", "values": [{"ratings": {"rAmountLearned": "2.75", "rDifficulty": "2.08", "rStimulateInterest": "2.92", "rRecommendMajor": "3.27", "rCourseQuality": "2.92", "rWorkRequired": "2.17", "rInstructorAccess": "3.25", "rReadingsValue": "3.42", "rRecommendNonMajor": "2.83", "rCommAbility": "3.25", "rInstructorQuality": "3.15"}, "section": {"name": "THE ART OF THE PROFILE", "sectionnum": "301", "primary_alias": "ENGL-161-301", "path": "/courses/21606/sections/301", "id": "21606-301", "aliases": ["ENGL-161-301"]}, "comments": "", "num_students": 13, "path": "/courses/21606/sections/301/reviews/1837-RICHARD-POLMAN", "instructor": {"path": "/instructors/1837-RICHARD-POLMAN", "first_name": "RICHARD", "last_name": "POLMAN", "id": "1837-RICHARD-POLMAN", "name": "RICHARD POLMAN"}, "num_reviewers": 13, "id": "21606-301-1837-RICHARD-POLMAN"}]}, "credits": null, "primary_alias": "ENGL-161", "path": "/courses/21606", "sections": {"path": "/courses/21606/sections", "values": [{"name": "THE ART OF THE PROFILE", "sectionnum": "301", "primary_alias": "ENGL-161-301", "path": "/courses/21606/sections/301", "id": "21606-301", "aliases": ["ENGL-161-301"]}]}, "id": 21606, "aliases": ["ENGL-161"]}