[{"ratings": {"rAmountLearned": "2.97", "rDifficulty": "2.38", "rStimulateInterest": "3.21", "rRecommendMajor": "3.21", "rCourseQuality": "2.73", "rWorkRequired": "2.52", "rInstructorAccess": "2.41", "rReadingsValue": "3.21", "rRecommendNonMajor": "2.79", "rCommAbility": "2.79", "rInstructorQuality": "2.93"}, "section": {"name": "WOMEN AND RELIGION", "sectionnum": "401", "primary_alias": "RELS-005-401", "path": "/courses/28099/sections/401", "id": "28099-401", "aliases": ["RELS-005-401", "FOLK-029-401", "GSWS-109-401"]}, "comments": "This course looked at issues of gender in Hinduism, Islam, and Christianity. By using historical, psychoanalytical and anthropological tools, the class explored the various ways in which religion shapes gender roles and vice-versa. Aspects considered included the representation of the divine, the role of women in religious institutions, and rules regarding the human body, marriage and sexuality. Students also took into consideration contemporary women's self-representation in religious literature, art, and film.\r\n\r\nOverall, students enjoyed this course, calling it \"enlightening,\" \"engaging,\" and \"interesting.\" One student considered the course a \"favorite class taken at Penn so far\" and another student \"would highly recommend it.\" Yet another class member appreciated the relation of \"course content to current events.\" \r\n\r\nWhile students appreciated Professor Butler's \"passionate\" nature, many students were disappointed by her \"one-sided\" opinions. One student noted that Professor Butler \"seemed highly distracted by her own involvements.\" Another student observed that when \"students expressed opposing views,\" the professor played \"less of an objective role and sort of targeted them for believing something else.\" Students felt that the professor's views made the course content more biased.  One student expressed a desire to have studied specific roles of religion in women, rather than the broad approach employed.\r\n\r\nIn terms of specific course work and prerequisites, one student cautioned that only \"people interested in either feminism or religion\" and with some prior knowledge of these subjects ought to take the class because this was \"not an introductory course on either subject.\" Another student noted, \"grades were not returned in a timely fashion.\"", "num_students": 41, "path": "/courses/28099/sections/401/reviews/4970-ANTHEA-D--BUTLER", "instructor": {"path": "/instructors/4970-ANTHEA-D--BUTLER", "first_name": "ANTHEA D.", "last_name": "BUTLER", "id": "4970-ANTHEA-D--BUTLER", "name": "ANTHEA D. BUTLER"}, "num_reviewers": 31, "id": "28099-401-4970-ANTHEA-D--BUTLER"}]