{"coursehistories": {"path": "/coursehistories/2550"}, "description": "Stochastic systems analysis and simulation (ESE 303) is a class that explores stochastic systems which we could loosely define as anything random that changes in time. Stochastic systems are at the core of a number of disciplines in engineering, for example communication systems and machine learning. They also find application elsewhere, including social systems, markets, molecular biology and epidemiology. The goal of the class is to learn how to model, analyze and simulate stochastic systems. With respect to analysis we distinguish between what we could call theoretical and experimental analysis. By theoretical analysis we refer to a set of tools which let us discover and understand properties of the system. These analysis can only take us so far and is usually complemented with numerical analysis of experimental outcomes. Although we use the word experiment more often than not we simulate the stochastic system in a computer and analyze the outcomes of these virtual experiments. \n\nThe class's material is divided in four blocks respectively dealing with Markov chains, continuous time Markov chains, Gaussian processes and stationary processes. Emphasis is placed in the development of toolboxes to analyze these different classes of processes and on describing their applications to complex stochastic systems in different disciplines. Particular examples include: (i) the problem of ranking web pages by a search engine; (ii) the study of reputation and trust in social networks; (iii) modeling and analysis of communication networks; (iv) the use of queues in the modeling of transportation networks; (v) stochastic modeling and simulation of biochemical reactions and gene networks; (vi) arbitrages, pricing of stocks, and pricing of options through Black-Scholes formula; and (vii) linear filtering of stochastic processes to separate signals of interest from background noise. For more information visit the class's web page at http://alliance.seas.upenn.edu/~ese303/wiki/. \n\n", "semester": "2011C", "name": "STOCH SYS ANALYSIS SIMUL", "reviews": {"path": "/courses/24361/reviews", "values": [{"ratings": {"rAmountLearned": "3.37", "rDifficulty": "3.38", "rStimulateInterest": "3.36", "rRecommendMajor": "3.71", "rCourseQuality": "3.16", "rWorkRequired": "3.72", "rInstructorAccess": "3.31", "rReadingsValue": "2.51", "rRecommendNonMajor": "2.31", "rCommAbility": "3.38", "rInstructorQuality": "3.36"}, "section": {"name": "STOCH SYS ANALYSIS SIMUL", "sectionnum": "001", "primary_alias": "ESE-303-001", "path": "/courses/24361/sections/001", "id": "24361-001", "aliases": ["ESE-303-001"]}, "comments": "This course provides a study of discrete-event systems simulation. Some areas of\r\napplication include: queuing systems, inventory systems, reliability systems and Monte-\r\nCarlo systems. The course examines many of the discrete and continuous probability\r\ndistributions used in simulation studies as well as the Poisson process. Long-run\r\nmeasurements of performances of queuing systems, steady-state behavior of infinite and\r\nfinite-population queuing systems and network of queues are also examined.\r\nFundamental to most simulation studies is the ability to generate reliable random\r\nnumbers. The course investigates the basic properties of random numbers and techniques\r\nused for the generation of pseudo-random numbers. In addition, the course examines\r\ntechniques used to test pseudo-random numbers for uniformity and independence. These\r\ninclude the Kolmogorov-Smirnov and chi-squired tests, runs tests, gap tests, and poker\r\ntests. Random numbers are used to generate random samples and the course examines the\r\ninverse-transform, convolution, composition and acceptance/rejection methods for the\r\ngeneration of random samples for many different types of probability distributions.\r\nFinally, since most inputs to simulation are probabilistic instead of deterministic in\r\nnature, the course examines some techniques used for identifying the probabilistic nature\r\nof input data. These include identifying distributional families with sample data, then\r\nusing maximum-likelihood methods for parameter estimating within a given family and\r\nthen testing the final choice of distribution using chi-squared goodness-of-fit tests.\r\nStudents found this class to be “very useful” and enjoyed the broad applicability\r\nof the materials taught. The homework and exams were described as “fair.” However, a\r\nfew students commented that the class felt rushed towards the end and wished there were\r\npractice problems for the final exam.\r\nProfessor Robeiro was generally well-liked. Students appreciated his flexibility\r\nregarding late assignments and described him as an “awesome guy.” Some students did\r\nnot like the fact that he randomly called on students to answer questions in class.\r\nThis course was described as “challenging” and “intimidating.” A working\r\nknowledge of MATLAB was required to complete the “lengthy” problem sets. A good\r\ngrasp of probability and programming was also recommended. Despite its difficulty,\r\nstudents recommended this class to both majors and non-majors alike.", "num_students": 49, "path": "/courses/24361/sections/001/reviews/4320-ALEJANDRO-RIBEIRO", "instructor": {"path": "/instructors/4320-ALEJANDRO-RIBEIRO", "first_name": "ALEJANDRO", "last_name": "RIBEIRO", "id": "4320-ALEJANDRO-RIBEIRO", "name": "ALEJANDRO RIBEIRO"}, "num_reviewers": 46, "id": "24361-001-4320-ALEJANDRO-RIBEIRO"}]}, "credits": null, "primary_alias": "ESE-303", "path": "/courses/24361", "sections": {"path": "/courses/24361/sections", "values": [{"name": "STOCH SYS ANALYSIS SIMUL", "sectionnum": "001", "primary_alias": "ESE-303-001", "path": "/courses/24361/sections/001", "id": "24361-001", "aliases": ["ESE-303-001"]}]}, "id": 24361, "aliases": ["ESE-303"]}