[{"ratings": {"rAmountLearned": "2.88", "rDifficulty": "2.49", "rStimulateInterest": "3.00", "rRecommendMajor": "3.51", "rCourseQuality": "3.00", "rWorkRequired": "2.49", "rInstructorAccess": "3.14", "rReadingsValue": "2.56", "rRecommendNonMajor": "2.11", "rCommAbility": "3.27", "rInstructorQuality": "3.30"}, "section": {"name": "MICROBIOLOGY", "sectionnum": "401", "primary_alias": "BIOL-275-401", "path": "/courses/24068/sections/401", "id": "24068-401", "aliases": ["BIOL-275-401", "BIOL-575-401"]}, "comments": "Microbiology plays a central role in diverse areas of human life such as infectious\r\ndisease, ecology and biotechnology. This course covers aspects of modern microbiology\r\nwith an emphasis on prokaryotic organisms. The topics include, among others, basic\r\naspects of microbial diversity, genetics, virology and pathogenesis as well as examples of\r\napplied microbiology.\r\nThe students felt that this was a “great course for introducing microbiology”. In\r\naddition to Professor Pohlschroder, there were many guest lecturers. Although some\r\nstudents felt that the guest lectures “made it hard to focus on the course’s central goals,”\r\nthe majority felt that the guest lectures added to the course, giving tips on in-depth\r\nresearch and career options in microbiology. Overall, the students felt that this was an\r\n“exciting and informative course.”\r\nStudents gave impressive reviews of Professor Pohlschroder. They said that she\r\nwas an “excellent teacher” with a “very positive attitude.” Students wished that Professor\r\nPohlschroder taught more of the lectures because she was a very entertaining lecturer and\r\npresented the course material clearly.\r\nThe students felt that the exams were easy and very fair. The prerequisites for\r\nthis class are BIOL 101 and BIOL 121, while BIOL 221 is strongly recommended.", "num_students": 44, "path": "/courses/24068/sections/401/reviews/865-MECHTHILD-POHLSCHRODER", "instructor": {"path": "/instructors/865-MECHTHILD-POHLSCHRODER", "first_name": "MECHTHILD", "last_name": "POHLSCHRODER", "id": "865-MECHTHILD-POHLSCHRODER", "name": "MECHTHILD POHLSCHRODER"}, "num_reviewers": 40, "id": "24068-401-865-MECHTHILD-POHLSCHRODER"}]