[{"ratings": {"rAmountLearned": "3.48", "rDifficulty": "1.55", "rStimulateInterest": "3.61", "rRecommendMajor": "3.86", "rCourseQuality": "3.52", "rWorkRequired": "2.13", "rInstructorAccess": "3.74", "rReadingsValue": "2.77", "rRecommendNonMajor": "3.70", "rCommAbility": "3.82", "rInstructorQuality": "3.84"}, "section": {"name": "Prevention of Tobacco Addiction in Pre-Adolescent Children of Philadelphia", "sectionnum": "401", "primary_alias": "ENVS-407-401", "path": "/courses/21642/sections/401", "id": "21642-401", "aliases": ["ENVS-407-401", "HSOC-407-401"]}, "comments": "In “Urban Environments: Prevention of Tobacco Smoking in Adolescents,” undergraduates learn about: the short and long term consequences of smoking; social influences affecting tobacco use; the effectiveness of cessation programs; tobacco advocacy; and the impact of the tobacco settlement. In addition to class, students will work with teachers in West Philadelphia to provide lessons for middle school students. Moreover, students will survey middle school and Penn student smoking. The goal of the course is to raise awareness among middle school children to prevent tobacco addiction during adolescence.\r\n\r\nMost students truly enjoyed the course and especially liked teaching middle school students. Students described the class as “interesting,” “fun,” and “fulfilling.” One student called it “the best course [he’s] ever taken during [his] four years at Penn.” The majority felt they learned a great deal from guest lecturers and firsthand teaching.\r\n\r\nProfessor Kulik received stellar reviews. Students described Professor Kulik as “knowledgeable, approachable, and funny.” Some pointed out that his “get-out-of-it-what-you-want-to-get-out-of-it” method worked well with the structure of the course.\r\n\r\nBecause it is classified as ABCS, the course requires community service in addition to class time. The majority of workload is attributed to the hours put into teaching middle school students, writing a final paper, and preparing a tobacco ad counting project. The course was recommended for majors and non-majors.\r\n", "num_students": 28, "path": "/courses/21642/sections/401/reviews/4317-MICHAEL-KULIK", "instructor": {"path": "/instructors/4317-MICHAEL-KULIK", "first_name": "MICHAEL", "last_name": "KULIK", "id": "4317-MICHAEL-KULIK", "name": "MICHAEL KULIK"}, "num_reviewers": 26, "id": "21642-401-4317-MICHAEL-KULIK"}]