{"coursehistories": {"path": "/coursehistories/2509"}, "description": "Theories of consumer behavior, demand, production, costs, the firm in various market contexts, factor employment, factor incomes, elementary general equilibrium, and welfare. \n\n", "semester": "2012A", "name": "INTERMED MICROECONOMICS", "reviews": {"path": "/courses/27262/reviews", "values": [{"ratings": {"rAmountLearned": "2.26", "rDifficulty": "3.57", "rStimulateInterest": "2.19", "rRecommendMajor": "3.16", "rCourseQuality": "1.78", "rWorkRequired": "3.26", "rInstructorAccess": "3.16", "rReadingsValue": "1.07", "rRecommendNonMajor": "0.82", "rCommAbility": "1.57", "rInstructorQuality": "2.19"}, "section": {"name": "INTERMED MICROECONOMICS", "sectionnum": "001", "primary_alias": "ECON-101-001", "path": "/courses/27262/sections/001", "id": "27262-001", "aliases": ["ECON-101-001"]}, "comments": "Introduction to economic analysis and its application.  Theory of supply and demand, costs and revenues of the firm under perfect competition, monopoly and oligopoly, pricing of factors of production, income distribution, and theory of international trade.  ECON001 deals primarily with microeconomics.\r\n\r\nStudents overall showed a slightly negative view toward this class. They commented that the “course needs more structure,” and that it did not really explain concepts clearly. Other comments included that the “course is taught in an abstract way” and “is pretty fast-paced and challenging.” One student stated that the “readings had no correlation with the lectures.”\r\n\r\nA majority of students thought that Professor Mylovanov's teaching could be improved, because it was his first semester teaching the course. He also had an “extremely heavy accent” and “wasted a lot of precious class time on tangents.” However, he “really cares about the students” and “is extremely accessible and approachable.”\r\n\r\nStudents expressed that “the concepts taught in the course are not, in and of themselves, difficult. However, the way they were taught made them seem much more confusing and daunting.” They also stated that the accompanied readings usually were not correlated well with the course material. There are no prerequisites for this course. This course fulfills the Society sector.", "num_students": 106, "path": "/courses/27262/sections/001/reviews/5339-TYMOKIY-MYLOVANOV", "instructor": {"path": "/instructors/5339-TYMOKIY-MYLOVANOV", "first_name": "TYMOKIY", "last_name": "MYLOVANOV", "id": "5339-TYMOKIY-MYLOVANOV", "name": "TYMOKIY MYLOVANOV"}, "num_reviewers": 102, "id": "27262-001-5339-TYMOKIY-MYLOVANOV"}]}, "credits": null, "primary_alias": "ECON-101", "path": "/courses/27262", "sections": {"path": "/courses/27262/sections", "values": [{"name": "INTERMED MICROECONOMICS", "sectionnum": "001", "primary_alias": "ECON-101-001", "path": "/courses/27262/sections/001", "id": "27262-001", "aliases": ["ECON-101-001"]}]}, "id": 27262, "aliases": ["ECON-101"]}