{"coursehistories": {"path": "/coursehistories/1434"}, "description": "What is a mind? What is special about human minds? We'll tackle this question by contrasting human minds with both the operations of computers and the cognitive activities of other animals; and by contrasting theoretical speculation with empirical investigation. Could a computer ever hold a real conversation, or experience what it's like to see red? If not, why are we so different? Can the boundaries of our minds extend beyond our skulls, to include computer interfaces? We'll also ask whether any other animals have mental states like beliefs or desires. If not, how should we understand what goes on in their heads? \n\n", "semester": "2009C", "name": "PHILOSOPHY OF MIND", "reviews": {"path": "/courses/17901/reviews", "values": [{"ratings": {"rAmountLearned": "3.31", "rDifficulty": "2.81", "rStimulateInterest": "3.50", "rRecommendMajor": "3.88", "rCourseQuality": "3.29", "rWorkRequired": "2.42", "rInstructorAccess": "3.31", "rReadingsValue": "3.35", "rRecommendNonMajor": "3.12", "rCommAbility": "3.65", "rInstructorQuality": "3.68"}, "section": {"name": "PHILOSOPHY OF MIND", "sectionnum": "401", "primary_alias": "PHIL-244-401", "path": "/courses/17901/sections/401", "id": "17901-401", "aliases": ["PHIL-244-401", "VLST-244-401", "PPE-244-401"]}, "comments": "This course investigates the nature of the human mind from a philosophical perspective by contrasting human minds with computers and other animals. The class explores questions such as: What is required for something to count as a thinker? What is the best model for understanding the representational contents and processes of thought? Do all minds have conscious experiences? Where are minds located: in the brain, the body, or extended into the world? Readings are drawn from philosophy, cognitive science, and empirical psychology.\r\nStudents agreed that this was a well-taught and interesting course with a lot of “stimulating discussion.” Content included “complex arguments” and “rather dense material,” making it very “conceptually difficult.” However, the “sensible” course structure and stellar instruction helped break the surface of tough readings. Recitations and discussion board assignments help to keep students keep up with and understand the readings. In sum, “the course was excellent in every regard.”&#8232;&#8232;\r\nStudents commented that Professor Camp is a “fantastic lecturer” whose “entertaining and engaging lecture style” was enjoyed by all. She succeeded in making the course’s daunting material easy and “a lot of fun to learn,” often using examples to help clarify the difficult readings. Through her “energy and obvious enthusiasm,” Professor Camp made each lecture “interesting and accessible.” She was also available during office hours to further discuss course material.&#8232;\r\n&#8232;Although the readings were tough, they were compensated for by the helpful, clear instruction. This would be an excellent course for anyone interested in the “workings of the mind” and in the fine line “between humanity and the rest of the world.”\r\n", "num_students": 36, "path": "/courses/17901/sections/401/reviews/3459-ELISABETH-MAURA-CAMP", "instructor": {"path": "/instructors/3459-ELISABETH-MAURA-CAMP", "first_name": "ELISABETH MAURA", "last_name": "CAMP", "id": "3459-ELISABETH-MAURA-CAMP", "name": "ELISABETH MAURA CAMP"}, "num_reviewers": 29, "id": "17901-401-3459-ELISABETH-MAURA-CAMP"}]}, "credits": null, "primary_alias": "PHIL-244", "path": "/courses/17901", "sections": {"path": "/courses/17901/sections", "values": [{"name": "PHILOSOPHY OF MIND", "sectionnum": "401", "primary_alias": "PHIL-244-401", "path": "/courses/17901/sections/401", "id": "17901-401", "aliases": ["PHIL-244-401", "VLST-244-401", "PPE-244-401"]}]}, "id": 17901, "aliases": ["PHIL-244", "VLST-244", "PPE-244"]}