{"coursehistories": {"path": "/coursehistories/3290"}, "description": "Provides an overview of the ethical and professional responsibilities of engineers, as engineerng professionals, as members of engineering organizations, and as participants in medical or scientific research. The course will make extensive use of student group presentations and role playing in the analysis of cases based on real-world problems with ethical dimensions. The case studies will vary from year to year, but will be chosen to reflect the full range of engineering fields and disciplines including areas of Bioengineering and Biomedical research. \n\n", "semester": "2010C", "name": "ETH/SOC/PRO RES FOR ENG", "reviews": {"path": "/courses/22683/reviews", "values": [{"ratings": {"rAmountLearned": "1.40", "rDifficulty": "2.09", "rStimulateInterest": "1.53", "rRecommendMajor": "1.69", "rCourseQuality": "1.43", "rWorkRequired": "3.40", "rInstructorAccess": "2.42", "rReadingsValue": "1.47", "rRecommendNonMajor": "0.71", "rCommAbility": "1.98", "rInstructorQuality": "1.92"}, "section": {"name": "ETH/SOC/PRO RES FOR ENG", "sectionnum": "401", "primary_alias": "BE-303-401", "path": "/courses/22683/sections/401", "id": "22683-401", "aliases": ["BE-303-401", "EAS-303-401"]}, "comments": "BE 303 provides an overview of the ethical and professional responsibilities of engineers, as engineering professionals, as members of engineering organizations, and as participants in medical or scientific research. The course makes extensive use of student group presentations and role-playing in the analysis of cases based on real-world problems with ethical dimensions. The case studies used vary year-to-year based on current relevance. \r\n\r\nMany students found this class to be disorganized and “very repetitive at times.” Most found that the case studies were too specific and did not cover bioethical subjects as widely as they could. Most students did not appreciate the workload for this course, stating, “there were simply too many assignments” that “quickly drain student interest.” Several students described the work as “busywork.” Some students found the class to be “pointless” and asked that the course be “restructured” because “it needs a lot of work.” \r\n\r\nMany students said that Professor Foster “does not make the course interesting or enjoyable.” They agreed that the professor is a “kind” and “friendly” but “not a great professor.” A majority of students found the course to be structured around Professor Foster’s work with the course material “based on projects he was involved in.” They did not appreciate the emphasis put on one particular subject, with one student stating, “we never had time to talk about [various subjects] because of his obsession with this one topic.” \r\n\r\nSeveral students felt that this subject could be incorporated into other bioengineering classes. The course is required for bioengineering majors, but would not be recommended for non-majors.\r\n", "num_students": 60, "path": "/courses/22683/sections/401/reviews/166-KENNETH-R-FOSTER", "instructor": {"path": "/instructors/166-KENNETH-R-FOSTER", "first_name": "KENNETH R", "last_name": "FOSTER", "id": "166-KENNETH-R-FOSTER", "name": "KENNETH R FOSTER"}, "num_reviewers": 52, "id": "22683-401-166-KENNETH-R-FOSTER"}]}, "credits": null, "primary_alias": "BE-303", "path": "/courses/22683", "sections": {"path": "/courses/22683/sections", "values": [{"name": "ETH/SOC/PRO RES FOR ENG", "sectionnum": "401", "primary_alias": "BE-303-401", "path": "/courses/22683/sections/401", "id": "22683-401", "aliases": ["BE-303-401", "EAS-303-401"]}]}, "id": 22683, "aliases": ["BE-303", "EAS-303"]}