{"coursehistories": {"path": "/coursehistories/950"}, "description": "This courseprovides an introduction to the psychology of personality and individual differences. Many psychology courses focus on the mind or brain; in contrast to those approaches of studying people in general, the focus in this course is on the question \"How are people different from each other?\" It will highlight research that take a multidimensional approach to individual differences and attempts to integrate across the biological, cognitive-experimental, and social-cultural influences on personality. A recitation will be required, you willhave a choice of times, announced on first day of class. \n\n", "semester": "2010C", "name": "PERSONALITY", "reviews": {"path": "/courses/23702/reviews", "values": [{"ratings": {"rAmountLearned": "2.28", "rDifficulty": "2.68", "rStimulateInterest": "2.00", "rRecommendMajor": "2.85", "rCourseQuality": "2.05", "rWorkRequired": "2.15", "rInstructorAccess": "2.72", "rReadingsValue": "2.42", "rRecommendNonMajor": "1.82", "rCommAbility": "2.18", "rInstructorQuality": "2.16"}, "section": {"name": "PERSONALITY", "sectionnum": "001", "primary_alias": "PSYC-160-001", "path": "/courses/23702/sections/001", "id": "23702-001", "aliases": ["PSYC-160-001"]}, "comments": "This course provides an introduction to the psychology of personality and individual differences. The class primarily focuses on the question: “How are people different from each other?” It highlights research that take a multidimensional approach to individual differences and attempts to integrate across the biological, cognitive-experimental, and social-cultural influences on personality.\r\n\r\nOverall, students described this class as “excellent” and “interesting.” Several found that they would have benefited from more information on the individual lecture slides, but in general, the lectures were organized and informative.\r\n\r\nStudents called Professor Kable a “stimulating lecturer.” One in particular liked that he was “good at keeping students engaged.” Another student noted his “encouragement of class participation.” Many appreciated how straightforward Professor Kable was with the requirements of the course.\r\n\r\nMost students who took this course were doing it for their major or minor. One in particular said that he would not recommend it to a non-major. The course is challenging; and one student remarked that it was too hard for a 100-level course.\r\n\r\n", "num_students": 87, "path": "/courses/23702/sections/001/reviews/4548-JOSEPH-W--KABLE", "instructor": {"path": "/instructors/4548-JOSEPH-W--KABLE", "first_name": "JOSEPH W.", "last_name": "KABLE", "id": "4548-JOSEPH-W--KABLE", "name": "JOSEPH W. KABLE"}, "num_reviewers": 83, "id": "23702-001-4548-JOSEPH-W--KABLE"}]}, "credits": null, "primary_alias": "PSYC-160", "path": "/courses/23702", "sections": {"path": "/courses/23702/sections", "values": [{"name": "PERSONALITY", "sectionnum": "001", "primary_alias": "PSYC-160-001", "path": "/courses/23702/sections/001", "id": "23702-001", "aliases": ["PSYC-160-001"]}]}, "id": 23702, "aliases": ["PSYC-160"]}