{"coursehistories": {"path": "/coursehistories/1545"}, "description": "The Greeks enjoy a special place in the construction of western culture and identity, and yet many of us have only the vaguest notion of what their culture was like. A few Greek myths at bedtime when we are kids, maybe a Greek tragedy like Sophokles' Oidipous when we are at school: these are often the only contact we have with the world of the ancient Mediterranean. The story of the Greeks, however, deserves a wider audience, because so much of what we esteem in our own culture derives from them: democracy, epic poetry, lyric poetry, tragedy, history writing, philosophy, aesthetic taste, all of these and many other features of cultural life enter the West from Greece. The oracle of Apollo at Delphi had inscribed over the temple, \"Know Thyself.\" For us, that also means knowing the Greeks. We will cover the period from the Late Bronze Age, c. 1500 BC, down to the time of Philip of Macedon, c. 350 BC, concentrating on the two hundred year interval from 600-400 BC. \n\n", "semester": "2010C", "name": "ANCIENT GREECE", "reviews": {"path": "/courses/22600/reviews", "values": [{"ratings": {"rAmountLearned": "2.99", "rDifficulty": "2.78", "rStimulateInterest": "3.77", "rRecommendMajor": "3.66", "rCourseQuality": "3.18", "rWorkRequired": "2.98", "rInstructorAccess": "2.80", "rReadingsValue": "2.83", "rRecommendNonMajor": "3.08", "rCommAbility": "3.62", "rInstructorQuality": "3.69"}, "section": {"name": "ANCIENT GREECE", "sectionnum": "401", "primary_alias": "ANCH-026-401", "path": "/courses/22600/sections/401", "id": "22600-401", "aliases": ["ANCH-026-401", "HIST-026-401"]}, "comments": "The Greeks enjoy a special place in the construction of western culture and identity, and yet many of us have only the vaguest notion of what their culture was like. A few Greek myths at bedtime when we are kids, maybe a Greek tragedy like Sophocles' Oedipus when we are at school: these are often the only contact we have with the world of the ancient Mediterranean. The story of the Greeks, however, deserves a wider audience, because so much of what we esteem in our own culture derives from them: democracy, epic poetry, lyric poetry, tragedy, history writing, philosophy, aesthetic taste, all of these and many other features of cultural life enter the West from Greece. The oracle of Apollo at Delphi had inscribed over the temple, \"Know Thyself.\" For this course, that also means knowing the Greeks. The course will cover the period from the Late Bronze Age, c. 1500 BC, down to the time of Philip of Macedon, c. 350 BC, concentrating on the two hundred year interval from 600-400 BC.\r\n\r\nMost of the students who took this course commented that it was very interesting and engaging. One student also commented that this was a “great class,” and another that is was “highly enjoyable.” One student also said that the course was entertaining. \r\n\r\nThe majority of the students who commented on the course found Professor McInerney to be knowledgeable and a great lecturer. A couple of students also mentioned that Professor McInerney was an “out-standing teacher” and an “entertaining lecturer.” One student also described Professor McInerney was “enthusiastic and easy to follow,” while another said he was “both intelligent and inspiring.”\r\n\r\nA couple of students mentioned that there was heavy workload. One commented that “the readings are long and extensive,” while another said that there was “good amount of busy work too.” Several students also mentioned that the grading was difficult, and a few students added that the open-ended paper and the midterm were difficult. One student commented that the power points were “not very helpful and sometimes contain outdated information,” though another said that they found the posting of outlines on Blackboard to be helpful. Students were divided on the appropriateness of the material for an introductory course. A couple of students felt that they would recommend this as an introductory course, while several said that the course was too hard for an introductory class, with one student commenting that the course “assumes prior subject matter knowledge, and makes no effort to help out.”\r\n", "num_students": 183, "path": "/courses/22600/sections/401/reviews/84-JEREMY-MCINERNEY", "instructor": {"path": "/instructors/84-JEREMY-MCINERNEY", "first_name": "JEREMY", "last_name": "MCINERNEY", "id": "84-JEREMY-MCINERNEY", "name": "JEREMY MCINERNEY"}, "num_reviewers": 173, "id": "22600-401-84-JEREMY-MCINERNEY"}]}, "credits": null, "primary_alias": "ANCH-026", "path": "/courses/22600", "sections": {"path": "/courses/22600/sections", "values": [{"name": "ANCIENT GREECE", "sectionnum": "401", "primary_alias": "ANCH-026-401", "path": "/courses/22600/sections/401", "id": "22600-401", "aliases": ["ANCH-026-401", "HIST-026-401"]}]}, "id": 22600, "aliases": ["ANCH-026", "HIST-026"]}