[{"ratings": {"rAmountLearned": "2.95", "rDifficulty": "1.55", "rStimulateInterest": "3.68", "rRecommendMajor": "3.82", "rCourseQuality": "3.33", "rWorkRequired": "1.64", "rInstructorAccess": "1.48", "rReadingsValue": "2.32", "rRecommendNonMajor": "2.91", "rCommAbility": "3.52", "rInstructorQuality": "3.42"}, "section": {"name": "CONTMP POL,POLICY,JOURN", "sectionnum": "301", "primary_alias": "COMM-323-301", "path": "/courses/27210/sections/301", "id": "27210-301", "aliases": ["COMM-323-301"]}, "comments": "Communications 323 focuses on the modern media and their impact on government and politics. This course primarily covers the post-Watergate/post-Vietnam era of journalism, the past quarter century. Each week focuses on specific topics and areas of post-Watergate journalism, as well as current press coverage of national events over the prior week. This course gives students the opportunity to interact and discuss the intersection of the press, politics, and public policy with some of the leading practitioners in the field.\r\n\tStudents enjoyed this class, which was praised for the “amazing array” of guest speakers as well as the “change from the more theory based courses offered at Annenberg.” However, the final paper was criticized, as students felt that it was not discussed in class until the deadline had begun to “loom large.” Students also praised the “fantastic” class discussions.  \r\n\tProfessor Hunt was lauded being “caring and funny” as well as “incredibly engaging.” Students were unanimous in praise of him in general, but many complained about the final paper, which they felt he handled by “continuously putting off” in class until it was too late to ignore. Professor Hunt was also praised for his stories and wide experience in Washington.\r\n\tThis course was mentioned by many commentators as their favorite at Penn; one senior felt so “fortunate” to have taken the class. Guest speakers were noted as particularly “amazing” and the class as a whole was lauded.", "num_students": 26, "path": "/courses/27210/sections/301/reviews/295-ALBERT-HUNT", "instructor": {"path": "/instructors/295-ALBERT-HUNT", "first_name": "ALBERT", "last_name": "HUNT", "id": "295-ALBERT-HUNT", "name": "ALBERT HUNT"}, "num_reviewers": 24, "id": "27210-301-295-ALBERT-HUNT"}]