{"coursehistories": {"path": "/coursehistories/3830"}, "description": "Physical properties; fluid statics; Bernoulli equation; fluid kinematics; conservation laws and finite control-volume analysis; conservation laws and differential analysis; inviscid flow; The Navier-Stokes equation and some exact solutions; similitude, dimensional analysis, and modeling; flow in pipes and channels; boundary layer theory; lift and drag. \n\n", "semester": "2010C", "name": "FLUID MECHANICS", "reviews": {"path": "/courses/22750/reviews", "values": [{"ratings": {"rAmountLearned": "3.40", "rDifficulty": "3.17", "rStimulateInterest": "3.38", "rRecommendMajor": "3.86", "rCourseQuality": "3.38", "rWorkRequired": "3.24", "rInstructorAccess": "3.56", "rReadingsValue": "2.76", "rRecommendNonMajor": "1.71", "rCommAbility": "3.54", "rInstructorQuality": "3.51"}, "section": {"name": "FLUID MECHANICS", "sectionnum": "001", "primary_alias": "CBE-350-001", "path": "/courses/22750/sections/001", "id": "22750-001", "aliases": ["CBE-350-001"]}, "comments": "This course covers a range of topics related to fluid mechanics, including physical properties; fluid statics and kinematics; the Bernoulli equation; conservation laws and differential analysis; the Navier-Stokes equation; flow in pipes and channels; boundary layer theory; and lift and drag.\r\n\r\nStudents generally found the material to be challenging, yet useful. One student noted that “the first half of the course was excellent, but the second half seemed to jump from topic to topic a little too quickly.”\r\n\r\nProfessor Holleran received many positive comments. Many of the students who took this course had Professor Holleran for other CBE courses and said that he “seems to keep getting better.” He was praised as an “excellent professor” who taught students how to think about and use the material, making it “intuitive through in class examples, derivations and explanation.” Another student complimented his “logical teaching style that works well with the minds of engineers,” as well as his ability to make coming to class worthwhile.\r\n\r\nSome students found the exams to be too long, but the fair grading policy was universally praised. This course is a requirement for CBE majors and is typically taken by juniors. CBE 231 is a prerequisite.\r\n", "num_students": 51, "path": "/courses/22750/sections/001/reviews/3908-SEAN-HOLLERAN", "instructor": {"path": "/instructors/3908-SEAN-HOLLERAN", "first_name": "SEAN", "last_name": "HOLLERAN", "id": "3908-SEAN-HOLLERAN", "name": "SEAN HOLLERAN"}, "num_reviewers": 47, "id": "22750-001-3908-SEAN-HOLLERAN"}]}, "credits": null, "primary_alias": "CBE-350", "path": "/courses/22750", "sections": {"path": "/courses/22750/sections", "values": [{"name": "FLUID MECHANICS", "sectionnum": "001", "primary_alias": "CBE-350-001", "path": "/courses/22750/sections/001", "id": "22750-001", "aliases": ["CBE-350-001"]}]}, "id": 22750, "aliases": ["CBE-350"]}