{"coursehistories": {"path": "/coursehistories/2428"}, "description": "Culture as lifestyle, therefore as the immediately visible aspect of social class, as well as the status groups that may cut across class. Examines micro-sociological evidence (including photos and other images; and literary and other textual sources) of how class and status are performed in everyday life. Goffmanian and subsequent theory of interaction rituals applied across long-term historical changes, and their causes. Topics include Norbert Elias's theory of civilizing process; stratification in patrimonial/aristocratic societies; the modern shift to bureaucracy plus private households; the effects of democratization, social movements, wars, revolutions, and status leveling; informalization and antinomian counter-cultures; youth cultures and cults of mass entertainment. Concluding with what electronic communications are doing to the future of class cultures and self-presentation. \n\n", "semester": "2012A", "name": "SOC OF CULTURE: Class Culture & Historical Change", "reviews": {"path": "/courses/28162/reviews", "values": [{"ratings": {"rAmountLearned": "3.19", "rDifficulty": "2.48", "rStimulateInterest": "3.00", "rRecommendMajor": "3.19", "rCourseQuality": "3.08", "rWorkRequired": "2.52", "rInstructorAccess": "3.57", "rReadingsValue": "3.25", "rRecommendNonMajor": "3.33", "rCommAbility": "3.43", "rInstructorQuality": "3.29"}, "section": {"name": "SOC OF CULTURE: Class Culture & Historical Change", "sectionnum": "301", "primary_alias": "SOCI-561-301", "path": "/courses/28162/sections/301", "id": "28162-301", "aliases": ["SOCI-561-301"]}, "comments": "This class examines the ideas of social classes as well as status groups in everyday life. Goffmanian and other theories of interactions applications are also examined in this course. Topics like stratification in patrimonial and aristocratic societies as well as the effects of democratization are also investigated.\r\nThe majority of the students in this class felt that the material covered was very “interesting.” Overall, the students felt that the content was very “fascinating.”\r\nThe students generally had a very positive review of Professor Collins’ teaching style.  They applauded his “clever teaching methods” and the interaction that occurred. However, some had hoped that there was more time for “in class discussion.”  Additionally, a few students were disappointed that the “course readings were barely addressed in class.” \r\nThe majority of the students in the class were upperclassman but this class would be suited for anyone interested in sociology.  It is suitable for both major and non-major students. ", "num_students": 24, "path": "/courses/28162/sections/301/reviews/1100-RANDALL-COLLINS", "instructor": {"path": "/instructors/1100-RANDALL-COLLINS", "first_name": "RANDALL", "last_name": "COLLINS", "id": "1100-RANDALL-COLLINS", "name": "RANDALL COLLINS"}, "num_reviewers": 24, "id": "28162-301-1100-RANDALL-COLLINS"}]}, "credits": null, "primary_alias": "SOCI-561", "path": "/courses/28162", "sections": {"path": "/courses/28162/sections", "values": [{"name": "SOC OF CULTURE: Class Culture & Historical Change", "sectionnum": "301", "primary_alias": "SOCI-561-301", "path": "/courses/28162/sections/301", "id": "28162-301", "aliases": ["SOCI-561-301"]}]}, "id": 28162, "aliases": ["SOCI-561"]}