[{"ratings": {"rAmountLearned": "2.93", "rDifficulty": "2.63", "rStimulateInterest": "3.38", "rRecommendMajor": "3.33", "rCourseQuality": "2.94", "rWorkRequired": "2.65", "rInstructorAccess": "2.87", "rReadingsValue": "2.78", "rRecommendNonMajor": "2.58", "rCommAbility": "3.46", "rInstructorQuality": "3.27"}, "section": {"name": "EUROPE IN A WIDER WORLD", "sectionnum": "001", "primary_alias": "HIST-002-001", "path": "/courses/21839/sections/001", "id": "21839-001", "aliases": ["HIST-002-001"]}, "comments": "This course is an examination of European social, economic, political and cultural development from 1500 to the present, with attention to Europe’s impact on the rest of the world. Readings included Diderot, Nietzsche and Montaigne, among others. &#8232;&#8232;&#8232;In general, students “enjoyed” this course, which they described as “interesting,” “well structured,” and “very good.” Students reported that the course remained “stimulating” despite being “extremely factually based” and covering a “tremendous amount” of material. It was able to cover an expansive historical time period yet still be “brilliantly detailed.”&#8232;&#8232;&#8232;Most students really enjoyed Professor Safley’s teaching style, and several students described him as an “excellent lecturer and teacher.” Students found Professor Safley to be “passionate” about the subject and a “gifted” communicator of the material. Students commended him for being able to communicate a vast amount of subject matter and still “make [students] feel that [they] are getting the details” and make it “comprehensible to the students.” Professor Safley’s lectures were described as “organized” and “well thought out.” It was clear to students that he cared about and enjoyed teaching them, and he was described as “approachable.” One student noted that it was frustrating that Professor Safley was not personally responsible for any of the grading, so it was difficult to approach him with questions about how to improve one’s grade in the course.&#8232;&#8232;&#8232;Students’ chief complaint about this course was the excessive amount of assigned weekly reading, with students often expected to read an entire book over the course of one week. Students often felt like they had to “cram” complex books, which they felt led to mere “scratch-the-surface” recitation discussions afterwards and made it difficult to retain the books’ content. One student mentioned that tests asked students to “regurgitate facts instead of analyzing events” and a couple of students reported that grading seemed “arbitrary.” Participation in class is factored into students’ grades, and a student who does not participate receives the same grade as a student who is absent. This course fulfills the History & Tradition sector requirement.", "num_students": 57, "path": "/courses/21839/sections/001/reviews/612-THOMAS-M--SAFLEY", "instructor": {"path": "/instructors/612-THOMAS-M--SAFLEY", "first_name": "THOMAS M.", "last_name": "SAFLEY", "id": "612-THOMAS-M--SAFLEY", "name": "THOMAS M. SAFLEY"}, "num_reviewers": 51, "id": "21839-001-612-THOMAS-M--SAFLEY"}]