[{"ratings": {"rAmountLearned": "1.97", "rDifficulty": "2.21", "rStimulateInterest": "1.62", "rRecommendMajor": "2.00", "rCourseQuality": "1.84", "rWorkRequired": "2.41", "rInstructorAccess": "2.50", "rReadingsValue": "2.18", "rRecommendNonMajor": "1.12", "rCommAbility": "2.00", "rInstructorQuality": "2.14"}, "section": {"name": "EMBEDDED SOFTWARE", "sectionnum": "401", "primary_alias": "CIS-441-401", "path": "/courses/24175/sections/401", "id": "24175-401", "aliases": ["CIS-441-401", "CIS-541-401"]}, "comments": "CIS 441 focuses on cyber physical systems with emphasis on real-time issues.\r\nCyber physical systems are integrations of computation and communication with physical\r\nprocesses. Embedded computers monitor and control physical processes in real- time. As\r\nthese embedded computers transform from word processors to global communications\r\ndevices for information gathering and sharing, embedded computers will change from\r\nsmall self-contained systems to cyber-physical systems. The course focuses on the\r\nprinciples, methods, and techniques for building high-assurance cyber-physical systems.\r\nTopics include requirements capture and modeling, mental models, assurance cases,\r\nhazard analysis, real-time programming and communication, real-time scheduling and\r\nvirtual machines, feedback control in computer systems, verification and valid series of\r\nprojects that implement safety-critical embedded systems (e.g., pacemaker, infusion\r\npump).\r\nStudents for the most part felt that they could have learned more from this course.\r\nWhile some of the topics were interesting, others were not as engaging and could have\r\nbeen restructured to be more informative and more in-depth. However, students did enjoy\r\nthe projects in the course.\r\nAt certain times throughout the course, students felt that Professor Lee could have\r\ndone a better job explaining the concepts during lecture.\r\nThis course was described to have “the right amount” of work. The major projects\r\nof the course, though rewarding, required a lot of time and were challenging to complete.\r\nThe only prerequisite for this class is CIS 240 or an equivalent course. The completion of\r\nESE 350 is also recommended.", "num_students": 38, "path": "/courses/24175/sections/401/reviews/1821-INSUP-LEE", "instructor": {"path": "/instructors/1821-INSUP-LEE", "first_name": "INSUP", "last_name": "LEE", "id": "1821-INSUP-LEE", "name": "INSUP LEE"}, "num_reviewers": 37, "id": "24175-401-1821-INSUP-LEE"}]