{"coursehistories": {"path": "/coursehistories/4540"}, "description": "Advanced individualized study in Greek for students enrolled in the Post-Baccalaureate Program in Classical Studies. Permission of the instructor required. \n\n", "semester": "2010C", "name": "POST BACC INDIVID: GREEK", "reviews": {"path": "/courses/22860/reviews", "values": [{"ratings": {"rAmountLearned": "2.86", "rDifficulty": "3.05", "rStimulateInterest": "2.86", "rRecommendMajor": "3.43", "rCourseQuality": "2.68", "rWorkRequired": "3.23", "rInstructorAccess": "3.18", "rReadingsValue": "3.09", "rRecommendNonMajor": "0.90", "rCommAbility": "2.82", "rInstructorQuality": "2.91"}, "section": {"name": "POST BACC INDIVID: GREEK", "sectionnum": "601", "primary_alias": "CLST-402-601", "path": "/courses/22860/sections/601", "id": "22860-601", "aliases": ["CLST-402-601"]}, "comments": "This is an Intensive Greek reading course for students in the Post Baccalaureate Program in Classical Studies. This course gives students experience reading a lot of Greek at a quick tempo, and in addition the course clarifies and reviews grammatical concepts. Readings include the major Homeric hymns and four Callimachean hymns; some of the questions that arise from the readings include the contexts for which they were composed, the literary and religious relationship of humans and gods, mythopoetics, and the differences in dialect and language between the works. Permission of the instructor is required to enter the course.&#8232;&#8232;\r\n\r\nSome students felt that this classed greatly helped them in their Greek education, saying that their understanding of Greek was “undoubtedly strengthened” and that their knowledge of the subject “has increased two-fold.” Though, other students felt that the class was too “focused on volume of reading rather than depth.” &#8232;&#8232;\r\n\r\nStudents enjoyed Professor Nishimura-Jensen, calling her “very willing to help students, always enthusiastic, and very knowledgeable.” Students also commended Professor Nishimura-Jensen for her helpfulness when answering questions.&#8232;&#8232;\r\n\r\nStudents found the material of the course “interesting” and “challenging.” Student enjoyed the readings, especially the hymns, but some thought too much discussion of the content detracted from learning grammatical concepts. Other students wished for more translation and grammatical exercises. One student noted that he thought the class was too large; he would “only translate once every two or three classes” where “students ought to translate every class period in order to force them to study each night with equal alacrity.” Students also expressed concern that Professor Nishimura-Jensen “does not demand [grammatical] accuracy during class readings but is then extremely picky on exams.”\r\n", "num_students": 26, "path": "/courses/22860/sections/601/reviews/1473-JULIE-NISHIMURA-JENSEN", "instructor": {"path": "/instructors/1473-JULIE-NISHIMURA-JENSEN", "first_name": "JULIE", "last_name": "NISHIMURA-JENSEN", "id": "1473-JULIE-NISHIMURA-JENSEN", "name": "JULIE NISHIMURA-JENSEN"}, "num_reviewers": 24, "id": "22860-601-1473-JULIE-NISHIMURA-JENSEN"}]}, "credits": null, "primary_alias": "CLST-402", "path": "/courses/22860", "sections": {"path": "/courses/22860/sections", "values": [{"name": "POST BACC INDIVID: GREEK", "sectionnum": "601", "primary_alias": "CLST-402-601", "path": "/courses/22860/sections/601", "id": "22860-601", "aliases": ["CLST-402-601"]}]}, "id": 22860, "aliases": ["CLST-402"]}