[{"ratings": {"rAmountLearned": "3.22", "rDifficulty": "2.70", "rStimulateInterest": "3.22", "rRecommendMajor": "3.61", "rCourseQuality": "3.22", "rWorkRequired": "2.78", "rInstructorAccess": "3.65", "rReadingsValue": "3.30", "rRecommendNonMajor": "2.74", "rCommAbility": "3.65", "rInstructorQuality": "3.57"}, "section": {"name": "PHILOSOPHY OF MIND", "sectionnum": "401", "primary_alias": "PHIL-244-401", "path": "/courses/16302/sections/401", "id": "16302-401", "aliases": ["PHIL-244-401", "VLST-244-401", "PPE-244-401"]}, "comments": "This course investigates the nature of the human mind from a philosophical perspective. The course material contrasts mental lives with the cognitive activities of non-human animals and with the operations of computers. Do either animals or computers have beliefs, desires, and experiences? If they do, do they also have the same ethical rights and responsibilities as humans? If they don\\'t, does this cast any doubt on the reality of our own mental lives? Throughout, students will contrast philosophical arguments with empirical findings in psychology, cognitive science, and artificial intelligence.\r\n\r\nStudents enjoyed the course material in the class and found the subject “interesting.” One student wrote that “the readings covered a breadth of subjects while remaining focused. Another student, however, found that there “was little continuity in the curriculum.” Most felt that they had challenged themselves intellectually and improved their reasoning skills.\r\n\r\nStudents found that Professor Horowitz was an “excellent professor.” He was very accessible and willing to speak with students “about questions, paper topics, etc, and he was very adept at explaining tricky concepts so that everyone in the class could understand them.” Another student wrote that he had an ability to “encourage even those students with no background or interest in philosophy.”\r\n\r\nThe difficulty of this course seemed to depend on whether the student has a background in philosophy. One student that had little background in philosophy wrote that “the content is quite difficult.” Another wrote, “I would not recommend the course to anyone without a decent background in philosophy who is willing to step up to the conceptually difficult readings.” The amount of work was moderate and included participation, reading responses, and two papers. This course was strongly recommended to majors and recommended somewhat less strongly to non-majors.", "num_students": 26, "path": "/courses/16302/sections/401/reviews/4524-DAMON-HOROWITZ", "instructor": {"path": "/instructors/4524-DAMON-HOROWITZ", "first_name": "DAMON", "last_name": "HOROWITZ", "id": "4524-DAMON-HOROWITZ", "name": "DAMON HOROWITZ"}, "num_reviewers": 23, "id": "16302-401-4524-DAMON-HOROWITZ"}]