[{"ratings": {"rAmountLearned": "3.03", "rDifficulty": "3.55", "rStimulateInterest": "2.87", "rRecommendMajor": "3.29", "rCourseQuality": "2.86", "rWorkRequired": "3.23", "rInstructorAccess": "2.74", "rReadingsValue": "2.70", "rRecommendNonMajor": "1.58", "rCommAbility": "3.00", "rInstructorQuality": "3.03"}, "section": {"name": "INVESTMENT MANAGEMENT", "sectionnum": "001", "primary_alias": "FNCE-205-001", "path": "/courses/15768/sections/001", "id": "15768-001", "aliases": ["FNCE-205-001"]}, "comments": "FNCE205 is designed to acquaint the student with the concepts of portfolio analysis in the general area of institutional investment management. The course discusses principles for managing financial assets. These principles apply, for example, to managing corporate pension funds, bank-administered trusts, and other institutional funds. Students will learn how to establish appropriate investment objectives, develop optimal portfolio strategies, estimate risk-return tradeoffs, and evaluate investment performance. Many of the latest quantitative approaches are discussed.\r\n\r\nFNCE 205 presents coursework that is highly technical, statistical, and involved. Students should have a firm grounding in mathematics, statistics, and finance before attempting this course. Those who are better qualified or passionate about finance will get more out of this class and likely be more willing to put in the necessary effort to understand the often obscure subject matter.\r\n\r\nProfessor Geczy has been described as highly “passionate” and “enthusiastic.” Some have deemed him the best professor they’ve had at Wharton and were glad to wake up at 9:00AM for his class. Though initially he may come off as intimidating, many found that they increasingly enjoyed Geczy as the class progressed.\r\n\r\nFNCE 205 stresses group work on assignments. Though some may prefer to work in teams, those who have difficulty working with others may have issues. A few noted that the professor is generally unwilling to resolve group conflicts and those who are unable to successfully collaborate may be at a disadvantage. Also, students who joined the class late found it difficult to catch up.", "num_students": 45, "path": "/courses/15768/sections/001/reviews/516-CHRISTOPHER-C--GECZY", "instructor": {"path": "/instructors/516-CHRISTOPHER-C--GECZY", "first_name": "CHRISTOPHER C.", "last_name": "GECZY", "id": "516-CHRISTOPHER-C--GECZY", "name": "CHRISTOPHER C. GECZY"}, "num_reviewers": 43, "id": "15768-001-516-CHRISTOPHER-C--GECZY"}]