{"coursehistories": {"path": "/coursehistories/5227"}, "description": "This freshman seminar on medical decision-making will focus on personal and public medical and health decisions - how we make them and how they can be improved. While in theory medical decisions are in large part both informed and constrained by scientific evidence, in reality they are much more complex. Drawing upon a range of information sources including textbooks, original research and popular media, the seminar will introduce students to the challenges of making personal and public (i.e., policy) decisions under conditions of inherent uncertainty and resources constraints and how research and scholarship can inform and improve decision making processes and decisions. Using a variety of highly engaging approaches (in-class discussions, examination of primary research, popular media, simple experiments, expert panel debates) this highly interactive seminar will provide students a strong introductory foundation to medical decision making specifically and, by extension to decision making under conditions of uncertainty more generally. The seminar will take a multi-disciplinary perspective, drawing upon knowledge developed from psychology, scoiology, economics, insurance and risk management, statistical inference, neuroscience, operations research, communications, law, ethics and political science. \n\n", "semester": "2012C", "name": "RISKY BUSINESS", "reviews": {"path": "/courses/29107/reviews", "values": [{"ratings": {"rDifficulty": "1.37", "rStimulateInterest": "3.47", "rCourseQuality": "3.05", "rWorkRequired": "1.37", "rInstructorQuality": "3.60", "rCommAbility": "3.28", "rInstructorAccess": "3.74"}, "section": {"name": "RISKY BUSINESS", "sectionnum": "301", "primary_alias": "HSOC-032-301", "path": "/courses/29107/sections/301", "id": "29107-301", "aliases": ["HSOC-032-301"]}, "comments": "", "num_students": 22, "path": "/courses/29107/sections/301/reviews/5764-J-SANFORD-SCHWARTZ", "instructor": {"path": "/instructors/5764-J-SANFORD-SCHWARTZ", "first_name": "J SANFORD", "last_name": "SCHWARTZ", "id": "5764-J-SANFORD-SCHWARTZ", "name": "J SANFORD SCHWARTZ"}, "num_reviewers": 20, "id": "29107-301-5764-J-SANFORD-SCHWARTZ"}]}, "credits": null, "primary_alias": "HSOC-032", "path": "/courses/29107", "sections": {"path": "/courses/29107/sections", "values": [{"name": "RISKY BUSINESS", "sectionnum": "301", "primary_alias": "HSOC-032-301", "path": "/courses/29107/sections/301", "id": "29107-301", "aliases": ["HSOC-032-301"]}]}, "id": 29107, "aliases": ["HSOC-032"]}