{"coursehistories": {"path": "/coursehistories/576"}, "description": "This course will survey the major political, economic, social and intellectual trends in the making of modern Japan. Special emphasis will be given to the turbulent relationship between state and society from 1800 to the present. \n\n", "semester": "2011A", "name": "MODERN JAPANESE HIST", "reviews": {"path": "/courses/21848/reviews", "values": [{"ratings": {"rAmountLearned": "3.05", "rDifficulty": "2.26", "rStimulateInterest": "3.47", "rRecommendMajor": "3.44", "rCourseQuality": "3.21", "rWorkRequired": "2.53", "rInstructorAccess": "3.42", "rReadingsValue": "2.89", "rRecommendNonMajor": "2.95", "rCommAbility": "3.63", "rInstructorQuality": "3.42"}, "section": {"name": "MODERN JAPANESE HIST", "sectionnum": "401", "primary_alias": "HIST-091-401", "path": "/courses/21848/sections/401", "id": "21848-401", "aliases": ["HIST-091-401", "EALC-071-401"]}, "comments": "This course surveys the dramatic story of transformation from feudal to modern Japan. It has two principal aims: 1) to provide a general narrative of events from 1600 to the present. 2) to introduce students to the most powerful tool of historical analysis: an awareness of the importance of interpretation. Readings include primary and secondary source materials. Students are asked to identify important people and events, and to identify and contemplate different perspectives on the past and present.\r\n\r\nStudents thoroughly enjoyed HIST 91. The course was applauded for “challenging [students] to think beyond the usual assumptions of history.” Overall, students felt that the course greatly “facilitated understanding of Japanese history.” This “awesome” course was elevated primarily by Professor Dickinson’s lectures, though students appreciated the primary source reading selections that were not based solely on the textbook. As students felt that the main text was “not particularly well-written,” the material was made “far less dry” by the inclusion of these primary source materials. \r\n\r\nProfessor Dickinson received high praise for his passion for the subject of Japanese history. “Without his true enthusiasm on the topic,” one student wrote, “I would not have enjoyed the class so much.” Students felt that Professor Dickinson presented the material in “a very interesting and enjoyable manner,” and that his “animated style infused the lectures with an energy that is all too often lacking in history course.” \r\n\r\nThe workload was considered very manageable. Readings came from six different texts. Grades were based on four components: class participation (which included blog posts and class reports), two “thought essays,” a mid-term exam and a take-home final exam. There are no prerequisites to the course.\r\n\r\nThis review is based on the 5 student comments that were submitted.\r\n", "num_students": 36, "path": "/courses/21848/sections/401/reviews/619-FREDERICK-R--DICKINSON", "instructor": {"path": "/instructors/619-FREDERICK-R--DICKINSON", "first_name": "FREDERICK R.", "last_name": "DICKINSON", "id": "619-FREDERICK-R--DICKINSON", "name": "FREDERICK R. DICKINSON"}, "num_reviewers": 26, "id": "21848-401-619-FREDERICK-R--DICKINSON"}]}, "credits": null, "primary_alias": "HIST-091", "path": "/courses/21848", "sections": {"path": "/courses/21848/sections", "values": [{"name": "MODERN JAPANESE HIST", "sectionnum": "401", "primary_alias": "HIST-091-401", "path": "/courses/21848/sections/401", "id": "21848-401", "aliases": ["HIST-091-401", "EALC-071-401"]}]}, "id": 21848, "aliases": ["HIST-091", "EALC-071"]}