{"coursehistories": {"path": "/coursehistories/3485"}, "description": "Socio-Political Philosophy of Education: In this course, we will examine some of the most pressing problems in contemporary philosophy of education. These problems include: how much control over a child's education ought to be allocated to parents and how much to the state; what role, if any, ought religion to play in education; how race and gender impact individuals' educatoinal experiences (and how such issues should be addressed in the classroom); what sort of (if any) civic education ought to be taught in schools (especially in wartime such as in the post 9-11 USA); and how schools should be funded. We will deal with a number of case studies, mostly recent, but some crucial historical cases as well. Our readings will be primarily philosophical texts, supplemented with those from other fields, such as psychology, history and sociology, in oder to provide empirical context to the theoretical problems facing education today. As a seminar, the instructor welcomes student participation, including students bringing their own interests in educational theory to the classroom. At the same time, the instructor will lecture to the extent necessary to make classroom discussion especially rich. \n\n", "semester": "2006C", "name": "SOCIO-POL PHIL OF EDUC", "reviews": {"path": "/courses/9407/reviews", "values": [{"ratings": {"rAmountLearned": "3.70", "rDifficulty": "2.80", "rStimulateInterest": "3.60", "rRecommendMajor": "3.30", "rCourseQuality": "3.56", "rWorkRequired": "2.70", "rInstructorAccess": "3.20", "rReadingsValue": "3.50", "rRecommendNonMajor": "3.50", "rCommAbility": "3.80", "rInstructorQuality": "3.80"}, "section": {"name": "SOCIO-POL PHIL OF EDUC", "sectionnum": "640", "primary_alias": "PHIL-550-640", "path": "/courses/9407/sections/640", "id": "9407-640", "aliases": ["PHIL-550-640"]}, "comments": "Students were unanimous in praising Dr. Detlefsen’s immense knowledge of the subject matter and ability to keep discussions structured and on track.  However, a small minority of evaluators wished the professor had let discussions flow more naturally.  The evaluators felt that the course was logically ordered and well organized, and admired Dr. Detlefsen for her respect of all students’ points of view.\r\n<br>*Note:  More than 75% of students submitted a written evaluation for this class\r\n", "num_students": 11, "path": "/courses/9407/sections/640/reviews/945-KAREN-E--DETLEFSEN", "instructor": {"path": "/instructors/945-KAREN-E--DETLEFSEN", "first_name": "KAREN E.", "last_name": "DETLEFSEN", "id": "945-KAREN-E--DETLEFSEN", "name": "KAREN E. DETLEFSEN"}, "num_reviewers": 10, "id": "9407-640-945-KAREN-E--DETLEFSEN"}]}, "credits": null, "primary_alias": "PHIL-550", "path": "/courses/9407", "sections": {"path": "/courses/9407/sections", "values": [{"name": "SOCIO-POL PHIL OF EDUC", "sectionnum": "640", "primary_alias": "PHIL-550-640", "path": "/courses/9407/sections/640", "id": "9407-640", "aliases": ["PHIL-550-640"]}]}, "id": 9407, "aliases": ["PHIL-550"]}