[{"ratings": {"rAmountLearned": "1.91", "rDifficulty": "1.64", "rStimulateInterest": "1.82", "rRecommendMajor": "2.23", "rCourseQuality": "1.96", "rWorkRequired": "1.57", "rInstructorAccess": "2.68", "rReadingsValue": "2.10", "rRecommendNonMajor": "2.09", "rCommAbility": "1.73", "rInstructorQuality": "1.74"}, "section": {"name": "NEURO BASIS OF AUTISM", "sectionnum": "601", "primary_alias": "BIBB-430-601", "path": "/courses/21339/sections/601", "id": "21339-601", "aliases": ["BIBB-430-601"]}, "comments": "This course covers the signs and symptoms of Autism Spectrum Disorder (ASD), such as the lack of language, eye gaze aberrations, deficits in joint attention, avoidance and inadequacies of social interaction, hand flapping, and self-stimulating behaviors. You will learn about diagnostic tools, such as the ADOS and ADIR. You will cover the neurobiological changes specific to the brains of autistic children such as in the cerebral cortex, white matter, amygdala, brainstem, cerebellum, and neural communication systems. You will also focus on genes associated with autism, many of which regulate neuronal communication systems. They include NRXN1,NLGN3,NLGN4, SHANK3,CNTNAP2,CHD10 BZRAP1 and MDGA2, DLX1and DLX2, fragile X, Tuberous Sclerous 1,Neurexin 1 Tuberous Sclerous2, Rubinstein-Taybi Syndrome, Neurofibromatous 1, and Rett's syndrome. Additionally covered are some of the more popularized issues such as autistic savants, vaccines and mirror neurons. Finally, the class will discuss brain plasticity and treatment choices, such as drugs and early behavioral interventions.\r\n\r\nBy and large, students expressed mixed opinions about the class. Some said it was very involved while others noted the material was not clearly defined and could have been improved.\r\n\r\nStudents commented that the professor read directly off the powerpoints, which were also found to be incoherent. Many students found that she could not communicate her thoughts. \r\n\r\nStudents complained that the grading was inconsistent.\r\n", "num_students": 23, "path": "/courses/21339/sections/601/reviews/5294-SANDRA-L-HOLLOWAY", "instructor": {"path": "/instructors/5294-SANDRA-L-HOLLOWAY", "first_name": "SANDRA L", "last_name": "HOLLOWAY", "id": "5294-SANDRA-L-HOLLOWAY", "name": "SANDRA L HOLLOWAY"}, "num_reviewers": 23, "id": "21339-601-5294-SANDRA-L-HOLLOWAY"}]