{"coursehistories": {"path": "/coursehistories/2772"}, "description": "This course explores constitutional criminal procedure or the law of the Fourth, Fifth, and Sixth Amendments to the United States Constitution. Topics included the laws and rules associated with search and seizure, arrest, interrogation, the exclusionary rule, and deprivation of counsel. Social science evidence that supports or raises questions about legal doctrine will be examined. No prerequisites are required. \n\n", "semester": "2010A", "name": "LAW AND CRIMINAL JUSTICE", "reviews": {"path": "/courses/25852/reviews", "values": [{"ratings": {"rAmountLearned": "2.76", "rDifficulty": "1.61", "rStimulateInterest": "3.20", "rRecommendMajor": "3.54", "rCourseQuality": "3.10", "rWorkRequired": "1.53", "rInstructorAccess": "3.31", "rReadingsValue": "2.58", "rRecommendNonMajor": "3.22", "rCommAbility": "3.27", "rInstructorQuality": "3.49"}, "section": {"name": "LAW AND CRIMINAL JUSTICE", "sectionnum": "301", "primary_alias": "CRIM-300-301", "path": "/courses/25852/sections/301", "id": "25852-301", "aliases": ["CRIM-300-301"]}, "comments": "This course explores constitutional criminal procedure or the law of the Fourth, Fifth, and Sixth Amendments to the United States Constitution. Topics include the laws and rules associated with search and seizure, arrest, interrogation, the exclusionary rule, and deprivation of counsel. Social science evidence that supports or raises questions about legal doctrine will be examined.\r\nMany students felt this was a “great class,” and found it to be “thought provoking and interesting.” They also describe the readings as rather enjoyable. Some noted, however, that the course was not particularly organized, and described it as “too hypothetical.” Students felt that the required field trips set the course apart and added “tremendous value.”\r\nStudents believed professor Laufer was great at maintaining interest throughout, and noted that he “tries to make you think more about the world at large.” A minority noted that Professor Laufer may have presented his own views a bit too much for an introductory course, and a few felt that he was disorganized. Nevertheless, students agreed that he did an “excellent” job.\r\nSeveral students noted that because of some organizational issues, the heavily emphasized group project never came into fruition. Others pointed out that the readings were often posted at the very last minute, leaving students with little time to do them. Still, students appreciated that Professor Laufer “taught for the sake of the material and not for a test.” Students recommend this course to “anyone and everyone,” adding that even someone with no background knowledge would feel comfortable in the class, because Professor Laufer “makes the material very accessible.” ", "num_students": 86, "path": "/courses/25852/sections/301/reviews/1719-WILLIAM-S--LAUFER", "instructor": {"path": "/instructors/1719-WILLIAM-S--LAUFER", "first_name": "WILLIAM S.", "last_name": "LAUFER", "id": "1719-WILLIAM-S--LAUFER", "name": "WILLIAM S. LAUFER"}, "num_reviewers": 80, "id": "25852-301-1719-WILLIAM-S--LAUFER"}]}, "credits": null, "primary_alias": "CRIM-300", "path": "/courses/25852", "sections": {"path": "/courses/25852/sections", "values": [{"name": "LAW AND CRIMINAL JUSTICE", "sectionnum": "301", "primary_alias": "CRIM-300-301", "path": "/courses/25852/sections/301", "id": "25852-301", "aliases": ["CRIM-300-301"]}]}, "id": 25852, "aliases": ["CRIM-300"]}