[{"ratings": {"rAmountLearned": "3.00", "rDifficulty": "2.10", "rStimulateInterest": "2.97", "rRecommendMajor": "3.10", "rCourseQuality": "3.16", "rWorkRequired": "1.76", "rInstructorAccess": "2.88", "rReadingsValue": "2.42", "rRecommendNonMajor": "2.96", "rCommAbility": "3.37", "rInstructorQuality": "3.38"}, "section": {"name": "INT TO NONP & LOGLIN MOD", "sectionnum": "401", "primary_alias": "STAT-501-401", "path": "/courses/28192/sections/401", "id": "28192-401", "aliases": ["STAT-501-401", "PSYC-612-401"]}, "comments": "STAT501 explores business responsibility from rival theoretical and managerial perspectives. Its focus includes theories of ethics and their application to case studies in business. Topics include moral issues in advertising and sales; hiring and promotion; financial management; corporate pollution; product safety; and decision-making across borders and cultures.\r\n\r\n Many students thought that this course is “highly recommended” and that they “learned a lot.” The one problem many students noticed is that the notes are not provided in a “legible manner,” making it difficult to learn in class. Students overall found this course, however, to be lectures to be pretty “straightforward.” \r\n\r\nMost students found that Professor Rosenbaum “does a great job explaining complex concepts using examples” and  “does a very good job of engaging students and making the material more accessible.” Many students liked that Professor Rosenbaum was “accessible,” “witty,” “engaging,” and “in complete command of the material in the classroom” making him a “brilliant professor.” However, some students thought that he demonstrated “poor board work” and that is “writing on the chalk board is too small and sloppy” while he “does not organize the things he writes on the board throughout class.” \r\n\r\nOverall, most students found that the subject matter of this course was “difficult to grasp” and that there was a “mismatch between lectures/tests and the assigned readings” because the readings are much more difficult and involved. Many students found the bulk pack to be a “tremendous help” and the practice exams to be “helpful in learning how to apply the methods” while the “books are not helpful with further explanations.” Some students also did not like that there was “not a lot of feedback outside of the exams.” This course’s prerequisites are STAT 101 or 112 or equivalent. Undergraduates need permission.\r\n", "num_students": 33, "path": "/courses/28192/sections/401/reviews/1164-PAUL-R--ROSENBAUM", "instructor": {"path": "/instructors/1164-PAUL-R--ROSENBAUM", "first_name": "PAUL R.", "last_name": "ROSENBAUM", "id": "1164-PAUL-R--ROSENBAUM", "name": "PAUL R. ROSENBAUM"}, "num_reviewers": 32, "id": "28192-401-1164-PAUL-R--ROSENBAUM"}]