[{"ratings": {"rAmountLearned": "2.17", "rDifficulty": "1.86", "rStimulateInterest": "2.10", "rRecommendMajor": "2.24", "rCourseQuality": "2.15", "rWorkRequired": "2.03", "rInstructorAccess": "2.50", "rReadingsValue": "2.28", "rRecommendNonMajor": "1.41", "rCommAbility": "1.86", "rInstructorQuality": "2.09"}, "section": {"name": "ETH/SOC/PRO RES FOR ENG", "sectionnum": "401", "primary_alias": "BE-303-401", "path": "/courses/15374/sections/401", "id": "15374-401", "aliases": ["BE-303-401", "EAS-303-401"]}, "comments": "The goal of BE 303/EAS 303 is to introduce students to the ethical and professional responsibilities of engineers, and ways to analyze these responsibilities in real-world situations. The course has a broader focus than a traditional “engineering ethics” course, but includes aspects of bioethics and research ethics to address needs of the many students at Penn who are headed for careers in medical research and practice.\r\n\r\nStudents seemed to appreciate the “fruitful discussions” and “insightful readings” offered throughout the course, but were often disappointed by the disorganization of the class. An unsettling observation was that “most discussions end up in the realm of chemical or bioengineering” and this sometimes “handicapped” students studying other disciplines.\r\n\r\nStudents called Dr. Shuster “much too biased in teaching the course,” even claiming that “she tells students regularly that [they are] wrong in ethical debates.” Some students noted that the professor “interrupts every few minutes to inject her thoughts” during class discussions, “clouding” the class’s thoughts. Dr. Shuster was accessible for meeting outside of class, helping students to pursue extracurricular ethics interests and providing articles, advice, and even “contact information for a colleague who could help.”\r\n\r\nStudents found themselves forced to write papers with the teacher’s and TA’s opinions in mind rather than their own in order to maintain decent grades. However, the class was not particularly time-consuming, and there are no prerequisites.", "num_students": 35, "path": "/courses/15374/sections/401/reviews/4251-EVELYNE-SHUSTER", "instructor": {"path": "/instructors/4251-EVELYNE-SHUSTER", "first_name": "EVELYNE", "last_name": "SHUSTER", "id": "4251-EVELYNE-SHUSTER", "name": "EVELYNE SHUSTER"}, "num_reviewers": 35, "id": "15374-401-4251-EVELYNE-SHUSTER"}]