{"coursehistories": {"path": "/coursehistories/925"}, "description": "This course will provide an overview of major figures and themes of modern political thought. We will focus on themes and questions pertinent to political theory in the modern era, particularly focusing on the relationship of the individual to community, society, and state. Although the emergence of the individual as a central moral, political, and conceptual category arguably began in earlier eras, it is in the seventeenth century that it takes firm hold in defining the state, political institutions, moral thinking, and social relations. The centrality of \"the individual\" has created difficulties, even paradoxes, for community and social relations, and political theorists have struggled to reconicle those throughout the modern era. We will consider the political forms that emerged out of those struggles, as well as the changed and distinctly \"modern\" conceptualizations of political theory such as freedom, responsibilty, justice, rights and obligations, as central categories for organizing moral and political life. \n\n", "semester": "2010A", "name": "MODERN POL THOUGHT", "reviews": {"path": "/courses/26658/reviews", "values": [{"ratings": {"rAmountLearned": "2.63", "rDifficulty": "2.66", "rStimulateInterest": "2.52", "rRecommendMajor": "3.03", "rCourseQuality": "2.38", "rWorkRequired": "2.59", "rInstructorAccess": "2.66", "rReadingsValue": "2.99", "rRecommendNonMajor": "2.07", "rCommAbility": "2.50", "rInstructorQuality": "2.66"}, "section": {"name": "MODERN POL THOUGHT", "sectionnum": "401", "primary_alias": "PSCI-181-401", "path": "/courses/26658/sections/401", "id": "26658-401", "aliases": ["PSCI-181-401", "PSCI-681-401"]}, "comments": "This course provides an overview of major figures and themes of modern political thought, particularly focusing on the relationship of the individual to community, society, and state. The course considers the political forms that emerged out of the struggles of this relationship, as well as the changed and distinctly \"modern\" conceptualizations of political theory such as freedom, responsibility, justice, rights and obligations, as central categories for organizing moral and political life.\r\nMany students commented that although this class was interesting, the lectures were often “disjointed, disorganized, and freewheeling.” The recitations for this class, however, were found to be not only informative, but also very helpful.\r\nProf. Norton was described by students as an “animated lecturer”, exuding “an energy that is inspiring.” Nevertheless, even her biggest fans agreed that she “tended to go on tangents minimally related to the topic.” Although some students thought that these extra anecdotes gave the class a “broader relevance,” most objected to the musings.\r\nStudents recommended this course as an excellent foundational class for all political science majors, but warned that the reading assignments were extensive and time-consuming. PSCI 181 fulfills the History and Tradition Sector. ", "num_students": 145, "path": "/courses/26658/sections/401/reviews/264-ANNE-NORTON", "instructor": {"path": "/instructors/264-ANNE-NORTON", "first_name": "ANNE", "last_name": "NORTON", "id": "264-ANNE-NORTON", "name": "ANNE NORTON"}, "num_reviewers": 131, "id": "26658-401-264-ANNE-NORTON"}]}, "credits": null, "primary_alias": "PSCI-181", "path": "/courses/26658", "sections": {"path": "/courses/26658/sections", "values": [{"name": "MODERN POL THOUGHT", "sectionnum": "401", "primary_alias": "PSCI-181-401", "path": "/courses/26658/sections/401", "id": "26658-401", "aliases": ["PSCI-181-401", "PSCI-681-401"]}]}, "id": 26658, "aliases": ["PSCI-181", "PSCI-681"]}