{"coursehistories": {"path": "/coursehistories/4535"}, "description": "What are the basic mathematical concepts and techniques needed in computer science? This course provides an introduction to proof principles and logics, functions and relations, induction principles, combinatorics and graph theory, as well as a rigorous grounding in writing and reading mathematical proofs. \n\n", "semester": "2010C", "name": "MATH FOUND COMP SCI", "reviews": {"path": "/courses/22822/reviews", "values": [{"ratings": {"rAmountLearned": "2.08", "rDifficulty": "3.23", "rStimulateInterest": "2.05", "rRecommendMajor": "3.17", "rCourseQuality": "1.82", "rWorkRequired": "3.13", "rInstructorAccess": "3.33", "rReadingsValue": "2.11", "rRecommendNonMajor": "0.84", "rCommAbility": "1.63", "rInstructorQuality": "2.24"}, "section": {"name": "MATH FOUND COMP SCI", "sectionnum": "001", "primary_alias": "CIS-160-001", "path": "/courses/22822/sections/001", "id": "22822-001", "aliases": ["CIS-160-001"]}, "comments": "The course deals with the question “what are the basic mathematical concepts and techniques needed in computer science?” It provides an introduction to proof principles and logics, functions and relations, induction principles, combinatorics and graph theory, as well as a rigorous grounding in writing and reading mathematical proof.\r\n\r\nReviews of this course were quite diverse, as students characterized it as “interesting,” “challenging,” “difficult,” “a waste of time,” and “curious.” The content of the course was described by most students to be “confusing,” “abstract,” “dense,” and “hard to follow.” While some students seemed to enjoy the course, others found it to be pointless given that they spent most of their time “trying to figure out how to do problems” rather than “learning the material.” Several students felt that the homework assignments were extremely challenging, stating that they were “bordering on impossible.”  However, students reported that the professors and the TAs gave away the answers and the solutions during office hours, making it easy to do well in the course. Many students were, however, dissatisfied with the grading system.\r\n\r\nStudents’ opinions about Professor Gallier were mixed.  Students generally appreciated his amazing sense of humor and his constant jokes and anecdotes, which they felt made the class enjoyable. However, many thought that he moved through the material too quickly, did not lecture in a clear way, and did not provide sufficient examples to tackle the homework problems.  Some reported that since he used his own notation and tree approach for proofs, it was impossible to find other sources that may have been of help.\r\n\r\nOverall, the course received poor ratings from students. While it was recommended to all CIS majors, it was not recommended to those who need not take it.\r\n", "num_students": 84, "path": "/courses/22822/sections/001/reviews/248-JEAN-HENRI-GALLIER", "instructor": {"path": "/instructors/248-JEAN-HENRI-GALLIER", "first_name": "JEAN HENRI", "last_name": "GALLIER", "id": "248-JEAN-HENRI-GALLIER", "name": "JEAN HENRI GALLIER"}, "num_reviewers": 72, "id": "22822-001-248-JEAN-HENRI-GALLIER"}]}, "credits": null, "primary_alias": "CIS-160", "path": "/courses/22822", "sections": {"path": "/courses/22822/sections", "values": [{"name": "MATH FOUND COMP SCI", "sectionnum": "001", "primary_alias": "CIS-160-001", "path": "/courses/22822/sections/001", "id": "22822-001", "aliases": ["CIS-160-001"]}]}, "id": 22822, "aliases": ["CIS-160"]}