{"coursehistories": {"path": "/coursehistories/2489"}, "description": "Process synthesis, steady-state simulation, second-law analysis heat integration, cost estimation and profitability analysis, plant-wide controllability assessment. \n\n", "semester": "2011C", "name": "INTRO TO PROCESS DESIGN", "reviews": {"path": "/courses/24096/reviews", "values": [{"ratings": {"rAmountLearned": "1.51", "rDifficulty": "2.71", "rStimulateInterest": "0.73", "rRecommendMajor": "2.39", "rCourseQuality": "1.32", "rWorkRequired": "3.71", "rInstructorAccess": "1.44", "rReadingsValue": "1.29", "rRecommendNonMajor": "0.27", "rCommAbility": "1.22", "rInstructorQuality": "1.23"}, "section": {"name": "INTRO TO PROCESS DESIGN", "sectionnum": "001", "primary_alias": "CBE-400-001", "path": "/courses/24096/sections/001", "id": "24096-001", "aliases": ["CBE-400-001"]}, "comments": "This course is concerned with process synthesis, steady-state simulation, secondlaw\r\nanalysis heat integration, cost estimation, profitability analysis, as well as plant-wide\r\ncontrollability assessment.\r\nStudents generally found this course “tedious” and very time consuming.\r\nAccording to one student the professor sometimes assigns two assignments in one week,\r\n“which makes it difficult to focus on other CBE classes as well.” Overall, students\r\nthought that the class seemed to have “no underlying theme” and that “the course was\r\nfragmented.” Despite these complaints, students found the material itself remained\r\ninteresting.\r\nMany students complained about the professor's teaching ability. They were\r\nunhappy that he did not teach modern methods and instead referred to archaic and\r\nobsolete studies and programs. According to one student, “he was un-receptive to\r\nquestions and would tell students that their questions were dumb or pointless. In\r\naddition, recitations were not used as a time for students to ask questions but rather as\r\nadditional class time where mandatory new information was introduced.” Most thought\r\nthat they did not fulfill the goal of the course and “could not honestly say I know\r\nanything about designing a process.”\r\nMany of the students in this course were Chemical and Biomolecular Engineering\r\nupperclassmen. This class was not recommended to either major or non-major students:\r\naccording to one student, “overall, a very frustrating course that I wouldn't wish on any\r\nstudent.”", "num_students": 49, "path": "/courses/24096/sections/001/reviews/1305-WARREN-D-SEIDER", "instructor": {"path": "/instructors/1305-WARREN-D-SEIDER", "first_name": "WARREN D", "last_name": "SEIDER", "id": "1305-WARREN-D-SEIDER", "name": "WARREN D SEIDER"}, "num_reviewers": 45, "id": "24096-001-1305-WARREN-D-SEIDER"}]}, "credits": null, "primary_alias": "CBE-400", "path": "/courses/24096", "sections": {"path": "/courses/24096/sections", "values": [{"name": "INTRO TO PROCESS DESIGN", "sectionnum": "001", "primary_alias": "CBE-400-001", "path": "/courses/24096/sections/001", "id": "24096-001", "aliases": ["CBE-400-001"]}]}, "id": 24096, "aliases": ["CBE-400"]}