[{"ratings": {"rAmountLearned": "3.10", "rDifficulty": "2.81", "rStimulateInterest": "3.29", "rRecommendMajor": "3.13", "rCourseQuality": "2.94", "rWorkRequired": "2.90", "rInstructorAccess": "3.39", "rReadingsValue": "3.10", "rRecommendNonMajor": "2.65", "rCommAbility": "3.10", "rInstructorQuality": "3.12"}, "section": {"name": "QUANTITATIVE METHODS I", "sectionnum": "001", "primary_alias": "SOCI-535-001", "path": "/courses/23801/sections/001", "id": "23801-001", "aliases": ["SOCI-535-001", "DEMG-535-001"]}, "comments": "This course is an introduction to the practice of statistics in social and behavioral sciences. It is open to beginning graduate students and--with the permission of the instructor--advanced undergraduates. Topics covered include the description of social science data, in graphical and non-graphical form; correlation and other forms of association, including cross-tabulation; bivariate regression; an introduction to probability theory; the logic of sampling; the logic of statistical inference and significance tests. There is a lecture twice weekly and a mandatory \"lab.\"\r\n\r\nStudents found that the course encouraged them to “get beyond thinking about statistics as number crunching” and instead face “real issues of statistics.” The material was described as both “difficult” and “interesting.” However, one student claimed that the “book was difficult to follow at times.” Overall, it was considered a “great fundamental course for statistics.”\r\n\r\nProfessor Smith was described as “down to earth” and students appreciated his ability to “stimulate his students to really think about the content.” He was praised for giving “good examples” and for being “able to explain things multiple ways.” He was also deemed “brilliant” and noted for being able to make “difficult material accessible”. \r\n\r\nOne student found the exams to be difficult and the homework assignments to be “time consuming.” However, other students found the homework to be “valuable” for its ability to help them focus on the content and applicability of the material. The quick feedback was also helpful as it was timely and thorough. The only prerequisite for the course is basic algebra.\r\n", "num_students": 36, "path": "/courses/23801/sections/001/reviews/2338-HERBERT-L-SMITH", "instructor": {"path": "/instructors/2338-HERBERT-L-SMITH", "first_name": "HERBERT L", "last_name": "SMITH", "id": "2338-HERBERT-L-SMITH", "name": "HERBERT L SMITH"}, "num_reviewers": 33, "id": "23801-001-2338-HERBERT-L-SMITH"}]