{"coursehistories": {"path": "/coursehistories/4911"}, "description": "Python is an elegant, concise, and powerful language that is useful for tasks large and small. Python has quickly become a popular language for getting things done efficiently in many in all domains: scripting, systems programming, research tools, and web development. This course will provide an introduction to this modern high-level language using hands-on experience through programming assignments and a collaborative final application development project. \n\n", "semester": "2012A", "name": "PYTHON PROG", "reviews": {"path": "/courses/27153/reviews", "values": [{"ratings": {"rAmountLearned": "2.91", "rDifficulty": "2.70", "rStimulateInterest": "2.80", "rRecommendMajor": "3.14", "rCourseQuality": "2.90", "rWorkRequired": "2.57", "rInstructorAccess": "3.29", "rReadingsValue": "2.76", "rRecommendNonMajor": "2.17", "rCommAbility": "3.26", "rInstructorQuality": "3.19"}, "section": {"name": "PYTHON PROG", "sectionnum": "001", "primary_alias": "CIS-192-001", "path": "/courses/27153/sections/001", "id": "27153-001", "aliases": ["CIS-192-001"]}, "comments": "Python is an elegant, concise, and powerful language that is useful for tasks large and small. Python has quickly become a popular language for getting things done efficiently in many in all domains: scripting, systems programming, research tools, and web development. This course provides an introduction to this modern high-level language using hands-on experience through programming assignments and a collaborative final application development project.\r\n\r\nThis course is a .5 credit course introduction to the Python computer programming language. This course can by students taken with no background or with an extensive background with the Python programming language. Students commented that they “learned a lot about programming in a very short amount of time.”\r\n\r\nThe teacher was lauded for really caring about the subject material and students. A student stated that he was “widely available outside of class and was always ready to answer question on Piazza.”\r\n\r\nThis .5 credit class is for computer science and non-computer science majors alike. CIS120 or ESE112 were listed as prerequisites. A student commented that this course “straddles an awkward line wherein it moves a little too slowly for majors and a little too quickly for non-majors.” A foundation with Python is not a prerequisite, but makes the class much more manageable. A students stated, “If you know Python this is a .4 credit course, but if you don’t it seems like a 1.0 credit course.”\r\n", "num_students": 50, "path": "/courses/27153/sections/001/reviews/5316-CONSTANTINE-E--LIGNOS", "instructor": {"path": "/instructors/5316-CONSTANTINE-E--LIGNOS", "first_name": "CONSTANTINE E.", "last_name": "LIGNOS", "id": "5316-CONSTANTINE-E--LIGNOS", "name": "CONSTANTINE E. LIGNOS"}, "num_reviewers": 44, "id": "27153-001-5316-CONSTANTINE-E--LIGNOS"}]}, "credits": null, "primary_alias": "CIS-192", "path": "/courses/27153", "sections": {"path": "/courses/27153/sections", "values": [{"name": "PYTHON PROG", "sectionnum": "001", "primary_alias": "CIS-192-001", "path": "/courses/27153/sections/001", "id": "27153-001", "aliases": ["CIS-192-001"]}]}, "id": 27153, "aliases": ["CIS-192"]}