[{"ratings": {"rAmountLearned": "3.07", "rDifficulty": "1.90", "rStimulateInterest": "3.17", "rRecommendMajor": "3.57", "rCourseQuality": "3.24", "rWorkRequired": "2.07", "rInstructorAccess": "3.38", "rReadingsValue": "3.11", "rRecommendNonMajor": "3.23", "rCommAbility": "3.33", "rInstructorQuality": "3.45"}, "section": {"name": "INDIA'S LITERATURE: India's Literature: Love, War, Wisdom, Humor", "sectionnum": "401", "primary_alias": "SAST-004-401", "path": "/courses/26742/sections/401", "id": "26742-401", "aliases": ["SAST-004-401", "COML-005-401"]}, "comments": "This course introduces students to the extraordinary quality of literary production during the past four millennia of South Asian civilization. Selecting for discussion only a few representative works in translation from pre-modern India [ranging from the earliest Sanskrit and Tamil texts, through to the medieval literatures of South Asia's regional Languages -(Kannada, Gujarati, Bengali, Marathi, Telegu, Panjabi, Malayalam, Oriya etc)] and up to the Hindavi romance traditions of the 16th century), the course will also broadly investigate the processes of masterpiece - making in South Asia, both through the lens of indigenous aesthetic formulations as well as from diverse contemporary perspectives of literary analysis. In doing so, the goal will be to come to some understanding of the immensely rich and complicated networks of language, literary form and the cultural life that have historically informed and continues to inform the production of literature of South Asia. The class covers genres that also serve as the organizing principles for the course: the hymn, the lyric, the epic, the gnomic, the dramatic, the political, the prosaic, the tragic and the comedic. No background in South Asia studies or South Asian languages is required for this course.\r\n\r\nStudents generally enjoyed this class because of the high quality of literature that Professor Patel focused on. Although the lectures were occasionally unfocused in their nature, the quality of the lectures and discussions made up for this. The reading was described by many students as “valuable.”\r\n\r\nStudents hailed Professor Patel as a very engaging lecturer who was well-versed in the material. The only complaint about him was that he could have “set a clearer objective for some of the broader lectures.” Other than that, students said that he created a “jovial, interactive atmosphere” and that he was “understanding,” “laidback,” and “accessible.”\r\n\r\nStudents said that although Professor Patel was a “fair grader,” some of the exams were difficult. Other than that, students enjoyed the course.", "num_students": 36, "path": "/courses/26742/sections/401/reviews/4103-DEVEN-M--PATEL", "instructor": {"path": "/instructors/4103-DEVEN-M--PATEL", "first_name": "DEVEN M.", "last_name": "PATEL", "id": "4103-DEVEN-M--PATEL", "name": "DEVEN M. PATEL"}, "num_reviewers": 35, "id": "26742-401-4103-DEVEN-M--PATEL"}]